id: 1426626e-c5e0-4776-a0f9-4dd209c62baf
name: VIP User Adding New Authentication Methods
description: |
  'This query hunts for a VIP user (as defined by the VIP User watchlist) who has added a new authentication method in AAD. Use this to start looking for anomalous suspicious additions. Adding an authentication method could be used to gain or persist access to an account. Look for suspicious actions following auth method addition, or look for other suspicious activity by the initiating user.
  ref: https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
tactics:
  - Persistence
relevantTechniques:
  - T1098
query: |
  let VIPUsers = (_GetWatchlist('VIPUsers') | project SearchKey);
  AuditLogs
  | where Category =~ "UserManagement"
  | where ActivityDisplayName =~ "User registered security info"
  | where LoggedByService =~ "Authentication Methods"
  | extend AccountCustomEntity = tostring(TargetResources[0].userPrincipalName)
  | where AccountCustomEntity in (VIPUsers)
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity