id: a308d780-1c39-4fa7-8c21-bb54f174b065
name: AD Account Lockout
description: |
  Detects Active Directory account lockouts
description-detailed: |
  This query detects Active Directory account lockouts. Account lockouts can be caused by a variety of reasons, including but not limited to: incorrect password attempts, service accounts with expired passwords, and accounts with expired passwords. This query looks for Event ID 4740, which is generated when an account is locked out.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Impact
relevantTechniques:
  - T1531
query: |
  SecurityEvent
  | where EventID == 4740
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), LockoutsCount = count() by Activity, Account, TargetSid, TargetDomainName, SourceComputerId, SourceDomainController = Computer
  | extend timestamp = StartTime, AccountCustomEntity = Account, HostCustomEntity = TargetDomainName
version: 1.0.0