id: 60304ebf-ebdd-4869-a702-e0216d90ab46
name: Masquerading files
description: |
  'Malware writers often use windows system process names for their malicious process names to make them blend 
  in with other legitimate commands that the Windows system executes.
  An analyst can create a simple query looking for a process named svchost.exe. 
  It is recommended to filter out well-known security identifiers (SIDs) that are used to launch the legitimate svchost.exe process. 
  The query also filters out the legitimate locations from which svchost.exe is launched.'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Execution
query: |
  SecurityEvent
  | where NewProcessName endswith "\\svchost.exe"
  | where SubjectUserSid !in ("S-1-5-18", "S-1-5-19", "S-1-5-20")
  | where NewProcessName !has ":\\Windows\\System32"
  | where NewProcessName !has ":\\Windows\\Syswow64"
  | summarize minTimeGenerated=min(TimeGenerated), maxTimeGenerated=max(TimeGenerated), count() by Computer, SubjectUserName, NewProcessName, CommandLine, Account
  | project minTimeGenerated , maxTimeGenerated , count_ , Computer , SubjectUserName , NewProcessName , CommandLine, Account
  | extend NTDomain = tostring(split(Account,'\\',0)[0]), Name = tostring(split(Account,'\\',1)[0])
  | extend HostName = tostring(split(Computer, '.', 0)[0]), DnsDomain = tostring(strcat_array(array_slice(split(Computer, '.'), 1, -1), '.'))
  | extend Account_0_Name = Name
  | extend Account_0_NTDomain = NTDomain
  | extend Host_0_HostName = HostName
  | extend Host_0_DnsDomain = DnsDomain
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: NTDomain
        columnName: NTDomain
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: HostName
      - identifier: DnsDomain
        columnName: DnsDomain
version: 2.0.1  
