{
    "id": "AzureAdvancedThreatProtection",
    "title": "Microsoft Defender for Identity",
    "publisher": "Microsoft",
    "logo": {
      "type": 258,
      "options": null
    },
    "descriptionMarkdown": "Connect Microsoft Defender for Identity to gain visibility into the events and user analytics. Microsoft Defender for Identity identifies, detects, and helps you investigate advanced threats, compromised identities, and malicious insider actions directed at your organization. Microsoft Defender for Identity enables SecOp analysts and security professionals struggling to detect advanced attacks in hybrid environments to:\n\n-   Monitor users, entity behavior, and activities with learning-based analytics​\n-   Protect user identities and credentials stored in Active Directory\n-   Identify and investigate suspicious user activities and advanced attacks throughout the kill chain\n-   Provide clear incident information on a simple timeline for fast triage\n\n[Try now >](https://aka.ms/AtpTryNow)\n\n[Deploy now >](https://aka.ms/AzureATP_Deploy)\n\nFor more information, see the [Microsoft Sentinel documentation >](https://go.microsoft.com/fwlink/p/?linkid=2220069&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
    "graphQueries": [
      {
        "metricName": "Total data received",
        "legend": "SecurityAlerts",
        "baseQuery": "SecurityAlert\n    | where ProductName == \"Azure Advanced Threat Protection\"\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false"
      }
    ],
    "sampleQueries": [
      {
        "description": "All logs",
        "query": "SecurityAlert\n    | where ProductName == \"Azure Advanced Threat Protection\"\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false ​| summarize arg_max(TimeGenerated, *) by SystemAlertId\n            | sort by TimeGenerated"
      },
      {
        "description": "Summarize by operation",
        "query": "SecurityAlert\n    | where ProductName == \"Azure Advanced Threat Protection\"\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false ​| summarize arg_max(TimeGenerated, *) by SystemAlertId\n            | summarize count() by TimeGenerated\n            | sort by TimeGenerated"
      }
    ],
    "connectivityCriterias": [
      {
        "type": "SentinelKinds",
        "value": [
          "AzureAdvancedThreatProtection"
        ]
      }
    ],
    "dataTypes": [
      {
        "name": "SecurityAlert (AATP)",
        "lastDataReceivedQuery": "SecurityAlert\n    | where ProductName == \"Azure Advanced Threat Protection\"\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
      }
    ],
    "availability": {
      "status": 2,
      "featureFlag": {
        "feature": "AATPConnector",
        "featureStates": {
          "1": 2,
          "2": 2,
          "3": 2,
          "4": 2,
          "5": 2
        }
      }
    },
    "permissions": {
      "resourceProvider": [
        {
          "provider": "Microsoft.OperationalInsights/workspaces",
          "permissionsDisplayText": "read and write permissions.",
          "providerDisplayName": "Workspace",
          "scope": "Workspace",
          "requiredPermissions": {
            "read": true,
            "write": true,
            "delete": true
          }
        }
      ],
      "tenant": [
        "SecurityAdmin",
        "GlobalAdmin"
      ],
      "licenses": [
        "Aatp"
      ]
    },
    "instructionSteps": [
      {
        "title": "Connect Microsoft Defender for Identity to Microsoft Sentinel",
        "description": "If your tenant is running [Microsoft Defender for Identity](https://aka.ms/Sentinel/MDI/Preview)  in Microsoft Defender for Cloud Apps, connect here to stream your Microsoft Defender for Identity alerts into Microsoft Sentinel\n\n> In order to integrate with Microsoft Defender for Identity alerts, use  **global administrator**, or  **security administrator**  permission.",
        "instructions": [
          {
            "parameters": {
              "title": "Microsoft Defender for Identity",
              "connectorKind": "AzureAdvancedThreatProtection",
              "enable": true,
              "consentText": "Yes, I have connected Microsoft Defender for Identity to Microsoft Defender for Cloud Apps"
            },
            "type": "SentinelResourceProvider"
          }
        ]
      }
    ],
    "caseGenerationSteps": [
      {
        "instructions": [
          {
            "parameters": {
              "filterProduct": "Azure Advanced Threat Protection"
            },
            "type": "FilterAlert"
          }
        ]
      }
    ]
  }
