id: 70078743-eb45-4e44-b7e4-c8f904e6c441
name: User made Owner of multiple teams
description: |
  'This hunting query identifies users who have been made Owner of multiple Teams.
   This query is works with the built-in Teams data connector only.'
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078
query: |

  // Adjust this value to change how many teams a user is made owner of before detecting
  let max_owner_count = 3;
  // Change this value to adjust how larger timeframe the query is run over.
  let time_window = 1d;
  let high_owner_count = (OfficeActivity
  | where TimeGenerated > ago(time_window)
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "MemberRoleChanged"
  | extend Member = tostring(Members[0].UPN) 
  | extend NewRole = toint(Members[0].Role) 
  | where NewRole == 2
  | summarize dcount(TeamName) by Member
  | where dcount_TeamName > max_owner_count
  | project Member);
  OfficeActivity
  | where TimeGenerated > ago(time_window)
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "MemberRoleChanged"
  | extend Member = tostring(Members[0].UPN) 
  | extend NewRole = toint(Members[0].Role) 
  | where NewRole == 2
  | where Member in (high_owner_count)
  // Uncomment the following line to map query entities is you plan to use this as a detection query
  //| extend timestamp = TimeGenerated, AccountCustomEntity = Member
