id: 0a87a9f8-2832-466d-ba15-9f092c042ad2
name: External user from a new organisation added
description: |
  'This query identifies external users added to Teams where the user's domain is not one 
  previously seen in Teams data.
  This query is works with the built-in Teams data connector only.'
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
tactics:
  - Persistence
relevantTechniques:
  - T1136
query: |

  // If you have more than 14 days worth of Teams data change this value
  let data_date = 14d;
  // If you want to look at users further back than the last day change this value
  let lookback_date = 1d;
  let known_orgs = (
  OfficeActivity 
  | where TimeGenerated > ago(data_date)
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "MemberAdded" or Operation =~ "TeamsSessionStarted"
  // Extract the correct UPN and parse our external organization domain
  | extend UPN = iif(Operation == "MemberAdded", tostring(Members[0].UPN), UserId)
  | extend Organization = tostring(split(split(UPN, "_")[1], "#")[0])
  | where isnotempty(Organization)
  | summarize by Organization);
  OfficeActivity 
  | where TimeGenerated > ago(lookback_date)
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "MemberAdded"
  | extend UPN = tostring(parse_json(Members)[0].UPN)
  | extend Organization = tostring(split(split(UPN, "_")[1], "#")[0])
  | where isnotempty(Organization)
  | where Organization !in (known_orgs)
  // Uncomment the following line to map query entities is you plan to use this as a detection query
  //| extend timestamp = TimeGenerated, AccountCustomEntity = UPN