id: 642BE261-33F7-439C-8940-C2D25289277A
name: Google Threat Intelligence - Threat Hunting Hash
description: |
  'Google Threat Intelligence hash correlation.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelIndicators
tags:
  - GoogleThreatIntelligence
query: |
  imFileEvent
  | where isnotempty(Hash)
  | join kind=inner (
  ThreatIntelligenceIndicator
  | where ObservableKey contains 'file:hashes'
  | where isnotempty(ObservableValue)
  | where SourceSystem == "Google Threat Intelligence"
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
  | where Active == true and isnotnull(ValidUntil) and ValidUntil > now()
  ) on $left.Hash == $right.ObservableValue
  | project Hash, HashType
  | extend FileHash_Value = Hash
  | extend FileHash_Type = HashType
entityMappings:
  - entityType: FileHash
    fieldMappings:
      - identifier: Value
        columnName: Hash
  - entityType: FileHash
    fieldMappings:
      - identifier: Algorithm
        columnName: HashType
version: 1.0.0
