id: 6E860011-3A24-4497-8237-76DFAF68A29F
name: Google Threat Intelligence - Threat Hunting IP
description: |
  'Google Threat Intelligence IP correlation.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelIndicators
tags:
  - GoogleThreatIntelligence
query: |
  _Im_NetworkSession
  | where isnotempty(DstIpAddr)
  | join kind= innerunique  (
  ThreatIntelligenceIndicator
  | where ObservableKey == 'ipv4-addr:value'
  | where isnotempty(ObservableValue)
  | where SourceSystem == "Google Threat Intelligence"
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
  | where Active == true and isnotnull(ValidUntil) and ValidUntil > now()
  ) on $left.DstIpAddr == $right.ObservableValue
  | project DstIpAddr
  | extend IP_0_Address = DstIpAddr
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DstIpAddr
version: 1.0.0
