id: "a1705fa5-c904-4f1b-9e2d-a4ccb30377a2"
name: Google Threat Intelligence - Threat Hunting Url
description: |
  'Google Threat Intelligence Url correlation.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelIndicators
tags:
  - GoogleThreatIntelligence
query: |
  _Im_WebSession
  | where isnotempty(Url)
  | join kind=inner (
  ThreatIntelIndicators
  | where ObservableKey == 'url:value'
  | where isnotempty(ObservableValue)
  | where SourceSystem == "Google Threat Intelligence"
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
  | where IsActive == true and (isnull(ValidUntil) or ValidUntil > now())
  ) on $left.Url == $right.ObservableValue
  | project Url
  | extend URL_0_Url = Url
entityMappings:
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: Url
version: 1.0.0
