id: 3cf46cb9-99d5-42ee-a43c-7bd88ea394a1
name: IronDefense Alert Detection Query
description: |
  'Create incidents/alerts from IronDefense Notifications'
severity: Medium
requiredDataConnectors: [requiredDataConnectors:
  - connectorId: IronNetIronDefense
    dataTypes:
      - CommonSecurityLog]
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
relevantTechniques:
query: |
  CommonSecurityLog
| where DeviceProduct == "IronDefense"
| summarize arg_max(TimeGenerated, *) by DeviceCustomString4, DeviceCustomString2
| extend Category = extract(@'cat=([^;]+)(\;|$)', 1, AdditionalExtensions)
| extend Subcategory = extract(@'subcat=([^;]+)(\;|$)', 1, AdditionalExtensions)
| extend AlertDescription = strcat(Category, ': ', Subcategory)
| extend Status = tostring(DeviceCustomString2)
| extend IronVueUrl = tostring(DeviceCustomString3)
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DestinationIP
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIP
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: DestinationHostName
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: SourceHostName
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: RequestURL
customDetails:
  IronDefenseStatus: Status
  AnalystRating: LogSeverity
  AlertCreatedTime: TimeGenerated
  IronVueUrl: IronVueUrl
  IronDefenseAlertId: DeviceCustomString4
  AnalystSeverity: DeviceCustomString1
