id: 66d5b7e0-ae96-4e92-9ab1-fc72a221db76
name: Count of emails by country
description: |
  This query helps reviewing count of emails by country data extracted from SenderIPv4
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents
  | extend GeoInformation = parse_json(geo_info_from_ip_address(SenderIPv4))
  | extend NwMsgId_Recipient = strcat(NetworkMessageId, "_", RecipientEmailAddress)
  | summarize dcount(NwMsgId_Recipient) by tostring(GeoInformation.country)
