id: da932998-81dd-4be4-963c-f4890cb4192e
name: Malicious emails detected per day
description: |
  This query helps reviewing Malware, Phishing, Spam emails caught per day
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents
  | where DetectionMethods != "" 
  | extend detection= parse_json(DetectionMethods) 
  | extend Spam = tostring(detection.Spam) 
  | extend Phish = tostring(detection.Phish) 
  | extend Malware = tostring(detection.Malware) 
  | where Spam != '' or Phish != '' or Malware != '' 
  | extend detection = case( 
      Malware != "", 'Malware', 
      Phish != "", 'Phish', 
      'Spam') 
  | summarize total=count() by detection, bin(Timestamp, 1d) 
  | order by Timestamp asc
