id: 12225f50-9d41-4b78-8269-cc127d98654c
name: Top 100 malicious email senders
description: |
  This query helps reviewing top 100 senders sending malicious email in your organization in last 30 days
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents
  | where Timestamp > ago(30d)
  | where ThreatTypes has "Phish" or ThreatTypes has "Malware" 
  | summarize total=count() by SenderMailFromAddress 
  | top 100 by total
