id: cadf6e78-2a9a-4fb5-b788-30a592d699d3
name: Top 100 senders
description: |
  This query helps reviewing top 100 senders in your organization in last 30 days
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents 
  | where Timestamp > ago(30d)
  | summarize mailCountBySender = count() by SenderMailFromAddress 
  | top 100 by mailCountBySender
