SchemaVersion: '1.0'
Type: KQL
Provider: Sentinel
DataTypes:
  - DataType: ThreatIntelligenceIndicator
EntitiesFilter: {}
RequiredInputFieldsSets: 
 - - Ip_Address
BaseQuery: |  
  let GetIPMatch = (Ip_Address:string){
  //checking time span to lock to 14 days or less for IP relevance and for Entity page perf
  let start = datetime('{{StartTimeISO}}');
  let end = datetime('{{EndTimeISO}}');
  let end_start = datetime_diff('day',end,start);
  let start_time = iff(end_start > 14, end - 14d, start);
  let end_time = end;
  ThreatIntelligenceIndicator
  | where isnotempty(Ip_Address)
  | where TimeGenerated >= start_time
  | where ExpirationDateTime > now()
  | where Active = true
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
  | where NetworkIP == Ip_Address or NetworkDestinationIP == Ip_Address or NetworkSourceIP == Ip_Address or EmailSourceIpAddress == Ip_Address
  | extend FieldsMatched = pack("NetworkIP", NetworkIP == Ip_Address, "NetworkDestinationIP", NetworkDestinationIP == Ip_Address, "NetworkSourceIP", NetworkSourceIP == Ip_Address, "EmailSourceIpAddress", EmailSourceIpAddress == Ip_Address)
  | project LatestIndicatorTime, ThreatType, IPAddress = Ip_Address, SourceSystem, ConfidenceScore, Description, FieldsMatched, Tags
  };
  GetIPMatch('{{Ip_Address}}')

Insights:
 Id: 8b4c6812-1829-423d-bb1e-04e3d06095b0
 DisplayName: "This IP has a TI match"
 Description: |
  'IP match from your TI table. Note due to potential performance impact, data is limited to a 30 day look back in TI.'
 DefaultTimeRange: 
  BeforeRange: 12h
  AfterRange: 12h
 TableQuery:
  ColumnsDefinitions:
  - Header: "IPAddress"
    OutputType: String
    SupportDeepLink: true
  - Header: "ConfidenceScore"
    OutputType: Number
    SupportDeepLink: false
  - Header: "ThreatType"
    OutputType: String
    SupportDeepLink: false
  - Header: "LatestIndicatorTime"
    OutputType: Date
    SupportDeepLink: false
  QueriesDefinitions:
  # TI hits
  - Filter:    "project IPAddress, ConfidenceScore, ThreatType, LatestIndicatorTime"
    Summarize: "summarize by IPAddress, ConfidenceScore, ThreatType, LatestIndicatorTime"
    Project:   "project IPAddress, ConfidenceScore, ThreatType, LatestIndicatorTime"
    LinkColumnsDefinitions:
    - ProjectedName: IPAddress
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: ConfidenceScore
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: ThreatType
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: LatestIndicatorTime
      Query: "{{BaseQuery}} | {{RowFilter}}"

 AdditionalQuery: 
  Text: "See All details"
  Query: "project LatestIndicatorTime, ThreatType, IPAddress, SourceSystem, ConfidenceScore, Description, FieldsMatched, Tags"
