id: d82e1987-4356-4a7b-bc5e-064f29b143c0
name: NOBELIUM - suspicious rundll32.exe execution of vbscript (Normalized Process)
description: |
  'This query idenifies when rundll32.exe executes a specific set of inline VBScript commands
   References: https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/'
severity: Medium
requiredDataConnectors: []
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1547
tags:
  - NOBELIUM
query: |
  imProcessCreation
  | where TargetProcessFileName =~ 'rundll32.exe' 
  | where TargetProcessCommandLine  has_any ('Execute','RegRead','window.close')
  | project TimeGenerated, DvcHostname, Account, TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, _ResourceId
  | extend timestamp = TimeGenerated, HostCustomEntity = DvcHostname, AccountCustomEntity = Account
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
version: 1.0.0