id: ca67c83e-7fff-4127-a3e3-1af66d6d4cad
name: Base64 encoded Windows process command-lines (Normalized Process Schema)
description: |
  'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.'
severity: Medium
requiredDataConnectors: []
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
  - DefenseEvasion
relevantTechniques:
  - T1059
  - T1027
  - T1140
query: |
  let ProcessCreationEvents=() {
  let processEvents=imProcessCreation
  | where isnotempty(TargetProcessFileName)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by DvcHostname, Account = ActorUserName, AccountDomain = ActorUserDomain,
  FileName = TargetProcessFileName, TargetProcessCommandLine, ActingProcessFileName, EventVendor, EventProduct;
  processEvents};
  ProcessCreationEvents
  | where TargetProcessCommandLine contains "TVqQAAMAAAAEAAA"
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = DvcHostname
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
version: 1.0.0