id: 11cc0e3f-9718-4ab5-be7b-d9c036ed6b0a
name: Files share contents and suspicious sign-in activity
description: |
  This query helps hunting for Files share contents and suspicious sign-in activity
description-detailed: |
  This query helps hunting for Files share contents and suspicious sign-in activity. 
  By correlating the file share emails with suspicious sign-ins, compromises can be detected. Since these are observed as campaigns, validating that the same file has been shared with multiple users in the organization can support the detection.
  Shared by Microsoft Threat Intelligence: https://www.microsoft.com/en-us/security/blog/2024/10/08/file-hosting-services-misused-for-identity-phishing/
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
  - AADSignInEventsBeta
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let usersWithSuspiciousEmails = EmailEvents
  | where Subject has_all ("shared", "with you")
  | where Subject has_any ("payment", "invoice", "urgent", "mandatory", "Payoff", "Wire", "Confirmation", "password")
  | where isnotempty(RecipientObjectId)
  | summarize RecipientCount = dcount(RecipientObjectId), RecipientList = make_set(RecipientObjectId) by Subject
  | where RecipientCount >= 10
  | mv-expand RecipientList to typeof(string)
  | distinct RecipientList;
  AADSignInEventsBeta
  | where AccountObjectId in (usersWithSuspiciousEmails)
  | where RiskLevelDuringSignIn == 100
version: 1.0.0