id: d7f4b1d0-018f-4033-8618-523bde350d23
name: Total Emails with User Overrides (Allow)
description: |
  Total Emails with User Overrides (Allow)
description-detailed: |
  Total Emails with User Overrides (Allow)
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents 
  | where UserLevelPolicy != "" and UserLevelAction == "Allow" 
  | summarize count() by UserLevelPolicy
  // | render columnchart // Uncomment this line to render as a graph
version: 1.0.0
