id: 89a0a2aa-69c8-4586-95f5-7d003901adec
name: Total Emails with Admin Overrides (Block)
description: |
  Total Emails with Admin Overrides (Block)
description-detailed: |
  Total Emails with Admin Overrides (Block)
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where  OrgLevelPolicy != "" and OrgLevelAction == "Block"
  | summarize count() by OrgLevelPolicy
  // | render columnchart // Uncomment this line to render as a graph
version: 1.0.0




