id: a8675d59-87f3-4d59-b96c-0f2a0f446293
name: Summary of newly created users being added to groups
description: |
  'Adversaries may add newly created accounts to the administrators group to maintain elevated access..'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - AuditLogs
      - BehaviorAnalytics
tactics:
  - Persistence
relevantTechniques:
  - T1098
query: |
BehaviorAnalytics
| where ActionType == "Add member to group" or ActionType == "Add member to role" 
| where ActivityInsights.FirstTimeUserPerformedAction == true
| join ( 
AuditLogs
) on $left.SourceRecordId == $right._ItemId 
| extend Actor = tostring(InitiatedBy.user.userPrincipalName)
| mv-expand TargetResources
| extend ImpactedUser = tostring(TargetResources.userPrincipalName)
| where isnotempty(ImpactedUser) 
| join ( BehaviorAnalytics ) on $left.ImpactedUser == $right.UserPrincipalName
| where UsersInsights1.NewAccount == true
| where UsersInsights1.BlastRadius == "High"
| project ["Actor"]=UserPrincipalName, ActionType, ["Impacted User"]=ImpactedUser, ["Impacted User New Account"]=UsersInsights1.NewAccount, ["Impacted User Blast Radius"]=UsersInsights1.BlastRadius
| distinct Actor, ActionType, ['Impacted User'], tostring(['Impacted User Blast Radius']), tostring(['Impacted User New Account'])
