id: 25c7f1a5-05d7-4003-88a5-a184922897b0
name: Summary of user performing passwrod reset to users accounts
description: |
  'Adversaries may Resete users passwords to interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - AuditLogs
	  - BehaviorAnalytics
tactics:
  - Impact
relevantTechniques:
  - T1531
query: |
BehaviorAnalytics
| where ActionType == "Reset user password"
| where ActivityInsights.FirstTimeUserPerformedAction == "True"
| join (
AuditLogs
) on $left.SourceRecordId == $right._ItemId
| extend Actor = tostring(InitiatedBy.user.userPrincipalName)
| mv-expand TargetResources
| extend Target = tostring(TargetResources.id)
| summarize TargetsNumber = dcount(Target) by Actor, bin(TimeGenerated, 4d)
| render columnchart
