id: 8f7736c0-dc94-44f1-bdea-aa96581af8c7
name: Anomalous Login to Devices
description: |
  'As part of content migration, this file is moved to new location. You can find here https://githubusercontent.com/Azure/Azure-Sentinel/blob/master/Solutions/UEBA%20Essentials/Hunting%20Queries/Anomalous%20Login%20to%20Devices.yaml'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078
query: |

 BehaviorAnalytics
 | where UsersInsights.IsDormantAccount == true
 | where DevicesInsights.IsLocalAdmin == true
 | where ActivityType == "LogOn"
 | where ActionType == "InteractiveLogon"
 | where ActivityInsights contains "True"
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
 | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserPrincipalName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress