id: 22b0262c-b6b5-4f15-82a4-93663e9965d7
name: Anomalous Password Reset
description: |
  'Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset user password where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
       - BehaviorAnalytics
       - AuditLogs
tactics:
  - Impact
relevantTechniques:
  - T1531
query: |

 BehaviorAnalytics
 | where ActionType == "Reset user password"
 | where ActivityInsights has "True"
 | join (
 AuditLogs
 ) on $left.SourceRecordId == $right._ItemId
 | mv-expand TargetResources
 | extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
 | extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
 UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
 | sort by TimeGenerated desc
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
