id: 0a8a8406-d216-4152-aa6e-778c4bfdd098
name: Anomalous Data Access
description: |
 'As part of content migration, this file is moved to new location. You can find here https://githubusercontent.com/Azure/Azure-Sentinel/blob/master/Solutions/UEBA%20Essentials/Hunting%20Queries/Anomalous%20Data%20Access.yaml'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
        - BehaviorAnalytics
tactics:
  - Collection
relevantTechniques:
  - T1530
query: |
    let operations = dynamic(['Export an existing database']);
    BehaviorAnalytics
    | where ActionType in(operations)
    | where ActivityInsights has "True"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
    | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserPrincipalName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
