id: 2e20ec77-8d50-4959-a70d-79c341ee2c37
name: Anomalous Login to Devices
description: |
  'All administator users performing an interactive logon (4624:2) to a device for the first time.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - Privilege Escalation
relevantTechniques:
  - T1078
query: |

 BehaviorAnalytics
 | where UsersInsights.DormantAccount == true
 | where DevicesInsights.LocalAdmin == true
 | where ActivityType == "LogOn"
 | where ActionType == "InteractiveLogon"
 | where ActivityInsights.FirstTimeUserConnectedToDestinationDevice == true
 UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
 UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
