id: c01d95d3-ee85-4e7f-9aed-e62356f1de76
name: Anomalous RDP Activity
description: |
  'All users performing a remote interactive logon (4624:10) to a device for the first time.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
       - BehaviorAnalytics
tactics:
  - LateralMovement
relevantTechniques:
  -  
query: |

 BehaviorAnalytics
 | where ActivityType == "LogOn"
 | where ActionType == "RemoteInteractiveLogon"
 | where ActivityInsights.FirstTimeUserConnectedToDestinationDevice == true
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
