id: 2e20ec77-8d50-4959-a70d-79c341ee2c37
name: Anomalous Login to Devices
description: |
  'All administator users performing an interactive logon (4624:2) to a device for the first time.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078
query: |

 BehaviorAnalytics
 | where UsersInsights.DormantAccount == true
 | where DevicesInsights.LocalAdmin == true
 | where ActivityType == "LogOn"
 | where ActionType == "InteractiveLogon"
 | where ActivityInsights.FirstTimeUserLoggedOnToDevice == true
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
