id: bd6fda76-c0df-41b0-b8cd-808190e1ded0
name: Anomalous Activity Role Assignment
description: |
    'Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. The query below generates an output 
    of all users performing an "action" operation regarding a access elevation, where one or more features of the activitiy deviates from the user, 
    his peers or the tenant profile.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1548
query: |
    let operations = dynamic(['Create role assignment']);
    BehaviorAnalytics
    | where ActionType in(operations)
    | where ActivityInsights contains "True"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights