id: 782f3bad-31f7-468f-8f58-3b74fc931914
name: Anomalous Resource Access
description: |
  'Adversary may be trying to move through the environment. APT29 and APT32, for example, has used PtH & PtT techniques to lateral move around the network. The query below generates an output of all users performing an resource access (4624:3) to devices for the first time.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - LateralMovement
relevantTechniques:
  - 
query: |

 BehaviorAnalytics
 | where ActivityType == "LogOn"
 | where ActionType == "ResourceAccess"
 | where ActivityInsights has "True"
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
