id: 0a4e446e-d702-441f-86f6-7e00b2b6b1df
name: Anomalous Defensive Mechanism Modification
description: |
    'As part of content migration, this file is moved to new location. You can find here https://githubusercontent.com/Azure/Azure-Sentinel/blob/master/Solutions/UEBA%20Essentials/Hunting%20Queries/Anomalous%20Defensive%20Mechanism%20Modification.yaml'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
        - BehaviorAnalytics
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562
query: |
    let operations = dynamic(['Remove database vulnerability assessment rule baseline']);
    BehaviorAnalytics
    | where ActionType in(operations)
    | where ActivityInsights has "True"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
    | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserPrincipalName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
