id: bb3bb9da-9598-4d1f-af78-7cc2fd413b0b
name: Anomalous Sign-in Activity
description: 'Successful Sign-in with one or more of the following indications:
 - performed by new or recently dormant accounts
 - performed by an account from a resource for the first time (while none of their peers did)
 - performed by an account to aa app for the first time (while none of their peers did)
 - performed by a user with Risk indicaiton from AAD'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
        - BehaviorAnalytics
        - SigninLogs
tactics:
  - Persistence
relevantTechniques:
  - T1078
query: |

 BehaviorAnalytics
 | where ActionType == "Sign-in"
 | where UsersInsights.NewAccount == True or UsersInsights.DormantAccount == True
 or ActivityInsights.FirstTimeUserConnectedToResource == True and ActivityInsights.PeersConnectedToResource == False
 or ActivityInsights.FirstTimeUserConnectedWithClientApp == True and ActivityInsights.PeersConnectedOnAppId == False
 | join (
 SigninLogs
 ) on $left.SourceRecordId == $right._ItemId
 | where Status.errorCode == 0 or Status.errorCode == 0 and RiskDetail != "none"
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,["Evidence"]=ActivityInsights, ResourceDisplayName,AppDisplayName,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
