id: eeea7fb9-21cf-4023-91dc-3f55d7548d14
name: Anomalous Geo Location Logon
description: 'Sign-in performed by a user from a new geo location he has never connected from before, and none of his peers as well.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
      - SigninLogs
tactics:
  - Initial Access
relevantTechniques:
  - T1078
query: |

 BehaviorAnalytics
 | where ActionType == "Sign-in"
 | where ActivityInsights.FirstTimeTenantConnectedFromGeo == True and ActivityInsights.PeersConnectedFromSameGeo == False
     | join (
 SigninLogs
 ) on $left.SourceRecordId == $right._ItemId
 | extend UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
 UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,["Evidence"]=ActivityInsights, ResourceDisplayName,AppDisplayName ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
