id: 2efb0c20-be16-45b7-b041-7e327a129976
name: Anomalous Code Execution
description: |
    'As part of content migration, this file is moved to new location. You can find here https://githubusercontent.com/Azure/Azure-Sentinel/blob/master/Solutions/UEBA%20Essentials/Hunting%20Queries/Anomalous%20Code%20Execution.yaml'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
        - BehaviorAnalytics
tactics:
  - Execution
relevantTechniques:
  - T1059
query: |
    let operations = dynamic(['Run Command on Virtual Machine']);
    BehaviorAnalytics
    | where ActionType in(operations)
    | where ActivityInsights has "True"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
    | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserPrincipalName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
