id: 22b0262c-b6b5-4f15-82a4-93663e9965d7
name: Anomalous Password Reset
description: |
  'All users performing Reset user password for the first time.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
       - BehaviorAnalytics
       - AuditLogs
tactics:
  - Impact
relevantTechniques:
  - T1531
query: |

 BehaviorAnalytics
 | where ActionType == "Reset user password"
 | where ActivityInsights.FirstTimeUserPerformedAction == "True"
 | join (
 AuditLogs
 ) on $left.SourceRecordId == $right._ItemId
 | mv-expand TargetResources
 | extend Target = tostring(TargetResources.id)
 | sort by TimeGenerated desc
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
