id: 782f3bad-31f7-468f-8f58-3b74fc931914
name: Anomalous Resource Access
description: |
  'All users performing an resource access (4624:3) to devices for the first time.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
	  - BehaviorAnalytics
tactics:
  - Lateral Movement
relevantTechniques:
  - 
query: |
BehaviorAnalytics
    | where ActivityType == "LogOn"
    | where ActionType == "ResourceAccess"
    | where ActivityInsights.FirstTimeUserConnectedToDestinationDevice == true
    | extend AnomalyName = "Anomalous Resource Access",
            Tactic = "Lateral Movement",
            Technique = "",
            SubTechnique = "",
            Description = "Anomalous Resource Access"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType,ActivityInsights ,SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights