id: a8675d59-87f3-4d59-b96c-0f2a0f446293
name: Summary of doemant local admin users performing interactive logins for the first time
description: |
  'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - AuditLogs
	  - BehaviorAnalytics
tactics:
  - Privilege Escalation
relevantTechniques:
  - T1078
query: |
BehaviorAnalytics
| where UsersInsights.DormantAccount == true
| where DevicesInsights.LocalAdmin == "True"
| where ActivityType == "LogOn"
| where ActionType == "InteractiveLogon"
| where ActivityInsights.FirstTimeUserConnectedToDestinationDevice == true