{
  "Name": "NetworkSessionSolution",
  "Author": "Microsoft - support@microsoft.com",
  "Logo": "<img src=\"{LogoLink}\" width=\"75px\" height=\"75px\">",
  "Description": "This is a domain solution and does not include any data connectors. The content in this solution requires one of the product solutions below , as well as any other connector or data source normalized to the ASIM < ASIM Network Session schema> . Install one or more of the listed solutions, or develop your custom ASIM parsers to unlock the value provided by this solution.\n1.Product Solution 1\n2. Product Solution 2",
  "WorkbookDescription": "This workbook is included as part of Network Security solution and gives a summary of analyzed traffic, helps with threat analysis and investigating suspicious IP’s and traffic analysis. Network Security Solution also includes playbooks to periodically summarize the logs thus enhancing user experience and improving data search. For the effective usage of workbook, we highly recommend to enable the summarization playbooks that are provided with this solution.",
  "Workbooks": [
    "Workbooks/NetworkSessionSolution.json"
  ],
  "WorkbookBladeDescription": "This workbook is included as part of Network Security solution and gives a summary of analyzed traffic, helps with threat analysis and investigating suspicious IP's and traffic analysis. Network Security Solution also includes playbooks to periodically summarize the logs thus enhancing user experience and improving data search. For the effective usage of workbook, we highly recommend to enable the summarization playbooks that are provided with this solution.", 
  "Analytic Rules": [
    "Analytic Rules/AnomalyFoundInNetworkSessionTraffic.yaml",
    "Analytic Rules/DetectPortMisuseByAnomalyBasedDetection.yaml",
    "Analytic Rules/DetectPortMisuseByStaticThreshold.yaml",
    "Analytic Rules/NetworkPortSweepFromExternalNetwork.yaml",
    "Analytic Rules/ExcessiveHTTPFailuresFromSource.yaml",
    "Analytic Rules/IPEntity_imNetworkSession.yaml",
    "Analytic Rules/PortScan.yaml",
    "Analytic Rules/PossibleBeaconingActivity.yaml"
  ],
  "Playbooks": [
    "Playbooks/SummarizeData/azuredeploy.json"
  ], 
  "PlaybookDescription": "This solution installs the Playbook templates to help implement log summarization which results in improved performance of solution security content. After installing the solution, [Learn more](https://docs.microsoft.com/azure/sentinel/tutorial-respond-threats-playbook?WT.mc_id=Portal-Microsoft_Azure_CreateUIDef)",
  "Hunting Queries": [
    "Hunting Queries/DetectPortMisuseByAnomalyHunting.yaml",
    "Hunting Queries/DetectPortMisuseByStaticThresholdHunting.yaml",
    "Hunting Queries/DetectsSeveralUsersWithTheSameMACAddress.yaml",
    "Hunting Queries/MismatchBetweenDestinationAppNameAndDestinationPort.yaml"
  ],
  "Watchlists": [
    "Watchlists/NetworkSession_Monitor_Configuration.json"
  ],
  "WatchlistDescription": "Monitor Network Session solution configurable conditions here. Choose between Detection or Hunting for Type and set Threshold type to Static or Anomaly to tune monitoring as needed",
  "BasePath": "C:\\Network Session Solution for Microsoft Sentinel",
  "Version": "2.0.0",
  "Metadata": "SolutionMetadata.json",
  "TemplateSpec": true,
  "Is1PConnector": false
}