id: a18e8bcf-e05d-4e45-bc6e-2c5004729fbd
name: Java Executing cmd to run Powershell
description: |
  This query finds instances of the Java process being used to execute cmd.exe, and download and execute a PowerShell script.
description-detailed: |
  This query was originally published in the threat analytics report, Sysrv botnet evolution.
  Sysrv is a Go-based botnet that targets both Windows and Linux servers, and steals resources to mine cryptocurrency.
  The following query finds instances of the Java process being used to execute cmd.exe, and download and execute a PowerShell script.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
    - DeviceProcessEvents
tactics:
  - Execution
query: |
  DeviceProcessEvents                         
  | where InitiatingProcessFileName == 'java.exe' and FileName == 'cmd.exe' 
  and ProcessCommandLine has_all('powershell iex','DownloadString')
version: 1.0.0