id: b4322358-5755-41d8-b70a-1f43088e1c29
name: Inhibit recovery by disabling tools and functionality
description: |-
  Prior to deploying Macaw ransomware in an organization, the adversary will disable several tools and functions in order to inhibit later recovery efforts.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Ransomware
query: "DeviceProcessEvents \r\n| where ProcessCommandLine has_all (\"reg\", \"add\") \r\n| where ProcessCommandLine has_any(\"DisableTaskMgr\", \"DisableCMD\", \"DisableRegistryTools\", \"NoRun\") and ProcessCommandLine has \"REG_DWORD /d \\\"1\\\"\" \r\n| summarize ProcessCount = dcount(ProcessCommandLine), make_set(ProcessCommandLine) by InitiatingProcessCommandLine, DeviceId, bin(Timestamp, 3m) \r\n| where ProcessCount > 2 "
