id: c892424d-8c76-4c94-9b92-ebf6fb590d69
name: Mass account password change
description: |-
  Prior to deploying Macaw ransomware in an organization, adversaries will change the password for hundreds or thousands of accounts in order to lock users out of the network and impeded recovery efforts.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Ransomware
query: "DeviceProcessEvents \r\n| where ProcessCommandLine has_all('user', '/Domain', '/Active:Yes', '/PasswordChg:No') \r\n| summarize commands=count() by DeviceId, bin(Timestamp, 1d)  \r\n| where commands > 200 "
