id: 1337f378-ed44-4f23-9938-7fc012924ff6
name: PSExec Attrib commands
description: |-
  Prior to deploying Macaw ransomware in an organization, adversaries wil use Attrib to display file attribute information on multiple drives and all subfolders.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Discovery
- Ransomware
query: "DeviceProcessEvents \r\n| where InitiatingProcessParentFileName endswith \"PSEXESVC.exe\" \r\n| where InitiatingProcessCommandLine has \".bat\" \r\n| where FileName =~ \"cmd.exe\" and ProcessCommandLine has_all(\"-s\", \"-h\", \"-r\", \"-a\", \"*.*\") \r\n| take 100 "
