id: 28f56c18-a66e-4c51-94f6-3c8902cb58af
name: PSExec Attrib commands
description: |
  Prior to deploying Macaw ransomware in an organization, adversaries wil use Attrib to display file attribute information on multiple drives and all subfolders.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Discovery
- Ransomware
query: "DeviceProcessEvents \r\n| where InitiatingProcessParentFileName endswith \"PSEXESVC.exe\" \r\n| where InitiatingProcessCommandLine has \".bat\" \r\n| where FileName =~ \"cmd.exe\" and ProcessCommandLine has_all(\"-s\", \"-h\", \"-r\", \"-a\", \"*.*\") \r\n| take 100 "
