Parser:
  Title: Registry Event ASIM schema function
  Version: '0.1.1'
  LastUpdated: Oct 08, 2023
Product:
  Name: Microsoft
Normalization:
  Schema: RegistryEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/ASimRegistryEventDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Registry Event schema
ParserName: vimRegistryEventEmpty
EquivalentBuiltInParser: _Im_RegistryEvent_Empty
ParserQuery: |
  let EmptyNewRegistryEvents = datatable(
  // ****** Mandatory LA fields ******
      TimeGenerated:datetime, // => EventEndTime
      _ResourceId:string,
      Type:string,
  // ****** Event fields ******
      EventType:string,
      EventSubType:string,
      EventProduct:string,
      EventResult:string,
      EventResultDetails:string,
      EventOriginalSubType:string,
      EventOriginalResultDetails:string,
      EventSeverity:string,
      EventOriginalSeverity:string,
      EventSchema:string,
      EventOwner:string,
      EventProductVersion:string, 
      EventCount:int, 
      EventMessage:string, 
      EventVendor:string, 
      EventSchemaVersion:string, 
      EventOriginalUid:string, 
      EventOriginalType:string,
      EventStartTime:datetime, 
      EventEndTime:datetime, 
      EventReportUrl:string, 
      AdditionalFields:dynamic, 
      //****** RegistryFields ****** 
      RegistryKey:string,
      RegistryValue:string,
      RegistryValueType:string,
      RegistryValueData:string,
      RegistryPreviousKey:string,
      RegistryPreviousValue:string,
      RegistryPreviousValueType:string,
      RegistryPreviousValueData:string,
      //****** Device fields ******
      DvcId:string, 
      DvcHostname:string, 
      DvcIpAddr:string, 
      DvcOs:string, 
      DvcOsVersion:string, 
      DvcMacAddr:string,
      DvcFQDN:string,
      DvcDomain:string,
      DvcDomainType:string,
      DvcDescription:string,
      DvcZone:string,
      DvcAction:string,
      DvcOriginalAction:string,
      DvcInterface:string,
      DvcScopeId:string,
      DvcScope:string,
      DvcIdType:string,
      // -- User fields
      ActorUsername:string, 
      ActorUsernameType:string, 
      ActorUserId:string, 
      ActorUserIdType:string, 
      ActorSessionId:string,
      ActorUserAadId:string,
      ActorUserSid:string,
      ActorScopeId:string,
      ActorScope:string,
      ActorUserType:string,
      ActorOriginalUserType:string,
      ActingProcessCommandLine:string,
      //****** Process fields ******
      ActingProcessName:string,
      ActingProcessId:string,
      ActingProcessGuid:string,
      ParentProcessName:string,
      ParentProcessId:string,
      ParentProcessGuid:string,
      ParentProcessCommandLine:string,
      //****** Inspection fields ******
      RuleName:string,
      RuleNumber:int,
      ThreatId:string,
      ThreatName:string,
      ThreatCategory:string,
      ThreatRiskLevel:int,
      ThreatOriginalRiskLevel:string,
      ThreatConfidence:int,
      ThreatOriginalConfidence:string,
      ThreatIsActive:bool,
      ThreatFirstReportedTime:datetime,
      ThreatLastReportedTime:datetime,
      ThreatField:string,
      //****** aliases ****** 
      Dvc:string,
      User:string,
      Process:string,
      Src:string,
      Dst:string
      )[];
      EmptyNewRegistryEvents