Parser:
  Title: Registry Event ASIM parser for Microsoft Security Event
  Version: '0.1'
  LastUpdated: June 23, 2021
Product:
  Name: Microsoft Security Events
Normalization:
  Schema: RegistryEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/ASimRegistryEventDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Microsoft Security Events (event number 4657), produced by the Microsoft AMA connector, to the ASIM Registry Event normalized schema.
ParserName: vimRegistryEventMicrosoftSecurityEvents
ParserQuery: | 
              let RegistryType = datatable (TypeCode:string,TypeName:string)
                [
                  "%%1872", "Reg_None",
                  "%%1873",	"Reg_Sz",
                  "%%1874",	"Reg_Expand_Sz",
                  "%%1875",	"Reg_Binary",
                  "%%1876",	"Reg_DWord",
                  "%%1879",	"Reg_Multi_Sz",
                  "%%1883",	"Reg_QWord"
                ];
              let RegistryAction = datatable (EventOriginalSubType:string,EventType:string)
                [
                  "%%1904", "RegistryValueSet",
                  "%%1905", "RegistryValueSet",      
                  "%%1906", "RegistryValueDeleted"             
                ];
              let Hives = datatable (KeyPrefix:string,Hive:string)
                [
                  "MACHINE", "HKEY_LOCAL_MACHINE",
                  "USER", "HKEY_USERS",   
                ];
              let RegistryEvents=(){
              SecurityEvent
              // -- Filter
              | where EventID == 4657          
              // Event
              | extend
                  EventCount = int(1), 
                  EventVendor = 'Microsoft', 
                  EventProduct = 'Security Events', 
                  EventSchemaVersion = '0.1.0', 
                  EventStartTime = todatetime(TimeGenerated), 
                  EventEndTime = todatetime(TimeGenerated),
                  EventOriginalType = tostring(EventID) 
              | project-rename
                  EventOriginalSubType = OperationType,
                  EventOriginalUid = EventOriginId
              | lookup RegistryAction on EventOriginalSubType
              // Registry
              // Normalize key hive
              | parse ObjectName with "\\REGISTRY\\" KeyPrefix "\\" Key
              | lookup Hives on KeyPrefix
              | extend RegistryKey = strcat (Hive, "\\", Key)
              | project-away Hive, Key, KeyPrefix, ObjectName
              | project-rename
                RegistryValue = ObjectValueName
              | extend
                RegistryValueData = iff (EventOriginalSubType == "%%1906", OldValue, NewValue), 
                RegistryKeyModified = iff (EventOriginalSubType == "%%1905", RegistryKey, ""),
                RegistryValueModified = iff (EventOriginalSubType == "%%1905", RegistryValue, ""),
                RegistryValueDataModified = iff (EventOriginalSubType == "%%1905", OldValue, "")
              | lookup RegistryType on $left.NewValueType == $right.TypeCode | project-rename RegistryValueType = TypeName
              | lookup RegistryType on $left.OldValueType == $right.TypeCode | project-rename RegistryValueTypeModified = TypeName
              | project-away OldValue, NewValue, OldValueType, NewValueType
              // Device
              | extend
                  DvcId = SourceComputerId,
                  DvcHostname = Computer,
                  DvcOs = 'Windows'
              // User
              | project-rename
                  ActorUserId = SubjectUserSid, 
                  ActorSessionId = SubjectLogonId, 
                  ActorDomainName = SubjectDomainName
              | extend
                  ActorUserIdType = 'SID',
                  ActorUsername = iff (ActorDomainName == '-', SubjectUserName, SubjectAccount), 
                  ActorUsernameType = iff(ActorDomainName == '-','Simple', 'Windows'),
                  ActingProcessId = tostring(toint(ProcessId)) 
              // Process 
              | project-rename
                  ActingProcessName = ProcessName
              // -- Aliases
                | extend
                  User = ActorUsername,
                  UserId = ActorUserId,
                  Dvc = DvcHostname,
                  Process = ActingProcessName
              // -- Remove potentially confusing
                | project-away 
                    SubjectUserName,
                    SubjectAccount
              }; RegistryEvents
