Parser:
  Title: Registry Event ASIM schema function
  Version: '0.1.0'
  LastUpdated: June 29, 2021
Product:
  Name: Microsoft
Normalization:
  Schema: RegistryEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/ASimRegistryEventDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Registry Event schema
ParserName: vimRegistryEventEmpty
ParserQuery: |
  let EmptyNewRegistryEvents = datatable(
  // ****** Mandatory LA fields ******
      TimeGenerated:datetime, // => EventEndTime
      _ResourceId:string,
      Type:string,
  // ****** Event fields ******
      EventType:string, 
      EventProduct:string,  
      EventProductVersion:string, 
      EventCount:int, 
      EventMessage:string, 
      EventVendor:string, 
      EventSchemaVersion:string, 
      EventOriginalUid:string, 
      EventOriginalType:string,
      EventStartTime:datetime, 
      EventEndTime:datetime, 
      EventReportUrl:string, 
      AdditionalFields:dynamic, 
      // -- RegistryFields
      RegistryKey:string,
      RegistryValue:string,
      RegistryValueType:string,
      RegistryValueData:string,
      RegistryPreviousKey:string,
      RegistryPreviousValue:string,
      RegistryPreviousValueType:string,
      RegistryPreviousValueData:string,
      // -- Device fields 
      DvcId:string, 
      DvcHostname:string, 
      DvcIpAddr:string, 
      DvcOs:string, 
      DvcOsVersion:string, 
      DvcMacAddr:string, 
      // -- User fields
      ActorUsername:string, 
      ActorUsernameType:string, 
      ActorUserId:string, 
      ActorUserIdType:string, 
      ActorSessionId:string, 
      // -- Process fields
      ActingProcessName:string,
      ActingProcessId:string,
      ActingProcessGuid:string,
      ParentProcessName:string,
      ParentProcessId:string,
      ParentProcessGuid:string,
      // -- aliases
      Dvc:string,
      User:string,
      Process:string,
      )[];
      EmptyNewRegistryEvents