Parser:
  Title: Registry Event ASIM schema function
  Version: '0.1.1'
  LastUpdated: Oct 08, 2023
Product:
  Name: Microsoft
Normalization:
  Schema: RegistryEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/ASimRegistryEventDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Registry Event schema
ParserName: vimRegistryEventEmpty
EquivalentBuiltInParser: _Im_RegistryEvent_Empty
ParserQuery: |
  let EmptyNewRegistryEvents = datatable(
      TimeGenerated:datetime,
      _ResourceId:string,
      Type:string,
      ActingProcessCommandLine:string,
      ActingProcessGuid:string,
      ActingProcessId:string,
      ActingProcessName:string,
      ActorDNUsername:string,
      ActorOriginalUserType:string,
      ActorScope:string,
      ActorScopeId:string,
      ActorSessionId:string,
      ActorSimpleUsername:string,
      ActorUserAadId:string,
      ActorUserAWSId:string,
      ActorUserId:string,
      ActorUserIdType:string,
      ActorUsername:string,
      ActorUsernameType:string,
      ActorUserOktaId:string,
      ActorUserPuid:string,
      ActorUserSid:string,
      ActorUserType:string,
      ActorUserUid:string,
      ActorUserUpn:string,
      ActorWindowsUsername:string,
      AdditionalFields:dynamic,
      Dst:string,
      Dvc:string,
      DvcAction:string,
      DvcDescription:string,
      DvcDomain:string,
      DvcDomainType:string,
      DvcFQDN:string,
      DvcHostname:string,
      DvcId:string,
      DvcIdType:string,
      DvcInterface:string,
      DvcIpAddr:string,
      DvcMacAddr:string,
      DvcOriginalAction:string,
      DvcOs:string,
      DvcOsVersion:string,
      DvcScope:string,
      DvcScopeId:string,
      DvcZone:string,
      EventCount:int,
      EventEndTime:datetime,
      EventMessage:string,
      EventOriginalResultDetails:string,
      EventOriginalSeverity:string,
      EventOriginalSubType:string,
      EventOriginalType:string,
      EventOriginalUid:string,
      EventOwner:string,
      EventProduct:string,
      EventProductVersion:string,
      EventReportUrl:string,
      EventResult:string,
      EventResultDetails:string,
      EventSchema:string,
      EventSchemaVersion:string,
      EventSeverity:string,
      EventStartTime:datetime,
      EventSubType:string,
      EventType:string,
      EventUid:string,
      EventVendor:string,
      ParentProcessGuid:string,
      ParentProcessId:string,
      ParentProcessName:string,
      Process:string,
      RegistryKey:string,
      RegistryPreviousKey:string,
      RegistryPreviousValue:string,
      RegistryPreviousValueData:string,
      RegistryPreviousValueType:string,
      RegistryValue:string,
      RegistryValueData:string,
      RegistryValueType:string,
      Rule:string,
      RuleName:string,
      RuleNumber:int,
      Src:string,
      ThreatCategory:string,
      ThreatConfidence:int,
      ThreatField:string,
      ThreatFirstReportedTime:datetime,
      ThreatId:string,
      ThreatIsActive:bool,
      ThreatLastReportedTime:datetime,
      ThreatName:string,
      ThreatOriginalConfidence:string,
      ThreatOriginalRiskLevel:string,
      ThreatRiskLevel:int,
      User:string
      )[];
      EmptyNewRegistryEvents