// Name: Windows - Process + Commandline Rare for Host
// Description: This hunting version will help you lookup your interesting process and see on what hosts it is rare, including command line.  
// Less than 1% of the average for 30 days and less than a count of 100 on a given host or less than a 14 count on a given host from the last 7 days
//
// Entity: Process
// Input: ProcessName
// Output: Hosts
//
// QueryPeriod: -7d, change as needed
//
// Data Source: SecurityEvent
//
// Tactics: #Execution, #Persistence, #Discovery, #Lateral Movement, #Collection
//
let GetHostWithRareProcess = (suspiciousEventTime:datetime, v_Process:string){
let v_StartTime = suspiciousEventTime-7d;
let v_EndTime = suspiciousEventTime-1m;
SecurityEvent
| where EventID == 4688
| where TimeGenerated between (v_StartTime .. v_EndTime)
| where NewProcessName has v_Process
| where isnotempty(CommandLine) and NewProcessName !endswith ":\\windows\\system32\\conhost.exe" and tolower(CommandLine) != tolower(NewProcessName) and tolower(CommandLine) != tolower(strcat('\"',NewProcessName,'\"'," "))
| summarize count() by Computer, NewProcessName, CommandLine
| join kind= inner (
    SecurityEvent
    | where EventID == 4688
    // get avg from last 30 days
    | where TimeGenerated >= ago(30d)
	| where NewProcessName has v_Process
    | where isnotempty(CommandLine) and NewProcessName !endswith ":\\windows\\system32\\conhost.exe" and tolower(CommandLine) != tolower(NewProcessName) and tolower(CommandLine) != tolower(strcat('\"',NewProcessName,'\"'," "))
    | summarize count() by Computer, NewProcessName, CommandLine
    | summarize avg(count_) by NewProcessName, CommandLine
    ) on NewProcessName, CommandLine
// attempt to control for noise, but not miss low prevalence count with low average count
| where count_ < 7 or (count_ <= avg_count_*0.01 and count_ < 100)
| join kind= inner (
    SecurityEvent
    | where EventID == 4688
    | where TimeGenerated between (v_StartTime .. v_EndTime)
	| where NewProcessName has v_Process
    | where isnotempty(CommandLine) and NewProcessName !endswith ":\\windows\\system32\\conhost.exe" and tolower(CommandLine) != tolower(NewProcessName) and tolower(CommandLine) != tolower(strcat('\"',NewProcessName,'\"'," "))
    | summarize min(TimeGenerated), max(TimeGenerated) by Computer, NewProcessName, CommandLine
) on Computer, NewProcessName, CommandLine
| project min_TimeGenerated, max_TimeGenerated, EventCount = count_, AvgEventCountAllSystems = avg_count_, Computer, NewProcessName, CommandLine 
| top 10 by EventCount asc nulls last 
| project min_TimeGenerated, max_TimeGenerated, Computer, NewProcessName, CommandLine, EventCount, AvgEventCountAllSystems 
};
// change datetime value and <processname> value below
GetHostWithRareProcess(datetime('2019-01-31T10:36:07Z'), "<processname>")