id: cdac93ef-56c0-45bf-9e7f-9cbf0ad034234
name: Check for spoofing attempts on the domain with Authentication failures  
description: |
  This query checks for spoofing attempts on the domain with Authentication failures.
requiredDataConnectors:
- connectorId: OfficeATP
  dataTypes:
  - EmailEvents
tactics:
- InitialAccess
query: |
  EmailEvents 
  | where TimeGenerated > ago (1d) and DetectionMethods has "spoof" and SenderFromDomain has "contoso.com"  // contoso.com is provided for refrence, this can be replaced by specific domain value
  | project TimeGenerated, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, Subject, SenderFromAddress, SenderIPv4,ThreatTypes,   DetectionMethods, ThreatNames  
  | evaluate bag_unpack(AR)  
  | where column_ifexists('SPF','') =~ "fail" or  column_ifexists('DMARC','') =~ "fail" or column_ifexists('DKIM','') =~ "fail" or column_ifexists('CompAuth','') =~ "fail"