id: cdac93ef-56c0-45bf-9e7f-9cbf0ad06890
name: Detection details for malicious clicks 
description: |
  This query determine clickthroughs, potential deliveries through User/Tenant overrides and detection details for malicious clicks.
requiredDataConnectors:
- connectorId: OfficeATP
  dataTypes:
  - UrlClickEvents
tactics:
- User Execution
query: |
  UrlClickEvents
  | where ThreatTypes has "Phish" 
  | join EmailEvents on NetworkMessageId,  $left.AccountUpn == $right.RecipientEmailAddress 
  | project Timestamp, Url, ActionType, AccountUpn, ReportId, NetworkMessageId, ThreatTypes, IsClickedThrough, DeliveryLocation, OrgLevelAction, UserLevelAction 