id: cdac93ef-56c0-45bf-9e7f-9cbf0ad06123
name: Determine Successfully Delivered Phishing Emails to Inbox/Junk folder.
description: |
  This query identifies threats which got successfully delivered to Inbox/Junk folder.
requiredDataConnectors:
- connectorId: OfficeATP
  dataTypes:
  - EmailEvents
tactics:
- InitialAccess
relevantTechniques:
- T1566
query: |
  EmailEvents
  | where isnotempty(ThreatTypes) and DeliveryLocation in ("Inbox/folder","Junk folder")
  | extend Account_0_Name = SenderFromAddress
  | extend IP_0_Address = SenderIPv4
  | extend MailBox_0_MailboxPrimaryAddress = RecipientEmailAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: SenderFromAddress
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SenderIPv4
  - entityType: MailBox
    fieldMappings:
      - identifier: MailboxPrimaryAddress
        columnName: RecipientEmailAddress

version: 1.0.1