id: cdac93ef-56c0-45bf-9e7f-9cbf0ad06789
name: Search for malicious clicks
description: |
  This query Search for malicious clicks where user was allowed to proceed through.
requiredDataConnectors:
- connectorId: OfficeATP
  dataTypes:
  - UrlClickEvents
tactics:
- User Execution
query: |
  UrlClickEvents
  | where ActionType == "ClickAllowed" or IsClickedThrough !="0" 
  | where ThreatTypes has "Phish"
  | summarize by ReportId, IsClickedThrough, AccountUpn, NetworkMessageId, ThreatTypes, Timestamp