id: c7f7cd69-cafe-477d-a775-935504bffa10
name: Vectra AI Detect - Host in the Low Quadrant
description: |
  'Identifies multiple Detections coming from the same internal Host which caused a move into Detect's Low quadrant. 
  To meet this requirement, the threat score must be in 0-50 range and the certainty score in the 0-50 range (range is 1-100 for threat and certainty). If required, variables in the query can be adjusted to a different threshold. '
severity: Low
requiredDataConnectors:
  - connectorId: AIVectraDetect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - Discovery
  - LateralMovement
  - Collection
  - CommandAndControl
  - Exfiltration
  - Impact
relevantTechniques:
query: |
  let threat_score_max = 50;
  let certainty_score_max = 50;
  CommonSecurityLog
  | where DeviceVendor == "Vectra Networks"
  | where DeviceProduct == "X Series"
  | where DeviceEventClassID == "hsc"
  | project-rename threat_score = FlexNumber1
  | project-rename certainty_score = FlexNumber2
  | project-rename vectra_URL = DeviceCustomString4
  | project-rename detection_name = DeviceEventClassID
  | project-rename score_decreases = DeviceCustomString3
  | where threat_score < threat_score_max and certainty_score < certainty_score_max
  //keep only the event with the highest threat score per Host
  | summarize arg_max(threat_score, *) by SourceHostName
  | project SourceHostName, TimeGenerated, SourceIP, threat_score, certainty_score, vectra_URL
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIP
version: 1.0.0
kind: Scheduled