id: 7040fea1-c711-4d0c-b87c-c0a9141ed3e7
name: Vectra AI Detect - Exfiltration Detection with High Severity
description: |
  'Identifies detections with a threat score superior to 7.0 in the category Exfiltration. This is consider has a high severity alert and should be investigated. 
  The Severity is a mapping with the Threat score assigned to a detection. It ranges between 0 and 10. 
  The severity_threshold can be adjusted as desired.' 
severity: High
requiredDataConnectors:
  - connectorId: AIVectraDetect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Exfiltration
relevantTechniques:
query: |
  //default threshold is 7 (meaning a threat score of 70)
  let severity_threshold = 7.0;
  CommonSecurityLog
  | where DeviceVendor == "Vectra Networks"
  | where DeviceProduct == "X Series"
  | where DeviceEventClassID != "campaigns" and DeviceEventClassID != "hsc" and DeviceEventClassID != "audit" and DeviceEventClassID != "health" and DeviceEventClassID != "asc" and SourceHostName != ""
  | extend Category = extract("cat=(.+?);", 1, AdditionalExtensions) 
  | project-rename threat_score = FlexNumber1
  | project-rename certainty_score = FlexNumber2
  | project-rename vectra_URL = DeviceCustomString4
  | project-rename detection_name = DeviceEventClassID
  | where todecimal(LogSeverity) >= severity_threshold and Category == "EXFILTRATION" 
  | summarize arg_max(threat_score, *) by SourceHostName, Activity
  | sort by TimeGenerated
  | project SourceHostName, Category, Activity, LogSeverity 
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
version: 1.0.0
kind: Scheduled