id: 8c705e06-6aa4-436a-b92f-0fa3fb248db6
name: Vectra AI Detect - Host in the Critical Quadrant
description: |
  'Identifies multiple Detections coming from the same internal Host which caused a move into Detect's critical quadrant. 
  The threat and certainty scores for that Host is greater than 50 (range is 1-100 for threat and certainty).  If required, variables in the query can be adjusted to a different threshold. 
  This means that Vectra AI has detected malicous behaviors accross multiple phases of the Kill Chain and it requires immediate investigation.'
severity: High
requiredDataConnectors:
  - connectorId: AIVectraDetect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - Discovery
  - LateralMovement
  - Collection
  - CommandAndControl
  - Exfiltration
  - Impact
relevantTechniques:
query: |
  let threat_score_min = 50;
  let certainty_score_min = 50;
  CommonSecurityLog
  | where DeviceVendor == "Vectra Networks"
  | where DeviceProduct == "X Series"
  | where DeviceEventClassID == "hsc"
  | project-rename threat_score = FlexNumber1
  | project-rename certainty_score = FlexNumber2
  | project-rename vectra_URL = DeviceCustomString4
  | project-rename detection_name = DeviceEventClassID
  | project-rename score_decreases = DeviceCustomString3
  | where threat_score >= threat_score_min and certainty_score >= certainty_score_min
  //keep only the event with the highest threat score per Host
  | summarize arg_max(threat_score, *) by SourceHostName
  | project SourceHostName, TimeGenerated, SourceIP, threat_score, certainty_score, vectra_URL
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIP
version: 1.0.0
kind: Scheduled