id: a5ee1c65-f27c-44fd-a65e-e0ac2f6404fc
name: Vectra AI Detect - Account in the Critical Quadrant
description: |
  'Identifies multiple Detections coming from the same account which caused a move into the Detect critical quadrant. 
  The threat and certainty scores for the account are greater than 50 (range is 1-100 for threat and certainty). If required, variables in the query can be adjusted to a different threshold. 
  This means that Vectra AI has detected malicous behaviors accross multiple phases of the Kill Chain and it requires immediate investigation.'
severity: High
requiredDataConnectors:
  - connectorId: AIVectraDetect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - Discovery
  - LateralMovement
  - Collection
  - CommandAndControl
  - Exfiltration
  - Impact
relevantTechniques:
query: |
  let threat_score_min = 50;
  let certainty_score_min = 50;
  let upn_has_prefix = ":";
  CommonSecurityLog
  | where DeviceVendor == "Vectra Networks"
  | where DeviceProduct == "X Series"
  | where DeviceEventClassID == "asc"
  | extend saccount = extract("saccount=(.+?);", 1, AdditionalExtensions)
  | extend type = iff(saccount matches regex upn_has_prefix, tostring(split(saccount,":")[0]) ,"network" ) 
  | extend upn = iff(saccount matches regex upn_has_prefix, tostring(split(saccount,":")[1]) , saccount )
  | project-rename threat_score = FlexNumber1
  | project-rename certainty_score = FlexNumber2
  | project-rename vectra_URL = DeviceCustomString4
  | project-rename detection_name = DeviceEventClassID
  | project-rename score_decreases = DeviceCustomString3
  | where threat_score >= threat_score_min and certainty_score >= certainty_score_min
  //keep only the event with the highest threat score per Host
  | summarize arg_max(threat_score, *) by saccount
  | project saccount, upn, type, threat_score, certainty_score, vectra_URL
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: upn
version: 1.0.0
kind: Scheduled