id: d378578c-0a89-447d-833a-f4043203df11
name: Vectra Detection - Insights
description: |
  'This query searches for Info Detections triggered by one of the Vectra AI models. 
  Those are informative, providing security insights, and do not influence the score assigned to the Host.  They provide useful context to a Host or Account for an investigation.
  Some examples: New role seen for a host (e.g DNS server), novel port (used for the first time from this host), etc.'
severity: Low
requiredDataConnectors:
  - connectorId: AIVectraDetect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
relevantTechniques:
query: |
  CommonSecurityLog
  | where DeviceVendor == "Vectra Networks"
  | where DeviceProduct == "X Series"
  | where DeviceEventClassID != "campaigns" and DeviceEventClassID != "hsc" and DeviceEventClassID != "audit" and DeviceEventClassID != "health" and DeviceEventClassID != "asc" 
  | extend cat = extract("cat=(.+?);", 1, AdditionalExtensions) 
  | where cat == "INFO"
  | project-rename triaged = DeviceCustomString5
  | project-rename vectra_URL = DeviceCustomString4
  | project-rename detection_name = DeviceEventClassID
  | summarize arg_max(TimeGenerated, *) by SourceHostName, detection_name
  | project SourceHostName, SourceIP, DestinationIP, DestinationPort, DestinationHostName, detection_name, cat, triaged, vectra_URL
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIP
version: 1.0.0
kind: Scheduled