id: 95dcf6ac-0527-46fc-8a88-f93d7a9fc059
name: Vectra AI Detect - Account in the Medium Quadrant
description: |
  'Identifies multiple Detections coming from the account which casued a move into the Detect Medium quadrant. 
  To meet this requirement, the threat score must be in 0-50 range and the certainty score between in 50-100 range (range is 1-100 for threat and certainty). If required, variables in the query can be adjusted to a different threshold. '
severity: Medium
requiredDataConnectors:
  - connectorId: AIVectraDetect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - Discovery
  - LateralMovement
  - Collection
  - CommandAndControl
  - Exfiltration
relevantTechniques:
query: |
  let threat_score_max = 50;
  let certainty_score_min = 50;
  let upn_has_prefix = ":";
  CommonSecurityLog
  | where DeviceVendor == "Vectra Networks"
  | where DeviceProduct == "X Series"
  | where DeviceEventClassID == "asc"
  | extend saccount = extract("saccount=(.+?);", 1, AdditionalExtensions)
  | extend type = iff(saccount matches regex upn_has_prefix, tostring(split(saccount,":")[0]) ,"network" ) 
  | extend upn = iff(saccount matches regex upn_has_prefix, tostring(split(saccount,":")[1]) , saccount )
  | project-rename threat_score = FlexNumber1
  | project-rename certainty_score = FlexNumber2
  | project-rename vectra_URL = DeviceCustomString4
  | project-rename detection_name = DeviceEventClassID
  | project-rename score_decreases = DeviceCustomString3
  | where threat_score < threat_score_max and certainty_score >= certainty_score_min
  //keep only the event with the highest threat score per Host
  | summarize arg_max(threat_score, *) by saccount
  | project saccount, upn, type, threat_score, certainty_score, vectra_URL
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: upn
version: 1.0.0
kind: Scheduled