Parser:
  Title: Alert Event ASIM schema function
  Version: '0.1.0'
  LastUpdated: Oct 18 2024
Product:
  Name: Microsoft
Normalization:
  Schema: AlertEvent
  Version: '0.1'
References:
- Title: ASIM Alert Schema
  Link: https://aka.ms/ASimAlertEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Dhcp Event schema.
ParserName: vimAlertEventEmpty
EquivalentBuiltInParser: _Im_AlertEvent_Empty
ParserQuery: |
  let EmptyAlertEvents =datatable (
    TimeGenerated:datetime,
    _ResourceId:string,
    Type:string,
    AdditionalFields:dynamic,
    AlertDescription:string,
    AlertId:string,
    AlertName:string,
    AlertOriginalStatus:string,
    AlertStatus:string,
    AlertVerdict:string,
    AttackRemediationSteps:string,
    AttackTactics:string,
    AttackTechniques:string,
    DetectionMethod:string,
    DvcAction:string,
    DvcDescription:string,
    DvcDomain:string,
    DvcDomainType:string,
    DvcFQDN:string,
    DvcHostname:string,
    DvcId:string,
    DvcIdType:string,
    DvcInterface:string,
    DvcIpAddr:string,
    DvcMacAddr:string,
    DvcOriginalAction:string,
    DvcOs:string,
    DvcOsVersion:string,
    DvcScope:string,
    DvcScopeId:string,
    DvcZone:string,
    EmailMessageId:string,
    EmailSubject:string,
    EventCount:int,
    EventEndTime:datetime,
    EventMessage:string,
    EventOriginalSeverity:string,
    EventOriginalSubType:string,
    EventOriginalType:string,
    EventOriginalUid:string,
    EventOwner:string,
    EventProduct:string,
    EventProductVersion:string,
    EventReportUrl:string,
    EventResult:string,
    EventSchema:string,
    EventSchemaVersion:string,
    EventSeverity:string,
    EventStartTime:datetime,
    EventSubType:string,
    EventType:string,
    EventUid:string,
    EventVendor:string,
    FileMD5:string,
    FileName:string,
    FilePath:string,
    FileSHA1:string,
    FileSHA256:string,
    FileSize:long,
    Hostname:string,
    IndicatorAssociation:string,
    IndicatorType:string,
    IpAddr:string,
    OriginalUserType:string,
    ProcessCommandLine:string,
    ProcessFileCompany:string,
    ProcessId:string,
    ProcessName:string,
    RegistryKey:string,
    RegistryValue:string,
    RegistryValueData:string,
    RegistryValueType:string,
    Rule:string,
    RuleDescription:string,
    RuleName:string,
    RuleNumber:int,
    ThreatCategory:string,
    ThreatConfidence:int,
    ThreatFirstReportedTime:datetime,
    ThreatId:string,
    ThreatIsActive:bool,
    ThreatLastReportedTime:datetime,
    ThreatName:string,
    ThreatOriginalCategory:string,
    ThreatOriginalConfidence:string,
    ThreatOriginalRiskLevel:string,
    ThreatRiskLevel:int,
    Url:string,
    User:string,
    UserId:string,
    UserIdType:string,
    Username:string,
    UsernameType:string,
    UserScope:string,
    UserScopeId:string,
    UserSessionId:string,
    UserType:string
  )[];
  EmptyAlertEvents