Parser:
  Title: Alert Event ASIM schema function
  Version: '0.1.0'
  LastUpdated: Oct 18 2024
Product:
  Name: Microsoft
Normalization:
  Schema: AlertEvent
  Version: '0.1'
References:
- Title: ASIM Alert Schema
  Link: https://aka.ms/ASimAlertEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Dhcp Event schema.
ParserName: vimAlertEventEmpty
EquivalentBuiltInParser: _Im_AlertEvent_Empty
ParserQuery: |
  let EmptyAlertEvents =datatable (
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // ****** Event fields ******
  , AdditionalFields:dynamic
  , EventCount:int
  , EventType:string
  , EventProduct:string
  , EventProductVersion:string
  , EvenMessage:string
  , EventVendor:string
  , EventSchema:string
  , EventSchemaVersion:string
  , EventSeverity:string
  , EventOriginalSeverity:string
  , EventSubType:string
  , EventOriginalUid:string
  , EventOwner:string
  , EventOriginalType:string
  , EventOriginalSubType:string
  , EventEndTime:datetime
  , EventReportUrl:string
  , EventResult:string
  , EventStartTime:datetime
  , EventUid:string
  //****** Device fields ******
  , DvcAction:string
  , DvcDescription:string
  , DvcId:string
  , DvcIdType:string
  , DvcInterface:string
  , DvcHostname:string
  , DvcDomain:string
  , DvcDomainType:string
  , DvcIpAddr:string
  , DvcOs:string
  , DvcOsVersion:string
  , DvcMacAddr:string
  , DvcOriginalAction:string
  , DvcScope:string
  , DvcScopeId:string
  , DvcFQDN:string
  , DvcZone:string
  //****** Inspection fields ******
  , AlertId:string
  , AlertName:string
  , AlertDescription:string
  , AlertStatus:string
  , AlertOriginalStatus:string
  , AlertVerdict:string
  , AttackTactics:string
  , AttackTechniques:string
  , AttackRemediationSteps:string
  , IndicatorType:string
  , IndicatorAssociation:string
  , DetectionMethod:string
  , Rule: string
  , RuleNumber:int
  , RuleName:string
  , RuleDescription:string
  , ThreatId:string
  , ThreatName:string
  , ThreatFirstReportedTime:datetime
  , ThreatLastReportedTime:datetime
  , ThreatCategory:string
  , ThreatOriginalCategory:string
  , ThreatIsActive:bool
  , ThreatRiskLevel:int
  , ThreatOriginalRiskLevel:string
  , ThreatConfidence:int
  , ThreatOriginalConfidence:string
  //****** Source User fields ******
  , UserId:string
  , UserTdType:string
  , Username:string
  , UsernameType:string
  , UserType:string
  , OriginalUserType:string
  , SessionId:string
  , UserScopeId:string
  , UserScope:string
  //****** Process fields ******
  , ProcessId:string
  , ProcessName:string
  , ProcessCommandLine:string
  , ProcessFileCompany:string
  //****** File fields ******
  , FileName:string
  , FilePath:string
  , FileSHA1:string
  , FileMD5:string
  , FileSHA256:string
  , FileSize:int
  //****** Registry fields ******
  , RegistryKey:string
  , RegistryValue:string
  , RegistryValueType:string
  , RegistryValueData:string
  //****** Email fields ******
  , EmailSubject:string
  , EmailMessageId:string
  //****** Url fields ******
  , Url:string
  //****** Aliases ******
  , IpAddr:string
  , Hostname:string
  , User:string
  )[];
  EmptyAlertEvents