id: 844ebe37-ec32-4061-b729-aa308b735096
name: VTI - High Severity Domain Collision Detection
version: 1.0.0
kind: Scheduled
description: |-
  This will alert when a collision is detected for EmailUrlInfo events with VTI high severity domain IoCs
severity: High
requiredDataConnectors:
  - connectorId: VisaThreatIntelligence
    dataTypes:
      - VisaThreatIntelligenceIOC_CL
      - EmailUrlInfo
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
- InitialAccess
relevantTechniques:
- T1566
query: |-
  EmailUrlInfo
  | join kind=inner (VisaThreatIntelligenceIOC_CL  | where IOCType == "domain" and SourceSeverity == "High")
  on $left.UrlDomain == $right.Value
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 1h
    matchingMethod: AllEntities
suppressionDuration: 1h
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: URL
  fieldMappings:
  - identifier: Url
    columnName: Url
- entityType: DNS
  fieldMappings:
  - identifier: DomainName
    columnName: UrlDomain

