{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('Workspace')]",
      "location": "[parameters('WorkspaceRegion')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimNetworkSessionForcePointFirewall",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('Workspace'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "Network Session ASIM parser for Force Point Firewall",
            "category": "ASIM",
            "FunctionAlias": "vimNetworkSessionForcePointFirewall",
            "query": "let ApplicationProtocolLookup=datatable(ApplicationProtocol:string,NetworkApplicationProtocol:string)\n   [\n         \"HTTPS\",\"HTTPS\",\n         \"HTTP-Over-QUIC\",\"HTTP\",\n         \"HTTP\",\"HTTP\",\n         \"DNS Over TLS\",\"DNS\",\n         \"HTTP proxy\",\"HTTP\",\n         \"IMAPS\",\"IMAPS\",\n         \"SMTP\",\"SMTP\",\n         \"IMAP\",\"IMAP\",\n         \"POP3S\",\"POP3\",\n         \"SMTP Submission Service\",\"SMTP\",\n         \"X11\",\"X11\",\n         \"RTSP\",\"RTSP\",\n         \"Telnet\",\"TELNET\",\n         \"NNTP\",\"NNTP\",\n         \"ISAKMP\",\"ISAKMP\",\"ISAKMP\",\"ISAKMP\",\n         \"POP3\",\"POP3\",\n         \"BGP\",\"BGP\",\n         \"FTP\",\"FTP\",\n         \"RIP\",\"RIP\",\n         \"Squid HTTP proxy\",\"HTTP\",\n         \"TFTP\",\"TFTP\",\n         \"QOTD\",\"QOTD\",\n         \"SCCP\",\"SCCP\",\n         \"Modbus\",\"MODBUS\",\n         \"SVN\",\"SVN\",\n         \"RADIUS (Accounting)\",\"RADIUS\",\n         \"Kerberos\",\"KERBEROS\",\n         \"GRE\",\"GRE\",\n         \"UUCP-rlogin\",\"UUCP\",\n         \"GTP User Data Tunneling\",\"GTP\",\n         \"NNTPS\",\"NNTP\",\n         \"GTP Control\",\"GTP\",\n         \"IRC-default\",\"IRC\",\n         \"FTPS (Control)\",\"FTPS\",\n         \"ICCP\",\"ICCP\",\n         \"IRCS\",\"IRC\",\n         \"Telnets\",\"TELNET\",\n         \"Finger\",\"FINGER\",\n         \"ESP\",\"ESP\",\n         \"Rlogin\",\"RLP\",\n         \"IMAP3\",\"IMAP\",\n         \"MGCP\",\"MGCP\",\n         \"RADIUS Accounting (Old)\",\"RADIUS\",\n         \"RADIUS (Old)\",\"RADIUS\",\n         \"CVS\",\"CVS\",\n         \"Ident\",\"IDENT\",\n         \"Gopher\",\"GOPHER\",\n         \"BGMP\",\"BGMP\",\n         \"FTPS (Data)\",\"FTPS\",\n         \"POP2\",\"POP\",\n         \"TLISRV\",\"TLISRV\",\n         \"INGRES-NET\",\"INGRES-NET\",\n         \"IPIP\",\"IPIP\",\n         \"XTP\",\"XTP\",\n         \"UUCP\",\"UUCP\",\n         \"IRC\",\"IRC\",\n         \"Photuris (ICMP)\",\"ICMP\",\n         \"TACACS-DS\",\"TACACS-DS\",\n         \"WESP\",\"WESP\",\n         \"EGP\",\"EGP\",\n         \"WSN\",\"WSN\",\n         \"XDMCP\",\"XDMCP\",\n         \"Kerberos IV\",\"KERBEROS\",\n         \"IRTP\",\"IRTP\",\n         \"TTP\",\"TTP\",\n         \"IRC-SERV\",\"IRC\",\n         \"I-NLSP\",\"NLSP\",\n         \"SNP\",\"SNP\",\n         \"XNS-IDP\",\"XNS\",\n         \"SECURE-VMTP\",\"VMTP\",\n         \"VMTP\",\"VMTP\",\n         \"IPLT\",\"IPLT\",\n         \"GGP\",\"GGP\",\n         \"MFE-NSP\",\"NSP\",\n         \"HIP\",\"HIP\",\n         \"MERIT-NSP\",\"NSP\",\n         \"NSFNET-IGP\",\"IGP\",\n         \"DCN-MEAS\",\"DCN\",\n         \"STP\",\"STP\",\n         \"SRP\",\"SRP\",\n         \"HMP\",\"HMP\",\n         \"XNET\",\"XNET\",\n         \"VRRP\",\"VRRP\",\n         \"ENCAP\",\"ENCAP\",\n         \"CPNX\",\"CPNX\",\n         \"PTP\",\"PTP\",\n         \"SKIP\",\"SKIP\",\n         \"SCPS\",\"SCPS\",\n         \"Sprite-RPC\",\"RPC\",\n         \"IPv6 ICMP\",\"ICMP\",\n         \"MUX\",\"MUX\",\n         \"CHAOS\",\"CHAOS\",\n         \"SSCOPMCE\",\"SSCOPMCE\",\n         \"CBT\",\"CBT\",\n         \"SPS\",\"SPS\",\n         \"ETHERIP\",\"ETHERIP\",\n         \"MTP\",\"MTP\",\n         \"ROHC\",\"ROHC\",\n         \"CRTP\",\"CRTP\",\n         \"PNNI\",\"PNNI\",\n         \"NETBLT\",\"NETBLT\",\n         \"TLSP\",\"TLSP\",\n         \"IDPR\",\"IDPR\",\n         \"DDX\",\"DDX\",\n         \"PUP\",\"PUP\",\n         \"DSR\",\"DSR\",\n         \"NARP\",\"NARP\",\n         \"CPHB\",\"CPHB\",\n         \"SMP\",\"SMP\",\n         \"L2TP\",\"L2TP\",\n         \"IPv6 ICMP/143/0\",\"ICMP\",\n         \"MICP\",\"MICP\",\n         \"GMTP\",\"GMTP\",\n         \"LARP\",\"LARP\",\n         \"IFMP\",\"IFMP\",\n         \"IGP\",\"IGP\",\n         \"CFTP\",\"CFTP\",\n         \"PGM\",\"PGM\",\n         \"DDP\",\"DDP\",\n         \"PIPE\",\"PIPE\",\n         \"IATP\",\"IATP\",\n         \"IGMP\",\"IGMP\",\n         \"3PC\",\"3PC\",\n         \"DGP\",\"DGP\",\n         \"TCF\",\"TCF\",\n         \"UTI\",\"UTI\",\n         \"DCCP\",\"DCCP\",\n         \"SWIPE\",\"SWIPE\",\n         \"EMCON\",\"EMCON\",\n         \"PIM\",\"PIM\",\n         \"RVD\",\"RVD\",\n   ];\n let ActionLookup=datatable(DeviceAction:string,DvcAction_ActionLookup:string,EventResult_ActionLookup:string,EventSeverity_ActionLookup:string)\n [\n           \"Allow\",\"Allow\",\"Success\",\"Informational\",          \n           \"Discard\",\"Drop\",\"Failure\",\"Low\",\n           \"Permit\",\"Allow\",\"Success\",\"Informational\",          \n           \"Refuse\",\"Deny\",\"Failure\",\"Low\",\n           \"Terminate\",\"Reset Source\",\"Failure\",\"Low\",          \n           \"Terminate (failed)\",\"\",\"Failure\",\"Low\",\n           \"Terminate (passive)\",\"Reset Destination\",\"Failure\",\"Low\",          \n           \"Terminate (reset)\",\"Reset\",\"Failure\",\"Low\",\n           \"Wait for Authentication\",\"\",\"Success\",\"Informational\",\n           \"Wait for Further Actions\",\"\",\"Success\",\"Informational\",          \n           \"Wait for RPC Reply\",\"\",\"Success\",\"Informational\"\n ];\n let DeviceEventClassIDLookup_Packet=datatable(DeviceEventClassID:string,EventSubType:string,DvcAction_DeviceEventClassIDLookup:string,EventResult_DeviceEventClassIDLookup:string,EventSeverity_DeviceEventClassIDLookup:string) //Add more codes if needed\n [\n           \"70018\",\"Start\",\"Allow\",\"Success\",\"Informational\", // Connection_Allowed\n           \"70019\",\"End\",\"Deny\",\"Failure\",\"Low\", // Connection_Discarded\n           \"70021\",\"End\",\"Reset\",\"Failure\",\"Low\", // Connection_Closed\n           \"70022\",\"End\",\"Reset\",\"Failure\",\"Low\", // Connection_Closed-Abnormally\n           \"70026\",\"\",\"\",\"Success\",\"Informational\", // Connection_Progress\n ];\n let DeviceEventClassIDLookup_File=datatable(DeviceEventClassID:string,DvcAction_DeviceEventClassIDLookup:string,EventResult_DeviceEventClassIDLookup:string,EventSeverity_DeviceEventClassIDLookup:string)\n [\n           \"76506\",\"Allow\",\"Success\",\"Informational\", // File_Allowed\n           \"76508\",\"Deny\",\"Failure\",\"Low\", // File_Malware-Blocked\n           \"76509\",\"\",\"Failure\",\"Low\" // File_Malware-Detected\n ];\n let MessageLookup = datatable (Message:string, DvcAction_MessageLookup:string, EventResult_MessageLookup:string, EventResultDetails:string, EventOriginalResultDetails:string)  \n [\n         \"Connection dropped\", \"Drop\", \"Failure\",\"Terminated\", \"Connection dropped\",\n         \"Connection removed because NGFW Engine is low on memory.\",\"Drop\", \"Failure\",\"Terminated\",\"Connection removed because NGFW Engine is low on memory.\",\n         \"Connection timeout in state TCP_CLOSE_WAIT\", \"\", \"Success\", \"Timeout\",\t\"One end of the Connection waits for the FIN packet (passive close).\",\n         \"Connection timeout in state TCP_CLOSE_WAIT_ACK\", \"\", \"Success\", \"Timeout\", \"One end of the Connection waits for the FIN packet (passive close)\",\n         \"Connection timeout in state TCP_CLOSING\", \"\", \"Success\", \"Timeout\", \"Closing packet (FIN) sent by one end of the Connection (simultaneous).\",\n         \"Connection timeout in state TCP_CLOSING_ACK\", \"\", \"Success\", \"Timeout\", \"Waiting for ACK for the FIN before going to closing status (active close).\",\n         \"Connection timeout in state TCP_ESTABLISHED\", \"\", \"Failure\", \"Timeout\", \"Normal status of TCP Connections for data transfer.\",\n         \"Connection timeout in state TCP_FIN_WAIT_1\", \"\", \"Success\", \"Timeout\",\t\"One end of the Connection waits for sending the FIN packet (active close).\",\n         \"Connection timeout in state TCP_FIN_WAIT_2\", \"\", \"Success\", \"Timeout\", \"One end of the Connection waits for receiving ACK packet.\",\n         \"Connection timeout in state TCP_LAST_ACK\", \"\",\t\"Success\", \"Timeout\", \"One end of the Connection sent a FIN packet (passive close).\",\n         \"Connection timeout in state TCP_LAST_ACK_WAIT\", \"\", \"Failure\",\t\"Timeout\", \"Waiting for the FIN packet to be acknowledged.\",\n         \"Connection timeout in state TCP_SYN_ACK_SEEN\", \"\", \"Failure\",\t\"Timeout\", \"Second phase of the TCP three-way handshake, the server has replied to client sent SYN with SYN+ACK, next status will be established.\",\n         \"Connection timeout in state TCP_SYN_FIN_SEEN\", \"\",\t\"Success\", \"Timeout\", \"T/TCP (Transactional TCP) Connection, RFC 1644.\",\n         \"Connection timeout in state TCP_SYN_RETURN\", \"\", \"Failure\", \"Timeout\", \"Received simultaneous SYN from the other end (simultaneous open).\",\n         \"Connection timeout in state TCP_SYN_SEEN\", \"\", \"Failure\", \"Timeout\", \"First packet sent by one end of the Connection.\",\n         \"Connection timeout in state TCP_TIME_WAIT\", \"\", \"Success\", \"Timeout\", \"One end of the Connection acknowledged closing packet (FIN).\",\n         \"Connection timeout in state TCP_TIME_WAIT_ACK\", \"\", \"Failure\",\t\"Timeout\", \"Waiting for ACK for the FIN status before going to time wait status (active close).\",\n         \"Connection timeout in state ICMP_ECHO\", \"\", \"Failure\", \"Timeout\", \"Ping reply is expected.\",\n         \"Connection timeout in state ICMP_REPLY_WAIT\", \"\", \"Failure\", \"Timeout\", \"Other ICMP request or reply types.\",\n         \"Connection was reset by client\", \"Reset Source\", \"Failure\",\"Reset\", \"\",\n         \"Connection was reset by server\", \"Reset Destination\", \"Failure\",\"Reset\", \"\",\n         \"invalid packet (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"not a (valid) SYN packet [A] (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"not a (valid) SYN packet [FA] (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"not a (valid) SYN packet [FPA] (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"not a (valid) SYN packet [PA] (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"not a (valid) SYN packet [RA] (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"not a (valid) SYN packet [SA] (CT)\", \"\", \"Failure\", \"Invalid TCP\", \"\",\n         \"TCP state violation\",\"Deny\",\"Failure\", \"Invalid TCP\", \"\",\n         \"TCP state violation: Connection end-point replied with ACK to SYN-packet. Connection refused.\", \"Deny\", \"Failure\", \"Invalid TCP\", \"\",\n         \"TSC error: Query timed out\", \"\", \"Failure\", \"Timeout\", \"\"\n ];\n let parser = (\n     starttime:datetime=datetime(null), \n     endtime:datetime=datetime(null), \n     srcipaddr_has_any_prefix:dynamic=dynamic([]), \n     dstipaddr_has_any_prefix:dynamic=dynamic([]), \n     ipaddr_has_any_prefix:dynamic=dynamic([]),\n     dstportnumber:int=int(null), \n     hostname_has_any:dynamic=dynamic([]), \n     dvcaction:dynamic=dynamic([]), \n     eventresult:string='*', \n     disabled:bool=false) {\n let src_or_any = set_union(srcipaddr_has_any_prefix, ipaddr_has_any_prefix); \n let dst_or_any = set_union(dstipaddr_has_any_prefix, ipaddr_has_any_prefix);\n let prefilter = (T:(DestinationPort:int,ApplicationProtocol:string,SourceIP:string,DestinationIP:string,AdditionalExtensions:string)) {\n     T\n     | where (isnull(dstportnumber) or (DestinationPort == dstportnumber) or (ApplicationProtocol has tostring(dstportnumber)))\n     | extend temp_isSrcMatch=has_any_ipv4_prefix(SourceIP,src_or_any), \n              temp_isDstMatch=has_any_ipv4_prefix(DestinationIP,dst_or_any)\n     | extend ASimMatchingIpAddr = case(\n                     array_length(src_or_any) == 0 and array_length(dst_or_any) == 0, \"-\", // match not requested\n                     (temp_isSrcMatch and temp_isDstMatch), \"Both\", // has to be checked before the individual \n                     temp_isSrcMatch, \"SrcIpAddr\",\n                     temp_isDstMatch, \"DstIpAddr\",\n                     \"No match\"\n                 )\n     | where ASimMatchingIpAddr != \"No match\"\n     | where array_length(hostname_has_any) == 0 or AdditionalExtensions has_any (hostname_has_any)\n };\n let ForcePointNetwork = CommonSecurityLog\n         | where not(disabled)\n         | where (isnull(starttime) or TimeGenerated >= starttime) \n             and (isnull(endtime) or TimeGenerated <= endtime)\n         | where DeviceVendor==\"FORCEPOINT\" and DeviceProduct==\"Firewall\"\n         | where DeviceFacility in~ (\"Inspection\",\"Packet Filtering\",\"File Filtering\") and isnotempty(DeviceEventClassID) and DeviceEventClassID != \"0\"\n         ;\n let PacketFilteringData = ForcePointNetwork\n         | where DeviceFacility == \"Packet Filtering\" and DeviceEventClassID !in (\"70383\",\"70393\",\"70734\",\"71009\",\"71040\")\n         | invoke prefilter()\n         | lookup DeviceEventClassIDLookup_Packet on DeviceEventClassID\n         | lookup MessageLookup on Message\n         | extend DvcAction = coalesce(DvcAction_MessageLookup, DvcAction_DeviceEventClassIDLookup), \n                  EventResult = case (Message startswith \"Referred connection not known\", \"Failure\",\n                                     coalesce(EventResult_MessageLookup, EventResult_DeviceEventClassIDLookup)), \n                  EventSeverity = case(Message startswith \"Referred connection not known\", \"Low\",\n                                     EventSeverity_DeviceEventClassIDLookup),\n                  EventOriginalResultDetails = case(Message startswith \"Referred connection not known\", Message,\n                                                 EventOriginalResultDetails),\n                 EventType = \"NetworkSession\"\n         | project-away DvcAction_*, EventResult_*, EventSeverity_DeviceEventClassIDLookup;\n let FileFilteringData = ForcePointNetwork\n         | where DeviceFacility == \"File Filtering\"\n         | invoke prefilter()\n         | lookup DeviceEventClassIDLookup_File on DeviceEventClassID\n         | extend ThreatName = case (DeviceEventClassID in (\"76508\", \"76509\"), Activity,\n                                     \"\")\n         | project-rename DvcAction = DvcAction_DeviceEventClassIDLookup\n         | extend EventResult = case(isnotempty(Message), \"Failure\",\n                                     EventResult_DeviceEventClassIDLookup), \n                  EventSeverity = case(isnotempty(Message), \"Low\",\n                                     EventSeverity_DeviceEventClassIDLookup),\n                  EventOriginalResultDetails = case(isnotempty(Message), Message,\n                                                 \"\"),\n                 EventType = \"NetworkSession\"\n         | project-away *_DeviceEventClassIDLookup;\n let InspectionData = ForcePointNetwork\n         | where DeviceFacility == \"Inspection\" or DeviceEventClassID == \"70734\"\n         | invoke prefilter()\n         | extend MessageCode = toint(DeviceEventClassID)\n         | extend EventSeverity = case (DeviceAction in~ (\"Allow\",\"Permit\"), \"Informational\",\n                                     MessageCode >= 200000, \"High\",\n                                     MessageCode < 200000, \"Low\",\n                                     \"\"),\n                  EventType = case (MessageCode < 80000, \"NetworkSession\",\n                                  \"IDS\")\n         | extend ThreatName = Activity\n         | project-away MessageCode;\n union PacketFilteringData, FileFilteringData, InspectionData\n         | extend NetworkProtocol = _ASIM_LookupNetworkProtocol(Protocol)\n         | lookup ActionLookup on DeviceAction\n         | extend DvcAction = coalesce(DvcAction,DvcAction_ActionLookup), \n                  EventResult = coalesce(EventResult,EventResult_ActionLookup), \n                  EventSeverity = coalesce(EventSeverity, EventSeverity_ActionLookup)\n         | project-away *_ActionLookup\n         | where ((array_length(dvcaction) == 0) or DvcAction has_any (dvcaction))\n         | where ((eventresult == \"*\") or (EventResult == eventresult))\n         | lookup ApplicationProtocolLookup on ApplicationProtocol\n         | extend \n                 EventCount = toint(1),\n                 EventSchema = \"NetworkSession\",\n                 EventSchemaVersion = \"0.2.6\",\n                 EventVendor = \"Forcepoint\",\n                 EventProduct = \"Firewall\"\n         | parse AdditionalExtensions with * \"requestURL=\" requestURL            \n         | project-rename\n                 EventOriginalType = DeviceEventClassID,\n                 DstPortNumber = DestinationPort,\n                 DstIpAddr = DestinationIP,\n                 SrcPortNumber = SourcePort,\n                 SrcIpAddr = SourceIP,\n                 DstNatIpAddr = DestinationTranslatedAddress,\n                 DstNatPortNumber = DestinationTranslatedPort,\n                 SrcNatIpAddr = SourceTranslatedAddress,\n                 SrcNatPortNumber = SourceTranslatedPort,\n                 EventProductVersion = DeviceVersion,\n                 EventMessage = Message,\n                 DvcOriginalAction = DeviceAction,\n                 SrcBytes = SentBytes,\n                 DstBytes = ReceivedBytes,\n                 EventOriginalSubType = DeviceFacility,\n                 DvcId = DeviceExternalID,\n                 DvcInboundInterface = DeviceInboundInterface,\n                 DvcOutboundInterface = DeviceOutboundInterface,\n                 DvcIpAddr = DeviceAddress,\n                 EventOriginalSeverity = LogSeverity,\n                 ThreatId = DeviceCustomString3\n         | invoke _ASIM_ResolveDvcFQDN('Computer')\n         | extend\n                 ThreatCategory = column_ifexists(\"DeviceEventCategory\",\"\"),\n                 EventStartTime = todatetime(ReceiptTime),\n                 EventEndTime = todatetime(ReceiptTime),\n                 ipv6_parts = extract_all (@'^\\[(.+)\\](?:\\:(\\d+))?$',requestURL)[0],\n                 ipv4_parts = extract_all (@'^(\\d+\\.\\d+\\.\\d+\\.\\d+)(?:\\:(\\d+))?$',requestURL)[0],\n                 host_parts = extract_all (@'^([^\\\\\\d:]+)(?:\\:(\\d+))?$',requestURL)[0]\n         | extend \n                  NetworkRuleName = case(isnotempty(DeviceCustomString2), strcat(DeviceCustomString1,',',DeviceCustomString2),\n                                         DeviceCustomString1),\n                  DstDomainPart = tostring(host_parts[0]),\n                  DstIpAddr = coalesce(DstIpAddr, tostring(ipv4_parts[0]), tostring(ipv6_parts[0])),\n                  DstPortNumber = coalesce(DstPortNumber, toint(host_parts[1]), toint(ipv4_parts[1]), toint(ipv6_parts[1]))\n         | invoke _ASIM_ResolveDstFQDN('DstDomainPart')\n         | extend ASimMatchingHostname = case(array_length(hostname_has_any) == 0 ,\"-\",\n                                     DstHostname has_any (hostname_has_any), \"DstHostname\",\n                                     \"No match\"\n                                     )\n         | where ASimMatchingHostname != \"No match\"\n         | extend\n                  DvcIdType = case(isnotempty(DvcId), \"ForcepointId\",\n                                 \"\"),\n                  DstPortNumber = case(\n                                 isnotempty(DstPortNumber), DstPortNumber,\n                                 ApplicationProtocol startswith \"TCP\", toint(split(ApplicationProtocol,'/')[1]),\n                                 ApplicationProtocol startswith \"UDP\", toint(split(ApplicationProtocol,'/')[1]),\n                                 int(null)),\n                  AdditionalFields = pack(iff(isnotempty(RequestMethod) and RequestMethod != \"UNKNOWN\", \"RequestMethod\", \"\"),RequestMethod,\n                                          iff(isnotempty(DeviceCustomString4),\"VirusId\",\"\"),DeviceCustomString4),\n                  DstAppName = case(DestinationServiceName in~ (\"Generic-Web-HTTP\",\"Application-Unknown\",\"Unknown-Encrypted-Application\"), \"\",\n                                     DestinationServiceName),\n                  DvcIpAddr = coalesce(DvcIpAddr,DeviceName)\n         | extend\n                 Dvc = DvcIpAddr,\n                 IpAddr = SrcIpAddr,\n                 Rule = NetworkRuleName,\n                 Dst = DstIpAddr,\n                 Src = SrcIpAddr,\n                 DvcInterface = DvcInboundInterface,\n                 Hostname = DstHostname\n         | project-away AdditionalExtensions, CommunicationDirection, Device*, Destination*, EndTime, ExternalID, File*, Flex*, IndicatorThreatType, Malicious*, Old*, OriginalLogSeverity, Process*, Protocol, ReceiptTime, Remote*, ReportReferenceLink, Request*, SimplifiedDeviceAction, Source*, StartTime, TenantId, ThreatConfidence, ThreatDescription, ThreatSeverity, ExtID, EventOutcome, FieldDevice*, Reason, ApplicationProtocol, Activity, requestURL, Computer, DstDomainPart, host_parts, ipv4_parts, ipv6_parts, temp_*\n     };\n     parser(starttime=starttime, \n             endtime=endtime, \n             srcipaddr_has_any_prefix=srcipaddr_has_any_prefix, \n             dstipaddr_has_any_prefix=dstipaddr_has_any_prefix, \n             ipaddr_has_any_prefix=ipaddr_has_any_prefix, \n             dstportnumber=dstportnumber, \n             hostname_has_any=hostname_has_any, \n             dvcaction=dvcaction, \n             eventresult=eventresult, \n             disabled=disabled)",
            "version": 1,
            "functionParameters": "starttime:datetime=datetime(null),endtime:datetime=datetime(null),srcipaddr_has_any_prefix:dynamic=dynamic([]),dstipaddr_has_any_prefix:dynamic=dynamic([]),ipaddr_has_any_prefix:dynamic=dynamic([]),dstportnumber:int=int(null),hostname_has_any:dynamic=dynamic([]),dvcaction:dynamic=dynamic([]),eventresult:string='*',disabled:bool=False"
          }
        }
      ]
    }
  ]
}