id: 459c6943-0162-4bf5-8d0b-c5904f03f5a7
name: Teams Admin-User Submissions Grading Verdicts
description: |
  This query visualizes Teams messages submitted by users or admins then graded in the submission process.
description-detailed: |
  This query visualizes Teams messages submitted by users or admins then graded in the submission process, summarizing the data by the various submission garde results.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  //This query visualizes Teams messages submitted by users or admins then graded in the submission process, summarizing the data by the various submission garde results
  CloudAppEvents
  | where ActionType == "AdminSubmissionTriage" or ActionType == "UserSubmissionTriage"
  | extend SubmissionType = tostring((parse_json(RawEventData)).SubmissionType),SubmissionContentType=tostring((parse_json(RawEventData)).SubmissionContentType),SubmissionState=tostring((parse_json(RawEventData)).SubmissionState),TriageVerdict=tostring((parse_json(RawEventData)).GradingResult.TriageVerdict)
  | where SubmissionContentType == "ChatMessage" and SubmissionState == "Graded"
  | summarize count() by TriageVerdict
  | project TriageVerdict, TeamsMessages = count_
version: 1.0.0