id: f82f3d63-b7f2-494d-8254-612405702dd4
name: Top 10 senders of  Admin Teams message submissions FP
description: |
  This query visualises Teams messages submitted by admins as false positives, summarizing the data by top 10 indidvidual senders of those messages
description-detailed: |
 This query visualises Teams messages submitted by admins as false positives, summarizing the data by top 10 indidvidual senders of those messages
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents
  | where ActionType == "AdminSubmissionSubmitted"
  | extend SubmissionType = tostring((parse_json(RawEventData)).SubmissionType),SubmissionContentType=tostring((parse_json(RawEventData)).SubmissionContentType),P2Sender=tostring((parse_json(RawEventData)).P2Sender)
  | where SubmissionContentType == "ChatMessage" and SubmissionType in ("3")
  | summarize count() by P2Sender
  | project P2Sender, TeamsMessages = count_
  | top 10 by TeamsMessages desc
version: l.0.0