id: cfaaf0bc-16d1-48df-ac8b-9d901bbd516a
name: User IAM Enumeration
description: |
  'Detects enumeration of accounts configuration via api call to list different instances and services within a short period of time. WL Scanner of Cloud Account such as Wiz and threshold can be adjusted'
severity: Medium
status: Available
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 10m
queryPeriod: 10m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Discovery
relevantTechniques:
  - T1580
query: |
 let threshold = 50; 
 AWSCloudTrail
 | where EventName in ("ListAttachedRolePolicies","ListRoles","ListGroupsForUser","ListAttachedUserPolicies","ListAccessKeys","ListUsers")
 | summarize
     count(),
     make_set(AWSRegion),
     make_set(UserAgent),
     make_set(SourceIpAddress),
     make_set(ErrorCode),
     make_set(ErrorMessage),
     make_set(EventName)
     by bin(TimeGenerated, 10m), UserIdentityPrincipalid, UserIdentityArn, UserIdentityAccountId
 | where count_ > threshold
 | mv-expand set_SourceIpAddress
 | extend UserName = substring(UserIdentityPrincipalid, indexof_regex(UserIdentityPrincipalid, ":") + 1)
 | extend Name = split(UserName,'@')[0],UpnSuffix = split(UserName,'@')[1]
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UpnSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: set_SourceIpAddress
version: 1.0.0
kind: Scheduled
