id: f6928301-56da-4d2c-aabe-e1a552bc8892
name: ECR image scan findings high or critical
description: |
  'AWS ECR Image scan detected critical or high-severity vulnerabilities in your container image.'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
relevantTechniques:
  - T1204
query: |
    AWSCloudTrail
    | where EventName == "DescribeImageScanFindings" and isempty(ErrorCode) and isempty(ErrorMessage)
    | extend repoName = tostring(parse_json(ResponseElements).repositoryName)
    | extend imageId = tostring(parse_json(ResponseElements).imageId.imageDigest)
    | extend Critical = toint(parse_json(ResponseElements).imageScanFindings.findingSeverityCounts.CRITICAL)
    | extend High = toint(parse_json(ResponseElements).imageScanFindings.findingSeverityCounts.HIGH)
    | where Critical > 0 or High > 0
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | extend timestamp = TimeGenerated, IPCustomEntity = SourceIpAddress, AccountCustomEntity = UserIdentityUserName 
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.1
kind: Scheduled