id: bc2d8214-afb6-4876-b210-25b69325b9b2
name: Hunt for TABL changes
description: |
  This query helps hunting for Tenant allow/block list (TABL) changes in Defender for Office 365
description-detailed: |
  This query helps hunting for Tenant allow/block list (TABL) changes in Defender for Office 365
  Reference - https://learn.microsoft.com/en-us/defender-office-365/tenant-allow-block-list-about
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562
query: |
  CloudAppEvents
  | where ActionType contains "TenantAllowBlockListItems"
  | order by Timestamp desc
version: 1.0.0