id: 25758e74-e9ff-43a2-b363-b7df826a15ab
name: Detect-Not-Active-AD-User-Accounts
description: |-
  // Detect Active Directory service accounts that are not active because their last logon was more than 14 days ago
  // Replace XXX on line 4 with the naming convention start of your Active Directory service accounts
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - IdentityLogonEvents
query: |+
  IdentityLogonEvents 
  | project Timestamp, AccountName, DeviceName, LogonType
  | where AccountName startswith "XXX" 
  | summarize LastLogon = max(Timestamp) by AccountName, LogonType, DeviceName
  | where LastLogon < ago(14d)
