id: 0a3ddbb6-d691-4cc5-aca1-1fe780258163
name: MDE_AVScanTimesAndType
description: |
  List all the scan types and device name of those scansg
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  //List all the scan types and device name of those scans
  DeviceEvents
  | where ActionType in ("AntivirusScanCompleted", "AntivirusScanCancelled")
  | extend A=parse_json(AdditionalFields)  
  | project Timestamp, DeviceName, ActionType,ScanType = A.ScanTypeIndex, StartedBy= A.User
  | sort by Timestamp desc
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]