id: ca4cf47f-6dfd-487a-a759-01d97120bfe2
name: MDE_ShowUSBMountedandfilescopied
description: |
  Show usb mounted and files copied
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  //Show usb mounted and files copied
  DeviceEvents
  | where ActionType contains "USB"
  | where Timestamp > ago(1d)
  | project USBMountTime = Timestamp, DeviceName, DriveLetter = tostring(todynamic(AdditionalFields).DriveLetter)
  | join (DeviceFileEvents
    | where Timestamp > ago(1d)
    | where ActionType == "FileCreated"
    | parse FolderPath with DriveLetter '\\' *
    | extend DriveLetter = tostring(DriveLetter))on DeviceName, DriveLetter
  | project USBMountTime, DeviceName, DriveLetter, ActionType, FileName, FolderPath, FileSize
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]