id: 73871df7-f708-4fe7-8fb9-a62bd5072ef9
name: MDE_BrowserExtensionInstalled
description: |
  Endpoint's that downloaded browser extensions
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
query: |
  DeviceFileEvents 
  | where FileOriginReferrerUrl <> ""
  | where FileName contains ".crx"
  | project DeviceName, FileName, FolderPath, FileOriginReferrerUrl
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]
