id: 7d905049-7e23-451e-bb57-0bfb6dd43f60
name: MDE_ProxyChangesViaRegistry
description: |
  Count of sender's email addresses by subject
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceRegistryEvents
query: |
  //Detect Proxy configurations changes on endpoints
  DeviceRegistryEvents 
  | where RegistryValueName contains "AutoConfigURL" or RegistryValueName contains "Proxy"
  | project DeviceName, RegistryKey, RegistryValueName,RegistryValueData
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]