id: ffa67017-fb8e-4706-9651-5911f96c1f20
name: MDE_BlockingASRRules
description: |
  Find endpoints ASR Rules blocking
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  DeviceEvents 
  | where ActionType startswith "ASR"
  | extend Fields=parse_json(AdditionalFields)
  | extend IsAudit = tostring(Fields.IsAudit)
  | where IsAudit == "false"
  | project Timestamp, DeviceName, ActionType, IsAudit, ReportId, DeviceId
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]