id: 19270420-5d36-43df-8bed-c34a47fadc92
name: MDE_FindMountedISOandDriveLetters
description: |
  Find Mounted ISO files and drive letters
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
query: |
  //Find Mounted ISO files and drive letters
  DeviceFileEvents
  | where Timestamp > ago(1d)
  | where FileName endswith "iso"
  | project DeviceName, FileName, ['Date']=format_datetime(Timestamp,'MM/dd/yyyy'), FolderPath
   | join kind = inner ( 
    DeviceFileEvents
    | where Timestamp > ago(1d)
    | where FileName endswith "lnk" 
    | extend ['LNK FileName'] = FileName
    | project ['LNK FileName'], DeviceName
    ) on DeviceName
  | join kind = inner (
    DeviceRegistryEvents 
    | where Timestamp > ago(1d)
    | where RegistryKey contains "MountedDevices"
    | project ['Date']=format_datetime(Timestamp,'MM/dd/yyyy'), DeviceName, RegistryValueName
    ) on DeviceName
  | where trim(@".lnk", ['LNK FileName']) == trim(@".iso", FileName)
  | distinct ['Date'],DeviceName, ['LNK FileName'], FileName, FolderPath, RegistryValueName
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]