id: d99350b8-212d-42b9-b336-62f870453c5c
name: MDE_ListAlPnPDevicesAllowedorBlocked
description: |
  List all PnP Devices that have been allowed or blocked
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  //List all PnP Devices that have been allowed or blocked
  DeviceEvents
  | where ActionType == "PnpDeviceBlocked" or ActionType == "PnpDeviceAllowed"
  | extend parsed=parse_json(AdditionalFields)
  | extend MediaClassGuid = tostring(parsed.ClassGuid)
  | extend MediaInstanceId = tostring(parsed.DeviceInstanceId)
  | extend MediaDeviceId = tostring(parsed.MatchingDeviceId)
  | project Timestamp , DeviceId, DeviceName, ActionType, MediaClassGuid, MediaDeviceId, MediaInstanceId, AdditionalFields
  | order by Timestamp desc
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]