id: f678ea38-4b93-4816-a33d-0518164fe01f
name: MDE_Networktrafficgoingtoport-DNS
description: |
  Find web Traffic going to port 53
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
query: |
  //Network traffic going to DNS(Port 53)
  DeviceNetworkEvents
  | where RemotePort == "53"
  | where RemoteUrl <> ""
  | project Timestamp, DeviceName, RemotePort, RemoteUrl
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]