id: cf984ec4-d67e-4d45-a2e5-0c97fb1b4c22
name: MDE_ListAllNotOnboardedEnpoints
description: |
  List all devices that are not onboarded
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
query: |
  //List all devices that are not onboarded
  DeviceInfo
  | extend Date = format_datetime(Timestamp, "MM/dd/yyyy")
  | where OnboardingStatus <> "Onboarded"
  | where Timestamp > ago(1d)
  | distinct DeviceName, Date, OnboardingStatus, Timestamp
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]