id: dde77b9b-799c-44c8-adfa-45007f312487
name: MDE_SmartScreenCheck
description: |
  Check to see if Smart screen is working. This can also be used to track users going to websites.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
query: |
  DeviceNetworkEvents 
  | where RemoteUrl <> ""
  | extend TimeStampformated=format_datetime(Timestamp,'MM/dd/yyyy HH:mm tt')
  | join kind=leftouter (DeviceEvents
    | where ActionType == 'SmartScreenUrlWarning' or ActionType == 'ExploitGuardNetworkProtectionBlocked'
    | extend A=parse_json(AdditionalFields)
    | extend TimeStampformated=format_datetime(Timestamp,'MM/dd/yyyy HH:mm tt')
    ) on DeviceName, RemoteUrl, InitiatingProcessFileName, InitiatingProcessAccountName, TimeStampformated
  | where InitiatingProcessFileName == "msedge.exe" or InitiatingProcessFileName == "chrome.exe"
  //| where RemoteUrl contains "facebook"
  //| where InitiatingProcessAccountName contains "Matt"
  //| where ActionType1 <> ""
  | distinct TimeStampformated,DeviceName, Action=ActionType1, URL_IPAddress=RemoteIP, URL=RemoteUrl, Username=InitiatingProcessAccountName, Browser=InitiatingProcessFileName
  | order by TimeStampformated desc
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]
