id: 76925b23-296e-4f62-8732-27b8045056f6
name: MDE_FindLNKFilesOnEndpoints
description: |
  Find LNK files on certain devices
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
query: |
  //Find LNK files on certain devices
  DeviceFileEvents
  | where DeviceName  == "EndpointNameHere"
  | where FileName contains ".LNK" 
  | project Timestamp, DeviceName, ActionType, FileName, FolderPath, PreviousFileName, PreviousFolderPath, InitiatingProcessAccountName, InitiatingProcessFolderPath
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]