id: a7ceb6dc-dd6a-4285-8c37-ae40463a1acf
name: MDE_Networktrafficgoingtoport
description: |
  Find web Traffic going to port 80 or 443
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
query: |
  //Network traffic going to port 80 and 443
  DeviceNetworkEvents 
  | where RemotePort == "80" or RemotePort == "443"
  | project Timestamp, DeviceName, RemotePort, RemoteIP, RemoteUrl
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]
