id: 36aa42d5-c2f5-4ede-9400-d55366bf0255
name: MDE_SoftwareInventorybyOS
description: |
  Software Inventory by OS
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmSoftwareInventory
query: |
  //Software Inventory by OS
  DeviceTvmSoftwareInventory 
  | where OSPlatform contains "iOS"
  | project DeviceName,SoftwareName, SoftwareVendor, SoftwareVersion
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]