id: da4eeb70-c39b-4d8f-a4f0-22e15a745230
name: MDE_DeviceHealth
description: |
  Endpoint Health with AV information
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmSecureConfigurationAssessment
query: |
  let avmodetable = DeviceTvmSecureConfigurationAssessment
  | where ConfigurationId == "scid-2010" and isnotnull(Context)
  | extend avdata=parsejson(Context)
  | extend AVMode = iif(tostring(avdata[0][0]) == '0', 'Active' , iif(tostring(avdata[0][0]) == '1', 'Passive' ,iif(tostring(avdata[0][0]) == '4', 'EDR Blocked',iif(tostring(avdata[0][0]) == '2',  'SxS Passive' ,'Unknown'))))
  | project DeviceId, AVMode;
  DeviceTvmSecureConfigurationAssessment
  | where ConfigurationId == "scid-2011" and isnotnull(Context)
  | extend avdata=parsejson(Context)
  | extend AVSigVersion = tostring(avdata[0][0])
  | extend AVEngineVersion = tostring(avdata[0][1])
  | extend AVSigLastUpdateTime = tostring(avdata[0][2])
  | project DeviceId, DeviceName, OSPlatform, AVSigVersion, AVEngineVersion, AVSigLastUpdateTime, IsCompliant, IsApplicable
  | join avmodetable on DeviceId
  | project-away DeviceId1
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]
