id: f173f87f-fa09-4258-8eaf-d95164318e7e
name: MDE_Evidenceforasingledevice
description: |
  Find all alert evidence for a single endpoint. This is handy for exporting to a third-party SIEM.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - AlertEvidence
query: |
  //Find all alert evidence for a single endpoint. This is handy for exporting to a third-party SIEM.
  let _F = AlertEvidence
    | where DeviceName == "Yourendpointhere" 
    | distinct AlertId;
  let _Process = AlertEvidence
    | where EntityType == "Process"
    | join kind=inner _F 
        on $left.AlertId == $right.AlertId
    | order by Timestamp, AlertId
    | project AlertId, FileName, FolderPath, SHA1, SHA256, FileSize, ProcessCommandLine, AdditionalFields;
  let _IP = AlertEvidence
    | where EntityType == "Ip"
    | join kind=inner _F 
        on $left.AlertId == $right.AlertId
    | order by Timestamp, AlertId
    | project AlertId, RemoteIP, AdditionalFields;
  let _URL = AlertEvidence
    | where EntityType == "Url"
    | join kind=inner _F 
        on $left.AlertId == $right.AlertId
    | order by Timestamp, AlertId
    | project AlertId, RemoteUrl, AdditionalFields;
  let _User = AlertEvidence
    | where EntityType == "User"
    | join kind=inner _F 
        on $left.AlertId == $right.AlertId
    | order by Timestamp, AlertId
    | project AlertId, AccountName, AccountDomain, AccountSid, AccountUpn, AdditionalFields;
  let _Machine = AlertEvidence
    | where EntityType == "Machine"
    | join kind=inner _F 
        on $left.AlertId == $right.AlertId
    | order by Timestamp, AlertId
    | project AlertId, DeviceName, LocalIP, AdditionalFields;
  _Machine
  | join _F on $left.AlertId == $right.AlertId
  | join _IP on $left.AlertId == $right.AlertId
  | join _Process on $left.AlertId == $right.AlertId
  | join _URL on $left.AlertId == $right.AlertId
  | join _User on $left.AlertId == $right.AlertId
  | distinct AlertId, AccountDomain, AccountName, AccountSid, AccountUpn, 
    DeviceName, LocalIP, FileSize, FolderPath, SHA1, SHA256, ProcessCommandLine,
    RemoteIP, RemoteUrl
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]