id: 39226090-3c73-407f-bef8-9a09f98fc668
name: MDE_DeviceInventory-LastUserLoggedIn
description: |
  Endpoint Inventory
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  let LastLogins=DeviceLogonEvents
    | where LogonType == "Interactive"
    | where InitiatingProcessParentFileName == "wininit.exe"
    | summarize LastLogon=arg_max(Timestamp, *) by AccountName, DeviceName
    | project AccountName, DeviceName, LastLogon;
  let Logins=DeviceLogonEvents
    | where LogonType == "Interactive"
    | where InitiatingProcessParentFileName == "wininit.exe"        
    | summarize Logins=count() by AccountName, DeviceName
    | project AccountName, Logins, DeviceName;
  let NetworkInfo=DeviceNetworkInfo
    | where IPv4Dhcp <> ""
    | mvexpand parse_json(IPAddresses)
    | where IPAddresses.IPAddress !contains ":"
    | summarize arg_max(Timestamp, *) by DeviceName
    | project DeviceName, IPAddress=IPAddresses.IPAddress, Timestamp;
  Logins
  | join kind=inner ( LastLogins
    | project AccountName, DeviceName, LastLogon
  ) on DeviceName, AccountName
  | join kind=leftouter  ( NetworkInfo
    | project DeviceName, IPAddress, Timestamp
  ) on DeviceName
  | project AccountName, DeviceName, LastLogon, Logins, IPAddress
  | sort by DeviceName
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]