id: fd57f946-9d0c-4c80-af9f-4bcd8257bd4d
name: MDE_ShowUSBMountedDevicesAndDriveLetter
description: |
  Show usb mounted devices and drive letters
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  //Show usb mounted devices and drive letters
  DeviceEvents
  | where ActionType contains "USB"
  | extend DriveLetter = tostring(todynamic(AdditionalFields).DriveLetter)
  | distinct DeviceName, ActionType, DriveLetter, Timestamp
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]