id: 28f8efbd-6ed3-4bbe-b52c-d132bc62e561
name: PasswordSearch
description: |-
  Detect Active Directory LDAP queries that search for users with comment or description that contains the string "pass" that might suggest for the user password
  This LDAP query cover MetaSploit - enum_ad_user_comments tool
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - IdentityQueryEvents
query: |+
  let PersonObject = "objectCategory=person";
  let UserClass = "objectClass=user";
  let SamAccountUser = "samAccountType=805306368";
  let Description = "description=*pass*";
  let Comment = "comment=*pass*";
  IdentityQueryEvents
  | where ActionType == "LDAP query"
  | parse Query with * "Search Scope: " SearchScope ", Base Object:" BaseObject ", Search Filter: " SearchFilter
  | where (SearchFilter contains Description or SearchFilter contains Comment) and
  (SearchFilter contains PersonObject or SearchFilter contains UserClass or SearchFilter contains SamAccountUser)
