id: a0784604-ef4d-43b9-8e31-d234c649eeda
name: qakbot-campaign-esentutl
description: |
  This query was originally published in the threat analytics report, Qakbot blight lingers, seeds ransomware
  Qakbot is malware that steals login credentials from banking and financial services. It has been deployed against small businesses as well as major corporations. Some outbreaks have involved targeted ransomware campaigns that use a similar set of techniques. Links to related queries are listed under See also.
  The following query detects possible use of the system process, esentutl.exe, to look through a user's browser history and steal cookies.
  Reference - https://www.microsoft.com/security/blog/2017/11/06/mitigating-and-eliminating-info-stealing-qakbot-and-emotet-in-corporate-networks/
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
- Credential Access
- Discovery
query: |
  DeviceProcessEvents
  | where FileName == "esentutl.exe"
  | where ProcessCommandLine has "WebCache"
  | where ProcessCommandLine has_any ("V01", "/s", "/d")
  | project ProcessCommandLine, 
  InitiatingProcessParentFileName, DeviceId, Timestamp
