id: 1c6979da-993b-4ecc-b052-a2c748f24b92
name: SensitiveLdaps
description: |-
  Detect Active Directory LDAP queries that search for sensitive objects in the organization
  This LDAP query cover BloodHound tool
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - IdentityQueryEvents
query: |+
  let SensitiveObjects = "[\"Administrators\", \"Domain Controllers\", \"Domain Admins\", \"Account Operators\", \"Backup Operators\", \"DnsAdmin\", \"Enterprise Admins\", \"Group Policy Creator Owners\"]";
  IdentityQueryEvents
  | where ActionType == "LDAP query"
  | parse Query with * "Search Scope: " SearchScope ", Base Object:" BaseObject ", Search Filter: " SearchFilter
  | where SensitiveObjects contains QueryTarget or SearchFilter contains "admincount=1"
