id: 9f04a8e4-75cd-49c7-9fee-e74dd86a0b4a
name: VulnComputers
description: |-
  Detect Active Directory LDAP queries that try to find operating systems that are vulnerable to specific vulnerabilities
  This LDAP query cover MetaSploit - enum_ad_computers tool
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - IdentityQueryEvents
query: |+
  let ComputerObject = "objectCategory=computer";
  let ComputerClass = "objectClass=computer";
  let SamAccountComputer = "sAMAccountType=805306369";
  let OperatingSystem = "operatingSystem=";
  IdentityQueryEvents
  | where ActionType == "LDAP query"
  | parse Query with * "Search Scope: " SearchScope ", Base Object:" BaseObject ", Search Filter: " SearchFilter
  | where (SearchFilter contains ComputerObject or SearchFilter contains ComputerClass or SearchFilter contains SamAccountComputer) and
   SearchFilter contains OperatingSystem
