Parser:
  Title: Microsoft File Storage - File Event Parser
  Version: '0.1'
  LastUpdated: July 15, 2021
Product:
  Name: Microsoft Azure File Storage
Normalization:
  Schema: FileEvent
  Version: '0.1.0'
References:
- Title: File schema documentation
  Link: https://aka.ms/AzSentinelFileEventDoc
- Title: Storage Analytics log format
  Link: https://docs.microsoft.comrest/api/storageservices/storage-analytics-log-format
Description: |
  This is a Query Parser that is used to map Azure Storage Analytics (StorageFileLogs) to the Azure Sentinel Information Model FileEvent schema.
ParserName: vimFileEventAzureFileStorage
ParserQuery: |
    // https://docs.microsoft.comrest/api/storageservices/storage-analytics-logged-operations-and-status-messages
    let fileoperations=datatable(OperationName:string, EventType:string)[
    "DeleteFile", "FileDeleted"
    , "DeleteDirectory", "FileDeleted"
    , "CopyFile", "FileCopied"
    , "CreateFileSnapshot", "FileCreated"
    , "CreateDirectory", "FileCreated"
    , "CreateFile", "FileCreated"
    , "CreateShare", "FileCreated" // Creates a folder
    , "DeleteShare", "FileDeleted"
    , "PutRange", "FileModified"
    ];
    StorageFileLogs
    // **** relevant data filtering;
    | where OperationName in (fileoperations)
    //
    | extend 
          EventCount=int(1)
        , EventStartTime=TimeGenerated
        , EventEndTime=TimeGenerated
    //	, EventType :string  ---> see lookup below
        , EventResult=iff(StatusText == 'Success', 'Success', 'Failure') 
      	, EventOriginalUid = CorrelationId
        , EventOriginalType=OperationName
        , EventProduct='Azure File Storage' 
        , EventVendor='Microsoft'
        , EventSchemaVersion='0.1.0'
    	, ActorUsername=AccountName
    	, ActorUsernameType='Simple'
    	, ActorUserType='Other' // Storage account? The account name of the service owner.
    	, TargetFilePath=tostring(split(Uri,'?')[0]) /// ????
    	, TargetFilePathFormat='URL'
      	, TargetUrl=Uri
        ,  SrcIpAddr=tostring(split(CallerIpAddress,':')[0])
        ,  SrcPortNumber=tostring(split(CallerIpAddress,':')[0])  //// Can use parse. SrcPortNumber is not in schema doc. should I map this?
      	, HttpUserAgent=UserAgentHeader
    | extend TargetFileName=tostring(split(TargetFilePath,'/')['-1'])
    //	EventMessage :string ,
    //	, TargetFileCreationTime :datetime,
    //	, TargetFileMimeType :string ,
    //	, TargetFileSize :int,
    //	, TargetFileMD5 :string ,
    //	, TargetFileSHA1 :string ,
    //	, TargetFileSHA256 :string ,
    //	, TargetFileSHA512 :string ,
    //	, Hash :string ,
     // ----------------------------------------------------------
    //	, EventProductVersion :string ,
    //	, ActorUserId :string ,
    //	, ActorUserIdType :string ,
    //	, Process :string ,
    //	, ActingProcessId :int,
    //	, ActingProcessGuid :string ,
    //	, ActingProcessCommandLine :string ,
    // No rename operation
        //	, SrcFilePath :string ,
    //	, SrcFilePathFormat :string ,
    //	, SrcFileName :string ,
    //	, SrcFileExtension :string ,
    //	, SrcFileDirecory :string ,
    //	, SrcFileCreationTime :datetime,
    //	, SrcFileMimeType :string ,
    //	, SrcFileSize :int,
    //	, SrcFileMD5 :string ,
    //	, SrcFileSHA1 :string ,
    //	, SrcFileSHA256 :string ,
    //	, SrcFileSHA512 :string ,
    //	, ActorOriginalUserType :string ?
    //	, ActingProcessName :string ,
        //	, EventReportUrl :string ,
    //	, Dvc :string ,
    //	, DvcIpAddr :string ,
    //	, DvcHostname :string ,
    //	, DvcId :string ,
    //	, DvcMacAddr :string ,
    //	, DvcOs :string ,
    //	, DvcOsVersion :string ,
    //	, AdditionalFields :dynamic,
    //
    | lookup fileoperations on OperationName
    // Aliases
    | extend User=ActorUsername
      , FilePath=TargetFilePath

    /// Unsupported Operations:
    // Other non supported 
    // fileoperations=datatable(x:string, y:string)[ "AbortCopyFile"
    // , "AcquireFileLease"
    // , "BreakFileLease"
    // , "ChangeFileLease"
    // , "ClearRange"
    // , "ListFilesystemDir"
    // , "CopyFileDestination"
    // , "CopyFileDestination"
    // , "CopyFileSource"
    // , "GetFileProperties"
    // , "FilePreflightRequest"
    // , "FileSessionConnect"
    // , "GetDirectoryMetadata" GetDirectoryProperties"
    // , "GetEncryptionKey"
    // , "GetFile"
    // , "GetFileCopyInformation"
    // , "GetFileMetadata"
    // , "GetFilePermission"
    // , "GetFileProperties"
    // , "GetFileServiceProperties"
    // , "GetFileShareUniqueId"
    // , "GetPostMigrationFileInfo"
    // , "CopyFileSource"
    // , "GetShareAcl"
    // , "GetShareMetadata"
    // , "GetShareProperties"
    // , "GetShareStats"
    // , "ListFileRanges"
    // , "ListFiles"
    // , "ListFileSnapshots"
    // , "ListHandles"
    // , "ListShares"
    // , "PutFilePermission"
    // , "GetFilePermission"
    // , "GetFileProperties"
    // , "GetFileServiceProperties"
    // , "GetFileShareUniqueId"
    // , "PutRangeFromURL"
    // , "ReleaseFileLease"
    // , "SetDirectoryMetadata"
    // , "SetFileMetadata"
    // , "SetFileMetadata"
    // , "SetFileProperties"
    // , "SetFileServiceProperties"
    // , "SetShareAcl"
    // , "SetShareMetadata"
    // , "SetShareProperties"
    // , "SnapshotShare];