Parser:
  Title: Microsoft File Storage - File Event Parser
  Version: '0.1'
  LastUpdated: July 15, 2021
Product:
  Name: Microsoft Azure File Storage
Normalization:
  Schema: FileEvent
  Version: '0.1.0'
References:
- Title: File schema documentation
  Link: https://aka.ms/AzSentinelFileEventDoc
- Title: Storage Analytics log format
  Link: https://docs.microsoft.com/en-us/rest/api/storageservices/storage-analytics-log-format
Description: |
  This is a Query Parser that is used to map Azure Storage Analytics (StorageFileLogs) to the Azure Sentinel Information Model FileEvent schema.
ParserName: vimFileEventAzureFileStorage
ParserQuery: |
  // https://docs.microsoft.com/en-us/rest/api/storageservices/storage-analytics-logged-operations-and-status-messages
    let fileoperations=datatable(OperationName:string, EventType:string)[
      "DeleteFile", "FileDeleted"
      , "DeleteDirectory", "FileDeleted"
      , "CopyFile", "FileCopied"
      , "CreateFileSnapshot", "FileCreated"
      , "CreateDirectory", "FileCreated"
      , "CreateFile", "FileCreated"
      , "CreateShare", "FileCreated"
      , "DeleteShare", "FileDeleted"
      ];
    // Other non supported 
    // fileoperations=datatable(x:string, y:string)[ "AbortCopyFile"
    // , "AcquireFileLease"
    // , "BreakFileLease"
    // , "ChangeFileLease"
    // , "ClearRange"
    // , "ListFilesystemDir"
    // , "CopyFileDestination"
    // , "CopyFileDestination"
    // , "CopyFileSource"
    // , "GetFileProperties"
    // , "FilePreflightRequest"
    // , "FileSessionConnect"
    // , "GetDirectoryMetadata" GetDirectoryProperties"
    // , "GetEncryptionKey"
    // , "GetFile"
    // , "GetFileCopyInformation"
    // , "GetFileMetadata"
    // , "GetFilePermission"
    // , "GetFileProperties"
    // , "GetFileServiceProperties"
    // , "GetFileShareUniqueId"
    // , "GetPostMigrationFileInfo"
    // , "CopyFileSource"
    // , "GetShareAcl"
    // , "GetShareMetadata"
    // , "GetShareProperties"
    // , "GetShareStats"
    // , "ListFileRanges"
    // , "ListFiles"
    // , "ListFileSnapshots"
    // , "ListHandles"
    // , "ListShares"
    // , "PutFilePermission"
    // , "PutRange"
    // , "GetFilePermission"
    // , "GetFileProperties"
    // , "GetFileServiceProperties"
    // , "GetFileShareUniqueId"
    // , "PutRangeFromURL"
    // , "ReleaseFileLease"
    // , "SetDirectoryMetadata"
    // , "SetFileMetadata"
    // , "SetFileMetadata"
    // , "SetFileProperties"
    // , "SetFileServiceProperties"
    // , "SetShareAcl"
    // , "SetShareMetadata"
    // , "SetShareProperties"
    // , "SnapshotShare];
    StorageFileLogs
    // **** relevant data filtering;
    | where OperationName in (fileoperations)
    //
    | extend 
    //	EventMessage :string ,
      , EventCount=int(1)
      , EventStartTime=TimeGenerated
      , EventEndTime=TimeGenerated
    //	, EventType :string  ---> see lookup below
      , EventResult=iff(StatusText == 'Success', 'Success', 'Failure') 
    //	, EventOriginalUid :string ,
      , EventOriginalType=OperationName
      , EventProduct='Azure File Storage' 
    //	, EventProductVersion :string ,
      , EventVendor='Microsoft'
      , EventSchemaVersion='0.1.0'
    //	, EventReportUrl :string ,
    //	, Dvc :string ,
    //	, DvcIpAddr :string ,
    //	, DvcHostname :string ,
    //	, DvcId :string ,
    //	, DvcMacAddr :string ,
    //	, DvcOs :string ,
    //	, DvcOsVersion :string ,
    //	, AdditionalFields :dynamic,
    //	, ActorUsername :string ,
    //	, User :string ,
    //	, ActorUsernameType :string ,
    //	, ActorUserId :string ,
    //	, ActorUserIdType :string ,
    //	, ActorUserType :string ,
    //	, ActorOriginalUserType :string ,
    //	, ActingProcessName :string ,
    //	, Process :string ,
    //	, ActingProcessId :int,
    //	, ActingProcessGuid :string ,
    //	, ActingProcessCommandLine :string ,
    //	, TargetFilePath :string ,
    //	, FilePath :string ,
    //	, TargetFilePathFormat :string ,
    //	, TargetFileName :string ,
    //	, TargetFileExtension :string ,
    //	, TargetFileDirecory :string ,
    //	, TargetFileCreationTime :datetime,
    //	, TargetFileMimeType :string ,
    //	, TargetFileSize :int,
    //	, TargetFileMD5 :string ,
    //	, TargetFileSHA1 :string ,
    //	, TargetFileSHA256 :string ,
    //	, TargetFileSHA512 :string ,
    //	, Hash :string ,
    //	, SrcFilePath :string ,
    //	, SrcFilePathFormat :string ,
    //	, SrcFileName :string ,
    //	, SrcFileExtension :string ,
    //	, SrcFileDirecory :string ,
    //	, SrcFileCreationTime :datetime,
    //	, SrcFileMimeType :string ,
    //	, SrcFileSize :int,
    //	, SrcFileMD5 :string ,
    //	, SrcFileSHA1 :string ,
    //	, SrcFileSHA256 :string ,
    //	, SrcFileSHA512 :string ,
    //	, TargetUrl:string ,
    //	, SrcIpAddr:string ,
    //	, HttpUserAgent  :string
    | lookup fileoperations on OperationName