Parser:
  Title: Microsoft 365 Defender - File Event Parser
  Version: '0.1'
  LastUpdated: June 28, 2021
Product:
  Name: 'M365 Defender for EndPoint'
Normalization:
  Schema: FileEvent
  Version: '0.1.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Dns schema documentation
  Link: https://aka.ms/AzSentinelFileEventDoc
- Title: Microsoft 365 Defender DeviceFileEvents
  Link: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicefileevents-table?view=o365-worldwide
Description: |
  This is a Query Parser that is used to map SharePoint File Operation (OfficeActivity) to the Azure Sentinel Information Model FileEvent schema.
ParserName: vimFileEventMicrosoftSharePoint
ParserQuery: |
  let M365DFileEvents=(){
    DeviceFileEvents
    | project-rename
         SrcIpAddr =RequestSourceIP
       , DvcId=DeviceId
       , TargetFilePath= iff(ActionType=='FileDeleted', strcat(TargetFilePath, '\\', FileName), TargetFilePath)
       , TargetFileMD5=MD5
       , TargetFileSHA1 =SHA1
       , TargetFileSHA256 =SHA256
       /// Removed: NetworkProtocol=RequestProtocol // [Unknown, Local, SMB, or NFS ]
       /// Removed: , SrcFileOriginUrl=FileOriginUrl
       //
       //
       //
      , ActingProcessCommandLine=InitiatingProcessCommandLine
      , ActingProcessName =InitiatingProcessFolderPath // Unlike FileName ActingProcessName includes full path  // Previously: ActingProcessFileName=initiatingProcessFileName
      , ActingProcessId = InitiatingProcessId
      /// Removed: , ActingProcessMD5 =InitiatingProcessMD5
      /// Removed: , ActingProcessSHA1 =InitiatingProcessSHA1
      /// Removed: , ActingProcessSHA256 =InitiatingProcessSHA256
      /// Removed: , ActingProcessParentFileName = InitiatingProcessParentFileName
      /// Removed: , ActingProcessCreationTime =InitiatingProcessCreationTime
      /// Removed: , ActingProcessParentCreationTime =InitiatingProcessParentCreationTime
      // Missing in Sentinel    , ActingProcessCompany =InitiatingProcessVersionInfoCompanyName
      // Missing in Sentinel    , ActingProcessFileDescription =InitiatingProcessVersionInfoFileDescription	
      // Missing in Sentinel    , ActingProcessFileProduct =InitiatingProcessVersionInfoProductName
    | extend
          EventCount=int(1)
        , EventStartTime= TimeGenerated 
        , EventEndTime= TimeGenerated
        , EventType=ActionType // [FileCreated, FileDeleted, FileModified, FileRenamed] : This will break if MDE adds operation not in our enum
        , EventResult= 'Success' // Only logging success?
        , EventProduct='M365 Defender'
        , EventVendor='Microsoft'
        , EventSchemaVersion='0.1.0' 
    //
        , ActorUsername=coalesce(InitiatingProcessAccountUpn, strcat(InitiatingProcessAccountDomain,'\\', InitiatingProcessAccountName))
        , ActorUsernameType=iff(isempty(InitiatingProcessAccountUpn),'Windows','Upn') // Is 'Windows' the right term?
        , ActorUserId=coalesce(InitiatingProcessAccountSid, InitiatingProcessAccountObjectId)
        , ActorUserIdType=iff(isempty(InitiatingProcessAccountSid),'AADId','Sid') 
        /// Removed: , DvcIdType='MDE'
        , DvcHostname =DeviceName
        , DvcHostnameType=iff(DeviceName contains '.','Fqdn','Hostname') // There's something missing here: https://docs.microsoft.com/en-us/azure/sentinel/normalization#the-device-entity
        , DvcOs='Windows' 
  //
  //
       , TargetFilePathFormat='Windows Local'
       , SrcFileName=coalesce(PreviousFileName,FileOriginUrl)  // Should I split the url to file and all the rest
       , SrcFilePath=strcat(PreviousFolderPath,'\\',PreviousFileName)
    // , ActingProcessGuid
    // , ActingProcessSessionId
       /// Removed:  , ActingProcessIntegrityLevel =InitiatingProcessIntegrityLevel
       /// Removed: , ActingProcessParentFilePath = ActingProcessParentFileName /// 
      // Aliases
     | extend 
        User=ActorUsername
       , Dvc=DvcHostname
       , ActingProcessHash=coalesce(ActingProcessSHA256, ActingProcessSHA1, ActingProcessMD5)
       , FilePath=TargetFilePath
        };M365DFileEvents