Parser:
  Title: Microsoft 365 Defender - File Event Parser
  Version: '0.1'
  LastUpdated: June 28, 2021
Product:
  Name: 'M365 Defender for EndPoint'
Normalization:
  Schema: FileEvent
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Dns schema documentation
  Link: https://aka.ms/AzSentinelFileEventDoc
- Title: Microsoft 365 Defender DeviceFileEvents
  Link: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicefileevents-table?view=o365-worldwide
Description: |
  This is a Query Parser that is used to map SharePoint File Operation (OfficeActivity) to the Azure Sentinel Information Model FileEvent schema.
ParserName: vimFileEventMicrosoftSharePoint
ParserQuery: |
  let FaliureReason=datatable(EventOriginalResultDetails:string, EventResultDetails:string)[
    'InvalidUserNameOrPassword','No such user or password' 
    // What other will we find here?
    ];
  let AuthM365D=(){
    DeviceLogonEvents 
    // ---   Already mapped
    // // TimeGenerated - exists
    //
    | project-rename 
       EventOriginalResultDetails=FailureReason 
       , EventSubType=LogonType
    | extend 
    //
       // ----  Untouched
       TimeGenerated
    // 
      // ----  Event
       , EventCount=int(1)
       , EventStartTime=TimeGenerated
       , EventEndTime=TimeGenerated
       , EventOriginalType = EventSubType // Previously:LogonType
       , EventProduct='M365 Defender for EndPoint'
      ,  EventResult = case(ActionType =='LogonSuccess', 'Success'
                            , ActionType=='LogonFailed', 'Failure'
                            , ActionType=='LogonAttempted', 'NA' //// Not sure what this is
                            , 'NA')
      , EventSchemaVersion='0.1.0'
      , EventType='Logon'
      , EventVendor ='Microsoft'
    //    -   No Data
    //  EventOriginalUid 
    //  EventProductVersion 
    //  EventReportUrl
    //  EventMessage 
    //  
    //  
    //  ----   Target and Actor Users
     | project-rename 
         TargetUserId=AccountSid
       , ActorUserId =InitiatingProcessAccountSid
       , ActorUserUpn=InitiatingProcessAccountUpn
       , ActorUserObjectId=InitiatingProcessAccountObjectId
      | extend 
         TargetUserIdType ='UserSid'
       , TargetUsername = strcat(AccountDomain,'\\',AccountName)
       , TargetUsernameType='Windows'
    //    -  No Data
      // TargetUserType 
    // 
    // ActingAppName 
    // ActingAppType 
    // ActorSessionId 
      , ActorUserIdType='SID'
    // ActorUserType 
      , ActorUsername=coalesce(ActorUserUpn, strcat(InitiatingProcessAccountDomain,'\\',InitiatingProcessAccountName)) // InitiatingProcessAccountName
      , ActorUsernameType=case(isnotempty( ActorUserUpn), 'Upn/Email'
                                , isnotempty(InitiatingProcessAccountDomain), 'Windows'
                                , 'Simple')
     //, AdditionalFields:already exists
      | project-rename 
        DvcHostname=DeviceName
      , LogonProtocol=Protocol
      , TargetDvcId=DeviceId
      , TargetDvcIpAddr=RemoteIP
      , OriginalEventUid=ReportId
    // No Data
    // DvcIpAddr 
    // HttpUserAgent 
    // LogonMethod 
    //
      , SrcDvcHostname=RemoteDeviceName 
      // SrcDvcHostnameType == Requires calculation. not sure it is worth it
    // SrcDvcId 
    // SrcDvcIpAddr 
    // SrcDvcOs 
    // SrcDvcType 
    // SrcGeo fields 
    //
    // TargetAppId 
    // TargetAppName 
    // TargetAppType 
    // TargetDvc
    //
    //, ActingProcessCommandLine = InitiatingProcessCommandLine
    //, ActingProcessCreationTime=InitiatingProcessCreationTime
    , ActingProcessPath=InitiatingProcessFolderPath
    , ActingProcessId=InitiatingProcessId
    //, ActingProcessMD5=InitiatingProcessMD5
    //, ActingProcessSHA1=InitiatingProcessSHA1
    //, ActingProcessSHA256= InitiatingProcessSHA256
      | extend 
          ActingProcessFileName=iff(ActingProcessPath hassuffix InitiatingProcessFileName
                            , ActingProcessPath
                            , strcat(ActingProcessPath,'\\',InitiatingProcessFileName))
        , TargetDvcHostname=DvcHostname
        ,  TargetDvcHostnameType='FQDN'
        , TargetDvcIdType='MDE'
    // TargetDvcOs
    // TargetDvcType
      , TargetPortNumber=RemotePort
      , TargetSessionId =LogonId
      // EventResultDetails
      | lookup FaliureReason on EventOriginalResultDetails 
    // TargetUrl 
    // -----------  Alias
      | extend 
        User=TargetUsername 
        , LogonTarget=TargetDvcHostname
        , Dvc=TargetDvcHostname
    // No data
        // // _ResourceId - no data 
        };AuthM365D