Parser:
  Title: Microsoft SharePoint File Operation - File Event Parser
  Version: '0.1'
  LastUpdated: June 28, 2021
Product:
  Name: Microsoft SharePoint
Normalization:
  Schema: FileEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/AzSentinelRegistryEventsDoc
- Title: Dns schema documentation
  Link: https://aka.ms/AzSentinelFileEventDoc
- Title: Office 365 Management Activity API schema
  Link: https://docs.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-schema#sharepoint-file-operations
Description: |
  This is a Query Parser that is used to map SharePoint File Operation (OfficeActivity) to the Azure Sentinel Information Model FileEvent schema.
ParserName: vimFileEventMicrosoftSharePoint
ParserQuery: |
  let SharepointFile=(){
    OfficeActivity
    | where OfficeWorkload=='SharePoint' // Guessing the value...
          and ItemType in ('File', 'Folder', 'DocumentLibrary', 'Page')
    | extend
          EventCount=int(1)
        , EventStartTime= TimeGenerated // Start_Time ?
        , EventEndTime= TimeGenerated
        , EventType=Operation
        , EventResult=case(ResultStatus =='Succeeded', 'Success'
                            , ResultStatus == 'Failed', 'Failure'
                            , 'Partial')
        , EventProduct='SharePoint 365'
        , EventVendor='Microsoft'
        , EventSchemaVersion='0.1.0' 
        , ActorUsername=UserId 
        , ActorUsernameType='upn'
        , ActorUserId=UserKey
        , ActorUserIdType='Puid' //(PUID) for events performed by users in SharePoint, OneDrive
        , ActorUserType=UserType
        , HttpUserAgent=UserAgent
        , SrcDvcIpAddr =ClientIP
        /// If operation is copied/moved than SourceFile us the "Previous file". (what about FileRenamed?)
        , TargetFileFullPath=iff(Operation in ('FileCopied', 'FileMoved')
                                , DestinationFileName
                                , strcat(Site_Url, '/', SourceRelativeUrl,'/',SourceFileName)) // need to see samples. Maybe use SourceFileName
        ,  TargetFileName=iff(Operation in ('FileCopied', 'FileMoved'), DestinationFileName, SourceFileName) // need to see samples. Maybe use SourceFileName
        , TargetFilePath= iff(Operation in ('FileCopied', 'FileMoved'),strcat(Site_Url, '/', DestinationRelativeUrl), strcat(Site_Url, '/', SourceRelativeUrl))
     // , SensitivityLabel:string // ? 
       , SrcFileName=iff(Operation in ('FileCopied', 'FileMoved'), SourceFileName,'')
       , SrcFilePath=iff(Operation in ('FileCopied', 'FileMoved'), strcat(Site_Url, '/', SourceRelativeUrl),'')
       , TargetAppName='SharePoint'
     // Aliases
     | extend 
        User=ActorUsername
        , File=TargetFileName
        // ***************** Missing columns
        // ActingAppId
        // ActingAppName
        // ActingProcess columns
        // AdditionalFields
        // DstDvcIpAddr
        // Dvc
        // DvcHostname
        // DvcHostnameType
        // DvcId
        // DvcIdType
        // DvcIpAddr
        // DvcMacAddr
        // DvcOs
        // DvcOsVersion
        // EventOriginalUid
        // EventProductVersion
        // EventReportUrl
        // EventResultDetails
        // EventSchemaVersion
        // FileHash columns
        // FileOriginUrl
        // FileSize
        // NetworkProtocol
        // PreviousFileHash columns
        // PreviousFileSize
        // SensitivityLabel
        // SessionId
        // ShareName
        // SrcDvcHostname
        // SrcDvcHostnameType
        // SrcDvcId
        // SrcDvcOs
        // SrcDvcType
        // SrcGeo columns
        // SrcIsp
        // SrcPortNumber
        // Remove this Column from schema: WebsiteOriginalUrl   (how is this different from FileOriginUrl)
   };
   SharepointFile
