id: 2cd90dd4-4f42-4d3e-86ed-b5c711f79f65
name: Remote Management and Monitoring tool - NAble - Network Connection
description: |
    Remote Monitoring and Management (RMM) programs are IT to manage remote endpoints. Attackers have begun to abuse these programs to persist or provide C2 channels.
    https://github.com/jischell-msft/RemoteManagementMonitoringTools
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
tactics: CommandAndControl
relevantTechniques: T1219
query: |
  let Time_start = now(-5d);
  let Time_end = now();
  //
  DeviceNetworkEvents
  | where Timestamp between (Time_start..Time_end)
  | where RemoteUrl has_any (
          'remote.management',
          'logicnow.com',
          'logicnow.us',
          'system-monitor.com',
          'systemmonitor.eu.com',
          'systemmonitor.co.uk',
          'systemmonitor.us',
          'n-able.com',
          'rmm-host.com',
          'solarwindsmsp.com'
      )
      and InitiatingProcessVersionInfoCompanyName has_any (
              'Remote Monitoring',
              'LogicNow Ltd',
              'N-Able',
              'SolarWinds MSP'
          )
  | summarize FirstSeen=min(Timestamp), LastSeen=max(Timestamp), 
      Report=make_set(ReportId), Count=count() by DeviceId, DeviceName,
      RemoteUrl 
