Parser:
  Title: Web Session ASIM schema function
  Version: '0.3'
  LastUpdated: Jun 15, 2022
Product:
  Name: Microsoft
Normalization:
  Schema: WebSession
  Version: '0.1'
References:
- Title: ASIM WebSession Schema
  Link: https://aka.ms/ASimWebSessionDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Web Session schema
ParserName: vimWebSessionEmpty
EquivalentBuiltInParser: _Im_WebSession_Empty
ParserQuery: | 
 let parser=datatable(
    TimeGenerated:datetime,
    _ResourceId:string,
    Type:string,
    AdditionalFields:dynamic,
    ASimMatchingHostname:string,
    ASimMatchingIpAddr:string,
    Dst:string,
    DstAppId:string,
    DstAppName:string,
    DstAppType:string,
    DstBytes:long,
    DstDescription:string,
    DstDeviceType:string,
    DstDomain:string,
    DstDNUsername:string,
    DstDomainType:string,
    DstDvcId:string,
    DstDvcIdType:string,
    DstDvcScope:string,
    DstDvcScopeId:string,
    DstFQDN:string,
    DstGeoCity:string,
    DstGeoCountry:string,
    DstGeoLatitude:real,
    DstGeoLongitude:real,
    DstGeoRegion:string,
    DstHostname:string,
    DstInterfaceGuid:string,
    DstInterfaceName:string,
    DstIpAddr:string,
    DstMacAddr:string,
    DstNatIpAddr:string,
    DstNatPortNumber:int,
    DstOriginalUserType:string,
    DstPackets:long,
    DstPortNumber:int,
    DstProcessGuid:string,
    DstProcessId:string,
    DstProcessName:string,
    DstSimpleUsername:string,
    DstUserAadId:string,
    DstUserAWSId:string,
    DstUserId:string,
    DstUserIdType:string,
    DstUsername:string,
    DstUsernameType:string,
    DstUserOktaId:string,
    DstUserPuid:string,
    DstUserScope:string,
    DstUserScopeId:string,
    DstUserSid:string,
    DstUserType:string,
    DstUserUid:string,
    DstUserUpn:string,
    DstWindowsUsername:string,
    DstVlanId:string,
    DstZone:string,
    Duration:int,
    Dvc:string,
    DvcAction:string,
    DvcDescription:string,
    DvcDomain:string,
    DvcDomainType:string,
    DvcFQDN:string,
    DvcHostname:string,
    DvcId:string,
    DvcIdType:string,
    DvcInboundInterface:string,
    DvcInterface:string,
    DvcIpAddr:string,
    DvcMacAddr:string,
    DvcOriginalAction:string,
    DvcOs:string,
    DvcOsVersion:string,
    DvcOutboundInterface:string,
    DvcScope:string,
    DvcScopeId:string,
    DvcZone:string,
    EventCount:int,
    EventEndTime:datetime,
    EventMessage:string,
    EventOriginalResultDetails:string,
    EventOriginalSeverity:string,
    EventOriginalSubType:string,
    EventOriginalType:string,
    EventOriginalUid:string,
    EventOwner:string,
    EventProduct:string,
    EventProductVersion:string,
    EventReportUrl:string,
    EventResult:string,
    EventResultDetails:string,
    EventSchema:string,
    EventSchemaVersion:string,
    EventSeverity:string,
    EventStartTime:datetime,
    EventSubType:string,
    EventType:string,
    EventUid:string,
    EventVendor:string,
    FileContentType:string,
    FileMD5:string,
    FileName:string,
    FileSHA1:string,
    FileSHA256:string,
    FileSHA512:string,
    FileSize:long,
    Hash:string,
    HashType:string,
    Hostname:string,
    HttpContentFormat:string,
    HttpContentType:string,
    HttpCookie:string,
    HttpHost:string,
    HttpIsProxied:bool,
    HttpReferrer:string,
    HttpRequestBodyBytes:long,
    HttpRequestCacheControl:string,
    HttpRequestHeaderCount:int,
    HttpRequestMethod:string,
    HttpRequestTime:int,
    HttpRequestXff:string,
    HttpResponseBodyBytes:long,
    HttpResponseCacheControl:string,
    HttpResponseExpires:string,
    HttpResponseHeaderCount:int,
    HttpResponseTime:int,
    HttpStatusCode:string,
    HttpUserAgent:string,
    HttpVersion:string,
    InnerVlanId:string,
    IpAddr:string,
    NetworkApplicationProtocol:string,
    NetworkBytes:long,
    NetworkConnectionHistory:string,
    NetworkDirection:string,
    NetworkDuration:int,
    NetworkIcmpCode:int,
    NetworkIcmpType:string,
    NetworkPackets:long,
    NetworkProtocol:string,
    NetworkProtocolVersion:string,
    NetworkSessionId:string,
    OuterVlanId:string,
    Process:string,
    Rule:string,
    RuleName:string,
    RuleNumber:int,
    SessionId:string,
    Src:string,
    SrcAppId:string,
    SrcAppName:string,
    SrcAppType:string,
    SrcBytes:long,
    SrcDescription:string,
    SrcDeviceType:string,
    SrcDomain:string,
    SrcDomainType:string,
    SrcDvcId:string,
    SrcDvcIdType:string,
    SrcDvcScope:string,
    SrcDvcScopeId:string,
    SrcFQDN:string,
    SrcGeoCity:string,
    SrcGeoCountry:string,
    SrcGeoLatitude:real,
    SrcGeoLongitude:real,
    SrcGeoRegion:string,
    SrcHostname:string,
    SrcInterfaceGuid:string,
    SrcInterfaceName:string,
    SrcIpAddr:string,
    SrcMacAddr:string,
    SrcNatIpAddr:string,
    SrcNatPortNumber:int,
    SrcOriginalUserType:string,
    SrcPackets:long,
    SrcPortNumber:int,
    SrcProcessGuid:string,
    SrcProcessId:string,
    SrcProcessName:string,
    SrcUserId:string,
    SrcUserIdType:string,
    SrcUsername:string,
    SrcUsernameType:string,
    SrcUserScope:string,
    SrcUserScopeId:string,
    SrcUserType:string,
    SrcVlanId:string,
    SrcZone:string,
    TcpFlagsAck:bool,
    TcpFlagsCwr:bool,
    TcpFlagsEce:bool,
    TcpFlagsFin:bool,
    TcpFlagsNs:bool,
    TcpFlagsPsh:bool,
    TcpFlagsRst:bool,
    TcpFlagsSyn:bool,
    TcpFlagsUrg:bool,
    ThreatCategory:string,
    ThreatConfidence:int,
    ThreatField:string,
    ThreatFirstReportedTime:datetime,
    ThreatId:string,
    ThreatIpAddr:string,
    ThreatIsActive:bool,
    ThreatLastReportedTime:datetime,
    ThreatName:string,
    ThreatOriginalConfidence:string,
    ThreatOriginalRiskLevel:string,
    ThreatRiskLevel:int,
    Url:string,
    UrlCategory:string,
    UrlOriginal:string,
    User:string,
    UserAgent:string
  )[];
  parser