Parser:
  Title: Network Session ASIM parser for Force Point Firewall
  Version: '0.1'
  LastUpdated: March 17, 2022
Product:
  Name: ForcePointFirewall
Normalization:
  Schema: NetworkSession
  Version: '0.2.6'
References:
  - Title: ASIM Network Session Schema
    Link: https://aka.ms/ASimNetworkSessionDoc
  - Title: ASIM
    Link: https://aka.ms/AboutASIM
  - Title: Field Description in Force Point Logs 
    Link: https://help.stonesoft.com/onlinehelp/StoneGate/SMC/6.8.0/GUID-DA3B3807-18E1-482B-A5E8-A8BD468E5BB0.html
Description: |
  This ASIM parser supports normalizing Force Point Firewall logs coming from CEF Data Connector to the ASIM Network Session normalized schema.
ParserName: ASimNetworkSessionForcePointFirewall
EquivalentBuiltInParser: _ASim_NetworkSession_ForcePointFirewall
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
   let ApplicationProtocolLookup=datatable(ApplicationProtocol:string,NetworkApplicationProtocol:string)
      [
            "HTTPS","HTTPS",
            "HTTP-Over-QUIC","HTTP",
            "HTTP","HTTP",
            "DNS Over TLS","DNS",
            "HTTP proxy","HTTP",
            "IMAPS","IMAPS",
            "SMTP","SMTP",
            "IMAP","IMAP",
            "POP3S","POP3",
            "SMTP Submission Service","SMTP",
            "X11","X11",
            "RTSP","RTSP",
            "Telnet","TELNET",
            "NNTP","NNTP",
            "ISAKMP","ISAKMP","ISAKMP","ISAKMP",
            "POP3","POP3",
            "BGP","BGP",
            "FTP","FTP",
            "RIP","RIP",
            "Squid HTTP proxy","HTTP",
            "TFTP","TFTP",
            "QOTD","QOTD",
            "SCCP","SCCP",
            "Modbus","MODBUS",
            "SVN","SVN",
            "RADIUS (Accounting)","RADIUS",
            "Kerberos","KERBEROS",
            "GRE","GRE",
            "UUCP-rlogin","UUCP",
            "GTP User Data Tunneling","GTP",
            "NNTPS","NNTP",
            "GTP Control","GTP",
            "IRC-default","IRC",
            "FTPS (Control)","FTPS",
            "ICCP","ICCP",
            "IRCS","IRC",
            "Telnets","TELNET",
            "Finger","FINGER",
            "ESP","ESP",
            "Rlogin","RLP",
            "IMAP3","IMAP",
            "MGCP","MGCP",
            "RADIUS Accounting (Old)","RADIUS",
            "RADIUS (Old)","RADIUS",
            "CVS","CVS",
            "Ident","IDENT",
            "Gopher","GOPHER",
            "BGMP","BGMP",
            "FTPS (Data)","FTPS",
            "POP2","POP",
            "TLISRV","TLISRV",
            "INGRES-NET","INGRES-NET",
            "IPIP","IPIP",
            "XTP","XTP",
            "UUCP","UUCP",
            "IRC","IRC",
            "Photuris (ICMP)","ICMP",
            "TACACS-DS","TACACS-DS",
            "WESP","WESP",
            "EGP","EGP",
            "WSN","WSN",
            "XDMCP","XDMCP",
            "Kerberos IV","KERBEROS",
            "IRTP","IRTP",
            "TTP","TTP",
            "IRC-SERV","IRC",
            "I-NLSP","NLSP",
            "SNP","SNP",
            "XNS-IDP","XNS",
            "SECURE-VMTP","VMTP",
            "VMTP","VMTP",
            "IPLT","IPLT",
            "GGP","GGP",
            "MFE-NSP","NSP",
            "HIP","HIP",
            "MERIT-NSP","NSP",
            "NSFNET-IGP","IGP",
            "DCN-MEAS","DCN",
            "STP","STP",
            "SRP","SRP",
            "HMP","HMP",
            "XNET","XNET",
            "VRRP","VRRP",
            "ENCAP","ENCAP",
            "CPNX","CPNX",
            "PTP","PTP",
            "SKIP","SKIP",
            "SCPS","SCPS",
            "Sprite-RPC","RPC",
            "IPv6 ICMP","ICMP",
            "MUX","MUX",
            "CHAOS","CHAOS",
            "SSCOPMCE","SSCOPMCE",
            "CBT","CBT",
            "SPS","SPS",
            "ETHERIP","ETHERIP",
            "MTP","MTP",
            "ROHC","ROHC",
            "CRTP","CRTP",
            "PNNI","PNNI",
            "NETBLT","NETBLT",
            "TLSP","TLSP",
            "IDPR","IDPR",
            "DDX","DDX",
            "PUP","PUP",
            "DSR","DSR",
            "NARP","NARP",
            "CPHB","CPHB",
            "SMP","SMP",
            "L2TP","L2TP",
            "IPv6 ICMP/143/0","ICMP",
            "MICP","MICP",
            "GMTP","GMTP",
            "LARP","LARP",
            "IFMP","IFMP",
            "IGP","IGP",
            "CFTP","CFTP",
            "PGM","PGM",
            "DDP","DDP",
            "PIPE","PIPE",
            "IATP","IATP",
            "IGMP","IGMP",
            "3PC","3PC",
            "DGP","DGP",
            "TCF","TCF",
            "UTI","UTI",
            "DCCP","DCCP",
            "SWIPE","SWIPE",
            "EMCON","EMCON",
            "PIM","PIM",
            "RVD","RVD",
      ];
    let ActionLookup=datatable(DeviceAction:string,DvcAction_ActionLookup:string,EventResult_ActionLookup:string,EventSeverity_ActionLookup:string)
    [
              "Allow","Allow","Success","Informational",          
              "Discard","Drop","Failure","Low",
              "Permit","Allow","Success","Informational",          
              "Refuse","Deny","Failure","Low",
              "Terminate","Reset Source","Failure","Low",          
              "Terminate (failed)","","Failure","Low",
              "Terminate (passive)","Reset Destination","Failure","Low",          
              "Terminate (reset)","Reset","Failure","Low",
              "Wait for Authentication","","Success","Informational",
              "Wait for Further Actions","","Success","Informational",          
              "Wait for RPC Reply","","Success","Informational"
    ];
    let DeviceEventClassIDLookup_Packet=datatable(DeviceEventClassID:string,EventSubType:string,DvcAction_DeviceEventClassIDLookup:string,EventResult_DeviceEventClassIDLookup:string,EventSeverity_DeviceEventClassIDLookup:string) //Add more codes if needed
    [
              "70018","Start","Allow","Success","Informational", // Connection_Allowed
              "70019","End","Deny","Failure","Low", // Connection_Discarded
              "70021","End","Reset","Failure","Low", // Connection_Closed
              "70022","End","Reset","Failure","Low", // Connection_Closed-Abnormally
              "70026","","","Success","Informational", // Connection_Progress
    ];
    let DeviceEventClassIDLookup_File=datatable(DeviceEventClassID:string,DvcAction_DeviceEventClassIDLookup:string,EventResult_DeviceEventClassIDLookup:string,EventSeverity_DeviceEventClassIDLookup:string)
    [
              "76506","Allow","Success","Informational", // File_Allowed
              "76508","Deny","Failure","Low", // File_Malware-Blocked
              "76509","","Failure","Low" // File_Malware-Detected
    ];
    let MessageLookup = datatable (Message:string, DvcAction_MessageLookup:string, EventResult_MessageLookup:string, EventResultDetails:string, EventOriginalResultDetails:string)  
    [
            "Connection dropped", "Drop", "Failure","Terminated", "Connection dropped",
            "Connection removed because NGFW Engine is low on memory.","Drop", "Failure","Terminated","Connection removed because NGFW Engine is low on memory.",
            "Connection timeout in state TCP_CLOSE_WAIT", "", "Success", "Timeout",	"One end of the Connection waits for the FIN packet (passive close).",
            "Connection timeout in state TCP_CLOSE_WAIT_ACK", "", "Success", "Timeout", "One end of the Connection waits for the FIN packet (passive close)",
            "Connection timeout in state TCP_CLOSING", "", "Success", "Timeout", "Closing packet (FIN) sent by one end of the Connection (simultaneous).",
            "Connection timeout in state TCP_CLOSING_ACK", "", "Success", "Timeout", "Waiting for ACK for the FIN before going to closing status (active close).",
            "Connection timeout in state TCP_ESTABLISHED", "", "Failure", "Timeout", "Normal status of TCP Connections for data transfer.",
            "Connection timeout in state TCP_FIN_WAIT_1", "", "Success", "Timeout",	"One end of the Connection waits for sending the FIN packet (active close).",
            "Connection timeout in state TCP_FIN_WAIT_2", "", "Success", "Timeout", "One end of the Connection waits for receiving ACK packet.",
            "Connection timeout in state TCP_LAST_ACK", "",	"Success", "Timeout", "One end of the Connection sent a FIN packet (passive close).",
            "Connection timeout in state TCP_LAST_ACK_WAIT", "", "Failure",	"Timeout", "Waiting for the FIN packet to be acknowledged.",
            "Connection timeout in state TCP_SYN_ACK_SEEN", "", "Failure",	"Timeout", "Second phase of the TCP three-way handshake, the server has replied to client sent SYN with SYN+ACK, next status will be established.",
            "Connection timeout in state TCP_SYN_FIN_SEEN", "",	"Success", "Timeout", "T/TCP (Transactional TCP) Connection, RFC 1644.",
            "Connection timeout in state TCP_SYN_RETURN", "", "Failure", "Timeout", "Received simultaneous SYN from the other end (simultaneous open).",
            "Connection timeout in state TCP_SYN_SEEN", "", "Failure", "Timeout", "First packet sent by one end of the Connection.",
            "Connection timeout in state TCP_TIME_WAIT", "", "Success", "Timeout", "One end of the Connection acknowledged closing packet (FIN).",
            "Connection timeout in state TCP_TIME_WAIT_ACK", "", "Failure",	"Timeout", "Waiting for ACK for the FIN status before going to time wait status (active close).",
            "Connection timeout in state ICMP_ECHO", "", "Failure", "Timeout", "Ping reply is expected.",
            "Connection timeout in state ICMP_REPLY_WAIT", "", "Failure", "Timeout", "Other ICMP request or reply types.",
            "Connection was reset by client", "Reset Source", "Failure","Reset", "",
            "Connection was reset by server", "Reset Destination", "Failure","Reset", "",
            "invalid packet (CT)", "", "Failure", "Invalid TCP", "",
            "not a (valid) SYN packet [A] (CT)", "", "Failure", "Invalid TCP", "",
            "not a (valid) SYN packet [FA] (CT)", "", "Failure", "Invalid TCP", "",
            "not a (valid) SYN packet [FPA] (CT)", "", "Failure", "Invalid TCP", "",
            "not a (valid) SYN packet [PA] (CT)", "", "Failure", "Invalid TCP", "",
            "not a (valid) SYN packet [RA] (CT)", "", "Failure", "Invalid TCP", "",
            "not a (valid) SYN packet [SA] (CT)", "", "Failure", "Invalid TCP", "",
            "TCP state violation","Deny","Failure", "Invalid TCP", "",
            "TCP state violation: Connection end-point replied with ACK to SYN-packet. Connection refused.", "Deny", "Failure", "Invalid TCP", "",
            "TSC error: Query timed out", "", "Failure", "Timeout", ""
    ];
    let parser = (disabled:bool) { 
    let ForcePointNetwork = CommonSecurityLog
            | where not(disabled)
            | where DeviceVendor=="FORCEPOINT" and DeviceProduct=="Firewall"
            | where DeviceFacility in~ ("Inspection","Packet Filtering","File Filtering") and isnotempty(DeviceEventClassID) and DeviceEventClassID != "0" 
            ;
    let PacketFilteringData = ForcePointNetwork
            | where DeviceFacility == "Packet Filtering" and DeviceEventClassID !in ("70383","70393","70734","71009","71040")
            | lookup DeviceEventClassIDLookup_Packet on DeviceEventClassID
            | lookup MessageLookup on Message
            | extend DvcAction = coalesce(DvcAction_MessageLookup, DvcAction_DeviceEventClassIDLookup), 
                    EventResult = case (Message startswith "Referred connection not known", "Failure",
                                        coalesce(EventResult_MessageLookup, EventResult_DeviceEventClassIDLookup)), 
                    EventSeverity = case(Message startswith "Referred connection not known", "Low",
                                        EventSeverity_DeviceEventClassIDLookup),
                    EventOriginalResultDetails = case(Message startswith "Referred connection not known", Message,
                                                    EventOriginalResultDetails),
                    EventType = "NetworkSession"
            | project-away DvcAction_*, EventResult_*, EventSeverity_DeviceEventClassIDLookup;
    let FileFilteringData = ForcePointNetwork
            | where DeviceFacility == "File Filtering"
            | lookup DeviceEventClassIDLookup_File on DeviceEventClassID
            | extend ThreatName = case (DeviceEventClassID in ("76508", "76509"), Activity,
                                        "")
            | project-rename DvcAction = DvcAction_DeviceEventClassIDLookup
            | extend EventResult = case(isnotempty(Message), "Failure",
                                        EventResult_DeviceEventClassIDLookup), 
                     EventSeverity = case(isnotempty(Message), "Low",
                                        EventSeverity_DeviceEventClassIDLookup),
                     EventOriginalResultDetails = case(isnotempty(Message), Message,
                                                    ""),
                    EventType = "NetworkSession"
            | project-away *_DeviceEventClassIDLookup;
    let InspectionData = ForcePointNetwork
            | where DeviceFacility == "Inspection" or DeviceEventClassID == "70734"
            | extend MessageCode = toint(DeviceEventClassID)
            | extend EventSeverity = case (DeviceAction in~ ("Allow","Permit"), "Informational",
                                        MessageCode >= 200000, "High",
                                        MessageCode < 200000, "Low",
                                        ""),
                    EventType = case (MessageCode < 80000, "NetworkSession",
                                     "IDS")
            | extend ThreatName = Activity
            | project-away MessageCode;
    union PacketFilteringData, FileFilteringData, InspectionData
            | extend NetworkProtocol = _ASIM_LookupNetworkProtocol(Protocol)
            | lookup ActionLookup on DeviceAction
            | extend DvcAction = coalesce(DvcAction,DvcAction_ActionLookup), 
                     EventResult = coalesce(EventResult,EventResult_ActionLookup), 
                     EventSeverity = coalesce(EventSeverity, EventSeverity_ActionLookup)
            | project-away *_ActionLookup
            | lookup ApplicationProtocolLookup on ApplicationProtocol
            | extend 
                    EventCount = toint(1),
                    EventSchema = "NetworkSession",
                    EventSchemaVersion = "0.2.6",
                    EventVendor = "Forcepoint",
                    EventProduct = "Firewall"
            | parse AdditionalExtensions with * "requestURL=" requestURL            
            | project-rename
                    EventOriginalType = DeviceEventClassID,
                    DstPortNumber = DestinationPort,
                    DstIpAddr = DestinationIP,
                    SrcPortNumber = SourcePort,
                    SrcIpAddr = SourceIP,
                    DstNatIpAddr = DestinationTranslatedAddress,
                    DstNatPortNumber = DestinationTranslatedPort,
                    SrcNatIpAddr = SourceTranslatedAddress,
                    SrcNatPortNumber = SourceTranslatedPort,
                    EventProductVersion = DeviceVersion,
                    EventMessage = Message,
                    DvcOriginalAction = DeviceAction,
                    SrcBytes = SentBytes,
                    DstBytes = ReceivedBytes,
                    EventOriginalSubType = DeviceFacility,
                    DvcId = DeviceExternalID,
                    DvcInboundInterface = DeviceInboundInterface,
                    DvcOutboundInterface = DeviceOutboundInterface,
                    DvcIpAddr = DeviceAddress,
                    EventOriginalSeverity = LogSeverity,
                    ThreatId = DeviceCustomString3
            | invoke _ASIM_ResolveDvcFQDN('Computer')
            | extend
                    ThreatCategory = column_ifexists("DeviceEventCategory",""),
                    EventStartTime = todatetime(ReceiptTime),
                    EventEndTime = todatetime(ReceiptTime),
                    ipv6_parts = extract_all (@'^\[(.+)\](?:\:(\d+))?$',requestURL)[0],
                    ipv4_parts = extract_all (@'^(\d+\.\d+\.\d+\.\d+)(?:\:(\d+))?$',requestURL)[0],
                    host_parts = extract_all (@'^([^\\\d:]+)(?:\:(\d+))?$',requestURL)[0]
            | extend 
                     NetworkRuleName = case(isnotempty(DeviceCustomString2), strcat(DeviceCustomString1,',',DeviceCustomString2),
                                            DeviceCustomString1),
                     DstDomainPart = tostring(host_parts[0]),
                     DstIpAddr = coalesce(DstIpAddr, tostring(ipv4_parts[0]), tostring(ipv6_parts[0])),
                     DstPortNumber = coalesce(DstPortNumber, toint(host_parts[1]), toint(ipv4_parts[1]), toint(ipv6_parts[1]))
            | invoke _ASIM_ResolveDstFQDN('DstDomainPart')
            | extend
                     DvcIdType = case(isnotempty(DvcId), "ForcepointId",
                                    ""),
                     DstPortNumber = case(
                                    isnotempty(DstPortNumber), DstPortNumber,
                                    ApplicationProtocol startswith "TCP", toint(split(ApplicationProtocol,'/')[1]),
                                    ApplicationProtocol startswith "UDP", toint(split(ApplicationProtocol,'/')[1]),
                                    int(null)),
                     AdditionalFields = pack(iff(isnotempty(RequestMethod) and RequestMethod != "UNKNOWN", "RequestMethod", ""),RequestMethod,
                                             iff(isnotempty(DeviceCustomString4),"VirusId",""),DeviceCustomString4),
                     DstAppName = case(DestinationServiceName in~ ("Generic-Web-HTTP","Application-Unknown","Unknown-Encrypted-Application"), "",
                                        DestinationServiceName),
                     DvcIpAddr = coalesce(DvcIpAddr,DeviceName)
            | extend
                    Dvc = DvcIpAddr,
                    IpAddr = SrcIpAddr,
                    Rule = NetworkRuleName,
                    Dst = DstIpAddr,
                    Src = SrcIpAddr,
                    DvcInterface = DvcInboundInterface,
                    Hostname = DstHostname
            | project-away AdditionalExtensions, CommunicationDirection, Device*, Destination*, EndTime, ExternalID, File*, Flex*, IndicatorThreatType, Malicious*, Old*, OriginalLogSeverity, Process*, Protocol, ReceiptTime, Remote*, ReportReferenceLink, Request*, SimplifiedDeviceAction, Source*, StartTime, TenantId, ThreatConfidence, ThreatDescription, ThreatSeverity, ExtID, EventOutcome, FieldDevice*, Reason, ApplicationProtocol, Activity, requestURL, Computer, DstDomainPart, host_parts, ipv4_parts, ipv6_parts
        };
        parser(disabled=disabled)