Parser:
  Title: Network Session ASIM schema function
  Version: '0.3'
  LastUpdated: Feb 13, 2022
Product:
  Name: Microsoft
Normalization:
  Schema: NetworkSession
  Version: '0.2.2'
References:
- Title: ASIM NetworkSession Schema
  Link: https://aka.ms/ASimNetworkSessionDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Network Session schema 
ParserName: vimNetworkSessionEmpty
EquivalentBuiltInParser: _Im_NetworkSession_Empty

ParserQuery: | 
 let parser=datatable(
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // -- Event Fields
  , EventMessage:string // Optional
  , EventCount:int // Mandatory
  , EventStartTime:datetime // Mandatory
  , EventEndTime:datetime // Alias
  , EventType:string // Mandatory
  , EventSubType:string // Optional
  , EventResult:string // Mandatory
  , EventResultDetails:string // Optional
  , EventOriginalResultDetails:string // Optional
  , EventSeverity:string // Mandatory
  , EventOriginalSeverity:string // Optional
  , EventOriginalUid:string // Optional
  , EventOriginalType:string // Optional
  , EventOriginalSubType:string // Optional
  , EventProduct:string // Mandatory
  , EventProductVersion:string // Optional
  , EventVendor:string // Mandatory
  , EventSchema:string // Mandatory
  , EventSchemaVersion:string // Mandatory
  , EventReportUrl:string // Mandatory
  , Dvc:string // Alias
  , DvcIpAddr:string // Mandatory
  , DvcHostname:string // Mandatory
  , DvcDomain:string // Recommended
  , DvcDomainType:string // Recommended
  , DvcFQDN:string // Optional
  , DvcId:string // Optional
  , DvcIdType:string // Optional
  , DvcMacAddr:string // Optional
  , DvcZone:string // Optional
  , DvcDescription:string // Optional
  // -- Network Session Fields
  , Dst:string // Alias
  , DstIpAddr:string // Recommended
  , DstPortNumber:int // Optional
  , DstHostname:string // Recommended
  , Hostname:string // Alias
  , DstDescription:string // Optional
  , DstDomain:string // Recommended
  , DstDomainType:string // Recommended
  , DstFQDN:string // Optional
  , DstDvcId:string // Optional
  , DstDvcIdType:string // Optional
  , DstDeviceType:string // Optional
  , DstUserId:string // Optional
  , DstUserIdType:string // Optional
  , DstUsername:string // Optional
  , User:string // Alias
  , DstUsernameType:string // Alias
  , DstUserType:string // Optional
  , DstOriginalUserType:string // Optional
  , DstUserDomain:string // Optional
  , DstAppName:string // Optional
  , DstAppId:string // Optional
  , DstAppType:string // Optional
  , DstZone:string // Optional
  , DstInterfaceName:string // Optional
  , DstInterfaceGuid:string // Optional
  , DstMacAddr:string // Optional
  , DstGeoCountry:string // Optional
  , DstGeoRegion: string // Optional
  , DstGeoCity:string // Optional
  , DstGeoLatitude:real // Optional
  , DstGeoLongitude:real // Optional
  , Src:string // Alias
  , SrcIpAddr:string // Recommended
  , SrcPortNumber:int // Optional
  , SrcHostname:string // Recommended
  , SrcDescription:string // Optional
  , SrcDomain:string // Recommended
  , SrcDomainType:string // Recommended
  , SrcFQDN:string // Optional
  , SrcDvcId:string // Optional
  , SrcDvcIdType:string // Optional
  , SrcDeviceType:string // Optional
  , SrcUserId:string // Optional
  , SrcUserIdType:string // Optional
  , SrcUsername:string // Optional
  , SrcUsernameType:string // Alias
  , SrcUserType:string // Optional
  , SrcOriginalUserType:string // Optional
  , SrcUserDomain:string // Optional
  , SrcAppName:string // Optional
  , SrcAppId:string // Optional
  , IpAddr:string // Alias
  , SrcAppType:string // Optional
  , SrcZone:string // Optional
  , SrcInterfaceName:string // Optional
  , SrcInterfaceGuid:string // Optional
  , SrcMacAddr:string // Optional
  , SrcGeoCountry:string // Optional
  , SrcGeoCity:string // Optional
  , SrcGeoRegion: string // Optional 
  , SrcGeoLatitude:real // Optional
  , SrcGeoLongitude:real // Optional
  , NetworkApplicationProtocol:string // Optional
  , NetworkProtocol:string // Optional
  , NetworkProtocolVersion:string // Optional
  , NetworkDirection:string // Optional
  , NetworkDuration:int // Optional
  , Duration:int // Alias
  , NetworkIcmpCode:int // Optional
  , NetworkIcmpType:string // Optional
  , DstBytes:long // Optional
  , SrcBytes:long // Optional
  , NetworkBytes:long // Optional
  , DstPackets:long // Optional
  , SrcPackets:long // Optional
  , NetworkPackets:long // Optional
  , NetworkSessionId:string // Optional
  , SessionId:string // Alias
  , NetworkConnectionHistory:string // Optional
  , SrcVlanId:string // Optional
  , DstVlanId:string // Alias
  , InnerVlanId:string // Optional
  , OuterVlanId: string // Alias
  // -- Intermediary device fields
  , DstNatIpAddr:string // Optional
  , DstNatPortNumber:int // Optional
  , SrcNatIpAddr:string // Optional
  , SrcNatPortNumber:int // Optional
  , DvcInboundInterface:string // Optional
  , DvcOutboundInterface:string // Optional
  , DvcInterface:string // Optional
  // -- Inspection fields
  , NetworkRuleName:string // Optional
  , NetworkRuleNumber:int // Optional
  , Rule:string // Optional
  , DvcAction:string // Optional
  , DvcOriginalAction:string // Optional
  , ThreatId:string // Optional
  , ThreatName:string // Optional
  , ThreatCategory:string // Optional
  , ThreatRiskLevel:int // Optional
  , ThreatOriginalRiskLevel:string // Optional
  , DvcSubscriptionId:string // Optional
  , SrcSubscriptionId:string // Optional
  , DstSubscriptionId:string // Optional 
  )[];
 parser