Parser:
  Title: Network Session ASIM filtering parser for Zscaler ZIA
  Version: '0.2'
  LastUpdated: Jan 17, 2022
Product:
  Name: Zscaler ZIA
Normalization:
  Schema: NetworkSession
  Version: '0.2.2'
References:
- Title: ASIM Network Session Schema
  Link: https://aka.ms/ASimNetworkSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
- Title: Zscaler Connector
  Link: https://docs.microsoft.com/azure/sentinel/data-connectors-reference#zscaler
- Title: Zscaler Sentinel deployment guide
  Link: https://help.zscaler.com/zia/zscaler-microsoft-azure-sentinel-deployment-guide
Description: |
  This ASIM parser supports filtering and normalizing Zscaler ZIA proxy logs produced by the Microsoft Sentinel Zscaler connector to the ASIM Network Session normalized schema.
ParserName: vimNetworkSessionZscalerZIA
EquivalentBuiltInParser: _Im_NetworkSession_ZscalerZIA
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstportnumber
    Type: int
    Default: int(null)
  - Name: hostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: dvcaction
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let ActionLookup = datatable (DvcOriginalAction: string, DvcAction:string) [
    // See https://help.zscaler.com/zia/firewall-insights-logs-filters
    'Allow','Allow',
    'Allow due to insufficient app data','Allow',
    'Block/Drop','Drop',
    'Block/ICMP','Drop ICMP',
    'Block/Reset', 'Reset',
    'IPS Drop', 'Drop',
    'IPS Reset', 'Reset',
    // Observed in real world events
    'Block ICMP', 'Drop ICMP',
    'Drop', 'Drop'
  ];
  let parser=  
    (starttime:datetime=datetime(null)
    , endtime:datetime=datetime(null)
    , srcipaddr_has_any_prefix:dynamic=dynamic([])
    , dstipaddr_has_any_prefix:dynamic=dynamic([])
    , dstportnumber:int=int(null)
    , hostname_has_any:dynamic=dynamic([])
    , dvcaction:dynamic=dynamic([])
    , eventresult:string='*'
    , disabled:bool=false) {
  CommonSecurityLog | where not(disabled)
  | where DeviceVendor == "Zscaler"
  | where DeviceProduct == "NSSFWlog"
  // -- Pre-filtering
  |where
    (array_length(hostname_has_any) == 0) // No host name information, so always filter out if hostname filter used. 
    and (isnull(starttime) or TimeGenerated >= starttime)
    and  (isnull(endtime) or TimeGenerated <= endtime)
    and  (isnull(dstportnumber) or dstportnumber == DestinationPort) 
    and  (array_length(srcipaddr_has_any_prefix)==0 or has_any_ipv4_prefix(SourceIP ,srcipaddr_has_any_prefix)) 
    and  (array_length(dstipaddr_has_any_prefix)==0 or has_any_ipv4_prefix(DestinationIP ,dstipaddr_has_any_prefix))
  | project-rename DvcOriginalAction = DeviceAction
  | lookup ActionLookup on DvcOriginalAction 
  | where array_length(dvcaction) == 0 or DvcAction in (dvcaction)
  | extend EventResult = iff (DvcOriginalAction == "Allow", "Success", "Failure") 
  | where (eventresult=='*' or EventResult == eventresult)
  // -- Event fields
  | extend 
    EventCount=DeviceCustomNumber1, 
    EventStartTime=TimeGenerated, 
    EventVendor = "Zscaler", 
    EventProduct = "ZIA Firewall", 
    EventSchema = "NetworkSession", 
    EventSchemaVersion="0.2.1", 
    EventType = 'NetworkSession', 
    EventSeverity = 'Informational',
    EventEndTime=TimeGenerated 
  | project-rename
    DvcHostname = Computer, 
    EventProductVersion = DeviceVersion, 
    NetworkProtocol = Protocol, 
    DstIpAddr = DestinationIP, 
    DstPortNumber = DestinationPort, 
    DstNatIpAddr = DestinationTranslatedAddress, 
    DstNatPortNumber = DestinationTranslatedPort, 
    DstAppName = DeviceCustomString3, 
    NetworkApplicationProtocol = DeviceCustomString2, 
    SrcIpAddr = SourceIP, 
    SrcPortNumber = SourcePort, 
    SrcUsername = SourceUserName,
    SrcNatIpAddr= SourceTranslatedAddress, 
    SrcNatPortNumber = SourceTranslatedPort, 
    SrcUserDepartment = DeviceCustomString1,  // Not in standard schema
    SrcUserLocation = SourceUserPrivileges,  // Not in standard schema
    NetworkDuration = DeviceCustomNumber1, 
    ThreatName = DeviceCustomString6, 
    ThreatCategory = DeviceCustomString5, 
    RuleName = Activity 
  // -- Calculated fields
  | extend
    ThreatCategory = iff(DeviceCustomString4 == "None", "", ThreatCategory),
    SrcUsername = iff (SrcUsername == SrcUserLocation, "", SrcUsername),
    DstBytes = tolong(ReceivedBytes), 
    SrcBytes = tolong(SentBytes)
  // -- Enrichment
  | extend
    DstAppType = "Service", 
    SrcUsernameType = "UPN" 
  // -- Aliases
  | extend
    Dvc = DvcHostname,
    User = SrcUsername,
    IpAddr = SrcIpAddr,
    Src = SrcIpAddr,
    Dst = DstIpAddr,
    Duration = NetworkDuration
  | project-away 
    DeviceCustom*
  };
  parser (starttime, endtime, srcipaddr_has_any_prefix, dstipaddr_has_any_prefix, dstportnumber, hostname_has_any, dvcaction, eventresult, disabled)