Parser:
  Title: Network Session ASIM parser for Cisco ISE
  Version: '1.0'
  LastUpdated: June 30, 2023
Product:
  Name: Cisco ISE
Normalization:
  Schema: NetworkSession
  Version: '0.2.6'
References:
  - Title: ASIM Network Session Schema
    Link: https://aka.ms/ASimNetworkSessionDoc
  - Title: ASIM
    Link: https://aka.ms/AboutASIM
  - Title: Organization Application Security Events 
    Link: https://www.cisco.com/c/en/us/td/docs/security/ise/3-2/admin_guide/b_ise_admin_3_2/b_ISE_admin_32_maintain_monitor.html#ID58
Description: |
  This ASIM parser supports normalizing Cisco ISE Events produced by the Microsoft Sentinel Cisco ISE connector to the ASIM Network Session normalized schema.
ParserName: vimNetworkSessionCiscoISE                                 
EquivalentBuiltInParser: _Im_NetworkSession_CiscoISE                                 
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: ipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstportnumber
    Type: int
    Default: int(null)
  - Name: hostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: dvcaction
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
    let EventName=datatable(EventOriginalType:string, EventResult:string, EventOriginalSeverity:string, EventSeverity:string, EventMessage:string, EventOriginalResultDetails:string)["25023","Success","INFO","Informational","LDAP connect to domain controller succeeded","LDAP connect to domain controller succeeded","25024","Failure","ERROR","Low","LDAP connect to domain controller failed","LDAP connect to domain controller failed","25025","Success","INFO","Informational","LDAP connect to global catalog succeeded","LDAP connect to domain controller succeeded","25026","Failure","ERROR","Low","LDAP connect to global catalog failed","LDAP connect to domain controller failed","25027","Success","INFO","Informational","RPC connect to domain controller succeeded","RPC connect to domain controller succeeded","25028","Failure","ERROR","Low","RPC connect to domain controller failed","RPC connect to domain controller failed","25029","Success","INFO","Informational","KDC connect to domain controller succeeded","KDC connect to domain controller succeeded","25030","Failure","ERROR","Low","KDC connect to domain controller failed","KDC connect to domain controller failed","25101","Success","DEBUG","Informational","Successfully connected to external REST ID store server","ISE successfully connect to external REST ID store server","25102","Failure","DEBUG","Low","Connection to external REST database failed","ISE failed to establish a new connection to external REST database","60188","Failure","INFO","Low","An attempted SSH connection has failed","An attempted SSH connection has failed","60234","Failure","ERROR","Low","The SXP connection has been disconnected","The SXP connection has been disconnected","60235","Success","INFO","Informational","SXP connection succeeded","SXP connection succeeded","60236","Failure","WARN","Low","SXP connection failed","SXP connection failed","61010","Success","INFO","Informational","ISE has established connection to APIC","ISE has established connection to APIC","61011","Success","INFO","Informational","ISE was disconnected from APIC","ISE was disconnected from APIC","61025","Success","INFO","Informational","Open secure connection with TLS peer","Secure connection established with TLS peer","61026","Success","INFO","Informational","Shutdown secure connection with TLS peer","Secure connection with TLS peer shutdown","60509","Failure","ERROR","Low","ERS request was denied as maximum possible connection was exceeded","ERS request was denied as maximum possible connection was exceeded","61231","Failure","WARN","Low","Kafka connection to ACI error while receiving message","Kafka connection to ACI error while receiving message","61232","Failure","WARN","Low","Kafka connection to ACI error while sending message","Kafka connection to ACI error while sending message","89003","Failure","WARN","Low","Failed to connect to MDM server","Failed to connect to MDM server","24000","Success","INFO","Informational","Connection established with LDAP server","Connection established with LDAP server","24001","Failure","ERROR","Low","Cannot establish connection with LDAP server","Cannot establish connection with LDAP server","24019","Failure","ERROR","Low","LDAP connection error was encountered","ISE cannot connect to LDAP external ID store","24030","Failure","ERROR","Low","SSL connection error was encountered","SSL connection error was encountered","24400","Success","INFO","Informational","Connection to ISE Active Directory agent established successfully","Connection to ISE Active Directory agent established successfully","24401","Failure","ERROR","Low","Could not establish connection with ISE Active Directory agent","Could not establish connection with ISE Active Directory agent","24428","Failure","ERROR","Low","Connection related error has occurred in either LRPC, LDAP or KERBEROS","This RPC connection problem may be because the stub received incorrect data","24429","Failure","ERROR","Low","Could not establish connection with Active Directory","Could not establish connection with Active Directory","24850","Success","DEBUG","Informational","Successfully connected to external ODBC database","ISE successfully established a new connection to external ODBC database","24851","Failure","DEBUG","Low","Connection to external ODBC database failed","ISE failed to establish a new connection to external ODBC database","34120","Failure","ERROR","Low","Profiler failed to get the connection to NAC Manager","Profiler sends a notification event to NAC Manager, but the notification fails because could not connect to NAC Manager","34147","Failure","WARN","Low","JGroups TLS Handshake Failed","JGroups TLS Handshake Failed","34148","Success","INFO","Informational","JGroups TLS Handshake Succeeded","JGroups TLS Handshake Succeeded","34149","Failure","WARN","Low","HTTPS TLS Handshake Failed","HTTPS TLS Handshake Failed","34150","Success","INFO","Informational","HTTPS TLS Handshake Succeeded","HTTPS TLS Handshake Succeeded","34159","Success","INFO","Informational","LDAPS connection established successfully","LDAPS connection established successfully","34160","Success","INFO","Informational","LDAPS connection terminated successfully","LDAPS connection terminated successfully","34161","Failure","WARN","Low","LDAPS connection establishment failed with SSL error","LDAPS connection establishment failed with SSL error","34162","Failure","WARN","Low","LDAPS connection terminated with SSL error","LDAPS connection terminated with SSL error","34163","Failure","WARN","Low","LDAPS connection establishment failed with non-SSL error","LDAPS connection establishment failed with non-SSL error","34164","Failure","WARN","Low","LDAPS connection terminated with non-SSL error","LDAPS connection terminated with non-SSL error","90062","Failure","ERROR","Low","Cannot connect to Domain Controller","Cannot connect to Domain Controller","90063","Success","INFO","Informational","Successfully establish connection to Domain Controller","Successfully establish connection to Domain Controller","90066","Failure","ERROR","Low","Lost connection with Domain Controller","Lost connection with Domain Controller","90078","Success","INFO","Informational","Closed connection to Domain Controller","Closed connection to Domain Controller","91082","Failure","WARN","Low","RADIUS DTLS: Connection to OCSP server failed","RADIUS DTLS: Connection attempt to OCSP server failed.","11317","Failure","WARN","Low","TrustSec SSH connection failed","ISE failed to establish SSH connection to a network device. Verify network device SSH credentials in the Network Device page are similar to the credentials configured on the network device. Check network device enabled ssh connections from ISE (ip address)","5405","Failure","NOTICE","Low","RADIUS Request dropped","RADIUS request dropped","5406","Failure","NOTICE","Low","TACACS+ Request dropped","TACACS+ request dropped"];
    let GetSrcIpAddr = (src_ip:string) {
      case ( 
          src_ip matches regex @"\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}", src_ip, ""
      )
    };
    let GetMacAddr = (mac:string) {
      case ( 
          mac matches regex @"[a-fA-F0-9\-:]{17}", mac, ""
      )
    };
    let CiscoISENSParser = (
        starttime:datetime=datetime(null), 
        endtime:datetime=datetime(null),
        srcipaddr_has_any_prefix:dynamic=dynamic([]), 
        dstipaddr_has_any_prefix:dynamic=dynamic([]), 
        ipaddr_has_any_prefix:dynamic=dynamic([]),
        dstportnumber:int=int(null), 
        hostname_has_any:dynamic=dynamic([]), 
        dvcaction:dynamic=dynamic([]), 
        eventresult:string='*', 
        disabled:bool=false){
        let src_or_any=set_union(srcipaddr_has_any_prefix, ipaddr_has_any_prefix); 
        let dst_or_any=set_union(dstipaddr_has_any_prefix, ipaddr_has_any_prefix);
        let ip_any = set_union(srcipaddr_has_any_prefix, dstipaddr_has_any_prefix, ipaddr_has_any_prefix); 
        Syslog
        | where not(disabled)
        | where ProcessName has_any ("CISE", "CSCO")
        | parse kind = regex SyslogMessage with @"\d{10}\s" EventOriginalType @"\s(NOTICE|INFO|WARN|WARNING|ERROR|FATAL|DEBUG)"
        //***************************** <Prefiltering> **************************
        | where (isnull(starttime) or TimeGenerated>=starttime) 
            and (isnull(endtime) or TimeGenerated<=endtime) 
            and not(disabled)
            and (array_length(hostname_has_any) == 0)
            and (array_length(dvcaction) == 0)
            and (EventOriginalType in ("25023","25024","25025","25026","25027","25028","25029","25030","25101","25102","60188","60234","60235","60236","61010","61011","61025","61026","60509","61231","61232","89003","24000","24001","24019","24030","24400","24401","24428","24429","24850","24851","34120","34147","34148","34149","34150","34159","34160","34161","34162","34163","34164","90062","90063","90066","90078","91082","11317","5405","5406"))
            and (array_length(ip_any)==0 or has_any_ipv4_prefix(SyslogMessage,ip_any)) 
            and (isnull(dstportnumber) or SyslogMessage has (strcat('DestinationPort=', tostring(dstportnumber))))
        | lookup EventName on EventOriginalType
        | where (eventresult == "*" or eventresult == EventResult)
        //**************************** </Prefilterring> **************************
        | parse-kv SyslogMessage as (FailureReason:string, NetworkDeviceName:string, DestinationIPAddress:string, DestinationPort:int, ['Remote-Address']:string, ['Device IP Address']:string, ['User-Name']:string, UserName:string, User:string, ['Device Port']:int, Protocol:string, ['Caller-Station-ID']:string, ['Called-Station-ID']:string) with (pair_delimiter=',', kv_delimiter='=')
      | project-rename DstIpAddr=DestinationIPAddress
                      , DstPortNumber=DestinationPort
                      , SrcPortNumber=['Device Port']
                      , NetworkApplicationProtocol=Protocol
      | invoke _ASIM_ResolveSrcFQDN("['Caller-Station-ID']")
      | extend 
              EventVendor = "Cisco"
              , EventProduct = "ISE"
              , EventProductVersion = "3.2"
              , EventCount = int(1)
              , EventSchema = "NetworkSession"
              , EventSchemaVersion = "0.2.6"
              , EventStartTime = coalesce(EventTime, TimeGenerated)
              , EventEndTime = coalesce(EventTime, TimeGenerated)
              , EventType = "NetworkSession"
              , EventOriginalResultDetails = case(isnotempty(FailureReason), FailureReason, EventOriginalResultDetails)
              , DvcIpAddr = extract(@"(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})", 1, Computer)
              , DstMacAddr = GetMacAddr(['Called-Station-ID'])
              , SrcMacAddr = GetMacAddr(['Caller-Station-ID'])
              , DstUsername = coalesce(UserName, ['User-Name'], User)
      | extend
              DstUsernameType = _ASIM_GetUsernameType(DstUsername)
              , DvcHostname = coalesce(NetworkDeviceName, Computer, HostName)
              , SrcIpAddr = coalesce(['Device IP Address'], ['Remote-Address'], GetSrcIpAddr(['Caller-Station-ID']))
      //********************** <Aliaces> ************************
      | extend 
          Dvc = coalesce(DvcHostname, DvcIpAddr)
          , IpAddr = SrcIpAddr
          , Dst = DstIpAddr
          , Src = SrcIpAddr
          , User = DstUsername
      //********************** </Aliases> ***********************
      | project-away TenantId, SourceSystem, MG, Computer, EventTime, Facility, HostName, SeverityLevel, SyslogMessage, HostIP, ProcessName, ProcessID, _ResourceId, FailureReason, NetworkDeviceName, ['User-Name'], UserName, User, ['Device IP Address'], ['Remote-Address'], ['Caller-Station-ID'], ['Called-Station-ID']
    };
    CiscoISENSParser(starttime=starttime, endtime=endtime, srcipaddr_has_any_prefix=srcipaddr_has_any_prefix, dstipaddr_has_any_prefix=dstipaddr_has_any_prefix, ipaddr_has_any_prefix=ipaddr_has_any_prefix, dstportnumber=dstportnumber, hostname_has_any=hostname_has_any, dvcaction=dvcaction, eventresult=eventresult, disabled=disabled)