{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Microsoft Defender for Office 365\n---\n"
      },
      "name": "text - 2"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "crossComponentResources": [
          "{Subscription}"
        ],
        "parameters": [
          {
            "id": "6e647d99-1a32-4bca-8147-403b5d37d773",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "isRequired": true,
            "value": "",
            "typeSettings": {
              "additionalResourceOptions": [],
              "includeAll": false,
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "timeContextFromParameter": "TimeRange"
          },
          {
            "id": "d57bcdf5-aec7-4f86-904c-67171864919b",
            "version": "KqlParameterItem/1.0",
            "name": "Workspace",
            "type": 5,
            "isRequired": true,
            "typeSettings": {
              "resourceTypeFilter": {
                "microsoft.operationalinsights/workspaces": true
              },
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "value": ""
          },
          {
            "id": "2e238f92-709c-410b-93e0-60eab6150a75",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "type": 4,
            "isRequired": true,
            "value": {
              "durationMs": 604800000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ],
              "allowCustom": true
            },
            "timeContext": {
              "durationMs": 86400000
            }
          }
        ],
        "style": "pills",
        "queryType": 1,
        "resourceType": "microsoft.resourcegraph/resources"
      },
      "name": "parameters - 1"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "title": "Summary- MDO threat count",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "let threatcount = EmailEvents\r\n| where isnotempty(ThreatTypes)\r\n| summarize Count = count()\r\n| extend Details = \"Email Events\";\r\nlet phishingcount = EmailEvents\r\n| where DetectionMethods has_any ('spoof','impersonation')\r\n| summarize Count= count()\r\n| extend Details = \"Phishing Emails\";\r\nlet emailposteliverycount = EmailPostDeliveryEvents \r\n|where ActionType =~ \"Phish ZAP\" or ActionType =~ \"Malware ZAP\"\r\n| summarize Count =count()\r\n| extend Details = \"ZAP Emails\";\r\nunion threatcount, phishingcount, emailposteliverycount\r\n| project Count, Details\r\n| order by Details asc",
              "size": 3,
              "title": "Total Threat count ",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIds",
              "exportParameterName": "NetworkMessageIdsDomain",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "tiles",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "Count",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "greenRed"
                    }
                  }
                ]
              },
              "tileSettings": {
                "titleContent": {
                  "columnMatch": "Details",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "Count",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                },
                "showBorder": false
              },
              "chartSettings": {
                "xAxis": "Count",
                "group": null,
                "createOtherGroup": 0
              },
              "mapSettings": {
                "locInfo": "LatLong",
                "sizeSettings": "Count",
                "sizeAggregation": "Sum",
                "legendMetric": "Count",
                "legendAggregation": "Sum",
                "itemColorSettings": {
                  "type": "heatmap",
                  "colorAggregation": "Sum",
                  "nodeColorField": "Count",
                  "heatmapPalette": "greenRed"
                }
              }
            },
            "customWidth": "100",
            "name": "query - 0 - Copy - Copy"
          }
        ]
      },
      "customWidth": "100",
      "name": "Summary - MDO threat count - Copy"
    },
    {
      "type": 11,
      "content": {
        "version": "LinkItem/1.0",
        "style": "tabs",
        "links": [
          {
            "id": "48578fe1-da47-4a4c-b495-ce7fe24ce495",
            "cellValue": "Nav",
            "linkTarget": "parameter",
            "linkLabel": "By Email",
            "subTarget": "Email",
            "style": "link"
          },
          {
            "id": "30e93159-8bf5-4006-820f-406ea10bcd17",
            "cellValue": "Nav",
            "linkTarget": "parameter",
            "linkLabel": "By Authentication",
            "subTarget": "Authentication",
            "style": "link"
          },
          {
            "id": "c40f76ed-94be-40ff-b65b-3fda306f2c3d",
            "cellValue": "Nav",
            "linkTarget": "parameter",
            "linkLabel": "By Url",
            "subTarget": "Url",
            "style": "link"
          }
        ]
      },
      "name": "links - 8"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents \r\n| where isnotempty(ThreatTypes) \r\n| summarize count() by ThreatTypes",
              "size": 1,
              "title": "Threat Type",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "EmailDirection",
              "exportParameterName": "Direction",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "categoricalbar",
              "tileSettings": {
                "showBorder": false,
                "titleContent": {
                  "columnMatch": "EmailDirection",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "Count",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                }
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isNotEqualTo",
              "value": "Authentication"
            },
            "name": "query - 5"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where ThreatTypes has \"Malware\" or ThreatTypes has \"Phish\" \r\n| summarize count() by RecipientEmailAddress \r\n| sort by count_  \r\n| take 15",
              "size": 1,
              "title": "Top Targeted users",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "DeliveryAction",
              "exportParameterName": "DeliveryAction",
              "exportDefaultValue": "All",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "table",
              "tileSettings": {
                "titleContent": {
                  "columnMatch": "DeliveryAction",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "Count",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                },
                "showBorder": false
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isNotEqualTo",
              "value": "Authentication"
            },
            "name": "query - 5 - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where DeliveryLocation =~ \"Inbox/folder\" \r\n| where isnotempty(ThreatTypes) and OrgLevelAction =~ \"Allow\" \r\n| count",
              "size": 1,
              "title": "Malicious Emails Allowed due to Admin overrides",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "EmailAction",
              "exportParameterName": "Action",
              "exportDefaultValue": "All",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "tiles",
              "tileSettings": {
                "titleContent": {
                  "columnMatch": "DeliveryAction",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "Count",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                },
                "showBorder": false
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isNotEqualTo",
              "value": "Authentication"
            },
            "name": "query - 5 - Copy - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| summarize count()by DeliveryLocation",
              "size": 0,
              "title": "Original Email Delivery Location count",
              "timeContextFromParameter": "TimeRange",
              "exportedParameters": [
                {
                  "fieldName": "SenderMailFromAddress",
                  "parameterName": "Sender2",
                  "defaultValue": "All"
                },
                {
                  "fieldName": "NetworkMessageIds",
                  "parameterName": "NetworkMessageIdsSender",
                  "parameterType": 1,
                  "defaultValue": "[]"
                }
              ],
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "SenderMailFromAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "29ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctMessages",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "20ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctRecipients",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "21ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctRecipientDomains",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "27ch"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isNotEqualTo",
              "value": "Authentication"
            },
            "name": "query - 0"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where isnotempty(ThreatTypes) \r\n| summarize count() by SenderFromDomain \r\n| sort by count_  \r\n| take 15",
              "size": 0,
              "title": "Top Sender Domains for Malicious Emails",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIds",
              "exportParameterName": "NetworkMessageIdsRecipient",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "RecipientEmailAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "28ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctMessages",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "143px"
                    }
                  },
                  {
                    "columnMatch": "DistinctSenders",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "140px"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isNotEqualTo",
              "value": "Authentication"
            },
            "name": "query - 0 - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n//|where Timestamp > ago(30d)  \r\n| where isnotempty(ThreatNames) \r\n| summarize count() by ThreatNames \r\n| sort by count_ ",
              "size": 0,
              "showAnalytics": true,
              "title": "Top Malware families",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageId",
              "exportParameterName": "NetworkMessageId",
              "exportDefaultValue": "None",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "table",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "SenderMailFromAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "30ch"
                    }
                  },
                  {
                    "columnMatch": "RecipientEmailAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "30ch"
                    }
                  },
                  {
                    "columnMatch": "Subject",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "35ch"
                    }
                  },
                  {
                    "columnMatch": "EmailDirection",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "==",
                          "thresholdValue": "Outbound",
                          "representation": "right",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Inbound",
                          "representation": "left",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Intra-org",
                          "representation": "Pending",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "unknown",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "DeliveryAction",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "==",
                          "thresholdValue": "Delivered",
                          "representation": "success",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Blocked",
                          "representation": "failed",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Junked",
                          "representation": "Disable",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "unknown",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "ConfidenceLevel",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25ch"
                    }
                  },
                  {
                    "columnMatch": "AttachmentCount",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue"
                    }
                  },
                  {
                    "columnMatch": "UrlCount",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageId",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isEqualTo",
              "value": "Authentication"
            },
            "name": "query - 6"
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Nav",
        "comparison": "isEqualTo",
        "value": "Email"
      },
      "name": "EmailGroup"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents \r\n| project Timestamp, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, SenderFromAddress, ThreatTypes, DetectionMethods   \r\n| evaluate bag_unpack(AR) \r\n| where column_ifexists('DMARC','') =~ \"fail\" \r\n| summarize count() by bin(Timestamp, 1d) ",
              "size": 0,
              "title": "DMARC failure by time",
              "timeContextFromParameter": "TimeRange",
              "exportedParameters": [
                {
                  "fieldName": "SenderMailFromAddress",
                  "parameterName": "Sender2",
                  "defaultValue": "All"
                },
                {
                  "fieldName": "NetworkMessageIds",
                  "parameterName": "NetworkMessageIdsSender",
                  "parameterType": 1,
                  "defaultValue": "[]"
                }
              ],
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "timechart",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "SenderMailFromAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "27ch"
                    }
                  },
                  {
                    "columnMatch": "TotalAttachments",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "150px"
                    }
                  },
                  {
                    "columnMatch": "DistinctRecipients",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "21ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctRecipientDomains",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "27ch"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              },
              "graphSettings": {
                "type": 0
              }
            },
            "customWidth": "50",
            "name": "query - 0 - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| project Timestamp, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, SenderFromAddress, ThreatTypes, DetectionMethods   \r\n| evaluate bag_unpack(AR) \r\n| where column_ifexists('DKIM','') =~ \"fail\" \r\n| summarize count() by bin(Timestamp, 1d)",
              "size": 0,
              "title": "DKIM Failure Trend",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIds",
              "exportParameterName": "NetworkMessageIdsRecipient",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "timechart",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "RecipientEmailAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "28ch"
                    }
                  },
                  {
                    "columnMatch": "TotalAttachments",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "20ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctSenders",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "140px"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "query - 0 - Copy - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| project Timestamp, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, SenderFromAddress, ThreatTypes, DetectionMethods   \r\n| evaluate bag_unpack(AR) \r\n| where column_ifexists('SPF','') =~ \"fail\" \r\n| summarize count() by bin(Timestamp, 1d)",
              "size": 0,
              "title": "SPF Fail Trend",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIds",
              "exportParameterName": "NetworkMessageIdsDomain",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "timechart",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "RecipientDomain",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25.8571ch"
                    }
                  },
                  {
                    "columnMatch": "TotalAttachments",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "22ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctSenders",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "140px"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "query - 0 - Copy - Copy - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| project Timestamp, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, SenderFromAddress, ThreatTypes, DetectionMethods   \r\n| evaluate bag_unpack(AR) \r\n| where column_ifexists('CompAuth','') =~ \"fail\" \r\n| summarize count() by bin(Timestamp, 1d) ",
              "size": 0,
              "title": "CompAuth Fail trend",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIds",
              "exportParameterName": "NetworkMessageIdsDomain",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "timechart",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "RecipientDomain",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25.8571ch"
                    }
                  },
                  {
                    "columnMatch": "TotalAttachments",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "22ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctSenders",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "140px"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "query - 0 - Copy - Copy - Copy - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where OrgLevelPolicy!=\"\" and OrgLevelAction =~ \"Allow\" \r\n| summarize count() by OrgLevelPolicy ",
              "size": 0,
              "showAnalytics": true,
              "title": "Top policies for Admin overrides (Allow) ",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIdWithFile",
              "exportParameterName": "NetworkMessageIdWithFile",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "table",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "NetworkMessageIdWithFile",
                    "formatter": 5
                  }
                ]
              },
              "sortBy": [],
              "tileSettings": {
                "showBorder": false,
                "titleContent": {
                  "columnMatch": "FileName",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "UniqueEmailsWithThisAttachment",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                }
              }
            },
            "customWidth": "50",
            "name": "query - 0"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "EmailEvents\r\n| where OrgLevelPolicy!=\"\" and OrgLevelAction =~ \"Block\" \r\n| summarize count() by OrgLevelPolicy ",
              "size": 0,
              "showAnalytics": true,
              "title": "Top policies for Admin overrides (Block) ",
              "noDataMessage": "No file attachments were selected",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageId",
              "exportParameterName": "NetworkMessageId",
              "exportDefaultValue": "None",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "SenderMailFromAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "30ch"
                    }
                  },
                  {
                    "columnMatch": "RecipientEmailAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "30ch"
                    }
                  },
                  {
                    "columnMatch": "Subject",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "35ch"
                    }
                  },
                  {
                    "columnMatch": "EmailDirection",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "==",
                          "thresholdValue": "Outbound",
                          "representation": "right",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Inbound",
                          "representation": "left",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Intra-org",
                          "representation": "Pending",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "unknown",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "DeliveryAction",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "icons",
                      "thresholdsGrid": [
                        {
                          "operator": "==",
                          "thresholdValue": "Delivered",
                          "representation": "success",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Blocked",
                          "representation": "failed",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "==",
                          "thresholdValue": "Junked",
                          "representation": "Disable",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "thresholdValue": null,
                          "representation": "unknown",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "ConfidenceLevel",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "25ch"
                    }
                  },
                  {
                    "columnMatch": "AttachmentCount",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue"
                    }
                  },
                  {
                    "columnMatch": "UrlCount",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageId",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "name": "query - 6 - Copy"
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Nav",
        "comparison": "isEqualTo",
        "value": "Authentication"
      },
      "name": "AuthenticationGroup"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "UrlClickEvents\r\n| where ActionType == \"ClickAllowed\" or IsClickedThrough !=\"0\" \r\n| where isnotempty(ThreatTypes) \r\n| summarize count() by bin (Timestamp,1d) ",
              "size": 0,
              "title": "URL Allowed clicks for Malicious clicks",
              "timeContextFromParameter": "TimeRange",
              "exportedParameters": [
                {
                  "fieldName": "SenderMailFromAddress",
                  "parameterName": "Sender2",
                  "defaultValue": "All"
                },
                {
                  "fieldName": "NetworkMessageIds",
                  "parameterName": "NetworkMessageIdsSender",
                  "parameterType": 1,
                  "defaultValue": "[]"
                }
              ],
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "timechart",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "SenderMailFromAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "27ch"
                    }
                  },
                  {
                    "columnMatch": "TotalUrls",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue"
                    }
                  },
                  {
                    "columnMatch": "DistinctRecipients",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "21ch"
                    }
                  },
                  {
                    "columnMatch": "DistinctRecipientDomains",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "27ch"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isEqualTo",
              "value": "Url"
            },
            "name": "query - 0 - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "UrlClickEvents \r\n| where isnotempty(ThreatTypes) \r\n| summarize count() by Workload ",
              "size": 0,
              "title": "Malicious Click by Workload ",
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "NetworkMessageIds",
              "exportParameterName": "NetworkMessageIdsRecipient",
              "exportDefaultValue": "[]",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "table",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "RecipientEmailAddress",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "28ch"
                    }
                  },
                  {
                    "columnMatch": "TotalUrls",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue"
                    }
                  },
                  {
                    "columnMatch": "DistinctSenders",
                    "formatter": 4,
                    "formatOptions": {
                      "palette": "blue",
                      "customColumnWidthSetting": "140px"
                    }
                  },
                  {
                    "columnMatch": "NetworkMessageIds",
                    "formatter": 5
                  }
                ]
              }
            },
            "customWidth": "50",
            "conditionalVisibility": {
              "parameterName": "Nav",
              "comparison": "isEqualTo",
              "value": "Url"
            },
            "name": "query - 0 - Copy - Copy"
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Nav",
        "comparison": "isEqualTo",
        "value": "Url"
      },
      "name": "UrlGroup"
    }
  ],
  "fromTemplateId": "sentinel-MDOWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}