id: abf42310-51c7-4d7f-98d2-e5af09859aab
name: Doppelpaymer Stop Services
description: |
  This query searches for attempts to stop security services, which is a common tactic used by DoppelPaymer ransomware operators.
description-detailed: |
  This query was originally published in the threat analytics report, Doppelpaymer: More human-operated ransomware. There is also a related blog.
  DoppelPaymer is ransomware that is spread manually by human operators. These operators have exhibited extensive knowledge of system administration and common network security misconfigurations. They often use stolen credentials from over-privileged service accounts to turn off security software, run malicious commands, and spread malware throughout an organization.
  The following query detects attempts to stop security services.
  The See also section below lists links to other queries associated with DoppelPaymer.
  References:
  https://msrc-blog.microsoft.com/2019/11/20/customer-guidance-for-the-dopplepaymer-ransomware/
  https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/DoppelPaymer!MTB&threatId=-2147205372
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - Execution
  - DefenseEvasion
query: |
  // Attempts to stop services and allow ransomware execution
  DeviceProcessEvents
  | where TimeGenerated > ago(7d)
  | where InitiatingProcessFileName startswith "psexe" and FileName =~ "powershell.exe" and
  ProcessCommandLine has "stop-service"
  and ProcessCommandLine has "sql" and ProcessCommandLine has "msexchange"
version: 1.0.0