id: bc2d8214-afb6-4876-b210-25b69325b9b2
name: Hunt for TABL changes
description: |
  This query helps hunting for Tenant allow/block list (TABL) changes in MDO
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
- Defense evasion
query: |
  CloudAppEvents
  | where ActionType contains "TenantAllowBlockListItems"
  | order by Timestamp desc