id: 81ede5df-2ec3-40a5-9dff-1fe6a841079d
name: Mail item accessed
description: |
  This query helps reviewing emails accessed by end users using cloud app events data
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - Initial access
query: |
  CloudAppEvents
  | where Timestamp > ago(30d)
  | extend Record= (parse_json(RawEventData)).RecordType
  | where Record == 50
  | take 10
