id: 63c799bc-7567-4e4d-97be-e143fcfaa333
name: Malicious email senders
description: |
  This query helps reviewing emails from sender with atleast one email in quarantine
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  let SenderWithQuarantine = EmailEvents
  | where LatestDeliveryLocation == "Quarantine"
  | project SenderFromAddress;
  EmailEvents
  | where LatestDeliveryLocation == "Inbox/folder"
  | where SenderFromAddress in (SenderWithQuarantine)
