id: 6f606826-b995-4a8d-8c2c-ee08e3d1194a
name: Top 10 External Senders
description: |
  Identifies the top 10 external email senders to your organization.
description-detailed: |
  This query lists the top 10 external senders of inbound emails, helping to identify frequently communicating external sources.
  By default, results are limited to the top 10 senders; remove or adjust the limit to see all results, or change the number for a different top N (e.g., Top 5).
  Update the domain exclusion filter to match your organization's internal email domain.
  Part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
    - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  EmailEvents
  | where Timestamp between (TimeStart .. TimeEnd)
  | where EmailDirection == "Inbound"
  | where SenderFromDomain !endswith "yourcompany.com"  // Replace with your internal domain
  | summarize SentCount = count() by Sender = SenderFromAddress
  | sort by SentCount desc
  | top 10 by SentCount  // Remove or adjust this line to see all senders or change the number for a different top N (e.g., Top 5)
//| render columnchart  // Compare senders
//| render piechart  // Proportional breakdown
version: 1.0.0
