{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    },
    "location": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "ASimDnszScalerZIA",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "zScaler ZIA DNS",
            "category": "Security",
            "FunctionAlias": "ASimDnszScalerZIA",
            "query": "let zScalerDNSevents=(disabled:bool=false){\n  CommonSecurityLog \n  | where not(disabled)\n  | where DeviceProduct == \"NSSDNSlog\" \n  | project-rename\n      Dvc=Computer , \n      SrcIpAddr = SourceIP, \n      SrcUsername = SourceUserName, \n      DstIpAddr = DestinationIP, \n      DstPortNumber = DestinationPort,  \n      EventProductVersion = DeviceVersion, \n      DnsQueryTypeName = DeviceCustomString4,  \n      DnsQuery = DeviceCustomString5, \n      DnsNetworkDuration = DeviceCustomNumber1,  \n      SrcUserDepartment = DeviceCustomString1, // Not part of the standard schema\n      reqaction = DeviceCustomString2, \n      resaction = DeviceCustomString3, \n      DvcUsername = SourceUserID,\n      DvcZone = SourceUserPrivileges,\n      SrcHostname = DeviceName\n  | extend\n      EventCount=int(1), \n      EventStartTime=TimeGenerated,  \n      EventVendor = \"zScaler\", \n      EventProduct = \"ZIA DNS\", \n      EventSchema = \"Dns\", \n      EventSchemaVersion=\"0.1.3\", \n      EventEndTime=TimeGenerated, \n      SrcUsernameType = \"Upn\", \n      SrcHostnameType = \"Simple\",\n      EventSubType = iff(resaction == 'None', 'request', 'response'),  \n      DvcAction = iff(resaction == 'None', reqaction, resaction), \n      EventResultDetails = iff (DeviceCustomString6 matches regex '^\\\\d', 'NOERROR', DeviceCustomString6),  \n      EventType = 'Query', \n      UrlCategory = extract(\"cat=(.*)\", 1, AdditionalExtensions),  \n      DnsRuleName = strcat (FlexString1, \" / \", FlexString2) \n    | extend \n      EventResult = case (\n        EventSubType == 'request', 'NA', \n        EventResultDetails == 'NOERROR', 'Success',\n        'Failure'),\n      DnsResponseName = iff (EventResultDetails == 'NOERROR', DeviceCustomString6, '')\n  // -- Aliases\n  | extend\n      DnsResponseCodeName = EventResultDetails,\n      Domain = DnsQuery,\n      IpAddr = SrcIpAddr,\n      Src = SrcIpAddr,\n      Dst = DstIpAddr,\n      DvcHostname = Dvc,\n      Duration = DnsNetworkDuration,\n      User = SrcUsername\n  // -- Backward Compatibility\n  | extend\n      Query=DnsQuery, \n      QueryTypeName=DnsQueryTypeName, \n      ResponseName=DnsResponseName, \n      ResponseCodeName=DnsResponseCodeName\n  };\nzScalerDNSevents (disabled)",
            "version": 1,
            "functionParameters": "disabled:bool=False"
          }
        }
      ]
    }
  ]
}