Parser:
  Title: Microsoft DNS
  Version: '0.0'
  LastUpdated: May 10, 2021
Product:
  Name: MS DNS Events
Normalization:
  Schema: DnsEvents
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  TODO
ParserName: vimDnsMicrosoft
ParserQuery: |
  let RCodes=(s:int){
    case(s==0, "NoError"
    , isnull(s),'-'
    , s==1, "FormErr"
    , s==2,"ServFail"
    , s==3,'NXDomain'
    , s==4,'NotImp'
    , s==5,'Refused'
    , s==6,'YXDomain'
    , s==7,'YXRRSet'
    , s==8,'NXRRSet'
    , s==9,'NotAuth'
    , s==10,'NotZone'
    , s==11,'DSOTYPENI'
    , s==12-15,'Unassigned'
    , s==16,'BADVERS'
    , s==16,'BADSIG'
    , s==17,'BADKEY'
    , s==18,'BADTIME'
    , s==19,'BADMODE'
    , s==20,'BADNAME'
    , s==21,'BADALG'
    , s==22,'BADTRUNC'
    , s==23,'BADCOOKIE'
    , s < 3840,'Unassigned'
    , s < 4095,'Reserved for Private Use'
    , s < 65534,'Unassigned'
    , s < 65535,'Reserved'
    , 'Unkown')
  };
  let DNSQuery_MS=(){
    DnsEvents
  | project-rename
         Dvc=Computer ,
         EventResult = Result, 
         SrcIpAddr = ClientIP,
         QueryTypeName=QueryType,
         EventMessage = Message,
         EventReportUrl = ReportReferenceLink,
         ResponseName = IPAddresses,
         Query = Name,
         ResponseCode = ResultCode
  | extend 
  // ******************* Mandatory
         EventCount=int(1),
         EventStartTime=TimeGenerated,
         EventVendor = "Microsoft",
         EventProduct = "Microsoft DNS Server",
         EventSchemaVersion="0.0.1",
         EventResultDetails = RCodes(ResponseCode),  
         //
         EventEndTime=TimeGenerated,
         EventSubType='response', 
         EventSeverity = tostring(Severity),
         EventType = case(SubType=='LookupQuery','lookup','other'),
         DvcHostname = Dvc
      // **************Aliases
    | extend 
        ResponseCodeName=EventResultDetails, 
        Domain=Query,
        IpAddr=SrcIpAddr
        };
  MSDNSEvents
