// Name: DNS Domains linked to WannaCry ransomware campaign
//
// Id: aaf84b80-7764-420c-98eb-239b5e194b3d
//
// Description: Displays client DNS request for any of the known domains linked to #WannaCry.
// These results may indicate #Wannacry / #Wannacrypt ransomware infection.
// Domain listing from https://pastebin.com/cRUii32E
//
// DataSource: #DnsEvents
//
// Tactics: #InitialAccess, #Execution
//
DnsEvents
| where Name in (
"agrdwrtj.us", "bctxawdt.us", "cokfqwjmferc.us", 
"cxbenjiikmhjcerbj.us", "depuisgef.us", "edoknehyvbl.us", 
"enyeikruptiukjorq.com", "frullndjtkojlu.us", "gcidpiuvamynj.us", 
"gxrytjoclpvv.us", "hanoluexjqcf.us", "iarirjjrnuornts.us", 
"ifbjoosjqhaeqjjwaerri.us", "iouenviwrc.us", "kuuelejkfwk.us", 
"lkbsxkitgxttgaobxu.us", "nnnlafqfnrbynwor.us", "ns768.com", 
"ofdwcjnko.us", "peuwdchnvn.us", "pvbeqjbqrslnkmashlsxb.us", 
"pxyhybnyv.us", "qkkftmpy.us", "rkhlkmpfpoqxmlqmkf.us", 
"ryitsfeogisr.us", "srwcjdfrtnhnjekjerl.us", "thstlufnunxaksr.us", 
"udrgtaxgdyv.us", "w5q7spejg96n.com", "xmqlcikldft.us", 
"yobvyjmjbsgdfqnh.us", "yrwgugricfklb.us", "ywpvqhlqnssecpdemq.us" )
| summarize count() by Computer, ClientIP, WannaCrypt_Related_Domain = Name
| extend HostCustomEntity = Computer, IPCustomEntity = ClientIP
