// Name: Long DNS Query
// Description: Length of DNS query can often be an indicator of suspicious activity. Regular domain names lengths are not too large whereas domain name query used for data exfiltration or tunneling can often be very large in size. 
// This is because they could be encoded using base 64/32 etc. The hunting query looks for Names that are more than 200 characters in length. Having said that there are also a lot of reputation feeds and some services 
// like Spotify which used the DNS protocol to send information to external servers . Would need to whitelist these benign services in your environment.
//
// Id: a0954a17-cc66-4d47-9651-8bf524bbdcc8
//
// DataSource: #DNSEvent
//
// Tactics: #C2 , #Exfiltration
//
let LocalDomains = 
(
DnsEvents | where TimeGenerated >= ago(1d)
| summarize count() by Computer 
| extend SubDomain = tolower(strcat(tostring(split(Computer, ".")[-2]),".", tostring(split(Computer, ".")[-1])))
| distinct SubDomain
);
let DomainLookups =
(
DnsEvents | where TimeGenerated >= ago(1d)
| where SubType == "LookupQuery"
| where ClientIP != "127.0.0.1" 
| where Name !endswith ".local" and Name !startswith "_" and Name !startswith "#"
| where Name !has "cnr.io" and Name !has "kr0.io" and Name !has "arcticwolf.net" and Name !has "webcfs00.com" and Name !has "barracudabrts.com"and Name !has "trendmicro.com" 
and Name !has "sophosxl.net" and Name !has "spotify.com" and Name !has "e5.sk" and Name !has "mcafee.com" and Name !has "opendns.com"  and Name !has "spameatingmonkey.net" 
and Name !has "_ldap" and Name !has "_kerberos" and Name !has "modsecurity.org" and Name !has "fdmarc.net" and Name !has "ipass.com" and Name !has "wpad"
and Name !has "cnr.io" and Name !has "trendmicro.com" and Name !has "sophosxl.net" and Name !has "spotify.com" and Name !has "e5.sk" and Name !has "mcafee.com" 
and Name !has "opendns.com"  and Name !has "spameatingmonkey.net" and Name !has "_ldap" and Name !has "_kerberos" and Name !has "modsecurity.org" and Name !has "fdmarc.net" 
and Name !has "ipass.com" and Name !has "wpad"
| where Name !contains "::1"
| extend Name = tolower(Name)
| extend Urilength = strlen(Name) 
| where Urilength >= 150
| extend SubDomain = case(
isempty(Name), Name,
array_length(split(Name, ".")) <= 2, Name,
tostring(split(Name, ".")[-2]) == "corp", strcat(tostring(split(Name, ".")[-3]),".",tostring(split(Name, ".")[-2]),".", tostring(split(Name, ".")[-1])),
strlen(tostring(split(Name, ".")[-1])) == 2, strcat(tostring(split(Name, ".")[-3]),".",tostring(split(Name, ".")[-2]),".", tostring(split(Name, ".")[-1])),
strlen(tostring(split(Name, ".")[-2])) != "corp", strcat(tostring(split(Name, ".")[-2]),".", tostring(split(Name, ".")[-1])),
Name))
;
DomainLookups
| join kind= leftanti (
    LocalDomains
) on SubDomain 
| summarize by TimeGenerated, Computer, ClientIP , Name, Urilength
| extend IPCustomEntity = ClientIP
| extend HostCustomEntity = Computer
