// Name: DNS high reverse DNS count
// Id: fda90754-4e22-4bb1-8b99-2bb49a991eae
// 
// Description: clients with a high reverse DNS count could be carrying out scanning activity.
//
// DataSource: #DnsEvents
//
// Tactics: #Discovery
//
DnsEvents 
| where TimeGenerated >= ago(1d)
| where Name contains "in-addr.arpa" 
| summarize dcount(Name) by ClientIP
| where dcount_Name >10
| project ClientIP , dcount_Name 
| extend IPCustomEntity = ClientIP
