{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Zscaler Admin Audit Overview"
      },
      "name": "text - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSAuditlog\"\n| where SourceUserName !=\"\"\n| summarize Count = count() by SourceUserName, SourceIP\n| order by Count desc",
        "size": 0,
        "title": "Access attempts by account name and IP address",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSAuditlog\"\n| where EventOutcome !=\"\"\n| summarize Count = count() by EventOutcome\n| order by Count desc",
        "size": 0,
        "title": "Login success and failures",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "piechart",
        "graphSettings": {
          "type": 0,
          "topContent": {
            "columnMatch": "EventOutcome",
            "formatter": 1
          },
          "centerContent": {
            "columnMatch": "Count",
            "formatter": 1,
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          }
        },
        "mapSettings": {
          "locInfo": "LatLong",
          "sizeSettings": "Count",
          "sizeAggregation": "Sum",
          "legendMetric": "Count",
          "legendAggregation": "Sum",
          "itemColorSettings": {
            "type": "heatmap",
            "colorAggregation": "Sum",
            "nodeColorField": "Count",
            "heatmapPalette": "greenRed"
          }
        }
      },
      "name": "query - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSAuditlog\"\n| where DeviceEventClassID !=\"\"\n| summarize Count = count() by DeviceEventClassID\n| order by Count desc",
        "size": 0,
        "title": "Action carried out by user",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "unstackedbar"
      },
      "name": "query - 2"
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/<your subscription id>/resourcegroups/<your log analytics resource group>/providers/microsoft.operationalinsights/workspaces/<your log analytics workspace name>"
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}