{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Zscaler CASB Activity Overview"
      },
      "name": "text - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSCasbactivitylog\"\n| extend EventTimestamp = todatetime(TimeGenerated)\n| summarize EventCount = count() by bin(EventTimestamp, 1h), DeviceEventClassID\n| render timechart",
        "size": 0,
        "title": "CASB Event Trend Analysis by Type Over Time",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSCasbactivitylog\"\n| summarize EventCount = count() by SourceIP\n| order by EventCount desc \n| render piechart",
        "size": 0,
        "title": "CASB Distribution of Events by Source IP",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSCasbactivitylog\"\n| project EventTimestamp = todatetime(TimeGenerated), User = SourceUserName, Action = DeviceAction, SourceIP\n| sort by EventTimestamp desc \n| render table",
        "size": 0,
        "title": "CASB Detailed Log Entries for Security Events",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 2"
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}