{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Zscaler CASB CRM Overview"
      },
      "name": "text - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSCasbcrmlog\"\n| summarize EventCount = count() by DeviceEventClassID\n| render columnchart",
        "size": 0,
        "title": "Count of CASB CRM Events by Application",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSCasbcrmlog\"\n| extend EventTimestamp = todatetime(TimeGenerated)\n| summarize EventCount = count() by bin(EventTimestamp, 1h)\n| render timechart",
        "size": 0,
        "title": "CASB CRM Events Over Time",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSCasbcrmlog\"\n| project EventTimestamp = todatetime(TimeGenerated), User = SourceUserName, Action = DeviceAction, Identifier = DeviceCustomString1\n| sort by EventTimestamp desc \n| render table",
        "size": 0,
        "title": "CASB CRM Detailed Security Event Information",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 2"
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}