{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Zscaler DNS Overview"
      },
      "name": "text - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSDNSlog\"\n| extend EventTimestamp = todatetime(TimeGenerated)\n| summarize CountByTime = count() by bin(EventTimestamp, 1h), DeviceEventClassID\n| render timechart ",
        "size": 0,
        "title": "DNS Events Over Time",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSDNSlog\"\n| project EventTimestamp = todatetime(TimeGenerated), SourceIP, DestinationIP, DestinationPort, Action = DeviceAction, Severity = LogSeverity, UserName = SourceUserName, EventType = DeviceEventClassID\n| sort by EventTimestamp desc \n| render table",
        "size": 0,
        "title": "DNS Event Details by Source and Destination",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Zscaler\"\n| where DeviceProduct == \"NSSDNSlog\"\n| summarize EventCount = count() by DeviceName\n| render barchart",
        "size": 0,
        "title": "Distribution of DNS Events by Device",
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 2"
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}