id: 853bacff-45cf-42f2-b2a6-6727fcf183ef
name: Suspicious Image Load related to IcedId
description: |
  This query searches for suspicious load image events by rundll32.exe or regsvr32.exe, a behavior associated with IcedId, which can lead to IcedId ransomware.
description-detailed: |
  This query searches for suspicious load image events by rundll32.exe or regsvr32.exe, a behavior associated with IcedId, which can lead to IcedId ransomware.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceImageLoadEvents
tactics:
  - Execution
  - DefenseEvasion
query: |
  DeviceImageLoadEvents 
  | where InitiatingProcessFileName in~ ('rundll32.exe','regsvr32.exe') 
  | where FileName endswith '.txt' or FileName endswith '.pdf'
version: 1.0.0
  