id: 9674f529-f0e9-4305-862d-479ccc9e28f1
name: Turning off services using sc exe
description: |
  This query checks for attempts to turn off at least 10 existing services using sc.exe.
description-detailed: |
  This query checks for attempts to turn off at least 10 existing services using sc.exe. This is a common technique used by ransomware to stop security products and other processes.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - DefenseEvasion
query: |
  // Look for sc.exe disabling services
  DeviceProcessEvents
  | where TimeGenerated > ago(1d)
  | where ProcessCommandLine has "sc" and ProcessCommandLine has "config" and ProcessCommandLine has "disabled"
  | summarize ScDisableCount = dcount(ProcessCommandLine), ScDisableList = make_set(ProcessCommandLine) by DeviceId, bin(TimeGenerated, 5m)
  | where ScDisableCount > 10
version: 1.0.0