{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentParameters.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "location": {
            "value": "eastus" 
        },
        "workspaceName": {
            "value": "<Enter Log Analytics Workspace name>"
        },
        "ruleDescription": {
            "value": "<The description of the alert rule>" 
        },
        "query": {
            "value": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"<The query that creates alerts for this rule>" 
        },
        "queryFrequency": {
            "value": "PT1H"
        },
        "queryPeriod": {
            "value": "P2DT1H30M" 
        },
        "severity": {
            "value": "Medium" 
        },
        "suppressionDuration": {
            "value": "PT1H" 
        },
        "suppressionEnabled": {
            "value": false 
        },
        "tactics": {
            "value": ["LateralMovement", "Persistence", "Collection"]
        },
        "triggerOperator": {
            "value": "GreaterThan" 
        },
        "triggerThreshold": {
            "value": 5 
        },
        "ruleDisplayName": {
            "value": "<Enter rule name>"
        },
        "ruleId": {
            "value": "<unique string for the connector>" 
        }
    }
}