{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "author": "Nikhil Tripathi - v-ntripathi@microsoft.com",
    "comments": "Solution template for AristaAwakeSecurity"
  },
  "parameters": {
    "location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
      }
    },
    "workspace-location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[parameters('location')]",
      "metadata": {
        "description": "Region to deploy solution resources"
      }
    },
    "workspace": {
      "defaultValue": "",
      "type": "string",
      "metadata": {
        "description": "Workspace name for Log Analytics where Sentinel is setup"
      }
    },
    "connector1-name": {
      "type": "string",
      "defaultValue": "62099812-4edb-4aaf-8a70-87b6bc93f419"
    },
    "analytic1-id": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "minLength": 1,
      "metadata": {
        "description": "Unique id for the scheduled alert rule"
      }
    },
    "analytic2-id": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "minLength": 1,
      "metadata": {
        "description": "Unique id for the scheduled alert rule"
      }
    },
    "analytic3-id": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "minLength": 1,
      "metadata": {
        "description": "Unique id for the scheduled alert rule"
      }
    },
    "formattedTimeNow": {
      "type": "string",
      "defaultValue": "[utcNow('g')]",
      "metadata": {
        "description": "Appended to workbook displayNames to make them unique"
      }
    },
    "workbook1-id": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "minLength": 1,
      "metadata": {
        "description": "Unique id for the workbook"
      }
    },
    "workbook1-name": {
      "type": "string",
      "defaultValue": "AristaAwakeSecurity",
      "minLength": 1,
      "metadata": {
        "description": "Name for the workbook"
      }
    }
  },
  "variables": {
    "connector1-source": "[concat('/subscriptions/',subscription().subscriptionId,'/resourceGroups/',resourceGroup().name,'/providers/Microsoft.OperationalInsights/workspaces/',parameters('workspace'),'/providers/Microsoft.SecurityInsights/dataConnectors/',parameters('connector1-name'))]",
    "_connector1-source": "[variables('connector1-source')]",
    "AristaAwakeSecurityConnector": "AristaAwakeSecurityConnector",
    "_AristaAwakeSecurityConnector": "[variables('AristaAwakeSecurityConnector')]",
    "HighMatchCountsByDevice_AnalyticalRules": "HighMatchCountsByDevice_AnalyticalRules",
    "_HighMatchCountsByDevice_AnalyticalRules": "[variables('HighMatchCountsByDevice_AnalyticalRules')]",
    "HighSeverityMatchesByDevice_AnalyticalRules": "HighSeverityMatchesByDevice_AnalyticalRules",
    "_HighSeverityMatchesByDevice_AnalyticalRules": "[variables('HighSeverityMatchesByDevice_AnalyticalRules')]",
    "ModelMatchesWithMultipleDestinationsByDevice_AnalyticalRules": "ModelMatchesWithMultipleDestinationsByDevice_AnalyticalRules",
    "_ModelMatchesWithMultipleDestinationsByDevice_AnalyticalRules": "[variables('ModelMatchesWithMultipleDestinationsByDevice_AnalyticalRules')]",
    "AristaAwakeSecurityWorkbook_workbook": "AristaAwakeSecurityWorkbook_workbook",
    "_AristaAwakeSecurityWorkbook_workbook": "[variables('AristaAwakeSecurityWorkbook_workbook')]",
    "workbook-source": "[concat(resourceGroup().id, '/providers/Microsoft.OperationalInsights/workspaces/',parameters('workspace'))]",
    "_workbook-source": "[variables('workbook-source')]",
    "sourceId": "arista-networks.awake-security",
    "_sourceId": "[variables('sourceId')]"
  },
  "resources": [
    {
      "id": "[variables('_connector1-source')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('connector1-name'))]",
      "apiVersion": "2021-03-01-preview",
      "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectors",
      "location": "[parameters('workspace-location')]",
      "kind": "GenericUI",
      "properties": {
        "connectorUiConfig": {
          "title": "Awake Security",
          "publisher": "Arista Networks",
          "descriptionMarkdown": "The Awake Security CEF connector allows users to send detection model matches from the Awake Security Platform to Azure Sentinel. Remediate threats quickly with the power of network detection and response and speed up investigations with deep visibility especially into unmanaged entities including users, devices and applications on your network. The connector also enables the creation of network security-focused custom alerts, incidents, workbooks and notebooks that align with your existing security operations workflows. ",
          "graphQueries": [
            {
              "metricName": "Total data received",
              "legend": "AwakeSecurity",
              "baseQuery": "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\"\n| where DeviceProduct == \"Awake Security\""
            }
          ],
          "sampleQueries": [
            {
              "description": "Top 5 Adversarial Model Matches by Severity",
              "query": "union CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize  TotalActivities=sum(EventCount) by Activity,LogSeverity\n| top 5 by LogSeverity desc"
            },
            {
              "description": "Top 5 Devices by Device Risk Score",
              "query": "union CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize MaxDeviceRiskScore=max(DeviceCustomNumber1),TimesAlerted=count() by SourceHostName=coalesce(SourceHostName,\"Unknown\")\n| top 5 by MaxDeviceRiskScore desc"
            }
          ],
          "dataTypes": [
            {
              "name": "CommonSecurityLog (AwakeSecurity)",
              "lastDataReceivedQuery": "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\"\n| where DeviceProduct == \"Awake Security\"\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            }
          ],
          "connectivityCriterias": [
            {
              "type": "IsConnectedQuery",
              "value": [
                "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\"\n| where DeviceProduct == \"Awake Security\"\n| summarize LastLogReceived = max(TimeGenerated)\n| project IsConnected = LastLogReceived > ago(30d)"
              ]
            }
          ],
          "availability": {
            "status": 1,
            "isPreview": true
          },
          "permissions": {
            "resourceProvider": [
              {
                "provider": "Microsoft.OperationalInsights/workspaces",
                "permissionsDisplayText": "read and write permissions are required.",
                "providerDisplayName": "Workspace",
                "scope": "Workspace",
                "requiredPermissions": {
                  "read": true,
                  "write": true,
                  "delete": true
                }
              },
              {
                "provider": "Microsoft.OperationalInsights/workspaces/sharedKeys",
                "permissionsDisplayText": "read permissions to shared keys for the workspace are required. [See the documentation to learn more about workspace keys](https://docs.microsoft.com/azure/azure-monitor/platform/agent-windows#obtain-workspace-id-and-key).",
                "providerDisplayName": "Keys",
                "scope": "Workspace",
                "requiredPermissions": {
                  "action": true
                }
              }
            ]
          },
          "instructionSteps": [
            {
              "description": "Install and configure the Linux agent to collect your Common Event Format (CEF) Syslog messages and forward them to Azure Sentinel.\n\n> Notice that the data from all regions will be stored in the selected workspace",
              "innerSteps": [
                {
                  "title": "1.1 Select or create a Linux machine",
                  "description": "Select or create a Linux machine that Azure Sentinel will use as the proxy between your security solution and Azure Sentinel this machine can be on your on-prem environment, Azure or other clouds."
                },
                {
                  "title": "1.2 Install the CEF collector on the Linux machine",
                  "description": "Install the Microsoft Monitoring Agent on your Linux machine and configure the machine to listen on the necessary port and forward messages to your Azure Sentinel workspace. The CEF collector collects CEF messages on port 514 TCP.\n\n> 1. Make sure that you have Python on your machine using the following command: python -version.\n\n> 2. You must have elevated permissions (sudo) on your machine.",
                  "instructions": [
                    {
                      "parameters": {
                        "fillWith": [
                          "WorkspaceId",
                          "PrimaryKey"
                        ],
                        "label": "Run the following command to install and apply the CEF collector:",
                        "value": "sudo wget -O cef_installer.py https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/DataConnectors/CEF/cef_installer.py&&sudo python cef_installer.py {0} {1}"
                      },
                      "type": "CopyableLabel"
                    }
                  ]
                }
              ],
              "title": "1. Linux Syslog agent configuration"
            },
            {
              "description": "Perform the following steps to forward Awake Adversarial Model match results to a CEF collector listening on TCP port **514** at IP **192.168.0.1**:\n- Navigate to the Detection Management Skills page in the Awake UI.\n- Click + Add New Skill.\n- Set the Expression field to,\n>integrations.cef.tcp { destination: \"192.168.0.1\", port: 514, secure: false, severity: Warning }\n- Set the Title field to a descriptive name like,\n>Forward Awake Adversarial Model match result to Azure Sentinel.\n- Set the Reference Identifier to something easily discoverable like,\n>integrations.cef.sentinel-forwarder\n- Click Save.\n\nNote: Within a few minutes of saving the definition and other fields the system will begin sending new model match results to the CEF events collector as they are detected.\n\nFor more information, refer to the **Adding a Security Information and Event Management Push Integration** page from the Help Documentation in the Awake UI.",
              "title": "2. Forward Awake Adversarial Model match results to a CEF collector."
            },
            {
              "description": "Follow the instructions to validate your connectivity:\n\nOpen Log Analytics to check if the logs are received using the CommonSecurityLog schema.\n\n>It may take about 20 minutes until the connection streams data to your workspace.\n\nIf the logs are not received, run the following connectivity validation script:\n\n> 1. Make sure that you have Python on your machine using the following command: python -version\n\n>2. You must have elevated permissions (sudo) on your machine",
              "instructions": [
                {
                  "parameters": {
                    "fillWith": [
                      "WorkspaceId"
                    ],
                    "label": "Run the following command to validate your connectivity:",
                    "value": "sudo wget  -O cef_troubleshoot.py https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/DataConnectors/CEF/cef_troubleshoot.py&&sudo python cef_troubleshoot.py  {0}"
                  },
                  "type": "CopyableLabel"
                }
              ],
              "title": "3. Validate connection"
            },
            {
              "description": "Make sure to configure the machine's security according to your organization's security policy\n\n\n[Learn more >](https://aka.ms/SecureCEF)",
              "title": "4. Secure your machine "
            }
          ]
        }
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic1-id'))]",
      "apiVersion": "2020-01-01",
      "kind": "Scheduled",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "description": "This query searches for devices with unexpectedly large number of activity match.",
        "displayName": "Awake Security - High Match Counts By Device",
        "enabled": false,
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP),\n  DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName\n| where ModelMatchCount > 1000 and MaxSeverity > 2\n| extend SeverityName=iff(MaxSeverity == 0, \"Informational\", iff(MaxSeverity < 5, \"Low\", iff(MaxSeverity < 8, \"Medium\", \"High\")))\n",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic2-id'))]",
      "apiVersion": "2020-01-01",
      "kind": "Scheduled",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "description": "This query searches for devices with high severity event(s).",
        "displayName": "Awake Security - High Severity Matches By Device",
        "enabled": false,
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\" and toint(LogSeverity) > 6\n| summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP),\n  DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(todecimal  (LogSeverity)) by SourceHostName\n",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic3-id'))]",
      "apiVersion": "2020-01-01",
      "kind": "Scheduled",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "description": "This query searches for devices with multiple possibly malicious destinations.",
        "displayName": "Awake Security - Model With Multiple Destinations",
        "enabled": false,
        "query": "CommonSecurityLog | where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP),\n  DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName\n| where array_length(DestinationIPs) > 1\n",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0
      }
    },
    {
      "type": "Microsoft.Insights/workbooks",
      "name": "[parameters('workbook1-id')]",
      "location": "[parameters('workspace-location')]",
      "kind": "shared",
      "apiVersion": "2020-02-12",
      "properties": {
        "displayName": "[concat(parameters('workbook1-name'), ' - ', parameters('formattedTimeNow'))]",
        "serializedData": "{\"version\":\"Notebook/1.0\",\"items\":[{\"type\":9,\"content\":{\"version\":\"KqlParameterItem/1.0\",\"parameters\":[{\"id\":\"96834e0b-c240-4603-b8ce-ab5c8e051a8c\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"TimeRange\",\"label\":\"Time Range\",\"type\":4,\"isRequired\":true,\"value\":{\"durationMs\":172800000},\"typeSettings\":{\"selectableValues\":[{\"durationMs\":3600000},{\"durationMs\":43200000},{\"durationMs\":86400000},{\"durationMs\":172800000},{\"durationMs\":604800000},{\"durationMs\":2592000000},{\"durationMs\":5184000000}],\"allowCustom\":true},\"timeContext\":{\"durationMs\":86400000}},{\"id\":\"66925847-0d36-4795-bdfe-1ad0e6fa92a8\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"SortBy\",\"label\":\"Sort By\",\"type\":2,\"isRequired\":true,\"typeSettings\":{\"showDefault\":false},\"jsonData\":\"[\\n\\n    { \\\"value\\\":\\\"Count\\\", \\\"label\\\":\\\"Count\\\"},\\n    { \\\"value\\\":\\\"Severity\\\", \\\"label\\\":\\\"Severity\\\", \\\"selected\\\":true}\\n]\"},{\"id\":\"39594a16-ba63-4c67-8be3-00b4e415bb19\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"HostName\",\"label\":\"Host Name\",\"type\":1,\"isRequired\":true,\"value\":\"\"}],\"style\":\"pills\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"parameters - 8\"},{\"type\":11,\"content\":{\"version\":\"LinkItem/1.0\",\"style\":\"tabs\",\"links\":[{\"id\":\"bc6350d6-4f87-4575-9057-6e80072afdc1\",\"cellValue\":\"Tab\",\"linkTarget\":\"parameter\",\"linkLabel\":\"Overview\",\"subTarget\":\"Overview\",\"style\":\"link\"},{\"id\":\"b90a2ef4-07db-4f55-b8f1-fcafa493ab16\",\"cellValue\":\"Tab\",\"linkTarget\":\"parameter\",\"linkLabel\":\"Models\",\"subTarget\":\"Models\",\"style\":\"link\"},{\"id\":\"e097203d-20ea-48de-af3d-d367e704dd61\",\"cellValue\":\"Tab\",\"linkTarget\":\"parameter\",\"linkLabel\":\"Devices\",\"subTarget\":\"Devices\",\"style\":\"link\"}]},\"name\":\"links - 11\"},{\"type\":12,\"content\":{\"version\":\"NotebookGroup/1.0\",\"groupType\":\"editable\",\"items\":[{\"type\":1,\"content\":{\"json\":\"---\\n### Adversarial Model Matches by Severity Level for {TimeRange}\"},\"customWidth\":\"30\",\"name\":\"Overview_Pie_Label\"},{\"type\":1,\"content\":{\"json\":\"\\n\\n\\n---\\n### Adversarial Models Matches for {TimeRange}\"},\"customWidth\":\"70\",\"name\":\"Overview_Chart_Label\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"union CommonSecurityLog\\n| where DeviceVendor == \\\"Arista Networks\\\" and DeviceProduct == \\\"Awake Security\\\"\\n//| summarize by bin(TimeGenerated,3h),Activity,LogSeverity\\n//| summarize by bin(TimeGenerated,case(datetime_diff('day',{TimeRange:end},{TimeRange:start})>1,3h,case(datetime_diff('hour',{TimeRange:end},{TimeRange:start})>3,1h,10m))),Activity,LogSeverity\\n| summarize by bin(TimeGenerated,floor(({TimeRange:end}-{TimeRange:start})/30,1m)),Activity,LogSeverity\\n| summarize Count=count() by Severity=iif(toint(LogSeverity) between (0 .. 3),\\\"1\\\",iif(toint(LogSeverity) between (4 .. 6),\\\"2\\\",iif(toint(LogSeverity) between (7 .. 8),\\\"3\\\",iif(toint(LogSeverity) between (9 .. 10),\\\"4\\\",\\\"5\\\")))) \\n| where toint(Severity)<5\\n| order by toint(Severity) desc\",\"size\":2,\"timeContext\":{\"durationMs\":172800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"piechart\",\"tileSettings\":{\"titleContent\":{\"columnMatch\":\"Severity\",\"formatter\":18,\"formatOptions\":{\"thresholdsOptions\":\"colors\",\"thresholdsGrid\":[{\"operator\":\"==\",\"thresholdValue\":\"4\",\"representation\":\"redBright\",\"text\":\"Critical\"},{\"operator\":\"==\",\"thresholdValue\":\"3\",\"representation\":\"orange\",\"text\":\"High\"},{\"operator\":\"==\",\"thresholdValue\":\"2\",\"representation\":\"yellow\",\"text\":\"Medium\"},{\"operator\":\"==\",\"thresholdValue\":\"1\",\"representation\":\"green\",\"text\":\"Low\"},{\"operator\":\"Default\",\"text\":\"{0}{1}\"}],\"compositeBarSettings\":{\"labelText\":\"\",\"columnSettings\":[{\"columnName\":\"status\",\"color\":\"green\"},{\"columnName\":\"status_count\",\"color\":\"lightBlue\"}]}}},\"leftContent\":{\"columnMatch\":\"Count\",\"formatter\":12,\"formatOptions\":{\"palette\":\"none\"}},\"showBorder\":true,\"sortOrderField\":1,\"size\":\"auto\"},\"graphSettings\":{\"type\":0},\"chartSettings\":{\"yAxis\":[\"Count\"],\"seriesLabelSettings\":[{\"seriesName\":\"1\",\"label\":\"Low\",\"color\":\"green\"},{\"seriesName\":\"2\",\"label\":\"Medium\",\"color\":\"yellow\"},{\"seriesName\":\"4\",\"label\":\"Critical\",\"color\":\"redBright\"},{\"seriesName\":\"3\",\"label\":\"High\",\"color\":\"orange\"}]}},\"customWidth\":\"30\",\"name\":\"Adversarial Model Matches by Severity\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"//union CommonSecurityLog\\n//|  summarize Requests = dcount(Activity) by bin(TimeGenerated, 3h)\\n\\nunion CommonSecurityLog\\n| where DeviceVendor == \\\"Arista Networks\\\" and DeviceProduct == \\\"Awake Security\\\"\\n//| summarize by bin(TimeGenerated,case(datetime_diff('day',{TimeRange:end},{TimeRange:start})>1,3h,case(datetime_diff('hour',{TimeRange:end},{TimeRange:start})>3,1h,10m))),Activity,LogSeverity\\n| summarize by bin(TimeGenerated,floor(({TimeRange:end}-{TimeRange:start})/30,1m)),Activity,LogSeverity\\n//| summarize by bin(TimeGenerated,3h),Activity,LogSeverity\\n| summarize Critical=countif(toint(LogSeverity) between (9 .. 10)),High=countif(toint(LogSeverity) between (7 .. 8)),Medium=countif(toint(LogSeverity) between (4 .. 6)),Low=countif(toint(LogSeverity) between (0 .. 3)) by TimeGenerated,LogSeverity\\n\\n\",\"size\":2,\"timeContext\":{\"durationMs\":172800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"categoricalbar\",\"graphSettings\":{\"type\":0},\"chartSettings\":{\"xAxis\":\"TimeGenerated\",\"seriesLabelSettings\":[{\"seriesName\":\"High\",\"color\":\"orange\"},{\"seriesName\":\"Critical\",\"color\":\"redBright\"},{\"seriesName\":\"Medium\",\"color\":\"yellow\"},{\"seriesName\":\"Low\",\"color\":\"green\"}]}},\"customWidth\":\"70\",\"name\":\"Overview_Chart\"},{\"type\":1,\"content\":{\"json\":\"\\n\\n\\n---\\n###### Links\"},\"name\":\"Overview_Links_Label\"},{\"type\":11,\"content\":{\"version\":\"LinkItem/1.0\",\"style\":\"bullets\",\"links\":[{\"id\":\"49514376-7f9d-40d5-9e71-be047648b095\",\"cellValue\":\"https://awakesecurity.com/\",\"linkTarget\":\"Url\",\"linkLabel\":\"Awake-Security\",\"preText\":\"\",\"postText\":\"\",\"style\":\"link\"},{\"id\":\"5f591858-9562-423f-b082-c8946fd74727\",\"cellValue\":\"https://{HostName}/\",\"linkTarget\":\"Url\",\"linkLabel\":\"Awake-Platform\",\"style\":\"link\"}]},\"name\":\"Overview_Links\"}]},\"conditionalVisibility\":{\"parameterName\":\"Tab\",\"comparison\":\"isEqualTo\",\"value\":\"Overview\"},\"name\":\"Overview_Group\"},{\"type\":12,\"content\":{\"version\":\"NotebookGroup/1.0\",\"groupType\":\"editable\",\"items\":[{\"type\":1,\"content\":{\"json\":\"---\\n### Top 5 Adversarial Models Activities for {TimeRange}\"},\"name\":\"Models_Chart_Label\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"\\nunion CommonSecurityLog\\n| where DeviceVendor == \\\"Arista Networks\\\" and DeviceProduct == \\\"Awake Security\\\"\\n| summarize d=arg_max(DeviceEventClassID,LogSeverity),TriggeredCount=sum(EventCount) by  Activity\\n| top 5 by case(\\\"{SortBy}\\\"==\\\"Count\\\",TriggeredCount,toint(LogSeverity))\\n\\n\\n//union CommonSecurityLog\\n//| summarize TriggeredCount=sum(EventCount) by Activity\\n//    ,SeverityInt=iif(toint(LogSeverity) between (0 .. 3),1,iif(toint(LogSeverity) between (4 .. 6),2,iif(toint(LogSeverity) between (7 .. 8),3,4)))\\n//| top 5 by case(\\\"{SortBy}\\\"==\\\"Count\\\",TriggeredCount,SeverityInt)\\n\\n//union CommonSecurityLog\\n//| summarize TriggeredCount=dcount(Activity) by Activity,DeviceEventClassID,toint(LogSeverity)\\n//    ,SeverityInt=iif(toint(LogSeverity) between (0 .. 3),1,iif(toint(LogSeverity) between (4 .. 6),2,iif(toint(LogSeverity) between (7 .. 8),3,4)))\\n| top 5 by case(\\\"{SortBy}\\\"==\\\"Count\\\",TriggeredCount,toint(LogSeverity))\\n\",\"size\":0,\"timeContext\":{\"durationMs\":0},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"barchart\",\"chartSettings\":{\"xAxis\":\"Activity\",\"yAxis\":[\"TriggeredCount\"]}},\"name\":\"Models_Chart\"},{\"type\":1,\"content\":{\"json\":\"---\\n\\n### Detailed: Top 50 Adversarial Model Matches for {TimeRange}\"},\"name\":\"Models_Grid_Label\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"union CommonSecurityLog\\n| where DeviceVendor == \\\"Arista Networks\\\" and DeviceProduct == \\\"Awake Security\\\"\\n| summarize arg_max(TimeGenerated,Severity=toint(LogSeverity),DeviceCustomDate2,DeviceEventClassID),arg_min(TimeGenerated, DeviceCustomDate1),\\nUniqueDevices= dcount(coalesce(SourceHostName,'Unknown')),TotalActivities=sum(EventCount) by Activity\\n| extend  ModelPath= strcat(\\\"https://{HostName}/app/workbench/?startTime=\\\",DeviceCustomDate1,\\\"&endTime=\\\",DeviceCustomDate2,\\\"&query=(dataset.threat_behavior%20\\\",DeviceEventClassID,\\\")%20%26%26%20(device.threat_behavior%20\\\",DeviceEventClassID,\\\")&view=device\\\")\\n| project Activity,ModelPath,Severity,UniqueDevices,TotalActivities\\n| top 50 by case(\\\"{SortBy}\\\"==\\\"Count\\\",TotalActivities,Severity)\",\"size\":2,\"timeContext\":{\"durationMs\":0},\"timeContextFromParameter\":\"TimeRange\",\"showExportToExcel\":true,\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"table\",\"gridSettings\":{\"formatters\":[{\"columnMatch\":\"Activity\",\"formatter\":1},{\"columnMatch\":\"ModelPath\",\"formatter\":7,\"formatOptions\":{\"linkTarget\":\"Url\",\"linkLabel\":\"Awake-Platform: Model Detail\"}},{\"columnMatch\":\"Severity\",\"formatter\":18,\"formatOptions\":{\"thresholdsOptions\":\"colors\",\"thresholdsGrid\":[{\"operator\":\"<=\",\"thresholdValue\":\"3\",\"representation\":\"green\",\"text\":\"Low\"},{\"operator\":\"<=\",\"thresholdValue\":\"6\",\"representation\":\"yellow\",\"text\":\"Medium\"},{\"operator\":\"<=\",\"thresholdValue\":\"8\",\"representation\":\"orange\",\"text\":\"High\"},{\"operator\":\"Default\",\"representation\":\"redBright\",\"text\":\"Critical\"}],\"compositeBarSettings\":{\"labelText\":\"\",\"columnSettings\":[{\"columnName\":\"SeverityInt\",\"color\":\"redBright\"}]}}},{\"columnMatch\":\"TimeGenerated\",\"formatter\":5},{\"columnMatch\":\"SeverityInt\",\"formatter\":5},{\"columnMatch\":\"DeviceEventClassID\",\"formatter\":5},{\"columnMatch\":\"mints\",\"formatter\":5},{\"columnMatch\":\"maxts\",\"formatter\":5}],\"labelSettings\":[{\"columnId\":\"Activity\"},{\"columnId\":\"ModelPath\",\"label\":\"Model Path\"},{\"columnId\":\"Severity\"},{\"columnId\":\"UniqueDevices\",\"label\":\"Unique Devices\"},{\"columnId\":\"TotalActivities\",\"label\":\"Total Activities\"}]}},\"name\":\"Models_Grid\"}]},\"conditionalVisibility\":{\"parameterName\":\"Tab\",\"comparison\":\"isEqualTo\",\"value\":\"Models\"},\"name\":\"Models_Group\"},{\"type\":12,\"content\":{\"version\":\"NotebookGroup/1.0\",\"groupType\":\"editable\",\"items\":[{\"type\":1,\"content\":{\"json\":\"---\\n### Top 10 Devices by Model Matches for {TimeRange}\"},\"name\":\"Devices_Chart_Label\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"//union CommonSecurityLog\\n//| extend Source = strcat(Sour.ceHostName,\\\" \\\", \\\"(\\\" ,SourceIP, \\\")\\\"),Destination= strcat(DestinationHostName,\\\" \\\", \\\"(\\\" ,DestinationIP, \\\")\\\")\\n//| summarize TimesAlerted=count() by SourceHostName //, //avg(DeviceCustomNumber1) by SourceHostName\\n//| top 10 by TimesAlerted\\n//| sort by TimesAlerted desc\\n\\nunion CommonSecurityLog\\n| where DeviceVendor == \\\"Arista Networks\\\" and DeviceProduct == \\\"Awake Security\\\"\\n| summarize \\n    MaxDeviceRiskScore=max(DeviceCustomNumber1),UniqueDeviceTypeCount=dcount(DeviceCustomString4),\\n    TimesAlerted=count() by SourceHostName=coalesce(SourceHostName,\\\"Unknown\\\")\\n//| where UniqueDeviceTypeCount<2\\n| top 10 by case(\\\"{SortBy}\\\"==\\\"Count\\\",TimesAlerted,MaxDeviceRiskScore)\\n\",\"size\":0,\"timeContext\":{\"durationMs\":172800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"barchart\",\"chartSettings\":{\"xAxis\":\"SourceHostName\",\"yAxis\":[\"TimesAlerted\"]}},\"name\":\"Devices_Chart\"},{\"type\":1,\"content\":{\"json\":\"---\\n### Detailed: Top 50 Devices by Model Matches for {TimeRange}\"},\"name\":\"Devices_Grid_Label\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"union CommonSecurityLog\\n| where DeviceVendor == \\\"Arista Networks\\\" and DeviceProduct == \\\"Awake Security\\\"\\n| summarize DevicePath=take_anyif(strcat(\\\"https://{HostName}/app/workbench/device/\\\",substring(DeviceCustomString2,-39,36)),DeviceCustomString2!=\\\"\\\"),\\n    DeviceType=strcat_array(make_set_if(DeviceCustomString4, strlen(DeviceCustomString4) > 0),\\\", \\\"),UniqueDeviceTypeCount=dcount(DeviceCustomString4),\\n    OperatingSystem=strcat_array(make_set_if(DeviceCustomString3, strlen(DeviceCustomString3) > 0),\\\", \\\"),\\n    IPsFound= dcount(SourceIP),//strcat_array(make_set(SourceIP),\\\", \\\"),\\n//    AverageDeviceRiskScore=round(avgif(DeviceCustomNumber1,DeviceCustomNumber1>0)),\\n    MaxDeviceRiskScore=max(DeviceCustomNumber1),\\n    TimesAlerted=count() by SourceHostName=coalesce(SourceHostName,\\\"Unknown\\\")//,DevicePath\\n//| where UniqueDeviceTypeCount<2\\n| top 50 by case(\\\"{SortBy}\\\"==\\\"Count\\\",TimesAlerted,MaxDeviceRiskScore)\\n//| order by MaxDeviceRiskScore desc\\n\",\"size\":2,\"timeContext\":{\"durationMs\":172800000},\"timeContextFromParameter\":\"TimeRange\",\"showExportToExcel\":true,\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"table\",\"gridSettings\":{\"formatters\":[{\"columnMatch\":\"DevicePath\",\"formatter\":7,\"formatOptions\":{\"linkTarget\":\"Url\",\"linkLabel\":\"Awake-Platform: Device Detail\"}},{\"columnMatch\":\"UniqueDeviceTypeCount\",\"formatter\":5},{\"columnMatch\":\"MaxDeviceRiskScore\",\"formatter\":18,\"formatOptions\":{\"thresholdsOptions\":\"colors\",\"thresholdsGrid\":[{\"operator\":\"<\",\"thresholdValue\":\"33\",\"representation\":\"green\",\"text\":\"Low\"},{\"operator\":\">=\",\"thresholdValue\":\"75\",\"representation\":\"redBright\",\"text\":\"High\"},{\"operator\":\">=\",\"thresholdValue\":\"33\",\"representation\":\"orange\",\"text\":\"Medium\"},{\"operator\":\"Default\",\"text\":\"{0}{1}\"}],\"compositeBarSettings\":{\"labelText\":\"\",\"columnSettings\":[{\"columnName\":\"IPsFound\",\"color\":\"blue\"},{\"columnName\":\"MaxDeviceRiskScore\",\"color\":\"brown\"}]}}}],\"labelSettings\":[{\"columnId\":\"SourceHostName\",\"label\":\"Source HostName\"},{\"columnId\":\"DevicePath\",\"label\":\"Device Path\"},{\"columnId\":\"DeviceType\",\"label\":\"Device Type\"},{\"columnId\":\"UniqueDeviceTypeCount\"},{\"columnId\":\"OperatingSystem\",\"label\":\"Operating System\"},{\"columnId\":\"IPsFound\",\"label\":\"Distinct IPs\"},{\"columnId\":\"MaxDeviceRiskScore\",\"label\":\"Device Risk Score (Max)\"},{\"columnId\":\"TimesAlerted\",\"label\":\"Total Activities\"}]}},\"name\":\"Devices_Grid\"}]},\"conditionalVisibility\":{\"parameterName\":\"Tab\",\"comparison\":\"isEqualTo\",\"value\":\"Devices\"},\"name\":\"Devices_Group\"}],\"fromTemplateId\":\"sentinel-AristaAwakeSecurityWorkbook\",\"$schema\":\"https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json\"}\r\n",
        "version": "1.0",
        "sourceId": "[variables('_workbook-source')]",
        "category": "sentinel"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "version": "1.1.0",
        "kind": "Solution",
        "contentId": "[variables('_sourceId')]",
        "parentId": "[variables('_sourceId')]",
        "source": {
          "kind": "Solution",
          "name": "AristaAwakeSecurity",
          "sourceId": "[variables('_sourceId')]"
        },
        "author": {
          "name": "Nikhil Tripathi",
          "email": "v-ntripathi@microsoft.com"
        },
        "support": {
          "name": "Arista - Awake Security",
          "email": "support-security@arista.com",
          "tier": "Partner",
          "link": "https://awakesecurity.com/"
        },
        "dependencies": {
          "operator": "AND",
          "criteria": [
            {
              "kind": "DataConnector",
              "contentId": "[variables('_AristaAwakeSecurityConnector')]",
              "version": "1.1.0"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('_HighMatchCountsByDevice_AnalyticalRules')]",
              "version": "1.1.0"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('_HighSeverityMatchesByDevice_AnalyticalRules')]",
              "version": "1.1.0"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('_ModelMatchesWithMultipleDestinationsByDevice_AnalyticalRules')]",
              "version": "1.1.0"
            },
            {
              "kind": "Workbook",
              "contentId": "[variables('_AristaAwakeSecurityWorkbook_workbook')]",
              "version": "1.1.0"
            }
          ]
        },
        "firstPublishDate": "2021-10-18",
        "providers": [
          "Arista Networks"
        ],
        "categories": {
          "domains": [
            "Security – Network"
          ]
        }
      },
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_sourceId'))]"
    }
  ],
  "outputs": {}
}
