Parser:
  Title: Agent Event ASIM schema function
  Version: '0.1.0'
  LastUpdated: Apr 16, 2026
Product:
  Name: Microsoft
Normalization:
  Schema: AgentEvent
  Version: '0.1.0'
References:
- Title: ASIM Agent Event Schema
  Link: https://aka.ms/ASimAgentEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Agent Event schema.
ParserName: vimAgentEventEmpty
EquivalentBuiltInParser: _Im_AgentEvent_Empty
ParserQuery: |
  let EmptyAgentEvents = datatable (
    TimeGenerated: datetime,
    Type: string,
    EventUid: string,
    EventOriginalUid: string,
    EventSchema: string,
    EventSchemaVersion: string,
    EventStartTime: datetime,
    EventEndTime: datetime,
    EventCount: int,
    EventVendor: string,
    EventProduct: string,
    ToolName: string,
    SrcAgentId: string,
    SrcAgentName: string,
    SrcAgentOriginalType: string,
    SrcAgentDescription: string,
    SrcAgentBlueprintId: string,
    SrcIpAddr: string,
    SrcFQDN: string,
    SrcPortNumber: int,
    TargetAgentId: string,
    TargetAgentName: string,
    TargetAgentUsername: string,
    TargetAgentUserId: string,
    TargetAgentOriginalType: string,
    TargetAgentDescription: string,
    TargetAgentBlueprintId: string,
    PlatformTargetAgentId: string,
    PlatformTargetAgentName: string,
    PlatformTargetAgentDescription: string,
    PlatformTargetOriginalAgentType: string,
    ActorUserId: string,
    ActorUserIdType: string,
    ActorUserScope: string,
    ActorUserScopeId: string,
    ActorUsername: string,
    ActorUsernameType: string,
    ActingAppName: string,
    ActingAppId: string,
    ActingAppType: string,
    EventSessionId: string,
    EventSessionName: string,
    EventType: string,
    EventOriginalType: string,
    EventRequestId: string,
    EventRequestTemperature: double,
    EventRequestTopP: double,
    EventRequestPresencePenalty: double,
    EventRequestFrequencyPenalty: double,
    EventRequestSeed: long,
    EventResponseId: string,
    EventOriginalRequestDetails: string,
    EventOriginalResultDetails: string,
    EventErrorDetails: string,
    EventOriginalErrorType: string,
    EventThoughtProcessDetails: string,
    EventThoughtProcessId: string,
    EventFinishReasons: dynamic,
    EventOutputType: string,
    ToolId: string,
    ToolDescription: string,
    ToolOriginalType: string,
    ModelProviderName: string,
    ModelName: string,
    InputTokensUsed: long,
    OutputTokensUsed: long,
    AdditionalFields: dynamic
  )[];
  EmptyAgentEvents