// Usage Instruction : 
// Paste below query in log analytics, click on Save button and select as Function from drop down by specifying function name and alias as NozomiNetworksEvents.
// Function usually takes 10-15 minutes to activate. You can then use function alias from any other queries (e.g. NozomiNetworksEvents | take 10).
// Reference : Using functions in Azure monitor log queries : https://docs.microsoft.com/azure/azure-monitor/log-query/functions
CommonSecurityLog 
| where DeviceVendor has 'Nozomi'
| extend EventVendor = DeviceVendor
| extend EventProduct = DeviceProduct
| extend EventProductVersion = DeviceVersion
| extend EventSeverity = LogSeverity
| extend SrcIpAddr = SourceIP
| extend SrcHostName = SourceHostName
| extend DstIpAddr = DestinationIP
| extend DstHostname = DestinationHostName
| extend SrcUserName = SourceUserName
| extend EventMessage = Message
| extend EventSubType = DeviceEventClassID
| extend EventStartTime = coalesce(StartTime,unixtime_milliseconds_todatetime(tolong(extract(@'start=(\w+).*', 1, AdditionalExtensions))),datetime(null))
| extend DvcHostname = DeviceName
| extend MitreAttackTactics = FlexString2
| extend MitreAttackTechniques = FlexString1
| extend EventSubType = Activity
| extend Risk = iff(DeviceCustomString1Label == "Risk", DeviceCustomString1, '')
| extend IsSecurity = iff(DeviceCustomString2Label == "isSecurity", DeviceCustomString2, '')
| extend EventOriginalUid = DeviceCustomString3
| extend TriggerType = DeviceCustomString4
| extend Parents = DeviceCustomString5
| extend NetworkApplicationProtocol = ApplicationProtocol
| extend DstMacAddr = DestinationMACAddress 
| extend SrcMacAddr = SourceMACAddress
| extend DstPortNumber= DestinationPort
| extend SrcPortNumber= SourcePort
| extend EventType = case (
                            DeviceCustomString1Label contains "Risk", "Alert",
                            DeviceCustomString1Label contains "Browser", "Audit Log",
                            "Health Log"
                            )
