id: b3470e40-39ae-4c28-9282-440038f6f964
name: Snip3 Malicious Network Connectivity
description: | 
  This hunting query looks for potentially hollowed processes that may be used to facilitate command-and-control or exfiltration by Snip3 malware.
description-detailed: |
  Snip3 is a family of related remote access trojans. Although the malware in this family contain numerous small variations, they all exhibit similar behaviors and techniques.
  The following query looks for potentially hollowed processes that may be used to facilitate command-and-control or exfiltration by Snip3 malware. This technique has been used in recent cases to exfiltrate data, including credentials.
  The query may return additional malware or campaigns not necessarily associated with Snip3. However, Microsoft recommends triaging all non-benign results as potential malware.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceNetworkEvents
tactics:
  - CommandAndControl
  - Exfiltration
query: |
  DeviceNetworkEvents 
  | where InitiatingProcessFileName in~ ("RegSvcs.exe","RegAsm.exe", "InstallUtil.exe") 
  | where InitiatingProcessCommandLine in~ ("\"RegAsm.exe\"","\"RegSvcs.exe\"","\"InstallUtil.exe\"") 
  | where InitiatingProcessParentFileName endswith "powershell.exe" 
    or InitiatingProcessParentFileName endswith "powershell_ise.exe" 
    or InitiatingProcessParentFileName endswith "pwsh.exe"
version: 1.0.0