id: 03d92bcb-cf51-4c65-9ca7-7a10f1761744
Function:
  Title: Parser for JBossEvent
  Version: '1.0.0'
  LastUpdated: '2023-08-03'
Category: Microsoft Sentinel Parser
FunctionName: JBossEvent
FunctionAlias: JBossEvent
FunctionParams:
FunctionQuery: |
    JBossLogs_CL
    | extend EventVendor = 'Red Hat'
    | extend EventProduct = 'JBoss Enterprise Application Platform'
    | extend EventCount = 1
    | extend EventSchemaVersion = 0.2
    | extend EventSeverity = extract(@'\d{2},\d{3}\s(\w+)\s+\[', 1, RawData)
    | extend ActingProcessName = extract(@'\[([A-Za-z0-9.-]+)\]', 1, RawData)
    | extend ActingProcessThread = extract(@'\]\s+\((.*?)\)', 1, RawData)
    | extend EventOriginalType = extract(@"([A-Z]+[0-9]+)(:)",1, RawData)
    | extend EventMessage = extract(@'\)\s([A-Z0-9]+:\s)?(.*)', 2, RawData)
    | project-away RawData