{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/ASimAlertEventGoogleSecOps')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "Alert Event ASIM parser for Google SecOps Detection Alerts",
        "category": "ASIM",
        "FunctionAlias": "ASimAlertEventGoogleSecOps",
        "query": "let AlertVerdictLookup = datatable(threat_verdict: string, AlertVerdict: string)\n  [\n  \"MALICIOUS\",  \"True Positive\",\n  \"SUSPICIOUS\", \"True Positive\",\n  \"BENIGN\",     \"Benign Positive\",\n  \"UNKNOWN\",    \"Unknown\"\n];\nlet SeverityLookup = datatable(orig_severity: string, EventSeverity: string)\n  [\n  \"CRITICAL\",      \"High\",\n  \"HIGH\",          \"High\",\n  \"MEDIUM\",        \"Medium\",\n  \"LOW\",           \"Low\",\n  \"INFORMATIONAL\", \"Informational\",\n  \"INFO\",          \"Informational\"\n];\nlet EventSubTypeLookup = datatable(detection_type: string, EventSubType: string)\n  [\n  \"RULE_DETECTION\", \"Threat\",\n  \"GCTI_FINDING\",   \"Threat\",\n  \"JOB_DETECTION\",  \"Suspicious Activity\"\n];\nlet DetectionMethodLookup = datatable(detection_type: string, DetectionMethod: string)\n  [\n  \"RULE_DETECTION\", \"Behavioral Analytics\",\n  \"GCTI_FINDING\",   \"Threat Intelligence\",\n  \"JOB_DETECTION\",  \"Automated Investigation\"\n];\nlet IndicatorTypeLookup = datatable(entity_type_raw: string, IndicatorType: string)\n  [\n  \"IP_ADDRESS\",  \"Ip\",\n  \"DOMAIN_NAME\", \"Url\",\n  \"USER\",        \"User\",\n  \"ASSET\",       \"Host\",\n  \"FILE\",        \"File\",\n  \"URL\",         \"Url\",\n  \"PROCESS\",     \"Process\"\n];\nlet parser = (disabled: bool=false, pack: bool=false) {\n  DetectionAlerts_CL\n  | where not(disabled)\n  //  Expand detection array (one row per detection element) \n  | extend detection_array = detection\n  | where isnotnull(detection_array) and array_length(detection_array) > 0\n  | mv-expand detection = detection_array\n  //  Top-level columns \n  | extend\n      detection_id   = id,\n      detection_type = DetectionType,\n      tw_start       = todatetime(timeWindow_startTime),\n      tw_end         = todatetime(timeWindow_endTime),\n      collection_arr = todynamic(collectionElements),\n      detect_timing  = detectionTimingDetails,\n      latency_metrics = latencyMetrics\n  //  Fields from expanded detection element \n  | extend\n      rule_name      = tostring(detection.ruleName),\n      rule_id        = tostring(detection.ruleId),\n      rule_version   = tostring(detection.ruleVersion),\n      rule_type      = tostring(detection.ruleType),\n      rule_labels    = detection.ruleLabels,\n      detect_desc    = tostring(detection.description),\n      orig_severity  = tostring(detection.severity),\n      alert_state    = tostring(detection.alertState),\n      risk_score_raw = tostring(detection.riskScore),\n      url_back       = tostring(detection.urlBackToProduct),\n      detect_fields  = detection.detectionFields,\n      outcomes       = detection.outcomes,\n      variables      = detection.variables\n  //  Entity variables (principal / source / target) \n  | extend\n      DvcIpAddr   = tostring(coalesce(\n                      variables.principal_ip.value,\n                      variables.source_ip.value,\n                      variables.correlation_ip.value)),\n      Username    = tostring(coalesce(\n                      variables.principal_user_userid.value,\n                      variables.source_user_userid.value,\n                      variables.user.value))\n  //  Severity normalisation \n  | lookup SeverityLookup on orig_severity\n  | extend EventSeverity = coalesce(EventSeverity, \"Informational\")\n  //  EventSubType / DetectionMethod \n  | lookup EventSubTypeLookup on detection_type\n  | extend EventSubType = coalesce(EventSubType, \"Threat\")\n  | lookup DetectionMethodLookup on detection_type\n  | extend DetectionMethod = coalesce(DetectionMethod, \"Behavioral Analytics\")\n  //  AlertStatus \n  | extend\n      AlertStatus         = case(alert_state == \"ALERTING\", \"Active\", \"Closed\"),\n      AlertOriginalStatus = alert_state\n  //  ThreatRiskLevel \n  | extend\n      ThreatRiskLevel         = toint(risk_score_raw),\n      ThreatOriginalRiskLevel = risk_score_raw\n  //  Threat intelligence from collectionElements \n  | extend\n      threat_obj          = coalesce(collection_arr[0].references[0].entity.metadata.threat[0],collection_arr[1].references[0].entity.metadata.threat[0]),\n      entity_type_raw     = coalesce(tostring(collection_arr[0].references[0].entity.metadata.entityType), tostring(collection_arr[1].references[0].entity.metadata.entityType))\n  | extend\n      threat_verdict_raw  = tostring(threat_obj.threatVerdict),\n      threat_category_raw = tostring(threat_obj.category),\n      threat_name_raw     = tostring(threat_obj.summary),\n      threat_first_ts     = todatetime(threat_obj.firstDiscoveredTime),\n      threat_last_ts      = todatetime(threat_obj.lastUpdatedTime),\n      threat_url          = tostring(threat_obj.urlBackToProduct)\n  //  AlertVerdict \n  | extend threat_verdict = threat_verdict_raw\n  | lookup AlertVerdictLookup on threat_verdict\n  | extend AlertVerdict = coalesce(AlertVerdict, \"Unknown\")\n  //  ThreatCategory \n  | extend\n      ThreatOriginalCategory = threat_category_raw,\n      ThreatCategory = case(\n          threat_category_raw has \"MALWARE\",       \"Malware\",\n          threat_category_raw has \"RANSOMWARE\",    \"Ransomware\",\n          threat_category_raw has \"TROJAN\",        \"Trojan\",\n          threat_category_raw has \"VIRUS\",         \"Virus\",\n          threat_category_raw has \"WORM\",          \"Worm\",\n          threat_category_raw has \"ADWARE\",        \"Adware\",\n          threat_category_raw has \"SPYWARE\",       \"Spyware\",\n          threat_category_raw has \"ROOTKIT\",       \"Rootkit\",\n          threat_category_raw has \"CRYPTOMINER\",   \"Cryptominer\",\n          threat_category_raw has \"PHISHING\",      \"Phishing\",\n          threat_category_raw has \"SPAM\",          \"Spam\",\n          threat_category_raw has \"NETWORK_RECON\", \"Security Policy Violation\",\n          isnotempty(threat_category_raw),         \"Unknown\",\n                                                   \"Unknown\")\n  //  IndicatorType\n  | lookup IndicatorTypeLookup on entity_type_raw\n  | extend IndicatorType = coalesce(IndicatorType, \"\")\n  // Hostname helper function\n  | extend Hostname = tostring(coalesce(\n              variables.principal_hostname.value,\n              variables.principal_asset_hostname.value,\n              variables.source_hostname.value))\n  | invoke _ASIM_ResolveDvcFQDN(\"Hostname\")\n  //  User fields \n  | extend UsernameType = _ASIM_GetUsernameType(Username)\n  //  AttackTactics / AttackTechniques\n  | mv-apply rl = rule_labels on (\n      summarize\n          AttackTactics = anyif(tostring(rl.value), rl.key == \"mitre_attack_tactic\"),\n          AttackTechniques = anyif(tostring(rl.value), rl.key == \"mitre_attack_technique\")\n  )\n  //  Mandatory / Recommended event fields\n  | extend\n      EventType             = \"Alert\",\n      EventCount            = int(1),\n      EventUid              = detection_id,\n      EventOriginalUid      = detection_id,\n      EventProduct          = 'GoogleSecOps',\n      EventVendor           = 'Google',\n      EventSchema           = 'AlertEvent',\n      EventSchemaVersion    = '0.1',\n      EventMessage          = detect_desc,\n      EventOriginalSeverity = orig_severity,\n      EventOriginalSubType  = detection_type,\n      AlertName             = rule_name,\n      RuleName              = rule_name,\n      RuleDescription       = detect_desc\n  //  Rename\n  | project-rename\n      EventStartTime        = tw_start,\n      EventEndTime          = tw_end,\n      EventReportUrl        = url_back,\n      ThreatName            = threat_name_raw,\n      ThreatFirstReportedTime = threat_first_ts,\n      ThreatLastReportedTime  = threat_last_ts,\n      Url                   = threat_url\n  //  AdditionalFields bag\n  | extend AdditionalFields = iff (\n    pack,\n    bag_pack(\n        \"ruleId\",                 rule_id,\n        \"ruleVersion\",            rule_version,\n        \"ruleType\",               rule_type,\n        \"ruleLabels\",             rule_labels,\n        \"detectionFields\",        detect_fields,\n        \"outcomes\",               outcomes,\n        \"variables\",              variables,\n        \"detectionTimingDetails\", detect_timing,\n        \"latencyMetrics\",         latency_metrics\n      ),\n    dynamic([])\n  )\n  //  Aliases\n  | extend\n      AlertId          = EventUid,\n      AlertDescription = EventMessage,\n      IpAddr           = DvcIpAddr,\n      Hostname         = DvcHostname,\n      User             = Username,\n      Rule             = RuleName\n  //  Project only final ASIM fields\n  | project\n      TimeGenerated,\n      Type,\n      EventType,\n      EventCount,\n      EventStartTime,\n      EventEndTime,\n      EventUid,\n      EventOriginalUid,\n      EventProduct,\n      EventVendor,\n      EventSchema,\n      EventSchemaVersion,\n      EventMessage,\n      EventOriginalSeverity,\n      EventSeverity,\n      EventSubType,\n      EventOriginalSubType,\n      EventReportUrl,\n      DetectionMethod,\n      AlertStatus,\n      AlertOriginalStatus,\n      AlertVerdict,\n      AlertName,\n      AlertId,\n      AlertDescription,\n      RuleName,\n      RuleDescription,\n      ThreatRiskLevel,\n      ThreatOriginalRiskLevel,\n      ThreatOriginalCategory,\n      ThreatCategory,\n      ThreatName,\n      ThreatFirstReportedTime,\n      ThreatLastReportedTime,\n      IndicatorType,\n      AttackTactics,\n      AttackTechniques,\n      DvcIpAddr,\n      DvcHostname,\n      DvcDomain,\n      DvcFQDN,\n      DvcDomainType,\n      Username,\n      UsernameType,\n      AdditionalFields,\n      Url,\n      IpAddr,\n      Hostname,\n      User,\n      Rule\n};\nparser(disabled = disabled, pack = pack)\n",
        "version": 1,
        "functionParameters": "disabled:bool=False,pack:bool=False"
      }
    }
  ]
}