//Este KQL consulta a blacklist de IPs divulgada pelo SERPRO e informa que dispositivo da sua rede conectou-se com algum dos IPs listados.
//Requisitos: Logs do Defender sendo encaminhados para o Sentinel DeviceNetworkEvents 
//Data Connector: Microsoft 365 Defender
//Tabela: DeviceNetworkEvents
let IPsSerpro = externaldata (IP:string) [@https://s3.i02.estaleiro.serpro.gov.br/blocklist/blocklist.txt] with (format="txt",ignoreFirstRecord=false);
DeviceNetworkEvents
| where RemoteIP in (IPsSerpro)
| project TimeGenerated, InitiatingProcessAccountUpn, InitiatingProcessAccountSid, DeviceName, RemoteIP, RemoteUrl, InitiatingProcessFileName, ActionType
