id: 8abe561f-eecd-45cb-a0a3-152189d2c064
name: Kerberos AS authentications
description: |
  This query shows attempts to request Kerberos service ticket using the AS service, to monitor Kerberos AS authentications.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - IdentityLogonEvents
tactics:
- Credential Access
relevantTechniques: []
query: |
// This query shows attempts to request Kerberos service ticket using the AS service which is usually providing TGTs (Ticket Granting Tickets).
IdentityLogonEvents
| where Timestamp > ago(2d)
| where Application == "Active Directory"
| where Protocol == "Kerberos"
| where LogonType == "Resource access"
| extend KerberosType = AdditionalFields['KerberosType']
| where KerberosType == "KerberosAs"
| extend Spns = AdditionalFields["Spns"]
| extend DestinationDC = AdditionalFields["TO.DEVICE"]
| project Timestamp, ActionType, AccountUpn, AccountSid, IPAddress, DeviceName, KerberosType, Spns, DestinationDC, DestinationIPAddress, ReportId
