IdentityLogonEvents
| where Timestamp > ago(2d)
| where Application == "Active Directory"
| where Protocol == "Kerberos"
| where LogonType == "Resource access"
| extend KerberosType = AdditionalFields['KerberosType']
| where KerberosType == "KerberosAs"
| extend Spns = AdditionalFields["Spns"]
| extend DestinationDC = AdditionalFields["TO.DEVICE"]
| project Timestamp, ActionType, AccountUpn, AccountSid, IPAddress, DeviceName, KerberosType, Spns, DestinationDC, DestinationIPAddress, ReportId
