SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes:
- DataType: AzureActivity
RequiredInputFieldsSets:
- - AzureResource_ResourceId
BaseQuery: |-
  AzureActivity
  | where OperationNameValue =~ "Microsoft.Storage/storageAccounts/listKeys/action"
  | where _ResourceId =~ '{{AzureResource_ResourceId}}'
  | project TimeGenerated, Caller, _ResourceId, OperationNameValue, Resource

Activities:
     EnabledByDefault: true
     Title: "Storage account keys list (Preview)"
     Content: "The account {{Caller}} retrieved the keys of the storage account {{_ResourceId}} {{Count}} time(s)"
     Items:
        - Id: a8b50062-f80e-4331-a247-de0e10d7b83f
          Description: This activity indicated storage account keys list operation
          QueryDefinitions:
            SummarizeBy: Caller, _ResourceId
