SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes:
- DataType: AzureActivity
RequiredInputFieldsSets:
- - AzureResource_ResourceId
BaseQuery: |-
  AzureActivity
  | where OperationNameValue =~ "MICROSOFT.STORAGE/STORAGEACCOUNTS/REGENERATEKEY/ACTION"
  | where _ResourceId =~ '{{AzureResource_ResourceId}}'
  | project TimeGenerated, Caller, _ResourceId, OperationNameValue, Resource

Activities:
     EnabledByDefault: true
     Title: "Storage account keys list were regenerated (Preview)"
     Content: "The account {{Caller}} regenerated the keys of the storage account {{_ResourceId}} {{Count}} time(s)"
     Items:
        - Id: e24d372a-ce9a-424e-99ba-5894177365a0
          Description: This activity indicated storage account keys list regeneration
          QueryDefinitions:
            SummarizeBy: Caller, _ResourceId
