SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes:
- DataType: AzureActivity
RequiredInputFieldsSets:
- - AzureResource_ResourceId
BaseQuery: |-
  AzureActivity
  | where OperationNameValue =~ "MICROSOFT.COMPUTE/VIRTUALMACHINES/RUNCOMMAND/ACTION"
  | where _ResourceId =~ '{{AzureResource_ResourceId}}'
  | project TimeGenerated, Caller, _ResourceId, OperationNameValue, Resource

Activities:
     EnabledByDefault: true
     Title: "VM Run Command execution (Preview)"
     Content: "The account {{Caller}} used Run Command on the VM {{Count}} time(s)"
     Items:
        - Id: 2276eacb-9400-47e9-88c9-600b9b04ad81
          Description: This activity indicates usage of Run Command
          QueryDefinitions:
            SummarizeBy: Caller, _ResourceId
