---
SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: AzureActivity | extend Azure_Resource_Id = tolower(ResourceId) | where
  Azure_Resource_Id =~ '{{Azure_ResourceId}}' | join kind= leftouter BehaviorAnalytics
  on $left._ItemId == $right.SourceRecordId
RequiredInputFieldsSets:
- - Azure_ResourceId
Insights:
  Id: 880c01a3-acc4-4b8c-98fe-2dd305be5860
  DisplayName: Top IP addresses and locations
  Description: "### Top IP addresses and locations \n ___ \n This insight show you
    the top IP adresses that provide an actions on this Azure Resource, and their
    geo-location, if available."
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 2d
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: IP
      OutputType: string
      SupportDeepLink: false
    - Header: Number of Events
      OutputType: number
      SupportDeepLink: false
    - Header: Geo Location
      OutputType: string
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: ''
      Summarize: summarize count() ,any(SourceIPLocation) by CallerIpAddress | sort
        by count_ desc | take 10
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View all the addresses
    Query: summarize count() ,any(SourceIPLocation) by CallerIpAddress | sort by count_
      desc | project CallerIpAddress, ['Number of event']=count_, ['Geo Location']=any_SourceIPLocation
