---
SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: 'AzureActivity | extend Azure_Resource_Id = tolower(ResourceId) | where
  Azure_Resource_Id =~ ''{{Azure_ResourceId}}'' '
RequiredInputFieldsSets:
- - Azure_ResourceId
Insights:
  Id: b58931df-2881-42b4-9e6a-2e4fac0dee2b
  DisplayName: Top Operations and Categories
  Description: "### Top Operations and Categories\n ___ \n This insight show you the
    top operations that made on this Azure Resource, and what is their categories."
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 2d
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: Operation
      OutputType: string
      SupportDeepLink: false
    - Header: Category
      OutputType: number
      SupportDeepLink: false
    - Header: Number of recrods
      OutputType: number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: ''
      Summarize: " summarize count() by OperationName, Category | sort by count_ desc"
      Project: ''
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View additional details
    Query: project  Caller, CallerIpAddress, OperationName, Category, Level, ActivityStatus,
      ResourceGroup, SubscriptionId
