SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: | 
  AzureActivity 
  | extend Azure_Resource_Id = tolower(ResourceId) 
  | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}'
RequiredInputFieldsSets:
- - AzureResource_ResourceId
Insights:
  Id: 9a7fa65c-d7e5-4e01-8e21-a056cb3b5ab6
  DisplayName: Top Operations and Categories
  Description: "### Top Operations and Categories\n ___ \n This insight shows you the operations most performed on this Azure Resource, and their categorization."
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 2d
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: Operation
      OutputType: string
      SupportDeepLink: false
    - Header: Category
      OutputType: number
      SupportDeepLink: false
    - Header: Number of records
      OutputType: number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: 'where 1==1'
      Summarize: "summarize ['Number of records']=count() by OperationNameValue, CategoryValue | top 20 by ['Number of records'] desc"
      Project: "project ['Operation']=OperationNameValue, CategoryValue, ['Number of records']"
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View additional details
    Query: "project Caller, CallerIpAddress, OperationNameValue, CategoryValue, Level, ActivityStatus, ResourceGroup, SubscriptionId"
