SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: |-
    let baseQuery = AzureActivity | extend Azure_Resource_Id = tolower(_ResourceId) | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}' | join kind= leftouter BehaviorAnalytics on $left._ItemId == $right.SourceRecordId;
    baseQuery
RequiredInputFieldsSets:
- - AzureResource_ResourceId
Insights:
  Id: 2ec468f6-f26c-4a6e-be12-f333aa284173
  DisplayName: Top IP addresses and locations (Preview)
  Description: "### Top IP addresses and locations \n ___ \n This insight shows you the top IP addresses that accessed this Azure Resource, and their geolocation, if available."
  DefaultTimeRange:
    BeforeRange: 12h
    AfterRange: 12h
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: IP
      OutputType: String
      SupportDeepLink: false
    - Header: Number of Events
      OutputType: Number
      SupportDeepLink: false
    - Header: Geo Location
      OutputType: Number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: 'where 1==1'
      Summarize: "summarize count() ,any(SourceIPLocation) by CallerIpAddress | top 10 by count_ desc"
      Project: "project ['IP']=CallerIpAddress, ['Number of events']=count_, ['Geolocation']=any_SourceIPLocation"
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View all the addresses
    Query: "summarize count() ,any(SourceIPLocation) by CallerIpAddress | sort by count_ desc | project ['IP']=CallerIpAddress, ['Number of events']=count_, ['Geolocation']=any_SourceIPLocation"
