SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: |-
    let baseQuery = AzureActivity | extend Azure_Resource_Id = tolower(_ResourceId) | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}';
    baseQuery
RequiredInputFieldsSets:
- - AzureResource_ResourceId
Insights:
  Id: 9a7fa65c-d7e5-4e01-8e21-a056cb3b5ab6
  DisplayName: Top Operations and Categories (Preview)
  Description: "### Top Operations and Categories\n ___ \n This insight shows you the operations most performed on this Azure Resource, and their categorization."
  DefaultTimeRange:
    BeforeRange: 12h
    AfterRange: 12h
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: Operation
      OutputType: String
      SupportDeepLink: false
    - Header: Category
      OutputType: Number
      SupportDeepLink: false
    - Header: Number of records
      OutputType: Number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: 'where 1==1'
      Summarize: "summarize count_=count() by OperationNameValue, CategoryValue | top 20 by count_ desc"
      Project: "project ['Operation']=OperationNameValue, CategoryValue, ['Number of records'] = count_"
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View additional details
    Query: "project Caller, CallerIpAddress, OperationNameValue, CategoryValue, Level, ActivityStatusValue, ResourceGroup, SubscriptionId"
