SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: |-
    let totalEvents = AzureActivity | extend Azure_Resource_Id = tolower(_ResourceId) | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}' | summarize total=count() by Azure_Resource_Id | project total, Azure_Resource_Id;
    let baseQuery = AzureActivity | extend Azure_Resource_Id = tolower(_ResourceId) | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}' | join kind=fullouter totalEvents on Azure_Resource_Id;
    baseQuery
RequiredInputFieldsSets:
- - AzureResource_ResourceId
Insights:
  Id: fb7b2c98-c4e5-4c58-ae70-194d1ad4265b
  DisplayName: Top Users Activity on Resource (Preview)
  Description: "### Top User Activity on Resource\n ___ \n This insight shows you the users that took the most actions on this Azure Resource."
  DefaultTimeRange:
    BeforeRange: 12h
    AfterRange: 12h
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: User
      OutputType: String
      SupportDeepLink: false
    - Header: Number of Events
      OutputType: Number
      SupportDeepLink: false
    - Header: Percentage
      OutputType: Number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: 'where 1==1'
      Summarize: "summarize count() by Caller, total, Azure_Resource_Id | extend percentage = round((todouble(count_) * 100 / todouble(total)), 2) | sort by percentage desc"
      Project: "project  Caller, itemCount = count_, percentage | take 10"
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View all users
    Query: summarize count() by Caller, total, Azure_Resource_Id | extend percentage = round((todouble(count_) * 100 / todouble(total)), 2) | sort by percentage desc | project  Caller, itemCount = count_, percentage
