SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes:
- DataType: AzureActivity
RequiredInputFieldsSets:
- - AzureResource_ResourceId
BaseQuery: |-
  AzureActivity
  | where OperationNameValue =~ "MICROSOFT.COMPUTE/VIRTUALMACHINES/EXTENSIONS/WRITE"
  | where _ResourceId =~ '{{AzureResource_ResourceId}}'
  | extend resBody = parse_json(Properties).responseBody
  | where resBody != ""
  | extend resBody = parse_json(tostring(resBody))
  | extend extName = resBody.name, extType = resBody.properties.type
  | where extType in ("VMAccessAgent", "VMAccessForLinux")
  | project TimeGenerated, Caller, _ResourceId, OperationNameValue, Resource

Activities:
     EnabledByDefault: true
     Title: "VM access extension execution (Preview)"
     Content: "The account {{Caller}} ran VM Access extension on the VM {{Count}} time(s)"
     Items:
        - Id: 0aa3626b-30dd-4731-9d1e-39872a73949c
          Description: This activity indicated VM access extension execution
          QueryDefinitions:
            SummarizeBy: Caller, _ResourceId
