[
  {
    "id": "/subscriptions/d4b9c5d3-7f45-4518-b484-8ddcfd80a361/resourceGroups/E2ETesting/providers/Microsoft.OperationalInsights/workspaces/AsiEnd2EndTest/providers/Microsoft.SecurityInsights/alertRules/5d68a76e-00f4-44c9-a5c1-8bcf39701a0b",
    "name": "5d68a76e-00f4-44c9-a5c1-8bcf39701a0b",
    "etag": "\"00005b5a-0000-0d00-0000-5d43470b0000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "Scheduled",
    "properties": {
      "severity": "Medium",
      "query": "SecurityEvent\r\n| where  (EventID == 4723 or EventID == 4724)\r\n| where  TargetUserName contains \"asiTestUser\" or TargetUserName contains \"E2EUser\"\r\n| extend AccountCustomEntity = TargetUserName",
      "queryFrequency": "PT5M",
      "queryPeriod": "PT10M",
      "triggerOperator": "GreaterThan",
      "triggerThreshold": 0,
      "suppressionDuration": "PT5H",
      "suppressionEnabled": false,
      "incidentConfiguration": {
        "createIncident": true,
        "groupingConfiguration": {
          "enabled": false,
          "reopenClosedIncident": false,
          "lookbackDuration": "PT5M",
          "entitiesMatchingMethod": "All",
          "groupByEntities": []
        }
      },
      "displayName": "AzureSentinelEnd2EndTest",
      "enabled": true,
      "description": "AzureSentinelEnd2EndTest",
      "tactics": null,
      "alertRuleTemplateName": null,
      "lastModifiedUtc": "2019-08-01T20:09:46.3695421Z"
    }
  },
  {
    "id": "/subscriptions/d4b9c5d3-7f45-4518-b484-8ddcfd80a361/resourceGroups/e2etesting/providers/Microsoft.OperationalInsights/workspaces/AsiEnd2EndTest/providers/Microsoft.SecurityInsights/alertRules/FusionBuiltIn",
    "name": "FusionBuiltIn",
    "etag": "\"0000da4d-0000-0d00-0000-5d7c14410000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "Fusion",
    "properties": {
      "displayName": "Advanced Multistage Attack Detection",
      "description": "By using Fusion technology that’s based on machine learning, Azure Sentinel can automatically detect multistage attacks by combining anomalous behaviors and suspicious activities that are observed at various stages of the kill-chain. Azure Sentinel then generates incidents that would otherwise be very difficult to catch. These incidents encase two or more alerts or activities. By design, these incidents are low volume, high fidelity, and high severity - which is why this detection is turned ON by default.\n\nThere are currently 35 incident types that include a combination of suspicious Azure Active Directory sign-in events followed by anomalous Office 365 activity. \n\nTo detect these multistage attacks, the following data connectors must be configured:\n- Azure Active Directory Identity Protection\n- Microsoft Cloud App Security\n\nFor a full list and description of each scenario that is supported for these multistage attacks, go to https://aka.ms/SentinelFusion.",
      "alertRuleTemplateName": "f71aba3d-28fb-450b-b192-4e76a83015c8",
      "tactics": [
        "Persistence",
        "LateralMovement",
        "Exfiltration",
        "CommandAndControl"
      ],
      "severity": "High",
      "enabled": true,
      "lastModifiedUtc": "2019-09-13T22:12:17.2640526Z"
    }
  }
]