[
  {
    "id": "/subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/azuresentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4soc/providers/Microsoft.SecurityInsights/alertRules/BuiltInFusion",
    "name": "BuiltInFusion",
    "etag": "\"63003153-0000-0100-0000-5f40c63c0000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "Fusion",
    "properties": {
      "displayName": "Advanced Multistage Attack Detection",
      "description": "By using Fusion technology that’s based on machine learning, Azure Sentinel can automatically detect multistage attacks by combining anomalous behaviors and suspicious activities that are observed at various stages of the kill-chain. Azure Sentinel then generates incidents that would otherwise be very difficult to catch. These incidents encase two or more alerts or activities. By design, these incidents are low volume, high fidelity, and high severity - which is why this detection is turned ON by default.\n\nThere are currently 35 incident types that include a combination of suspicious Azure Active Directory sign-in events followed by anomalous Office 365 activity. \n\nTo detect these multistage attacks, the following data connectors must be configured:\n- Azure Active Directory Identity Protection\n- Microsoft Cloud App Security\n\nFor a full list and description of each scenario that is supported for these multistage attacks, go to https://aka.ms/SentinelFusion.",
      "alertRuleTemplateName": "f71aba3d-28fb-450b-b192-4e76a83015c8",
      "tactics": [
        "Persistence",
        "LateralMovement",
        "Exfiltration",
        "CommandAndControl"
      ],
      "severity": "High",
      "enabled": true,
      "lastModifiedUtc": "2020-08-22T07:16:12.77706Z"
    }
  },
  {
    "id": "/subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/azuresentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4soc/providers/Microsoft.SecurityInsights/alertRules/66c336cb-6ffe-4f8c-b2b3-555ea0045aed",
    "name": "66c336cb-6ffe-4f8c-b2b3-555ea0045aed",
    "etag": "\"46009b31-0000-0100-0000-5f443f010000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "Scheduled",
    "properties": {
      "severity": "High",
      "query": "let timeframe = 1d;\nlet IPList = dynamic([\"45.63.52.41\",\"140.82.17.161\",\"207.148.101.95\",\"45.32.87.51\",\"66.42.98.156\",\"45.76.144.105\",\"217.163.28.35\",\"45.32.141.174\",\"149.28.165.249\",\"209.250.225.247\",\"45.63.100.115\",\"95.179.229.230\",\"209.250.233.247\",\"45.77.121.232\",\"45.76.175.65\",\"104.238.160.237\",\"45.77.181.97\",\"95.179.192.125\",\"149.28.93.184\",\"140.82.16.81\",\"45.76.173.103\",\"45.77.255.22\",\"45.32.11.71\",\"149.28.77.26\",\"45.32.54.50\",\"104.156.233.156\",\"45.32.21.118\",\"45.63.62.109\",\"45.77.244.202\",\"149.248.11.205\",\"104.238.190.244\"]);\nlet IOCTerms = \"\\\\?lang=[/..]*/dev/cmdb/sslvpn_websession|/dana-na/jam/[/..]*home/webserver/htdocs/dana/html5acc/guacamole[/..]*etc/passwd\\\\?\";\n(union isfuzzy=true\n(CommonSecurityLog\n| where TimeGenerated >= ago(1d) \n| where isnotempty(SourceIP) or isnotempty(DestinationIP)\n| where SourceIP in (IPList) or DestinationIP in (IPList) or Message has_any (IPList)\n| extend IPMatch = case(\nSourceIP in (IPList), \"SourceIP\", \nDestinationIP in (IPList), \"DestinationIP\",\n\"Message\") \n| where Message matches regex IOCTerms\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by SourceIP, DestinationIP, DeviceProduct, DeviceAction, Message, Protocol, SourcePort, DestinationPort, DeviceAddress, DeviceName, IPMatch\n| extend timestamp = StartTimeUtc, IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP, IPMatch == \"DestinationIP\", DestinationIP, \"IP in Message Field\") \n),\n(OfficeActivity\n| where TimeGenerated >= ago(1d) \n| where isnotempty(UserAgent) and ClientIP in (IPList)\n| where UserAgent contains \"ExchangeServicesClient/0.0.0.0\"\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by SourceIP = ClientIP, Account = UserId, Type, RecordType, OfficeWorkload, UserAgent, OfficeObjectId, IPMatch = \"ClientIP\"\n| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, IPCustomEntity = SourceIP\n)\n)",
      "queryFrequency": "P1D",
      "queryPeriod": "P1D",
      "triggerOperator": "GreaterThan",
      "triggerThreshold": 0,
      "suppressionDuration": "PT5H",
      "suppressionEnabled": false,
      "incidentConfiguration": {
        "createIncident": true,
        "groupingConfiguration": {
          "enabled": false,
          "reopenClosedIncident": false,
          "lookbackDuration": "PT5H",
          "entitiesMatchingMethod": "All",
          "groupByEntities": []
        }
      },
      "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
      },
      "displayName": "Known Manganese IP and UserAgent activity",
      "enabled": true,
      "description": "Matches IP plus UserAgent IOCs in OfficeActivity data, along with IP plus Connection string information in the CommonSecurityLog data related to Manganese group activity.\nReferences: \nhttps://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44101/\nhttps://fortiguard.com/psirt/FG-IR-18-384",
      "tactics": [
        "InitialAccess",
        "Collection"
      ],
      "alertRuleTemplateName": "a04cf847-a832-4c60-b687-b0b6147da219",
      "lastModifiedUtc": "2020-08-24T22:28:15.2638622Z"
    }
  },
  {
    "id": "/subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/azuresentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4soc/providers/Microsoft.SecurityInsights/alertRules/8f61c0eb-7095-43fe-9fa3-d58090dd104b",
    "name": "8f61c0eb-7095-43fe-9fa3-d58090dd104b",
    "etag": "\"8600c31c-0000-0100-0000-5f63d5cd0000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "Scheduled",
    "properties": {
      "severity": "Medium",
      "query": "let timeframe = 1d;\nSecurityEvent\n| where TimeGenerated >= ago(timeframe)\n| where EventID == 1102 and EventSourceName == \"Microsoft-Windows-Eventlog\" \n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), EventCount = count() by Computer, Account, EventID, Activity\n| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer",
      "queryFrequency": "P1D",
      "queryPeriod": "P1D",
      "triggerOperator": "GreaterThan",
      "triggerThreshold": 0,
      "suppressionDuration": "PT5H",
      "suppressionEnabled": false,
      "incidentConfiguration": {
        "createIncident": true,
        "groupingConfiguration": {
          "enabled": false,
          "reopenClosedIncident": false,
          "lookbackDuration": "PT5H",
          "entitiesMatchingMethod": "All",
          "groupByEntities": []
        }
      },
      "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
      },
      "displayName": "Security Event log cleared",
      "enabled": false,
      "description": "Checks for event id 1102 which indicates the security event log was cleared. \nIt uses Event Source Name \"Microsoft-Windows-Eventlog\" to avoid generating false positives from other sources, like AD FS servers for instance.",
      "tactics": [
        "DefenseEvasion"
      ],
      "alertRuleTemplateName": "80da0a8f-cfe1-4cd0-a895-8bc1771a720e",
      "lastModifiedUtc": "2020-09-17T21:31:57.491896Z"
    }
  },
  {
    "id": "/subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/azuresentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4soc/providers/Microsoft.SecurityInsights/alertRules/63a573f7-d425-4395-adc8-7f8e13c3dda8",
    "name": "63a573f7-d425-4395-adc8-7f8e13c3dda8",
    "etag": "\"230075e2-0000-0100-0000-5f5d86890000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "MicrosoftSecurityIncidentCreation",
    "properties": {
      "productFilter": "Microsoft Cloud App Security",
      "severitiesFilter": null,
      "displayNamesFilter": null,
      "displayNamesExcludeFilter": null,
      "displayName": "Create incidents based on Microsoft Cloud App Security alerts",
      "enabled": true,
      "description": "Create incidents based on all alerts generated in Microsoft Cloud App Security",
      "tactics": null,
      "alertRuleTemplateName": null,
      "lastModifiedUtc": "2020-09-13T02:40:09.316291Z"
    }
  },
  {
    "id": "/subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/providers/Microsoft.SecurityInsights/alertRules/8265eeb1-2505-48ed-b688-9a51abcd541c",
    "name": "8265eeb1-2505-48ed-b688-9a51abcd541c",
    "etag": "\"b600dcd8-0000-0100-0000-5f698fea0000\"",
    "type": "Microsoft.SecurityInsights/alertRules",
    "kind": "Scheduled",
    "properties": {
      "severity": "High",
      "query": "AzureActivity | where isnotempty(OperationName)",
      "queryFrequency": "PT1H",
      "queryPeriod": "P2DT1H30M",
      "triggerOperator": "GreaterThan",
      "triggerThreshold": 0,
      "suppressionDuration": "PT1H",
      "suppressionEnabled": false,
      "incidentConfiguration": {
        "createIncident": true,
        "groupingConfiguration": {
          "enabled": false,
          "reopenClosedIncident": false,
          "lookbackDuration": "PT5M",
          "entitiesMatchingMethod": "All",
          "groupByEntities": []
        }
      },
      "displayName": "Rule2",
      "enabled": true,
      "description": "",
      "tactics": null,
      "alertRuleTemplateName": null,
      "lastModifiedUtc": "2020-09-22T05:47:22.2843518Z"
    }
  }
]