[
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/2b8506b1-49b1-4c9f-9a0d-9386101ff976",
    "etag": "W/\"datetime'2020-09-22T05%3A51%3A52.8716334Z'\"",
    "properties": {
      "Category": "Hunting Queries",
      "DisplayName": "HuntingRule 1",
      "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "Tags": [
        {
          "Name": "Description",
          "Value": "Test"
        },
        {
          "Name": "Tactics",
          "Value": "Execution, Discovery"
        }
      ],
      "Version": 2
    },
    "name": "2b8506b1-49b1-4c9f-9a0d-9386101ff976",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/303a7849-7d62-4e28-b4a1-a663e3b177b4",
    "etag": "W/\"datetime'2020-09-19T16%3A49%3A21.2356724Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "Heartbeat | summarize Count() by Computer | take a",
      "Tags": [
        {
          "Name": "Group",
          "Value": "Computer"
        }
      ],
      "FunctionAlias": "heartbeat_func",
      "FunctionParameters": "a:int=1",
      "Version": 2
    },
    "name": "303a7849-7d62-4e28-b4a1-a663e3b177b4",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/624ca812-c7c1-46c4-ba57-30bb43e0a9e9",
    "etag": "W/\"datetime'2020-09-19T17%3A04%3A51.4183717Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "Tags": [
        {
          "Name": "Description",
          "Value": "Test"
        },
        {
          "Name": "Tactics",
          "Value": "Excution, Discovery"
        }
      ],
      "Version": 2
    },
    "name": "624ca812-c7c1-46c4-ba57-30bb43e0a9e9",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/884c45f1-745c-45d0-8953-e381327ec404",
    "etag": "W/\"datetime'2020-09-19T05%3A33%3A54.5051728Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "Heartbeat | summarize Count() by Computer | take a",
      "Tags": [
        {
          "Name": "Group",
          "Value": "Computer"
        }
      ],
      "FunctionAlias": "heartbeat_func",
      "FunctionParameters": "a:int=1",
      "Version": 2
    },
    "name": "884c45f1-745c-45d0-8953-e381327ec404",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/9c174c70-241a-451a-8fcf-1df75df260a2",
    "etag": "W/\"datetime'2020-09-17T23%3A50%3A35.1245574Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "Heartbeat | summarize Count() by Computer | take a",
      "Tags": [
        {
          "Name": "Group",
          "Value": "Computer"
        }
      ],
      "FunctionAlias": "heartbeat_func",
      "FunctionParameters": "a:int=1",
      "Version": 2
    },
    "name": "9c174c70-241a-451a-8fcf-1df75df260a2",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/9c63f502-62d0-47a3-ba01-6618df241902",
    "etag": "W/\"datetime'2020-09-24T16%3A25%3A09.7817757Z'\"",
    "properties": {
      "Category": "Hunting Queries",
      "DisplayName": "HuntingRule 1",
      "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "Tags": [
        {
          "Name": "Description",
          "Value": "Test"
        },
        {
          "Name": "Tactics",
          "Value": "Execution, Discovery"
        }
      ],
      "Version": 2
    },
    "name": "9c63f502-62d0-47a3-ba01-6618df241902",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/9d0c5823-2fac-4235-b7b8-2b7265dda4bc",
    "etag": "W/\"datetime'2020-09-19T16%3A57%3A41.277398Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "Heartbeat | summarize Count() by Computer | take a",
      "Tags": [
        {
          "Name": "Group",
          "Value": "Computer"
        }
      ],
      "Version": 2
    },
    "name": "9d0c5823-2fac-4235-b7b8-2b7265dda4bc",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/ad266a29-bd3d-44f8-af51-040e0837d3c5",
    "etag": "W/\"datetime'2020-09-19T17%3A01%3A44.9421039Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "Tags": [
        {
          "Name": "Group",
          "Value": "Computer"
        }
      ],
      "FunctionAlias": "heartbeat_func",
      "FunctionParameters": "a:int=1",
      "Version": 2
    },
    "name": "ad266a29-bd3d-44f8-af51-040e0837d3c5",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/b2251c79-c932-4c76-b4ec-2a32930ca99f",
    "etag": "W/\"datetime'2020-09-19T16%3A58%3A36.451352Z'\"",
    "properties": {
      "Category": "Saved Search Test Category",
      "DisplayName": "Create or Update Saved Search Test",
      "Query": "Heartbeat | summarize Count() by Computer | take a",
      "Tags": [
        {
          "Name": "Group",
          "Value": "Computer"
        }
      ],
      "Version": 2
    },
    "name": "b2251c79-c932-4c76-b4ec-2a32930ca99f",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AllEvents",
    "properties": {
      "DisplayName": "All Events",
      "Category": "Log Management",
      "Query": "Event | sort by TimeGenerated desc\r\n// Oql: Type=Event // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AllEvents",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|EventsWithStartedinEventID",
    "properties": {
      "DisplayName": "Count of Events containing the word \"started\" grouped by EventID",
      "Category": "Log Management",
      "Query": "search in (Event) \"started\" | summarize AggregatedValue = count() by EventID\r\n// Oql: Type=Event \"started\" | Measure count() by EventID // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|EventsWithStartedinEventID",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|EventsByEventLog",
    "properties": {
      "DisplayName": "Count of Events grouped by Event Log",
      "Category": "Log Management",
      "Query": "Event | summarize AggregatedValue = count() by EventLog\r\n// Oql: Type=Event | Measure count() by EventLog // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|EventsByEventLog",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|EventsByEventSource",
    "properties": {
      "DisplayName": "Count of Events grouped by Event Source",
      "Category": "Log Management",
      "Query": "Event | summarize AggregatedValue = count() by Source\r\n// Oql: Type=Event | Measure count() by Source // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|EventsByEventSource",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|EventsByEventsID",
    "properties": {
      "DisplayName": "Count of Events grouped by Event ID",
      "Category": "Log Management",
      "Query": "Event | summarize AggregatedValue = count() by EventID\r\n// Oql: Type=Event | Measure count() by EventID // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|EventsByEventsID",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|WarningEvents",
    "properties": {
      "DisplayName": "All Events with level \"Warning\"",
      "Category": "Log Management",
      "Query": "Event | where EventLevelName == \"warning\" | sort by TimeGenerated desc\r\n// Oql: Type=Event EventLevelName=warning // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|WarningEvents",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountOfWarningEvents",
    "properties": {
      "DisplayName": "Count of Events with level \"Warning\" grouped by Event ID",
      "Category": "Log Management",
      "Query": "Event | where EventLevelName == \"warning\" | summarize AggregatedValue = count() by EventID\r\n// Oql: Type=Event EventLevelName=warning | Measure count() by EventID // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountOfWarningEvents",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|NoOfConnectionsToOMSDKService",
    "properties": {
      "DisplayName": "How many connections to Operations Manager's SDK service by day",
      "Category": "Log Management",
      "Query": "Event | where EventID == 26328 and EventLog == \"Operations Manager\" | summarize AggregatedValue = count() by bin(TimeGenerated, 1d) | sort by TimeGenerated desc\r\n// Oql: Type=Event EventID=26328 EventLog=\"Operations Manager\" | Measure count() interval 1DAY // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|NoOfConnectionsToOMSDKService",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|EventsInOMBetween2000to3000",
    "properties": {
      "DisplayName": "Events in the Operations Manager Event Log whose Event ID is in the range between 2000 and 3000",
      "Category": "Log Management",
      "Query": "Event | where EventLog == \"Operations Manager\" and EventID >= 2000 and EventID <= 3000 | sort by TimeGenerated desc\r\n// Oql: Type=Event EventLog=\"Operations Manager\" EventID:[2000..3000] // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|EventsInOMBetween2000to3000",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|ServerRestartTime",
    "properties": {
      "DisplayName": "When did my servers initiate restart?",
      "Category": "Log Management",
      "Query": "search in (Event) \"shutdown\" and EventLog == \"System\" and Source == \"User32\" and EventID == 1074 | sort by TimeGenerated desc | project TimeGenerated, Computer\r\n// Oql: shutdown Type=Event EventLog=System Source=User32 EventID=1074 | Select TimeGenerated,Computer // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|ServerRestartTime",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|WindowsFireawallPolicySettingsChanged",
    "properties": {
      "DisplayName": "Windows Firewall Policy settings have changed",
      "Category": "Log Management",
      "Query": "Event | where EventLog == \"Microsoft-Windows-Windows Firewall With Advanced Security/Firewall\" and EventID == 2008 | sort by TimeGenerated desc\r\n// Oql: Type=Event EventLog=\"Microsoft-Windows-Windows Firewall With Advanced Security/Firewall\" EventID=2008 // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|WindowsFireawallPolicySettingsChanged",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|WindowsFireawallPolicySettingsChangedByMachines",
    "properties": {
      "DisplayName": "On which machines and how many times have Windows Firewall Policy settings changed",
      "Category": "Log Management",
      "Query": "Event | where EventLog == \"Microsoft-Windows-Windows Firewall With Advanced Security/Firewall\" and EventID == 2008 | summarize AggregatedValue = count() by Computer | limit 500000\r\n// Oql: Type=Event EventLog=\"Microsoft-Windows-Windows Firewall With Advanced Security/Firewall\" EventID=2008 | measure count() by Computer | top 500000 // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|WindowsFireawallPolicySettingsChangedByMachines",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|ListAllIISLogEntries",
    "properties": {
      "DisplayName": "All IIS Log Entries",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | sort by TimeGenerated desc\r\n// Oql: Type=W3CIISLog // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|ListAllIISLogEntries",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|DisplayBreakdownRespondCodes",
    "properties": {
      "DisplayName": "Shows breakdown of response codes",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by scStatus\r\n// Oql: Type=W3CIISLog | Measure count() by scStatus // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|DisplayBreakdownRespondCodes",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|FindMaximumTimeTakenForEachPage",
    "properties": {
      "DisplayName": "Find the maximum time taken for each page",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = max(TimeTaken) by csUriStem\r\n// Oql: Type=W3CIISLog | Measure Max(TimeTaken) by csUriStem // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|FindMaximumTimeTakenForEachPage",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|Show404PagesList",
    "properties": {
      "DisplayName": "Shows which pages people are getting a 404 for",
      "Category": "Log Management",
      "Query": "search scStatus == 404 | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by csUriStem\r\n// Oql: Type=W3CIISLog scStatus=404 | Measure count() by csUriStem // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|Show404PagesList",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AverageHTTPRequestTimeHTTPMethod",
    "properties": {
      "DisplayName": "Average HTTP Request time by HTTP Method",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = avg(TimeTaken) by csMethod\r\n// Oql: Type=W3CIISLog | Measure Avg(TimeTaken) by csMethod // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AverageHTTPRequestTimeHTTPMethod",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|ShowServersThrowingInternalServerError",
    "properties": {
      "DisplayName": "Shows servers that are throwing internal server error",
      "Category": "Log Management",
      "Query": "search scStatus == 500 | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by sComputerName\r\n// Oql: Type=W3CIISLog scStatus=500 | Measure count() by sComputerName // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|ShowServersThrowingInternalServerError",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountIISLogEntriesHTTPRequestMethod",
    "properties": {
      "DisplayName": "Count of IIS Log Entries by HTTP Request Method",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by csMethod\r\n// Oql: Type=W3CIISLog | Measure count() by csMethod // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountIISLogEntriesHTTPRequestMethod",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountIISLogEntriesHTTPUserAgent",
    "properties": {
      "DisplayName": "Count of IIS Log Entries by HTTP User Agent",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by csUserAgent\r\n// Oql: Type=W3CIISLog | Measure count() by csUserAgent // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountIISLogEntriesHTTPUserAgent",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountIISLogEntriesClientIPAddress",
    "properties": {
      "DisplayName": "Count of IIS Log Entries by Client IP Address",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by cIP\r\n// Oql: Type=W3CIISLog | Measure count() by cIP // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountIISLogEntriesClientIPAddress",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|IISLogEntriesForClientIP",
    "properties": {
      "DisplayName": "IIS Log Entries for a specific client IP Address (replace with your own)",
      "Category": "Log Management",
      "Query": "search cIP == \"192.168.0.1\" | extend Type = $table | where Type == W3CIISLog | sort by TimeGenerated desc | project csUriStem, scBytes, csBytes, TimeTaken, scStatus\r\n// Oql: Type=W3CIISLog cIP=\"192.168.0.1\" | Select csUriStem,scBytes,csBytes,TimeTaken,scStatus // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|IISLogEntriesForClientIP",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountOfIISLogEntriesByURLRequestedByClient",
    "properties": {
      "DisplayName": "Count of IIS Log Entries by URL requested by client (without query strings)",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by csUriStem\r\n// Oql: Type=W3CIISLog | Measure count() by csUriStem // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountOfIISLogEntriesByURLRequestedByClient",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountOfIISLogEntriesByHostRequestedByClient",
    "properties": {
      "DisplayName": "Count of IIS Log Entries by Host requested by client",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by csHost\r\n// Oql: Type=W3CIISLog | Measure count() by csHost // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountOfIISLogEntriesByHostRequestedByClient",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|CountOfIISLogEntriesByURLForHost",
    "properties": {
      "DisplayName": "Count of IIS Log Entries by URL for the host \"www.contoso.com\" (replace with your own)",
      "Category": "Log Management",
      "Query": "search csHost == \"www.contoso.com\" | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = count() by csUriStem\r\n// Oql: Type=W3CIISLog csHost=\"www.contoso.com\" | Measure count() by csUriStem // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|CountOfIISLogEntriesByURLForHost",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|TotalBytesSentByClientIPAddress",
    "properties": {
      "DisplayName": "Total Bytes sent by Client IP Address",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = sum(csBytes) by cIP\r\n// Oql: Type=W3CIISLog | Measure Sum(csBytes) by cIP // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|TotalBytesSentByClientIPAddress",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|TotalBytesReceivedByEachAzureRoleInstance",
    "properties": {
      "DisplayName": "Total Bytes received by each Azure Role Instance",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = sum(csBytes) by RoleInstance\r\n// Oql: Type=W3CIISLog | Measure Sum(csBytes) by RoleInstance // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|TotalBytesReceivedByEachAzureRoleInstance",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|TotalBytesReceivedByEachIISComputer",
    "properties": {
      "DisplayName": "Total Bytes received by each IIS Computer",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = sum(csBytes) by Computer | limit 500000\r\n// Oql: Type=W3CIISLog | Measure Sum(csBytes) by Computer | top 500000 // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|TotalBytesReceivedByEachIISComputer",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|TotalBytesRespondedToClientsByEachIISServerIPAddress",
    "properties": {
      "DisplayName": "Total Bytes responded back to clients by each IIS ServerIP Address",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = sum(scBytes) by sIP\r\n// Oql: Type=W3CIISLog | Measure Sum(scBytes) by sIP // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|TotalBytesRespondedToClientsByEachIISServerIPAddress",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|TotalBytesRespondedToClientsByClientIPAddress",
    "properties": {
      "DisplayName": "Total Bytes responded back to clients by Client IP Address",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = sum(scBytes) by cIP\r\n// Oql: Type=W3CIISLog | Measure Sum(scBytes) by cIP // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|TotalBytesRespondedToClientsByClientIPAddress",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AverageHTTPRequestTimeByClientIPAddress",
    "properties": {
      "DisplayName": "Average HTTP Request time by Client IP Address",
      "Category": "Log Management",
      "Query": "search * | extend Type = $table | where Type == W3CIISLog | summarize AggregatedValue = avg(TimeTaken) by cIP\r\n// Oql: Type=W3CIISLog | Measure Avg(TimeTaken) by cIP // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PEF: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AverageHTTPRequestTimeByClientIPAddress",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AllSyslog",
    "properties": {
      "DisplayName": "All Syslogs",
      "Category": "Log Management",
      "Query": "Syslog | sort by TimeGenerated desc\r\n// Oql: Type=Syslog // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AllSyslog",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AllSyslogsWithErrors",
    "properties": {
      "DisplayName": "All Syslog Records with Errors",
      "Category": "Log Management",
      "Query": "Syslog | where SeverityLevel == \"error\" | sort by TimeGenerated desc\r\n// Oql: Type=Syslog SeverityLevel=error // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AllSyslogsWithErrors",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AllSyslogByFacility",
    "properties": {
      "DisplayName": "All Syslog Records grouped by Facility",
      "Category": "Log Management",
      "Query": "Syslog | summarize AggregatedValue = count() by Facility\r\n// Oql: Type=Syslog | Measure count() by Facility // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AllSyslogByFacility",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_LogManagement|AllSyslogByProcessName",
    "properties": {
      "DisplayName": "All Syslog Records grouped by ProcessName",
      "Category": "Log Management",
      "Query": "Syslog | summarize AggregatedValue = count() by ProcessName\r\n// Oql: Type=Syslog | Measure count() by ProcessName // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_LogManagement|AllSyslogByProcessName",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_General|dataPointsPerManagementGroup",
    "properties": {
      "DisplayName": "Which Management Group is generating the most data points?",
      "Category": "General Exploration",
      "Query": "search * | summarize AggregatedValue = count() by ManagementGroupName\r\n// Oql: * | Measure count() by ManagementGroupName // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_General|dataPointsPerManagementGroup",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_General|dataTypeDistribution",
    "properties": {
      "DisplayName": "Distribution of data Types",
      "Category": "General Exploration",
      "Query": "search * | extend Type = $table | summarize AggregatedValue = count() by Type\r\n// Oql: * | Measure count() by Type // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_General|dataTypeDistribution",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_General|AlphabeticallySortedComputers",
    "properties": {
      "DisplayName": "All Computers with their most recent data",
      "Category": "General Exploration",
      "Query": "search not(ObjectName == \"Advisor Metrics\" or ObjectName == \"ManagedSpace\") | summarize AggregatedValue = max(TimeGenerated) by Computer | limit 500000 | sort by Computer asc\r\n// Oql: NOT(ObjectName=\"Advisor Metrics\" OR ObjectName=ManagedSpace) | measure max(TimeGenerated) by Computer | top 500000 | Sort Computer // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_General|AlphabeticallySortedComputers",
    "type": "Microsoft.OperationalInsights/savedSearches"
  },
  {
    "id": "subscriptions/31d14918-b1ae-429f-9178-62358dd97551/resourceGroups/AzureSentinel/providers/Microsoft.OperationalInsights/workspaces/sentinel4SOC/savedSearches/LogManagement(sentinel4SOC)_General|StaleComputers",
    "properties": {
      "DisplayName": "Stale Computers (data older than 24 hours)",
      "Category": "General Exploration",
      "Query": "search not(ObjectName == \"Advisor Metrics\" or ObjectName == \"ManagedSpace\") | summarize lastdata = max(TimeGenerated) by Computer | limit 500000 | where lastdata < ago(24h)\r\n// Oql: NOT(ObjectName=\"Advisor Metrics\" OR ObjectName=ManagedSpace) | measure max(TimeGenerated) as lastdata by Computer | top 500000 | where lastdata < NOW-24HOURS // Args: {OQ: True; WorkspaceId: 00000000-0000-0000-0000-000000000000} // Settings: {PTT: True; SortI: True; SortF: True} // Version: 0.1.122",
      "Version": 2
    },
    "name": "LogManagement(sentinel4SOC)_General|StaleComputers",
    "type": "Microsoft.OperationalInsights/savedSearches"
  }
]