id: 641bb3ce-912d-4ab8-9013-38d29ecd0492
name: Base64encodePEFile (0)
description: |-
  Finding base64 encoded PE files header seen in the command line parameters.
  Tags: #fileLess  #powershell.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents
  | where Timestamp > ago(7d)
  | where ProcessCommandLine contains "TVqQAAMAAAAEAAA"
  | top 1000 by Timestamp
