id: ec9a1c81-ea19-4fd8-abbb-c1309eea6503
name: python-based-attacks-on-macos
description: |-
  This query was originally published in the threat analytics report, Python abuse on macOS
  The Python programming language comes bundled with macOS. In threat intelligence gathered from macOS endpoints, we have observed numerous attacks run with EmPyre, a Python-based post-exploitation framework similar to PowerShell Empire for Windows.
  The following query checks for Microsoft Office documents that run Python scripts.
  Reference - https://www.powershellempire.com/
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
query: |-
  DeviceProcessEvents
  | where InitiatingProcessParentFileName in ("Microsoft Word", "Microsoft Excel")
  | where FileName =~ "Python"
  | where ProcessCommandLine matches regex "[A-Za-z0-9]{50}"
