id: 1ef38d9a-7d3e-4313-a961-169bb23ff270
name: qakbot-campaign-suspicious-javascript
description: |
  This query was originally published in the threat analytics report, Qakbot blight lingers, seeds ransomware
  Qakbot is malware that steals login credentials from banking and financial services. It has been deployed against small businesses as well as major corporations. Some outbreaks have involved targeted ransomware campaigns that use a similar set of techniques. Links to related queries are listed under See also.
  The following query detects possible attempts by Qakbot to execute malicious Javascript code.
  Reference - https://www.microsoft.com/security/blog/2017/11/06/mitigating-and-eliminating-info-stealing-qakbot-and-emotet-in-corporate-networks/
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
query: |
  DeviceProcessEvents
  | where InitiatingProcessFileName == "cmd.exe"
  | where FileName == "cscript.exe"
  | where InitiatingProcessCommandLine has "start /MIN"
  | where ProcessCommandLine has "E:javascript"
  | project ProcessCommandLine, 
  InitiatingProcessCommandLine, DeviceId, Timestamp
