//Title:Suspicious behavior wscript launching JS 
//Description:Suspicious wscript process launching JavaScript file.Detected malware ex:SocGholish.
//Author:kddx017831
DeviceProcessEvents
| where (ProcessCommandLine contains "wscript.exe" and ProcessCommandLine contains ".js") or (InitiatingProcessParentFileName contains "wscript.exe" and InitiatingProcessFileName endswith ".js") or  (InitiatingProcessFileName contains "wscript.exe" and FileName endswith ".js")
| project-reorder ProcessCommandLine
| summarize make_set(DeviceName), 
  make_set(TimeGenerated),make_set(FileName),make_set(InitiatingProcessFileName),make_set(InitiatingProcessCommandLine),make_set(InitiatingProcessParentFileName),make_set(AccountUpn) by ProcessCommandLine
