{
  "properties": {
    "lenses": {
      "0": {
        "order": 0,
        "parts": {
          "0": {
            "position": {
              "x": 0,
              "y": 0,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where Activity == 'THREAT'\n| where DeviceEventClassID == 'wildfire'\n| summarize count() by DeviceCustomString2\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "DeviceCustomString2",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "72b60b01-4813-4cb7-b913-16cfba0b534b"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "WildFire Verdicts",
                  "PartSubTitle": "Last 24 Hours"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "1": {
            "position": {
              "x": 6,
              "y": 0,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where Activity == \"THREAT\"\n| summarize count() by DeviceEventClassID\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "DeviceEventClassID",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "7be78514-27c6-45a8-9cb1-9d2bda498a95"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Threats by Subtypes",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| where Activity == \"THREAT\" and DeviceEventClassID != \"url\" and DeviceEventClassID != \"file\"\n| summarize count() by DeviceEventClassID\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "2": {
            "position": {
              "x": 12,
              "y": 0,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where Activity == \"THREAT\"\n| summarize count() by ApplicationProtocol\n| top 10 by count_\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "ApplicationProtocol",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "cb784592-d889-4f99-aad4-cfe194123a6c"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Threats by Applications",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| where Activity == \"THREAT\" and DeviceEventClassID != \"url\" and DeviceEventClassID != \"file\"\n| summarize count() by ApplicationProtocol\n| top 10 by count_\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "3": {
            "position": {
              "x": 0,
              "y": 4,
              "colSpan": 9,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where Activity == 'THREAT'\n| summarize count() by bin(TimeGenerated, 5m), DeviceEventClassID\n| render timechart\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "TimeGenerated",
                      "type": "DateTime"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [
                      {
                        "name": "DeviceEventClassID",
                        "type": "String"
                      }
                    ],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "beacb551-cbfe-4f28-b1ec-2c230d748c05"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Bar"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Threat Subtypes Over Time",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| where Activity == 'THREAT' and DeviceEventClassID != \"url\" and DeviceEventClassID != \"file\"\n| summarize count() by bin(TimeGenerated, 1h), DeviceEventClassID\n| render timechart\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "4": {
            "position": {
              "x": 9,
              "y": 4,
              "colSpan": 9,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where Activity == 'THREAT'\n| summarize count() by bin(TimeGenerated, 5m), LogSeverity\n| render timechart\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "TimeGenerated",
                      "type": "DateTime"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [
                      {
                        "name": "LogSeverity",
                        "type": "String"
                      }
                    ],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "7f6cea8f-a7c3-41a6-a12e-abe5059857e4"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Bar"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Threat Severity Over Time",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| where Activity == 'THREAT' and DeviceEventClassID != \"url\" and DeviceEventClassID != \"file\"\n| summarize count() by bin(TimeGenerated, 1h), LogSeverity\n| render timechart\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "5": {
            "position": {
              "x": 0,
              "y": 8,
              "colSpan": 9,
              "rowSpan": 5
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceEventClassID == \"vulnerability\" \n| extend ThreatId = extract(\"cat=([^;]+)\",1,AdditionalExtensions) \n| summarize count() by ThreatId, LogSeverity\n| top 20 by count_\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "f846bd4d-0767-4cad-a2ac-534f4f618e6f"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top Vulnerability Events",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| where DeviceEventClassID == \"vulnerability\" \n| extend ThreatId = extract(\"cat=([^;]+)\",1,AdditionalExtensions) \n| summarize count() by ThreatId, LogSeverity\n| top 20 by count_\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "6": {
            "position": {
              "x": 9,
              "y": 8,
              "colSpan": 9,
              "rowSpan": 5
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| search DeviceEventClassID:\"*virus*\"\n| summarize count() by RequestURL, DeviceEventClassID, DestinationIP, SourceIP\n| top 20 by count_\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "48dc6a32-7164-415d-b2df-b3a87d8736fa"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top Virus and Malware Events",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| search DeviceEventClassID:\"*virus*\"\n| summarize count() by RequestURL, DeviceEventClassID, DestinationIP, SourceIP, SourceUserID\n| top 20 by count_"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "7": {
            "position": {
              "x": 0,
              "y": 13,
              "colSpan": 18,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "398a3ec8-8315-492f-b239-11b791c8829a",
                    "ResourceGroup": "asi-dev",
                    "Name": "asi-dev",
                    "ResourceId": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourcegroups/asi-dev/providers/microsoft.operationalInsights/workspaces/asi-dev"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceEventClassID == \"vulnerability\" \n| extend ThreatId = extract(\"cat=([^;]+)\",1,AdditionalExtensions)\n| extend ThreatCategory = extract(\"PanOSThreatCategory=([^;]+)\",1, AdditionalExtensions)\n| summarize count() by ThreatId, ThreatCategory, LogSeverity\n| top 20 by count_\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053"
                },
                {
                  "name": "PartId",
                  "value": "c2e08e81-0d14-4e06-b458-c46cda17bfbe"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "asi-dev"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top Correlation Events",
                  "PartSubTitle": "Last 24 Hours",
                  "Query": "CommonSecurityLog\n| where DeviceEventClassID == \"correlation\" \n| extend ThreatId = extract(\"cat=([^;]+)\",1,AdditionalExtensions)\n| extend ThreatCategory = extract(\"PanOSThreatCategory=([^;]+)\",1, AdditionalExtensions)\n| summarize count() by ThreatId, ThreatCategory, LogSeverity\n| top 20 by count_\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          }
        }
      }
    }
  },
  "id": "arm/subscriptions/398a3ec8-8315-492f-b239-11b791c8829a/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/6e657d24-3397-41b5-b57f-8875c3461053",
  "name": "6e657d24-3397-41b5-b57f-8875c3461053",
  "type": "Microsoft.Portal/dashboards",
  "location": "centralus",
  "tags": {
    "hidden-title": "Palo Alto Networks - Threats Dasboard"
  },
  "apiVersion": "2015-08-01-preview"
}