{
  "properties": {
    "lenses": {
      "0": {
        "order": 0,
        "parts": {
          "0": {
            "position": {
              "x": 0,
              "y": 0,
              "colSpan": 18,
              "rowSpan": 1
            },
            "metadata": {
              "inputs": [],
              "type": "Extension/HubsExtension/PartType/MarkdownPart",
              "settings": {
                "content": {
                  "settings": {
                    "content": "<div style=\"font-size:300%;\">General Overview</div>",
                    "title": "",
                    "subtitle": ""
                  }
                }
              }
            }
          },
          "1": {
            "position": {
              "x": 19,
              "y": 0,
              "colSpan": 6,
              "rowSpan": 1
            },
            "metadata": {
              "inputs": [],
              "type": "Extension/HubsExtension/PartType/MarkdownPart",
              "settings": {
                "content": {
                  "settings": {
                    "content": "<div style=\"font-size:300%;\">Users</div>",
                    "title": "",
                    "subtitle": ""
                  }
                }
              }
            }
          },
          "2": {
            "position": {
              "x": 0,
              "y": 1,
              "colSpan": 9,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "OfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| summarize Amount = count() by Operation, bin_at(TimeGenerated, 1d, now()) \n| sort by Amount \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P7D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "TimeGenerated",
                      "type": "DateTime"
                    },
                    "yAxis": [
                      {
                        "name": "Amount",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [
                      {
                        "name": "Operation",
                        "type": "String"
                      }
                    ],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "4a095d3a-bb9d-447b-ac09-bc1e83da3efb"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Bar"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Operations by time, type",
                  "PartSubTitle": "Over the past week"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              },
              "filters": {
                "MsPortalFx_TimeRange": {
                  "model": {
                    "format": "local",
                    "granularity": "auto",
                    "relative": "7d"
                  }
                }
              }
            }
          },
          "3": {
            "position": {
              "x": 9,
              "y": 1,
              "colSpan": 9,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "OfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where TimeGenerated >= ago(14d)\n| summarize count() by bin_at(TimeGenerated, 1d, now())\n| extend Week = iff(TimeGenerated>=ago(7d), \"This Week\", \"Last Week\"), TimeGenerated = iff(TimeGenerated>=ago(7d), TimeGenerated, TimeGenerated + 7d)\n"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "TimeGenerated",
                      "type": "DateTime"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [
                      {
                        "name": "Week",
                        "type": "String"
                      }
                    ],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "6b6093d2-ae51-4cff-b134-dc50c5ab49a3"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Line"
                },
                {
                  "name": "TimeRange",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Activity per day",
                  "PartSubTitle": "Week Over Week"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              },
              "filters": {
                "MsPortalFx_TimeRange": {
                  "model": {
                    "format": "utc",
                    "granularity": "auto",
                    "relative": "30d"
                  }
                }
              }
            }
          },
          "4": {
            "position": {
              "x": 19,
              "y": 1,
              "colSpan": 6,
              "rowSpan": 6
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//5 Top SharePoint Users\r\nOfficeActivity\r\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\r\n| summarize count() by UserId\r\n| top 10 by count_ \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "676dcffa-2ac9-458f-bae2-a1d3ec7c3b68"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top 10 active users",
                  "PartSubTitle": "-",
                  "Query": "OfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| summarize Amount = count() by UserId\n| top 10 by Amount \n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "5": {
            "position": {
              "x": 0,
              "y": 5,
              "colSpan": 9,
              "rowSpan": 6
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Top sharepoint client IPS\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| summarize Amount = count() by Operation\n| top 10 by Amount\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "5b2a4a9d-343e-4c86-9a42-2ef7a7556594"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top 10 operations",
                  "PartSubTitle": "-"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "6": {
            "position": {
              "x": 9,
              "y": 5,
              "colSpan": 9,
              "rowSpan": 6
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Top sharepoint sites\r\nOfficeActivity\r\n| where OfficeWorkload in ('OneDrive', 'SharePoint') and Site_Url != \"\"\r\n| summarize Amount = count() by Site_Url\r\n| top 10 by Amount \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "bc02219c-5295-4bac-9e9f-d80fcb4da4a8"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top 10 sites",
                  "PartSubTitle": "-"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "7": {
            "position": {
              "x": 19,
              "y": 7,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Top sharepoint client IPS\r\nOfficeActivity\r\n| where OfficeWorkload in ('OneDrive', 'SharePoint') and ClientIP != \"\"\r\n| summarize Amount = count() by ClientIP\r\n| order by Amount \r\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "ClientIP",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "Amount",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "b238514f-d87a-475f-8b20-21c3d6359a4b"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top client IP'S",
                  "PartSubTitle": "-"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "8": {
            "position": {
              "x": 0,
              "y": 11,
              "colSpan": 18,
              "rowSpan": 1
            },
            "metadata": {
              "inputs": [],
              "type": "Extension/HubsExtension/PartType/MarkdownPart",
              "settings": {
                "content": {
                  "settings": {
                    "content": "<div style=\"font-size:300%;\">Files</div>",
                    "title": "",
                    "subtitle": ""
                  }
                }
              }
            }
          },
          "9": {
            "position": {
              "x": 19,
              "y": 11,
              "colSpan": 6,
              "rowSpan": 5
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Files Downloaded by top users\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where Operation == \"FileDownloaded\"\n| summarize Files = count() by UserId\n| take 10\n"
                },
                {
                  "name": "TimeRange",
                  "value": "2018-07-01T07:57:56.000Z/2018-08-26T07:57:56.709Z"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "56ea2b74-28cc-4c0c-81d5-f6219a094350"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Users which downloaded biggest amount of files",
                  "PartSubTitle": "Top 10"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "10": {
            "position": {
              "x": 0,
              "y": 12,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Files Uploaded by type\r\nOfficeActivity\r\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\r\n| where Operation == \"FileUploaded\"\r\n| summarize count() by SourceFileExtension\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "SourceFileExtension",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "14b57fcb-b745-4d53-ac7c-a609b77132d4"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Files uploaded by extension",
                  "PartSubTitle": "-"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "11": {
            "position": {
              "x": 6,
              "y": 12,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Files Uploaded vs Files Downloaded\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where Operation in (\"FileDownloaded\", \"FileUploaded\")\n| summarize count() by Operation, bin_at(TimeGenerated, 1h, now())\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "TimeGenerated",
                      "type": "DateTime"
                    },
                    "yAxis": [
                      {
                        "name": "count_",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [
                      {
                        "name": "Operation",
                        "type": "String"
                      }
                    ],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "aee77909-7653-4b8b-a038-e7c4871210d2"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Line"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Files - uploaded VS downloaded",
                  "PartSubTitle": "-",
                  "Query": "//Files Uploaded vs Files Downloaded\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where Operation in (\"FileDownloaded\", \"FileUploaded\")\n| summarize count() by Operation, bin_at(TimeGenerated, 1h, now())"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "12": {
            "position": {
              "x": 12,
              "y": 12,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "Subscription_ID",
                    "ResourceGroup": "Resource_Group_Name",
                    "Name": "Workspace_Name"
                  }
                },
                {
                  "name": "Query",
                  "value": "//Top sharepoint client IPS\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| summarize Amount = count() by Operation\n| top 10 by Amount\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/Subscription_ID/resourceGroups/dashboards/providers/Microsoft.Portal/dashboards/8c165a7d-fbf6-4208-acc2-587ac172e024"
                },
                {
                  "name": "PartId",
                  "value": "f37b2285-8dd1-46ad-8803-328cf82e6a14"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "Contoso77"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Files downloaded by extension",
                  "PartSubTitle": "-",
                  "Query": "//Files Downloaded by type\nOfficeActivity\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where Operation == \"FileDownloaded\"\n| summarize count() by SourceFileExtension"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          }
        }
      }
    }
  },
  "apiVersion": "2015-08-01-preview"
}