CommonSecurityLog
| parse-kv AdditionalExtensions as (CompanyName: string, CorrelationId:guid, ItemId: guid, SrcFileName: string, SrcFileSize: int, PasswordProtected: bool, AVResult: string, ThreatCount: int, BlockedCount: int, FileModification: string, SanitizationResult: string, SanitizationTime: int, ConnectorType: string, ConnectorName: string, ConnectorId: dynamic, PolicyName: string, ExceptionId: dynamic, IncidentURL: dynamic, MessageId: dynamic, Subject: string, From: string, Recipients: string) with (pair_delimiter=";", kv_delimiter="=")
| project-rename
    SrcFileSHA256=FileHash
| project-away AdditionalExtensions