id: 7017c313-c778-4a23-a15a-9e2f277b216e
name: Impersonation Detections by Detection Technology
description: |
  This query visualises total emails with Phish (BEC) Impersonation detections by Detection Technology
description-detailed: |
  This query visualises total emails with Phish Business Email Compromise (BEC) Impersonation detections by various Impersonation Detection technologies/controls in Microsoft Defender for Office 365.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents 
  | where DetectionMethods has 'Impersonation' 
  | project Timestamp, DT=parse_json(DetectionMethods) 
  | evaluate bag_unpack(DT) 
  | summarize count() by Phish=tostring(column_ifexists('Phish', ''))
  | sort by count_ desc
  | render piechart
version: 1.0.0
