id: 60d15bd4-1fad-4a70-bc3b-094dc1c5e554
name: UMWorkerProcess Creating Webshell
description: |
  This query detects unusual file content created by UMWorkerProcess, indicating exploitation of CVE-2021-26858 to generate a web shell. More related queries can be found on the Microsoft Security Response Center blog.
description-detailed: |
  This query was originally published in the threat analytics report, "Exchange Server zero-days exploited in the wild".
  In early March 2021, Microsoft released patches for four different zero-day vulnerabilities affecting Microsoft Exchange Server. The vulnerabilities were being used in a coordinated attack. For more information on the vulnerabilities, visit the following links:
  1. CVE-2021-26855
  2. CVE-2021-26857
  3. CVE-2021-26858
  4. CVE-2021-27065
  The following query detects unusual file content being created by UMWorkerProcess, the Exchange Unified Messaging service. This might indicated that CVE-2021-26858 is being exploited to generate a web shell.
  More queries related to this threat can be found under the See also section of this page.
  Reference - https://msrc-blog.microsoft.com/2021/03/02/multiple-security-updates-released-for-exchange-server/
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
tactics:
- Execution
- Persistence
- Exploit
query: |
  DeviceFileEvents
  | where InitiatingProcessFileName == "UMWorkerProcess.exe" 
  | where FileName !in~("CacheCleanup.bin", "cleanup.bin")
  | where FileName !endswith ".txt"
  | where FileName !endswith ".LOG" 
  | where FileName !endswith ".cfg"
version: 1.0.0
