// Name: Attempt to Bypass conditional access rule
// Id: 3af9285d-bb98-4a35-ad29-5ea39ba0c628
//
// Description: This query over Azure AD sign-in activity highlights attempt to Bypass conditional access rule.
// The ConditionalAccessStatus column value in the logs details if there was an attempt to bypass Conditional Access
// or if the Conditional access rule was not satisfied (ConditionalAccessStatus == 1 )
// ConditionalAccessStatus == 0     //Success
// ConditionalAccessStatus == 1     // Failure
// ConditionalAccessStatus == 2      // Not Applied
// ConditionalAccessStatus == 3      // unknown
//
// DataSource: #SigninLogs
//
// Severity: Low
//
// QueryFrequency: 24
//
// QueryPeriod: 24
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// Techniques: #InitialAccess
//
let timeRange = ago(1d);
SigninLogs
| where TimeGenerated >= timeRange
| where ConditionalAccessStatus == 1 
// Conditional access rule was not satisfied
| extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser 
| extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)
| extend locationString= strcat(tostring(LocationDetails["countryOrRegion"]), "/", tostring(LocationDetails["state"]), "/", tostring(LocationDetails["city"]))
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[0].displayName)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[1].displayName)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[2].displayName)
| summarize makeset(AppDisplayName) by UserPrincipalName  , locationString, IPAddress ,tostring(Browser),tostring(OS),ConditionalAccessPol1Name , ConditionalAccessPol0Name
