// Name: Attempts to sign in to disabled accounts by account name.
//
// Id: 75ea5c39-93e5-489b-b1e1-68fa6c9d2d04
//
// Description: (failed) attempts to sign in to disabled accounts summarized by
// account name. An alert is generated if this behaviour is seen across 
// multiple Azure Applications.
//
// DataSource: #SigninLogs
//
// Severity: Medium
//
// QueryFrequency: 24
//
// QueryPeriod: 24
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// Tactics: #InitialAccess
//
SigninLogs
| where TimeGenerated >= ago(30d)
| where ResultType == "50057"
| where ResultDescription == "User account is disabled. The account has been disabled by an administrator."
| summarize count(), applicationCount=dcount(AppDisplayName), applicationSet=makeset(AppDisplayName) by UserPrincipalName
| where applicationCount >= 3
