id: 6b478186-da3b-4d71-beaa-aa5b42908499
name: Mailflow by directionality
description: |
  This query helps reviewing inbound / outbound / intra-org emails by domain per day
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents 
  | where Timestamp > ago(30d)
  | extend domain = substring(RecipientEmailAddress, indexof(RecipientEmailAddress, "@")+1) 
  | summarize total=count() by EmailDirection, domain, bin(Timestamp, 1d) 
  | order by Timestamp asc
