id: b77e9765-8b1f-4fec-b702-339a0402975a
name: LemonDuck-registration-function
description: |-
  LemonDuck is an actively updated and robust malware primarily known for its botnet and cryptocurrency mining objectives. First discovered in 2019, LemonDuck has since adopted more sophisticated behavior and escalated its operations in 2021. Today, beyond using resources for its traditional bot and mining activities, LemonDuck steals credentials, removes security controls, spreads via emails, moves laterally, and ultimately drops more tools for human-operated activity.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceEvents
tactics:
- Execution
- Persistence
- Lateral movement
- Command and control
query: |-
  DeviceEvents
  | where ActionType == "PowerShellCommand"
  | where AdditionalFields =~ "{\"Command\":\"SIEX\"}"
