id: 46320412-ba5c-49c5-abcf-4ebbf621ab06
name: LemonDuck-defender-exclusions
description: |-
  LemonDuck is an actively updated and robust malware primarily known for its botnet and cryptocurrency mining objectives. First discovered in 2019, LemonDuck has since adopted more sophisticated behavior and escalated its operations in 2021. Today, beyond using resources for its traditional bot and mining activities, LemonDuck steals credentials, removes security controls, spreads via emails, moves laterally, and ultimately drops more tools for human-operated activity.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Defense evasion
query: "DeviceProcessEvents  \r\n| where InitiatingProcessCommandLine has_all (\"Set-MpPreference\", \"DisableRealtimeMonitoring\", \"Add-MpPreference\", \"ExclusionProcess\")  \r\n| project ProcessCommandLine, InitiatingProcessCommandLine, DeviceId, Timestamp  "
