id: 147c4c0a-7241-4ce9-9b71-0aecb8a2b59f
name: LemonDuck Registration Function
description: |
  LemonDuck is a malware primarily known for its botnet and cryptocurrency mining objectives. First discovered in 2019, LemonDuck has since adopted more sophisticated behavior and escalated its operations in 2021.
description-detailed: |
  LemonDuck is an actively updated and robust malware primarily known for its botnet and cryptocurrency mining objectives. First discovered in 2019, LemonDuck has since adopted more sophisticated behavior and escalated its operations in 2021. Today, beyond using resources for its traditional bot and mining activities, LemonDuck steals credentials, removes security controls, spreads via emails, moves laterally, and ultimately drops more tools for human-operated activity.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceEvents
tactics:
  - Execution
  - Persistence
  - LateralMovement
  - CommandAndControl
query: |
  DeviceEvents
  | where ActionType == "PowerShellCommand"
  | where AdditionalFields =~ "{\"Command\":\"SIEX\"}"
version: 1.0.0