id: 4a2cfd04-cb9a-4adf-a2c1-66ccfe0d9139
name: TI Map IP Entity to 1Password SignIn Logs
description: |
  'This query maps any IP indicators of compromise (IOCs) from threat intelligence (TI), by searching for matches in SigninLogs.'
severity: Medium
requiredDataConnectors:
  - connectorId: OnePasswordSignIn
    dataTypes:
      - OnePasswordSignInEvents_CL
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
query: |
  let dt_lookBack = 1h; // Look back 1 hour for OnePasswordSignIn events
  let ioc_lookBack = 14d; // Look back 14 days for threat intelligence indicators
  // Fetch threat intelligence indicators related to IP addresses
  let IP_Indicators = ThreatIntelligenceIndicator
  | where TimeGenerated >= ago(ioc_lookBack)
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
  | where Active == true and ExpirationDateTime > now()
  | where isnotempty(NetworkIP) or isnotempty(EmailSourceIpAddress) or isnotempty(NetworkDestinationIP) or isnotempty(NetworkSourceIP)
  | extend TI_ipEntity = iff(isnotempty(NetworkIP), NetworkIP, NetworkDestinationIP)
  | extend TI_ipEntity = iff(isempty(TI_ipEntity) and isnotempty(NetworkSourceIP), NetworkSourceIP, TI_ipEntity)
  | extend TI_ipEntity = iff(isempty(TI_ipEntity) and isnotempty(EmailSourceIpAddress), EmailSourceIpAddress, TI_ipEntity)
  | where ipv4_is_private(TI_ipEntity) == false and  TI_ipEntity !startswith "fe80" and TI_ipEntity !startswith "::" and TI_ipEntity !startswith "127.";
  // Perform a join between IP indicators and OnePasswordSignIn events
  IP_Indicators
  | join kind=innerunique (
    OnePasswordSignInEvents_CL
    | extend todatetime(timestamp_s)
    | where timestamp_s >= ago(dt_lookBack)
    ) 
    on $left.TI_ipEntity == $right.client_ip_address_s 
    | where timestamp_s < ExpirationDateTime
    // Group the results by IndicatorId and client_ip_address_s, and keep the log entry with the latest timestamp
    | summarize arg_max(timestamp_s, *) by IndicatorId, client_ip_address_s
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: client_ip_address_s
version: 1.0.0
kind: Scheduled