{
  "id": "IoT",
  "title": "Microsoft Defender for IoT",
  "publisher": "Microsoft",
  "descriptionMarkdown": "Gain insights into your IoT security by connecting Microsoft Defender for IoT alerts to Microsoft Sentinel.\nYou can get out-of-the-box alert metrics and data, including alert trends, top alerts, and alert breakdown by severity.\nYou can also get information about the recommendations provided for your IoT hubs including top recommendations and recommendations by severity. For more information, see the [Microsoft Sentinel documentation](https://go.microsoft.com/fwlink/p/?linkid=2224002&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
  "logo": "IoTIcon.svg",
  "graphQueries": [
    {
      "metricName": "Total data received",
      "legend": "SecurityAlerts",
      "baseQuery": "SecurityAlert | where ProductName == \"Azure Security Center for IoT\""
    }
  ],
  "sampleQueries": [
    {
      "description": "All logs",
      "query": "SecurityAlert | where ProductName == \"Azure Security Center for IoT\"\n            | sort by TimeGenerated"
    },
    {
      "description": "Summarize by severity",
      "query": "SecurityAlert | where ProductName == \"Azure Security Center for IoT\"\n            | summarize count() by AlertSeverity"
    }
  ],
  "connectivityCriterias": [
    {
      "type": "SentinelKinds",
      "value": [
        "IOT"
      ]
    }
  ],
  "dataTypes": [
    {
      "name": "SecurityAlert (ASC for IoT)",
      "lastDataReceivedQuery": "SecurityAlert | where ProductName == \"Azure Security Center for IoT\"\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
    }
  ],
  "availability": {
    "status": 2,
    "isPreview": false,
    "featureFlag": {
      "feature": "AzureKeyVaultFeature",
      "featureStates": {
        "1": 3,
        "2": 3,
        "3": 3,
        "4": 3,
        "5": 2,
        "6": 2,
        "7": 2
      }
    }
  },
  "permissions": {
    "resourceProvider": [
      {
        "provider": "Microsoft.OperationalInsights/workspaces",
        "permissionsDisplayText": "read and write permissions.",
        "providerDisplayName": "Workspace",
        "scope": "Workspace",
        "requiredPermissions": {
          "read": true,
          "write": true,
          "delete": true
        }
      }
    ],
    "customs": [
      {
        "name": "Subscription",
        "description": "Contributor permissions to the subscription of your IoT Hub."
      }
    ]
  },
  "instructionSteps": [
    {
      "title": "Connect Microsoft Defender for IoT to Microsoft Sentinel",
      "description": "Select Connect next to each Subscription whose IoT Hub's alerts you want to stream to Microsoft Sentinel.",
      "instructions": [
        {
          "parameters": {
            "linkType": "OpenIotPricingModel"
          },
          "type": "InstallAgent"
        },
        {
          "parameters": {},
          "type": "IotV2"
        }
      ]
    }
  ],
  "caseGenerationSteps": [
    {
      "instructions": [
        {
          "parameters": {
            "filterProduct": "Azure Security Center for IoT"
          },
          "type": "FilterAlert"
        }
      ]
    }
  ]
}