id: 0d5eac98-5c1c-41e3-8011-630867141fa9
name: Detecting important data destruction by ransomware - rule 3
description: |
  This query identifies someone that removes a "backup item".
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1490
query: |
  AzureActivity
  | where OperationName =~ "Unregister Service Container"
  | where ActivityStatus != "Started" // Leave out the start. We want to get one hit only for the final result being "Succeeded" or "Failed" or whatever else.

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Caller
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 1.0.0
kind: Scheduled