id: dacce6f2-a040-4a1a-a1a5-37631393e7f6
name: Detecting important data destruction by ransomware - rule 2
description: |
  This query identifies someone that disables "soft delete".
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1490
query: |
  AzureActivity
  | where OperationName =~ "Update Resource Config"
  | where Resource =~ "vaultconfig" and ResourceGroup == "<YOUR RG NAME HERE>"
  | where ActivityStatus != "Started" // Leave out the start. We want to get one hit only for the final result being "Succeeded" or "Failed" or whatever else.

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Caller
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 1.0.0
kind: Scheduled