id: 4f0ae452-dd95-428b-bb61-f4b9fa7b5dbd
name: Detecting important data destruction by ransomware - rule 1
description: |
  This query identifies someone that deletes a resource lock.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1490
query: |
  AzureActivity
  | where OperationNameValue =~ "Microsoft.Authorization/locks/delete"
  | where Resource =~ "<YOUR LOCK NAME HERE>"
  | where ActivityStatus != "Started" // Leave out the start. We want to get one hit only for the final result being "Succeeded" or "Failed" or whatever else.

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Caller
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 1.0.0
kind: Scheduled