id: f4b2ee89-d9a4-4265-82bc-e12c784691f5
name: Password Spraying - 2
description: |
  This query detects a password spraying attack, where a single machine has performed a large number of failed login attempts, with a large number of different accounts. For each account, the attacker uses just a few attempts to prevent account lockout. 
  This query uses the Microsoft Defender for Identity (MDI) data as a datasource for the analysis. MDI has its own password spraying detection, but that's not configurable. This implementation provides three variables to tune to your environment.
severity: Medium
requiredDataConnectors:
  - connectorId: XXX // BANAAN [moet XXX door degene die de query gebruikt worden ingevuld? Zie ook lines 32-35 hieronder] MDI
    dataTypes:
      - IdentityLogonEvents
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Credential Access
relevantTechniques:
  - T1110.003
query: |
  let thresholdForUniqueFailedAccounts = 20;
  let upperBoundOfFailedLogonsPerAccount = 10;
  let ratioSuccessFailedLogons = 0.5;
  let timeframe = 1d;
  IdentityLogonEvents
  | where Timestamp >= ago(timeframe)
  | summarize SuccessLogonCount = countif(ActionType == "LogonSuccess"), FailedLogonCount = countif(ActionType == "LogonFailed"),
      UniqueAccountFailedLogons=dcountif(AccountUpn, ActionType == "LogonFailed"), FailedAccounts=make_set_if(AccountUpn, ActionType == "LogonFailed"),
      SuccessAccounts=make_set_if(AccountUpn, ActionType == "LogonSuccess"), FirstFailed=minif(Timestamp, ActionType == "LogonFailed"),
      LastFailed=maxif(Timestamp, ActionType == "LogonFailed"), LastTimestamp=arg_max(Timestamp, tostring(ReportId)) by IPAddress, DeviceName // IP address is here the "remote IP" , i.e. the source of the logon attempt.
  | where UniqueAccountFailedLogons > thresholdForUniqueFailedAccounts and SuccessLogonCount*ratioSuccessFailedLogons < FailedLogonCount and UniqueAccountFailedLogons*upperBoundOfFailedLogonsPerAccount > FailedLogonCount 
entityMappings:
  - entityType: ABC
    fieldMappings:
      - identifier: XYZ
        columnName: XXX 
version: 1.0.0


