id: c903138d-b948-4975-a660-57495b3f8754
name: Malicious bat file
description: |
  ZLoader was delivered in a campaign in late summer 2021. This campaign was tweeted by @MsftSecIntel on twitter.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
tactics:
- Initial access
query: |
  DeviceFileEvents
  | where FileName endswith '.bat'
      and FolderPath has @'Program Files (x86)\Sun Technology Network\Oracle Java SE'
