id: 47506508-dee4-4d4d-93a8-1c78d63cd2eb
name: Top accounts performing user submissions
description: |
  This query graphs top accounts performing user submissions
description-detailed: |
  This query graphs top accounts performing user submissions in Defender for Office 365
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents
  | where Timestamp > ago(30d) 
  | extend Record= (parse_json(RawEventData)).RecordType 
  | extend SubmissionState = (parse_json(RawEventData)).SubmissionState  
  | extend UserId = (parse_json(RawEventData)).UserId
  | where Record == 29 
  | where ActionType == "UserSubmission" 
  | summarize count() by tostring(UserId) | sort by count_ //| top 50 by count_
  | render columnchart
version: 1.0.0