id: 8b0bae20-687f-47ca-bc2e-8dabbed9cbae
name: Top accounts performing admin submissions (FP)
description: |
  This query visualises the top admins performing false positive submissions
description-detailed: |
  This query visualises the top admins performing false positive submissions in Defender for Office 365
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents
  | where ActionType == "AdminSubmissionSubmitted"
  | extend Record= (parse_json(RawEventData)).RecordType,SubmissionState = (parse_json(RawEventData)).SubmissionState, UserId = (parse_json(RawEventData)).UserId,SubmissionType = parse_json(RawEventData).SubmissionType
  | where Record == 29 and SubmissionType =="3"
  | summarize count() by tostring(UserId) | sort by count_
  | top 15 by count_
  | render columnchart
version: 1.0.0
