id: d236f728-8b0f-4b4f-acf7-e4707993b841
name: Top accounts performing admin submissions (FN)
description: |
  This query visualises the top admins performing false negative submissions
description-detailed: |
  This query visualises the top admins performing false negative submissions in Defender for Office 365
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents
  | where ActionType == "AdminSubmissionSubmitted"
  | extend Record= (parse_json(RawEventData)).RecordType,SubmissionState = (parse_json(RawEventData)).SubmissionState, UserId = (parse_json(RawEventData)).UserId,SubmissionType = parse_json(RawEventData).SubmissionType
  | where Record == 29 and SubmissionType in ("0","1","2")
  | summarize count() by tostring(UserId) | sort by count_
  | top 15 by count_
  | render columnchart
version: 1.0.0
