id: 53c58a33-668d-46e1-9714-5892c87650d9
name: Total Submissions by Submission Type
description: |
  Total Submissions by Submission Status
description-detailed: |
  Total Submissions by Submission Status in Defender for Office 365.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents
  | where Timestamp > ago(30d) 
  | extend Record= (parse_json(RawEventData)).RecordType 
  | extend SubmissionState = (parse_json(RawEventData)).SubmissionState  
  | extend UserKey = (parse_json(RawEventData)).UserKey 
  | where Record == 29 
  | where ActionType == "UserSubmission" or ActionType == "AdminSubmission" 
  | summarize count() by tostring(SubmissionState) | sort by count_
  // | render piechart // Uncomment this line to render as a graph
version: 1.0.0