id: ff9a1b12-e446-44ff-a576-7f53caa32044
name: ARS Ransomware Event triggered
description: |
  This rule detects when the ASR rule AsrRansomwareBlocked or AsrRansomwareAudited is triggered.
  No alert is generated by default. This could be the start of a ransomware attack. 
  Additional information available by Microsoft: 
  https://docs.microsoft.com/microsoft-365/security/defender-endpoint/attack-surface-reduction-rules-reference?view=o365-worldwide#use-advanced-protection-against-ransomware
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
tactics:
- Ransomware
relevantTechniques:
  - T1486
query: |
  DeviceEvents
  | where Timestamp > ago(30d)
  | where ActionType has_any ('AsrRansomwareBlocked', 'AsrRansomwareAudited')
  | summarize arg_max(Timestamp, *), TotalEvents = count(), TriggeredFiles = make_set(FileName),FileHashes = make_set(SHA1),
  IntiatingProcesses = make_set(InitiatingProcessCommandLine) by DeviceName, AccountName
  | project Timestamp, DeviceName, AccountDomain, AccountName, TotalEvents, TriggeredFiles, FileHashes, IntiatingProcesses
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountName 
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName 
