id: 765470fe-00e6-48f2-b08f-185f6eb101f2
name: DarkSide
description: |-
  Use this query to look for running DarkSide ransomware behavior in the environment
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Ransomware
query: |+
  DeviceProcessEvents 
  | where FileName =~ "rundll32.exe" | where ProcessCommandLine matches regex @".dll,#(?:1|3) worker[0-9]\sjob[0-9]-[0-9]{4,}"
