id: cb6cd262-719d-4fe3-a7ac-64f7b3024a9a
name: Distribution from remote location
description: |-
  This query checks for alerts related to file drop and remote execution where the file name matches PsExec and similar tools used for distribution
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - AlertInfo
  - AlertEvidence
tactics:
- Ransomware
query: |+
  AlertInfo
  | where Title == "File dropped and launched from remote location"
  | join AlertEvidence on $left.AlertId == $right.AlertId
  // Looking for tools involved in potential distribution of ransomware
  | where FileName hasprefix "psexe" or (FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}")
  or ProcessCommandLine has "accepteula"
