id: 21444f27-9184-45bf-a335-7b7169a56790
name: File Backup Deletion Alerts
description: |
  This query checks alerts related to file backup deletion and enriches with additional alert evidence information
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - AlertInfo
  - AlertEvidence
tactics:
- Ransomware
query: |
  AlertInfo
  | where Title == "File backups were deleted"
  | join AlertEvidence on $left.AlertId == $right.AlertId
