id: 8d13e6ad-0a17-46fa-aa3e-c4c28e7d81a9
name: File Backup Deletion Alerts
description: |-
  This query checks alerts related to file backup deletion and enriches with additional alert evidence information
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - AlertInfo
  - AlertEvidence
tactics:
- Ransomware
query: |+
  AlertInfo
  | where Title == "File backups were deleted"
  | join AlertEvidence on $left.AlertId == $right.AlertId
