id: b2f3ee1c-f379-465c-a339-412ecf3b1bcb
name: IcedId Delivery
description: |
  Use this query to locate successful delivery of associated malicious downloads that can lead to ransomware
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
tactics:
- Initial access
- Ransomware
query: |
  DeviceFileEvents 
  | where InitiatingProcessFileName in~("msedge.exe", "chrome.exe", "explorer.exe", "7zFM.exe", "firefox.exe", "browser_broker.exe") 
  | where FileOriginReferrerUrl has ".php" and FileOriginReferrerUrl has ".top" and FileOriginUrl  has_any("googleusercontent", "google", "docs")
