id: 35a62e99-6108-48a8-9b3b-38c22fdeb7a3
name: IcedId email delivery
description: |-
  Use this query to locate emails and malicious downloads related to the IcedId activity that can lead to ransomware
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailUrlInfo
  - EmailEvents
tactics:
- Initial access
- Ransomware
query: |+
  EmailUrlInfo 
  | where Url matches regex @"\bsites\.google\.com\/view\/(?:id)?\d{9,}\b" 
  | join EmailEvents on NetworkMessageId // Note: Replace the following subject lines with the one generated by your website's Contact submission form if no results return initially 
  | where Subject has_any('Contact Us', 'New Submission', 'Contact Form', 'Form submission')
