id: cd9c8cd5-b11a-467f-8f4d-9a73c244e54e
name: Sticky Keys
description: |-
  A technique used in numerous ransomware attacks is a Sticky Keys hijack for privilege escalation/persistence. Surface realted alerts with this query.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - AlertInfo
tactics:
- Ransomware
query: |-
  // Checks for possible hijacking of Sticky Keys feature 
  AlertInfo | where Title == "Sticky Keys binary hijack detected"
