id: 0c29e965-e33b-459b-97c3-9ac9f9fcd981
name: Suspicious Google Doc Links
description: |-
  Use this query to find emails with message IDs that resemble IDs used in known attack emails and contain a link a document in Google Docs. These behaviors have
  been observed leading to ransomware attacks.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailUrlInfo
  - EmailEvents
tactics:
- Initial access
- Ransomware
query: |+
  EmailUrlInfo 
  | where Url startswith "https://docs.google.com/document/" 
  | join (EmailEvents 
  | where EmailDirection == "Inbound" 
  | where InternetMessageId matches regex "\\<\\w{ 38,42} \\@") on NetworkMessageId 
