Function:
  Title: An ASIM normalized view of the IdentityInfo table  
  Version: '0.1'
  LastUpdated: Jan 2 2023
References:
- Title: ASIM
  Link: https://aka.ms/AboutASIM
- Title: The IdentityInfo table
  Link: https://learn.microsoft.com/azure/sentinel/ueba-reference#identityinfo-table
Description: |
  This ASIM function deduplicate and normalizes the IdentityInfo table to improve its usability in queries. 
FunctionName: ASIM_IdentityInfo
EquivalentBuiltInFunction: _ASIM_IdentityInfo

FunctionQuery: |
  IdentityInfo
    | where TimeGenerated > ago(14d)
    | where AccountObjectId != ""
    | project-away AccountName, AccountDomain, GivenName, Surname, Type, TenantId, OnPremisesExtensionAttributes, UserState, UserStateChangedOn, SourceSystem
    | project-away InvestigationPriority, InvestigationPriorityPercentile, ExtensionProperty, AccountCloudSID, Applications, ServicePrincipals
    | summarize arg_max(TimeGenerated, *) by UserScopeId = AccountTenantId, UserId = AccountObjectId
    | project-away TimeGenerated
    | project-rename
        Username = AccountUPN,
        UserDisplayName = AccountDisplayName,
        UserSid = AccountSID,
        UserDN = OnPremisesDistinguishedName,
        UserTags = Tags,
        UserRiskLevel = RiskLevel,
        UserRiskLevelDetails = RiskLevelDetails,
        UserRiskState = RiskState, 
        UserBlastRadius = BlastRadius,
        UserGroupMembership = GroupMembership,
        UserAssignedRoles = AssignedRoles,
        UserDepartment = Department,
        UserEmployeeId = EmployeeId,
        UserJobTitle = JobTitle,
        UserMailAddress = MailAddress,
        UserAdditionalMailAddresses = AdditionalMailAddresses,
        UserManager = Manager,
        UserStreetAddress = StreetAddress,
        UserCity = City,
        UserCountry = Country,
        UserRegion = State,
        UserPhone = Phone,
        UserAccountEnabled = IsAccountEnabled,
        UserAccountCreationTime = AccountCreationTime,
        RelatedUsers = RelatedAccounts,
        UserDeleted = DeletedDateTime,
        UserLastSeen = LastSeenDate,
        UserUACFlags = UACFlags,
        UserIsMFARegistered = IsMFARegistered,
        UserRiskScore = EntityRiskScore
    | extend 
        UsernameType = "UPN",
        UserIdType = "AadId",
        UserType = iff(UserType == "Guest", UserType, ""),
        UserUpn = Username

