id: bea87dea-1c01-461b-9649-6619dc2d989c
Function:
  Title: Parser for SymantecDLP
  Version: '1.0.0'
  LastUpdated: '2023-08-23'
Category: Microsoft Sentinel Parser
FunctionName: SymantecDLP
FunctionAlias: SymantecDLP
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor == "Symantec" and DeviceProduct == "DLP"
    | extend Blocked = extract(@"BLOCKED=([^;]+)\;",1,AdditionalExtensions),
             ApplicationName = extract(@"APPLICATION_NAME=([^;]+)\;",1,AdditionalExtensions),
             IncidentId = toint(extract(@"INCIDENT_ID=([^;]+)\;",1,AdditionalExtensions)),
             IncidentSnapshot = extract(@"INCIDENT_SNAPSHOT=([^;]+)\;",1,AdditionalExtensions),
             AttachedFileName = extract(@"ATTACHMENT_FILENAME=([^;]+)\;",1,AdditionalExtensions),
             FileName = extract(@"FILE_NAME=([^;]+)\;",1,AdditionalExtensions),
             MatchCount = toint(extract(@"MATCH_COUNT=([^;])\;",1,AdditionalExtensions)),
             Protocol = extract(@"PROTOCOL=([^;])\;",1,AdditionalExtensions),
             Recipients = extract(@"RECIPIENTS_NAME=([^;]+)\;",1,AdditionalExtensions),
             Sender = extract(@"SENDER=([^;]+)\;",1,AdditionalExtensions),
             Subject = extract(@"SUBJECT=([^;]+)\;",1,AdditionalExtensions),
             Severity = extract(@"SEVERITY=([^;]+)\;",1,AdditionalExtensions),
             EndpointMachine = extract(@"ENDPOINT_MACHINE=([^;]+)\;",1,AdditionalExtensions),
             EndpointDvcId = extract(@"ENDPOINT_DEVICE_ID=([^;]+)\;",1,AdditionalExtensions),
             MachineIpAddr = extract(@"MACHINE_IP=([^;]+)\;",1,AdditionalExtensions),
             OccuredOn = extract(@"OCCURRED_ON=([^;]+)\;",1,AdditionalExtensions),
             ReportedOn = extract(@"REPORTED_ON=([^;]+)\;",1,AdditionalExtensions),
             Url = extract(@"URL=([^;]+)\;",1,AdditionalExtensions),
             DstIpAddr = extract(@"DESTINATION_IP=([^;]+)\;",1,AdditionalExtensions),
             Scan = extract(@"SCAN=([^;]+)\;",1,AdditionalExtensions),
             QuarantinePath = extract(@"QUARANTINE_PATH=([^;]+)\;|$",1,AdditionalExtensions)