// Name: Changes made to AWS IAM policy 
// Description: Identity and Access Management (IAM) enables to manage access to AWS services and resources securely. IAM service is where many of the security incidents will get reflected.
// This query looks for when an API call is made to change an IAM particularly those related to new policies being attached to users and roles as well as changes to access methods and changes to account level policies. In case these turn out to be noisy in some environments we can filter out the regular known ones.  
//
// Id: e0a67cd7-b4e5-4468-aae0-26cb16a1bbd2
//
// DataSource: #AWSCloudTrail
//
// Tactics: #LateralMovement, #PrivilegeEscalation
//
let timeframe = 7d;
AWSCloudTrail
| where TimeGenerated >= ago(timeframe)
| where  EventName in~ ("AttachGroupPolicy" 
,"AttachRolePolicy" 
,"AttachUserPolicy" 
,"CreatePolicy" 
,"DeleteGroupPolicy" 
,"DeletePolicy"  
,"DeleteRolePolicy" 
,"DeleteUserPolicy" 
,"DetachGroupPolicy" 
,"PutUserPolicy" 
,"PutGroupPolicy"  
,"CreatePolicyVersion" 
,"DeletePolicyVersion" 
,"DetachRolePolicy"  
,"CreatePolicy")
| project TimeGenerated , EventName , EventTypeName  , UserIdentityAccountId ,  UserIdentityPrincipalid , UserAgent , UserIdentityUserName , SessionMfaAuthenticated , SourceIpAddress , AWSRegion , EventSource , AdditionalEventData , ResponseElements
| extend IPCustomEntity = SourceIpAddress
| extend AccountCustomEntity = UserIdentityAccountId

