id: 152440f1-c1c2-4cc5-9b82-555a130c59d2
name: AWS_Abnormal_userdata_download_from_AWS_EC2
description: |
  Detects abnormal downloading of User Data associated with AWS EC2 instances. Asset management, discovery, Vulnerability scanners are expected false positives in this.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Exfiltration
relevantTechniques:
  - T1020
query: |
AWSCloudTrail
|where EventName == "ec2.amazonaws.com" and RequestParameters == "userData" or EventName == "DescribeInstanceAttribute"
|summarize count() by SourceIpAddress
|where not( SourceIpAddress endswith "amazonaws.com") and not(SourceIpAddress == "AWS Internal") and count_ > 30
entityMappings:  
- entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0
kind: NRT
