Parser:
  Title: Empty File Events Schema
  Version: '0.1'
  LastUpdated: June 28, 2021
Product:
  Name: Microsoft Sentinel
Normalization:
  Schema: FileEvent
  Version: '0.1.0'
References:
- Title: ASIM File Event Schema
  Link: https://aka.ms/AzSentinelFileEventsDoc
- Title: ASIM
  Link: https://aka.ms/AzSentinelNormalization
Description: |
  The purpose of this function is to generate and guarentee the schema columns
ParserName: vimFileEventEmpty
ParserQuery: |
  let FileEvent=(){
    let EventFields=datatable(
      TimeGenerated:datetime,
      _ResourceId:string, 
      EventMessage :string ,
      EventCount :int,
      EventStartTime :datetime,
      EventEndTime :datetime,
      EventType :string ,
      EventResult :string ,
      EventOriginalUid :string ,
      EventOriginalType :string ,
      EventProduct :string ,
      EventProductVersion :string ,
      EventVendor :string ,
      EventSchemaVersion :string ,
      EventReportUrl :string ,
      Dvc :string ,
      DvcIpAddr :string ,
      DvcHostname :string ,
      DvcId :string ,
      DvcMacAddr :string ,
      DvcOs :string ,
      DvcOsVersion :string ,
      AdditionalFields :dynamic)[];
  let FileSpecific=datatable(
      ActorUsername :string ,
      User :string ,
      ActorUsernameType :string ,
      ActorUserId :string ,
      ActorUserIdType :string ,
      ActorUserType :string ,
      ActorOriginalUserType :string ,
      ActingProcessName :string ,
      Process :string ,
      ActingProcessId :int,
      ActingProcessGuid :string ,
      ActingProcessCommandLine :string ,
      TargetFilePath :string ,
      FilePath :string ,
      TargetFilePathFormat :string ,
      TargetFileName :string ,
      TargetFileExtension :string ,
      TargetFileDirectory :string ,
      TargetFileCreationTime :datetime,
      TargetFileMimeType :string ,
      TargetFileSize :int,
      TargetFileMD5 :string ,
      TargetFileSHA1 :string ,
      TargetFileSHA256 :string ,
      TargetFileSHA512 :string ,
      Hash :string ,
      SrcFilePath :string ,
      SrcFilePathType :string ,
      SrcFileName :string ,
      SrcFileExtension :string ,
      SrcFileDirectory :string ,
      SrcFileCreationTime :datetime,
      SrcFileMimeType :string ,
      SrcFileSize :int,
      SrcFileMD5 :string ,
      SrcFileSHA1 :string ,
      SrcFileSHA256 :string ,
      SrcFileSHA512 :string ,
      TargetUrl:string ,
      SrcIpAddr:string ,
      HttpUserAgent  :string)[];
   union EventFields, FileSpecific
   };FileEvent