id: 416eeaf7-6335-40e7-942e-ea01fbe6457e
name: detect-archive-exfiltration-to-competitor
description: |-
  This query can be used to detect instances of a malicious insider creating a file archive and then emailing that archive to an external "competitor" organization.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailEvents
  - EmailAttachmentInfo
  - DeviceFileEvents
tactics:
- Exfiltration
query: |-
  EmailEvents
  | where RecipientEmailAddress contains "competitor"
  and AttachmentCount >=1
  | join (
  EmailAttachmentInfo
  //| where isnotempty(SHA256)
  )on NetworkMessageId
  | join (
  DeviceFileEvents
  | where InitiatingProcessFileName in ("7z.exe", "7zG.exe", "AxCrypt.exe", "BitLocker.exe", "Diskcryptor.exe", "GNUPrivacyGuard.exe", "GPG4Win.exe", "PeaZip.exe", "VeraCrypt.exe", "WinRAR.exe", "WinZip.exe")
  | project FileName, SHA256
  ) on FileName
