id: 58759ff6-5111-43cc-9411-9470809058bb
Function:
  Title: Parser for OSSECEvent
  Version: '1.0.0'
  LastUpdated: '2023-08-08'
Category: Microsoft Sentinel Parser
FunctionName: OSSECEvent
FunctionAlias: OSSECEvent
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor has 'OSSEC'
    | extend EventVendor = DeviceVendor
    | extend EventProduct = DeviceProduct
    | extend EventProductVersion = DeviceVersion
    | extend RuleName = Activity
    | extend RuleNumber = DeviceEventClassID
    | extend Classification = coalesce(
                                extract(@'(classification|cat)=(\s)?(.*?)(,$|;|$)', 3, AdditionalExtensions),                            
                                column_ifexists("DeviceEventCategory", "")
                            )
    | extend DvcHostname = DeviceAddress
    | extend EventSeverity = LogSeverity
    | extend SrcIpAddr = SourceIP
    | extend SrcHostname = SourceHostName
    | extend SrcUserName = SourceUserName
    | extend EventMessage = Message
    | extend FilePath = FileName
    | extend FileHashSha1 = FileHash
    | extend OldFileHashSha1 = OldFileHash
    | project TimeGenerated
            , EventVendor
            , EventProduct
            , EventProductVersion
            , RuleName
            , RuleNumber
            , Classification
            , DvcHostname
            , EventSeverity
            , SrcIpAddr
            , SrcHostname
            , SrcUserName
            , EventMessage
            , FilePath
            , OldFileHashSha1
            , FileHashSha1
            , DeviceCustomString1Label
            , DeviceCustomString1
            , DeviceCustomString2Label
            , DeviceCustomString2
            , DeviceCustomString3Label
            , DeviceCustomString3
            , DeviceCustomString4Label
            , DeviceCustomString4
            , DeviceCustomString5Label
            , DeviceCustomString5
            , DeviceCustomString6Label
            , DeviceCustomString6
            , AdditionalExtensions