// Reference : Using functions in Azure monitor log queries : https://docs.microsoft.com/azure/azure-monitor/log-query/functions
CommonSecurityLog
| where DeviceVendor has 'OSSEC'
| extend EventVendor = DeviceVendor
| extend EventProduct = DeviceProduct
| extend EventProductVersion = DeviceVersion
| extend RuleName = Activity
| extend RuleNumber = DeviceEventClassID
| extend Classification = coalesce(
                            extract(@'(classification|cat)=(\s)?(.*?)(,$|;|$)', 3, AdditionalExtensions),                            
                            column_ifexists("DeviceEventCategory", "")
                        )
| extend DvcHostname = DeviceAddress
| extend EventSeverity = LogSeverity
| extend SrcIpAddr = SourceIP
| extend SrcHostname = SourceHostName
| extend SrcUserName = SourceUserName
| extend EventMessage = Message
| extend FilePath = FileName
| extend FileHashSha1 = FileHash
| extend OldFileHashSha1 = OldFileHash
| project TimeGenerated
        , EventVendor
        , EventProduct
        , EventProductVersion
        , RuleName
        , RuleNumber
        , Classification
        , DvcHostname
        , EventSeverity
        , SrcIpAddr
        , SrcHostname
        , SrcUserName
        , EventMessage
        , FilePath
        , OldFileHashSha1
        , FileHashSha1
        , DeviceCustomString1Label
        , DeviceCustomString1
        , DeviceCustomString2Label
        , DeviceCustomString2
        , DeviceCustomString3Label
        , DeviceCustomString3
        , DeviceCustomString4Label
        , DeviceCustomString4
        , DeviceCustomString5Label
        , DeviceCustomString5
        , DeviceCustomString6Label
        , DeviceCustomString6
        , AdditionalExtensions