{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('workspace'), '/MDE_A_process_was_injected_with_potentially_malicious_code_T1055_T1055_001_T1055_002_T1055_003_T1055_004_T1055_012_T1059_001')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "eTag": "*",
        "displayName": "MDE Alert - A process was injected with potentially malicious code",
        "category": "Hunting Queries",
        "query": "SecurityAlert\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\"\n| extend ep=parse_json(ExtendedProperties)\n| extend MitreTechnique = ep.[\"MitreTechniques\"]\n| where AlertName == \"A process was injected with potentially malicious code\"\n| where MitreTechnique == \"T1055;T1055.001;T1055.002;T1055.003;T1055.004;T1055.012;T1059.001\"",
        "version": 1,
        "tags": [
          {
            "name": "description",
            "value": "Microsoft Defender for Endpoint Alert - A process was injected with potentially malicious code - Mitre Techniques T1055,T1055.001,T1055.002,T1055.003,T1055.004,T1055.012,T1059.001"
          },
          {
            "name": "tactics",
            "value": "DefenseEvasion"
          },
		  {
            "name": "techniques",
            "value": "T1055,T1055.001,T1055.002,T1055.003,T1055.004,T1055.012,T1059.001"
          }
        ]
      }
    }
  ]
}
