id: 54569b06-47fc-41ae-9b00-f7d9b61337b6
name: Inbox rule changes which forward-redirect email
description: |
  This query helps hunting for Inbox rule changes which forward-redirect email
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
- Persistence
query: |
  CloudAppEvents
  | where ActionType contains "Set-InboxRule"
  |extend Parameters = tostring((parse_json(RawEventData)).Parameters)
  |where Parameters contains "ForwardTo" or Parameters contains "RedirectTo"