id: 295ac28c-919c-48b9-8a38-a0f792f2b92b
name: Total Emails with User Overrides (Block)
description: |
  Total Emails with User Overrides (Block)
description-detailed: |
  Total Emails with User Overrides (Block)
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where UserLevelPolicy != "" and UserLevelAction == "Block"
  | summarize count() by UserLevelPolicy
  // | render columnchart // Uncomment this line to render as a graph
version: 1.0.0