id: 85000725-df05-479e-8cfd-78310b659714
name: Total Emails with Admin Overrides (Allow)
description: |
  Total Emails with Admin Overrides (Allow)
description-detailed: |
  Total Emails with Admin Overrides (Allow)
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents 
  | where OrgLevelPolicy != "" and OrgLevelAction == "Allow" 
  | summarize count() by OrgLevelPolicy,bin(Timestamp, 1d)
version: 1.0.0
