id: 194dd92e-d6e7-4249-85a5-273350a7f5ce
name: Exchange AuditLog Disabled
description: |
  This will help you determine if exchange audit logging is disabled which may be an attempt
  to evade detection or avoid other defenses by an adversary.
severity: Medium
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
query: |

  let timeframe = 1d;
  OfficeActivity
  | where TimeGenerated >= ago(timeframe)
  | where UserType in ("Admin","DcAdmin") 
  // Only admin or global-admin can disable audit logging
  | where Operation == "Set-AdminAuditLogConfig" 
  | extend AdminAuditLogEnabledValue= 
    tostring(parse_json(tostring(parse_json(tostring(array_slice(parse_json(Parameters),3,3)))[0])).Value)
  | where AdminAuditLogEnabledValue == "False" 
  | summarize min(TimeGenerated), max(TimeGenerated), OperationCount = count()
    by Operation, UserType, UserId, ResultStatus, Parameters, AdminAuditLogEnabledValue