// Name: rare and potentially high-risk Office operations
//
// Id: 957cb240-f45d-4491-9ba5-93430a3c08be
//
// Description: This query over Office Activity audit data highlights operations that are typically rare
// and can provide capability useful to attackers.
//
// DataSource: #OfficeActivity
//
// Severity: Medium
//
// QueryFrequency: 24
//
// QueryPeriod: 24
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// Techniques: #Persistence
//
OfficeActivity
| where Operation in ( "AddMailbox-Permission", "Add-MailboxFolderPermission", "Set-Mailbox", "New-ManagementRoleAssignment")