id: bfe04e48-3ee8-406c-8855-8f60cd281aaa
name: Office Unified Log Disabled
description: |
  'Identifies when an administrator has disabled the Office 365 Unified Audit Log.'
severity: High
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Defense Evasion
relevantTechniques:
  - T1089
query: |
  OfficeActivity
| where Operation  == "Set-AdminAuditLogConfig" and todynamic(Parameters)[0].Name == "UnifiedAuditLogIngestionEnabled" and todynamic(Parameters)[0].Value == "False"
| extend ClientIPOnly = case( 
  ClientIP has ".", tostring(split(ClientIP,":")[0]), 
  ClientIP has "[", tostring(trim_start(@'[[]',tostring(split(ClientIP,"]")[0]))),
  ClientIP
  )  
  | extend Port = case(
  ClientIP has ".", (split(ClientIP,":")[1]),
  ClientIP has "[", tostring(split(ClientIP,"]:")[1]),
  ClientIP
  )
  | extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = ClientIP