id: a1664330-810a-473b-b354-acbaa751a294
name: Top targeted users
description: |
  This query helps reviewing top targeted users with malware or phishing emails in an organization in last 30 days
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents 
  | where Timestamp > ago(30d) 
  | where ThreatTypes has "Malware" or ThreatTypes has "Phish" 
  | summarize count() by RecipientEmailAddress 
  | sort by count_
