# -- Fields common to all schemas
Fields:
- Name: TimeGenerated
  Type: datetime
  Class: Mandatory

- Name: Type
  Type: string
  Class: Mandatory

- Name: AdditionalFields
  Type: dynamic
  Class: Recommended

- Name: Src
  Type: string
  Class: Recommended
  Description: A unique identifier of the source or acting device. This field might alias the ource or acting device device FQDN, Hostname, Device Id or IP address fields.

- Name: Dst
  Type: string
  Class: Recommended
  Description: A unique identifier of the target or destination device. This field might alias the target or destination device FQDN, Hostname, Device Id or IP Address fields.

- Name: EventMessage
  Type: string
  Class: Optional
  Description: A general message or description, either included in or generated from the record.

- Name: EventCount
  Type: int
  Class: Optional
  Description: The number of events described by the record. This value is used when the source supports aggregation, and a single record might represent multiple events.

- Name: EventStartTime
  Type: datetime
  Class: Mandatory
  Description: The time in which the event started. If the source supports aggregation and the record represents multiple events, the time that the first event was generated. If not provided by the source record, this field aliases the TimeGenerated field.

- Name: EventEndTime
  Type: datetime
  Class: Mandatory
  Description: The time in which the event ended. If the source supports aggregation and the record represents multiple events, the time that the last event was generated. If not provided by the source record, this field aliases the TimeGenerated field.

- Name: EventType
  Type: string
  Class: Mandatory
  Logical type: Enumerated
  List of values: []
  Description: Describes the operation reported by the record. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalType field.

- Name: EventSubType
  Type: string
  Class: Optional
  Logical type: Enumerated
  List of values: []
  Description:   Describes a subdivision of the operation reported in the EventType field. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalSubType field.

- Name: EventResult
  Type: string
  Class: Mandatory
  Logical type: Enumerated
  List of values: [ Success, Failure, Partial, NA ]

- Name: EventResultDetails
  Type: string
  Class: Recommended
  Logical type: Enumerated
  List of values: []
  Description: Reason or details for the result reported in the EventResult field. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalResultDetails field.

- Name: EventOriginalUid
  Type: string
  Class: Optional
  Description: A unique ID of the original record, if provided by the source.

- Name: EventOriginalType
  Type: string
  Class: Optional
  Description: The original event type or ID, if provided by the source. For example, this field will be used to store the original Windows event ID. This value is used to derive EventType, which should have only one of the values documented for each schema.

- Name: EventOriginalSubType
  Type: string
  Class: Optional
  Description: The original event subtype or ID, if provided by the source. For example, this field will be used to store the original Windows logon type. This value is used to derive EventSubType, which should have only one of the values documented for each schema.

- Name: EventOriginalResultDetails
  Type: string
  Class: Optional
  Description: The original result details provided by the source. This value is used to derive EventResultDetails, which should have only one of the values documented for each schema.

- Name: EventSeverity
  Type: string
  Class: Recommended
  Logical type: Enumerated
  List of values: [ Informational, Low, Medium, High ]
  Description: The severity of the event.

- Name: EventOriginalSeverity
  Type: string
  Class: Optional
  Description: The original severity as provided by the reporting device. This value is used to derive EventSeverity.

- Name: EventProduct
  Type: string
  Class: Mandatory
  Logical type: Enumerated
  List of values: EventProduct
  Description:   The product generating the event. The value should be one of the values listed in Vendors and Products.

- Name: EventProductVersion
  Type: string
  Class: Optional
  Description: The version of the product generating the event.

- Name: EventVendor
  Type: string
  Class: Mandatory
  Logical type: Enumerated
  List of values: EventVendor
  Description: The vendor of the product generating the event. The value should be one of the values listed in Vendors and Products.

- Name: EventSchema
  Type: string
  Class: Mandatory
  Logical type: Enumerated
  List of values: Schemas
  Description: The schema the event is normalized to. Each schema documents its schema name.

- Name: EventSchemaVersion
  Type: string
  Class: Mandatory
  Logical type: SchemaVersion
  Description: The version of the schema. Each schema documents its current version.

- Name: EventOwner
  Type: string
  Class: Optional
  Logical type: Enumerated
  Description: The owner of the event, which is usually the department or subsidiary in which it was generated.

- Name: EventReportUrl
  Type: string
  Class: Optional
  Logical type: URL
  Description: A URL provided in the event for a resource that provides more information about the event.