id: 7d6d8a8e-b08a-4082-8dbb-d7fd2cbbc35e
name: "[Deprecated] - Silk Typhoon UM Service writing suspicious file"
description: |
    'This query has been deprecated as the associated IoCs (Indicators of Compromise) are outdated and no longer relevant. To ensure effective threat detection, it is recommended to implement Microsoft's Threat Intelligence solution, which enables matching your log data with the most up-to-date IoCs generated by Microsoft. This solution can be installed from the Microsoft Sentinel Content Hub if not currently deployed. More details on the Content Hub can be found here: https://learn.microsoft.com/azure/sentinel/sentinel-solutions-deploy'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent 
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceFileEvents
  - connectorId: WindowsSecurityEvents
    dataTypes: 
      - SecurityEvents 
  - connectorId: WindowsForwardedEvents
    dataTypes: 
      - WindowsEvent 
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
tags:
  - Schema: ASIMFileEvent
    SchemaVersion: 0.1.0
query: |
  let scriptExtensions = dynamic([".php", ".jsp", ".js", ".aspx", ".asmx", ".asax", ".cfm", ".shtml"]);
  union isfuzzy=true
  (SecurityEvent
  | where EventID == 4663
  | where Process has_any ("umworkerprocess.exe", "UMService.exe")
  | where ObjectName has_any (scriptExtensions)
  | where AccessMask in ('0x2','0x100', '0x10', '0x4')
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress
  ),
    (WindowsEvent
  | where EventID == 4663 and EventData has_any ("umworkerprocess.exe", "UMService.exe") and EventData has_any (scriptExtensions) 
  | where EventData has_any ('0x2','0x100', '0x10', '0x4')
  | extend NewProcessName = tostring(EventData.NewProcessName)
  | extend Process=tostring(split(NewProcessName, '\\')[-1])
  | where Process has_any ("umworkerprocess.exe", "UMService.exe")
  | extend ObjectName = tostring(EventData.ObjectName)
  | where ObjectName has_any (scriptExtensions)
  | extend AccessMask = tostring(EventData.AccessMask)
  | where AccessMask in ('0x2','0x100', '0x10', '0x4')
  | extend Account = strcat(EventData.SubjectDomainName,"\\", EventData.SubjectUserName)
  | extend IpAddress = tostring(EventData.IpAddress)
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress
  ),
  (imFileEvent
  | where EventType == "FileCreated"
  | where ActingProcessName has_any ("umworkerprocess.exe", "UMService.exe")
    and
    TargetFileName has_any (scriptExtensions)
  | extend timestamp = TimeGenerated, AccountCustomEntity = ActorUsername, HostCustomEntity = DvcHostname
  ),
  (DeviceFileEvents
  | where ActionType =~ "FileCreated"
  | where InitiatingProcessFileName has_any ("umworkerprocess.exe", "UMService.exe")
  | where FileName has_any(scriptExtensions)
  | extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingProcessAccountUpn, HostCustomEntity = DeviceName, IPCustomEntity = RequestSourceIP)

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: InitiatingProcessAccountUpn
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: DeviceName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 2.0.0
kind: Scheduled