{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string"
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'),'/ASimAuthenticationPaloAltoPanOS')]",
      "properties": {
        "etag": "*",
        "displayName": "Authentication ASIM parser for Palo Alto PAN-OS",
        "category": "ASIM",
        "FunctionAlias": "ASimAuthenticationPaloAltoPanOS",
        "query": "let EventSeverityLookup = datatable (LogSeverity: string, EventSeverity: string)\n[\n    \"0\", \"Low\",\n    \"1\", \"Low\",\n    \"2\", \"Low\",\n    \"3\", \"Low\",\n    \"4\", \"Low\",\n    \"5\", \"Low\",\n    \"6\", \"Medium\",\n    \"7\", \"Medium\",\n    \"8\", \"Medium\",\n    \"9\", \"High\",\n    \"10\", \"High\"\n];\nlet EventResultLookup = datatable (DeviceEventClassID: string, EventResult: string, EventResultDetails: string)\n[\n    \"auth-success\", \"Success\", \"\",\n    \"auth-fail\", \"Failure\", \"No such user or password\",\n    \"auth-error\", \"Failure\", \"Other\",\n    \"auth-timeout\", \"Failure\", \"Session expired\",\n    \"auth-challenge\", \"Partial\", \"MFA not satisfied\",\n    \"auth-unknown\", \"Failure\", \"Other\",\n    \"auth\", \"NA\", \"\"\n];\nlet parser = (disabled: bool=false, pack: bool=false) {\n    CommonSecurityLog\n    | where not(disabled)\n        and DeviceVendor == \"Palo Alto Networks\"\n        and DeviceProduct == \"PAN-OS\"\n        and DeviceEventClassID startswith \"auth\"\n    | lookup EventResultLookup on DeviceEventClassID\n    | extend EventResult = coalesce(EventResult, \"NA\")\n    | parse-kv AdditionalExtensions as (\n        PanOSAuthenticationDescription: string,\n        PanOSAuthenticationProtocol: string,\n        PanOSAuthenticatedUserDomain: string,\n        PanOSAuthenticatedUserName: string,\n        PanOSAuthenticatedUserUUID: string,\n        PanOSClientTypeName: string,\n        PanOSConfigVersion: string,\n        PanOSCortexDataLakeTenantID: string,\n        PanOSDGHierarchyLevel1: string,\n        PanOSDGHierarchyLevel2: string,\n        PanOSDGHierarchyLevel3: string,\n        PanOSDGHierarchyLevel4: string,\n        PanOSIsDuplicateLog: string,\n        PanOSLogExported: string,\n        PanOSLogForwarded: string,\n        PanOSIsPrismaNetworks: string,\n        PanOSIsPrismaUsers: string,\n        PanOSLocation: string,\n        PanOSLogSource: string,\n        LogSourceGroupID: string,\n        PanOSLogSourceTimeZoneOffset: string,\n        PanOSMFAVendor: string,\n        PanOSPanoramaSN: string,\n        PlatformType: string,\n        PanOSRuleMatched: string,\n        PanOSRuleMatchedUUID: string,\n        PanOSAuthCacheServiceRegion: string,\n        PanOSSessionID: string,\n        PanOSSourceDeviceCategory: string,\n        PanOSSourceDeviceHost: string,\n        PanOSSourceDeviceMac: string,\n        PanOSSourceDeviceModel: string,\n        PanOSSourceDeviceOSFamily: string,\n        PanOSSourceDeviceOSVersion: string,\n        PanOSSourceDeviceProfile: string,\n        PanOSSourceDeviceVendor: string,\n        PanOSTimeGeneratedHighResolution: string,\n        PanOSUserAgentString: string,\n        PanOSVirtualSystemID: string,\n        PanOSVirtualSystemName: string,\n        start: string\n    ) with (pair_delimiter=\";\", kv_delimiter=\"=\")\n    | invoke _ASIM_ResolveDvcFQDN('DeviceName')\n    | invoke _ASIM_ResolveSrcFQDN('PanOSSourceDeviceHost')\n    | lookup EventSeverityLookup on LogSeverity\n    | extend\n        temp_SrcIpAddr = coalesce(SourceIP, DeviceCustomIPv6Address2),\n        temp_TargetIpAddr = coalesce(DestinationIP, DeviceCustomIPv6Address3),\n        temp_DvcIpAddr = Computer\n    | extend\n        SrcIpAddr = iff(temp_SrcIpAddr matches regex @\"^[0-9a-fA-F:\\.]+$\", temp_SrcIpAddr, \"\"),\n        TargetIpAddr = iff(temp_TargetIpAddr matches regex @\"^[0-9a-fA-F:\\.]+$\", temp_TargetIpAddr, \"\"),\n        DvcIpAddr = iff(temp_DvcIpAddr matches regex @\"^[0-9a-fA-F:\\.]+$\", temp_DvcIpAddr, \"\"),\n        DvcHostname = case(\n            temp_DvcIpAddr matches regex @\"^[0-9a-fA-F:\\.]+$\", DvcHostname,\n            isnotempty(temp_DvcIpAddr), temp_DvcIpAddr,\n            DvcHostname\n        ),\n        EventStartTime = coalesce(todatetime(start), TimeGenerated),\n        EventMessage = Message,\n        TargetUsername = coalesce(PanOSAuthenticatedUserName, DestinationUserName, SourceUserName),\n        AdditionalFields = iff(pack, bag_pack(\n            \"PanOSAuthenticationDescription\", PanOSAuthenticationDescription,\n            \"PanOSClientTypeName\", PanOSClientTypeName,\n            \"PanOSConfigVersion\", PanOSConfigVersion,\n            \"PanOSCortexDataLakeTenantID\", PanOSCortexDataLakeTenantID,\n            \"PanOSDGHierarchyLevel1\", PanOSDGHierarchyLevel1,\n            \"PanOSDGHierarchyLevel2\", PanOSDGHierarchyLevel2,\n            \"PanOSDGHierarchyLevel3\", PanOSDGHierarchyLevel3,\n            \"PanOSDGHierarchyLevel4\", PanOSDGHierarchyLevel4,\n            \"PanOSIsDuplicateLog\", PanOSIsDuplicateLog,\n            \"PanOSLogExported\", PanOSLogExported,\n            \"PanOSLogForwarded\", PanOSLogForwarded,\n            \"PanOSIsPrismaNetworks\", PanOSIsPrismaNetworks,\n            \"PanOSIsPrismaUsers\", PanOSIsPrismaUsers,\n            \"PanOSLocation\", PanOSLocation,\n            \"PanOSLogSource\", PanOSLogSource,\n            \"LogSourceGroupID\", LogSourceGroupID,\n            \"PanOSLogSourceTimeZoneOffset\", PanOSLogSourceTimeZoneOffset,\n            \"PanOSMFAVendor\", PanOSMFAVendor,\n            \"PanOSPanoramaSN\", PanOSPanoramaSN,\n            \"PlatformType\", PlatformType,\n            \"PanOSRuleMatched\", PanOSRuleMatched,\n            \"PanOSRuleMatchedUUID\", PanOSRuleMatchedUUID,\n            \"PanOSAuthCacheServiceRegion\", PanOSAuthCacheServiceRegion,\n            \"PanOSSourceDeviceCategory\", PanOSSourceDeviceCategory,\n            \"PanOSSourceDeviceMac\", PanOSSourceDeviceMac,\n            \"PanOSSourceDeviceModel\", PanOSSourceDeviceModel,\n            \"PanOSSourceDeviceOSVersion\", PanOSSourceDeviceOSVersion,\n            \"PanOSSourceDeviceProfile\", PanOSSourceDeviceProfile,\n            \"PanOSSourceDeviceVendor\", PanOSSourceDeviceVendor,\n            \"PanOSTimeGeneratedHighResolution\", PanOSTimeGeneratedHighResolution,\n            \"PanOSVirtualSystemID\", PanOSVirtualSystemID,\n            \"PanOSVirtualSystemName\", PanOSVirtualSystemName,\n            DeviceCustomNumber1Label, FieldDeviceCustomNumber1,\n            DeviceCustomNumber2Label, FieldDeviceCustomNumber2,\n            DeviceCustomString3Label, DeviceCustomString3,\n            DeviceCustomString4Label, DeviceCustomString4,\n            DeviceCustomString5Label, DeviceCustomString5,\n            DeviceCustomString6Label, DeviceCustomString6\n        ), dynamic([]))\n    | project-rename\n        DvcId = DeviceExternalID,\n        EventOriginalResultDetails = Message,\n        EventOriginalSeverity = LogSeverity,\n        EventOriginalType = DeviceEventClassID,\n        EventProductVersion = DeviceVersion,\n        LogonProtocol = PanOSAuthenticationProtocol,\n        SrcDvcOs = PanOSSourceDeviceOSFamily,\n        TargetUserId = PanOSAuthenticatedUserUUID,\n        TargetDomain = PanOSAuthenticatedUserDomain,\n        EventOriginalSubType = Activity,\n        HttpUserAgent = PanOSUserAgentString,\n        TargetSessionId = PanOSSessionID\n    | invoke _ASIM_ResolveDstFQDN('DestinationHostName')\n    | extend\n        TargetHostname = DstHostname,\n        DvcAction = case(\n            EventResult == \"Success\", \"Allow\",\n            EventResult == \"Failure\", \"Deny\",\n            \"\"\n        ),\n        Dvc = coalesce(DvcFQDN, DvcId, DvcHostname, DvcIpAddr),\n        EventEndTime = EventStartTime,\n        Dst = coalesce(DstFQDN, DstHostname, TargetIpAddr),\n        Src = coalesce(SrcFQDN, SrcHostname, SrcIpAddr),\n        TargetUserType = _ASIM_GetUserType(TargetUsername, \"\"),\n        User = TargetUsername,\n        IpAddr = SrcIpAddr,\n        DvcIdType = iff(isnotempty(DvcId), \"Other\", \"\"),\n        TargetUserIdType = iff(isnotempty(TargetUserId), \"UID\", \"\"),\n        TargetUsernameType = _ASIM_GetUsernameType(TargetUsername),\n        TargetDomainType = case(\n            array_length(split(TargetDomain, \".\")) > 1, \"FQDN\",\n            isnotempty(TargetDomain), \"Windows\",\n            \"\"\n        )\n    | extend\n        EventSchema = \"Authentication\",\n        EventSchemaVersion = \"0.1.3\",\n        EventType = \"Logon\",\n        EventProduct = \"PAN-OS\",\n        EventVendor = \"Palo Alto\",\n        EventCount = int(1),\n        Type = \"CommonSecurityLog\"\n    | project\n        TimeGenerated,\n        EventSchema,\n        EventSchemaVersion,\n        EventType,\n        EventResult,\n        EventResultDetails,\n        EventSeverity,\n        EventProduct,\n        EventVendor,\n        EventCount,\n        EventStartTime,\n        EventEndTime,\n        EventMessage,\n        EventOriginalResultDetails,\n        EventOriginalSeverity,\n        EventOriginalType,\n        EventOriginalSubType,\n        EventProductVersion,\n        Dvc,\n        DvcHostname,\n        DvcDomain,\n        DvcFQDN,\n        DvcDomainType,\n        DvcIpAddr,\n        DvcId,\n        DvcIdType,\n        TargetUsername,\n        TargetUsernameType,\n        TargetUserId,\n        TargetUserIdType,\n        TargetUserType,\n        TargetDomain,\n        TargetDomainType,\n        TargetHostname,\n        TargetIpAddr,\n        TargetSessionId,\n        DvcAction,\n        SrcIpAddr,\n        SrcHostname,\n        SrcDomain,\n        SrcFQDN,\n        SrcDomainType,\n        SrcDvcOs,\n        LogonProtocol,\n        HttpUserAgent,\n        Dst,\n        Src,\n        User,\n        IpAddr,\n        AdditionalFields,\n        Type\n};\nparser(disabled=disabled, pack=pack)\n",
        "version": 1,
        "functionParameters": "disabled:bool=False,pack:bool=False"
      }
    }
  ]
}