Parser:
  Title: User Management ASIM parser for Cisco ISE
  Version: '1.0'
  LastUpdated: June 27, 2023
Product:
  Name: Cisco ISE
Normalization:
  Schema: UserManagement
  Version: '0.1.1'
References:
- Title: ASIM User Management Schema
  Link: https://aka.ms/ASimAUserManagementDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
- Title: Cisco ISE Security Events 
  Link: https://www.cisco.com/c/en/us/td/docs/security/ise/3-2/admin_guide/b_ise_admin_3_2/b_ISE_admin_32_maintain_monitor.html#ID58
Description: |
  This ASIM parser supports normalizing user management activity in the Cisco ISE events to the ASIM User Management schema.
ParserName: ASimUserManagementCiscoISE
EquivalentBuiltInParser: _ASim_UserManagement_CiscoISE
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
    let EventName=datatable(EventOriginalType:string, EventResult:string, EventType:string, EventOriginalSeverity:string, EventMessage:string)["25000","Success","PasswordChanged","INFO","ISE server password update succeeded","25001","Failure","PasswordChanged","ERROR","AD: ISE account password update failed.","51101","Failure","PasswordChanged","NOTICE","Invalid new password. Password is too short","51102","Failure","PasswordChanged","NOTICE","Invalid new password. Too many repeating characters","51103","Failure","PasswordChanged","NOTICE","Invalid new password. Missing required character type","51104","Failure","PasswordChanged","NOTICE","Invalid new password. Contains username","51105","Failure","PasswordChanged","NOTICE","Invalid new password. Contains reserved word","51107","Failure","PasswordChanged","NOTICE","Invalid new password","51115","Failure","PasswordChanged","NOTICE","The new password is invalid. This password has been previously used.","51116","Failure","PasswordChanged","NOTICE","Invalid new password. Password must not contain dictionary words or their characters in reverse order","58019","Success","PasswordReset","NOTICE","ISE administrator password reset","60460","Success","UserDisabled","INFO","Account disabled due to inactivity","60461","Success","UserDisabled","INFO","Account disabled due to user level date expiry","60462","Success","UserDisabled","INFO","Account disabled due to global level date expiry","60463","Success","UserDisabled","INFO","Account disabled due to global level days expiry","10013","Success","UserModified","INFO","Admin account set as 'never disabled'","10014","Success","UserModified","INFO","Admin account set to change password on next login","5415","Failure","PasswordChanged","NOTICE","Change password failed","86002","Success","UserDisabled","INFO","Sponsor has suspended a guest user account","86003","Success","UserEnabled","INFO","Sponsor has enabled a guest user account","86004","Success","PasswordChanged","INFO","Guest user has changed the password","86006","Success","UserCreated","INFO","Guest user account is created","86007","Success","UserModified","INFO","Guest user account is updated","86008","Success","UserDeleted","INFO","Guest user account is deleted","86015","Failure","PasswordChanged","INFO","Invalid Password Change","24059","Failure","PasswordChanged","ERROR","User password change ended with an error","24064","Failure","PasswordChanged","WARN","The user doesn't have sufficient rights to change password","24065","Failure","PasswordChanged","WARN","The new password does not conform to LDAP password policy","24066","Success","PasswordChanged","INFO","User password change succeeded","24205","Failure","PasswordChanged","ERROR","Could not change password to new password","24206","Success","UserDisabled","INFO","User disabled","24347","Success","UserDisabled","ERROR","Account disabled","24348","Success","UserLocked","ERROR","Account locked","24370","Success","UserDisabled","ERROR","User credentials have been revoked.","24425","Success","PasswordChanged","INFO","User change password against Active Directory succeeded","24426","Failure","PasswordChanged","ERROR","User change password against Active Directory failed","24455","Failure","PasswordChanged","ERROR","Change password against Active Directory failed because of a timeout error","33108","Success","PasswordReset","INFO","Reset admin password to its default value","5204","Success","PasswordChanged","NOTICE","Change password succeeded"];
    let ASIM_GetUsernameType = (username:string) { 
      case ( 
          username contains "@" , "UPN"
          , username contains "\\", "Windows"
          , isempty(username), ""
          , "Simple"
      )
    };
    let CiscoISEUsrMgmtParser=(disabled:bool=false){
      Syslog
      | where not(disabled)
      | where ProcessName has_any ("CISE", "CSCO")
      | extend EventOriginalType = extract(@".*\d{10}\s(\d{4,5})\s.*", 1, SyslogMessage)
      | where EventOriginalType in ("25000","25001","51101","51102","51103","51104","51105","51107","51115","51116","58019","60460","60461","60462","60463","10013","10014","5415","86002","86003","86004","86006","86007","86008","86015","24059","24064","24065","24066","24205","24206","24347","24348","24370","24425","24426","24455","33108","5204")
      | extend 
          EventVendor = "Cisco"
          , EventProduct = "ISE"
          , EventProductVersion = "3.2"
          , EventCount = int(1)
          , EventSchema = "UserManagement"
          , EventSchemaVersion = "0.1.1"
          , EventStartTime = coalesce(EventTime, TimeGenerated)
          , EventEndTime = coalesce(EventTime, TimeGenerated)
      | lookup EventName on EventOriginalType
      | parse-kv SyslogMessage as (NetworkDeviceName:string, ['User-Name']:string, UserName:string, User:string, ['Remote-Address']:string) with (pair_delimiter=',', kv_delimiter='=')
      | project-rename
                    SrcIpAddr=['Remote-Address']
                    , TargetUsername=User
      | extend TargetUsernameType = ASIM_GetUsernameType(TargetUsername) 
      | extend DvcHostname = coalesce(NetworkDeviceName, Computer, HostName)
      | extend ActorUsername = coalesce(['User-Name'], UserName)
      | extend ActorUsernameType = ASIM_GetUsernameType(ActorUsername)      
      | project-away NetworkDeviceName, ['User-Name'], UserName
      | extend DvcIpAddr = extract(@"(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})", 1, Computer) 
      // ***************** <Aliases> ********************
      | extend 
          Hostname = DvcHostname
          , IpAddr = SrcIpAddr
          , Src = SrcIpAddr
          , User = TargetUsername
      // ***************** </Aliases> *******************
      | project-away TenantId, SourceSystem, MG, Computer, EventTime, Facility, HostName, SeverityLevel, SyslogMessage, HostIP, ProcessName, ProcessID, _ResourceId
    };
    CiscoISEUsrMgmtParser(disabled)