Parser:
  Title: User Management ASIM schema function
  Version: '0.1.1'
  LastUpdated: Oct 08, 2023
Product:
  Name: Source Agnostic
Normalization:
  Schema: UserManagement
  Version: '0.1.1'
References:
- Title: ASIM User Management Schema
  Link: https://aka.ms/ASimUserManagementDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM UserManagement schema
ParserName: vimUserManagementEmpty
EquivalentBuiltInParser: _Im_UserManagement_Empty
ParserQuery: |
 let parser=datatable(
  TimeGenerated:datetime,
  _ResourceId:string,
  Type:string,
  ActingAppId:string,
  ActingAppName:string,
  ActingAppType:string,
  ActingOriginalAppType:string,
  ActorDNUsername:string,
  ActorOriginalUserType:string,
  ActorScope:string,
  ActorScopeId:string,
  ActorSessionId:string,
  ActorSimpleUsername:string,
  ActorUserAadId:string,
  ActorUserAWSId:string,
  ActorUserId:string,
  ActorUserIdType:string,
  ActorUsername:string,
  ActorUsernameType:string,
  ActorUserOktaId:string,
  ActorUserPuid:string,
  ActorUserSid:string,
  ActorUserType:string,
  ActorUserUid:string,
  ActorUserUpn:string,
  ActorWindowsUsername:string,
  AdditionalFields:dynamic,
  Dst:string,
  Dvc:string,
  DvcAction:string,
  DvcDescription:string,
  DvcDomain:string,
  DvcDomainType:string,
  DvcFQDN:string,
  DvcHostname:string,
  DvcId:string,
  DvcIdType:string,
  DvcInterface:string,
  DvcIpAddr:string,
  DvcMacAddr:string,
  DvcOriginalAction:string,
  DvcOs:string,
  DvcOsVersion:string,
  DvcScope:string,
  DvcScopeId:string,
  DvcZone:string,
  EventCount:int,
  EventEndTime:datetime,
  EventMessage:string,
  EventOriginalResultDetails:string,
  EventOriginalSeverity:string,
  EventOriginalSubType:string,
  EventOriginalType:string,
  EventOriginalUid:string,
  EventOwner:string,
  EventProduct:string,
  EventProductVersion:string,
  EventReportUrl:string,
  EventResult:string,
  EventResultDetails:string,
  EventSchema:string,
  EventSchemaVersion:string,
  EventSeverity:string,
  EventStartTime:datetime,
  EventSubType:string,
  EventType:string,
  EventUid:string,
  EventVendor:string,
  GroupId:string,
  GroupIdType:string,
  GroupName:string,
  GroupNameType:string,
  GroupOriginalType:string,
  GroupType:string,
  Hostname:string,
  HttpUserAgent:string,
  IpAddr:string,
  NewPropertyValue:string,
  PreviousPropertyValue:string,
  Rule:string,
  RuleName:string,
  RuleNumber:int,
  Src:string,
  SrcDescription:string,
  SrcDeviceType:string,
  SrcDomain:string,
  SrcDomainType:string,
  SrcDvcId:string,
  SrcDvcIdType:string,
  SrcDvcScope:string,
  SrcDvcScopeId:string,
  SrcFQDN:string,
  SrcGeoCity:string,
  SrcGeoCountry:string,
  SrcGeoLatitude:real,
  SrcGeoLongitude:real,
  SrcGeoRegion:string,
  SrcHostname:string,
  SrcIpAddr:string,
  SrcMacAddr:string,
  SrcOriginalRiskLevel:string,
  SrcPortNumber:int,
  SrcRiskLevel:int,
  TargetDNUsername:string,
  TargetOriginalUserType:string,
  TargetSimpleUsername:string,
  TargetUserAadId:string,
  TargetUserAWSId:string,
  TargetUserId:string,
  TargetUserIdType:string,
  TargetUsername:string,
  TargetUsernameType:string,
  TargetUserOktaId:string,
  TargetUserPuid:string,
  TargetUserScope:string,
  TargetUserScopeId:string,
  TargetUserSessionId:string,
  TargetUserSid:string,
  TargetUserType:string,
  TargetUserUid:string,
  TargetUserUpn:string,
  TargetWindowsUsername:string,
  ThreatCategory:string,
  ThreatConfidence:int,
  ThreatField:string,
  ThreatFirstReportedTime:datetime,
  ThreatId:string,
  ThreatIsActive:bool,
  ThreatLastReportedTime:datetime,
  ThreatName:string,
  ThreatOriginalConfidence:string,
  ThreatOriginalRiskLevel:string,
  ThreatRiskLevel:int,
  UpdatedPropertyName:string,
  User:string
  )[];
  parser