Parser:
  Title: User Management ASIM schema function
  Version: '0.1.0'
  LastUpdated: 17 Jul2023
Product:
  Name: Source Agnostic
Normalization:
  Schema: UserManagement
  Version: '0.1.1'
References:
- Title: ASIM User Management Schema
  Link: https://aka.ms/ASimUserManagementDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM UserManagement schema
ParserName: vimUserManagementEmpty
EquivalentBuiltInParser: _Im_UserManagement_Empty
ParserQuery: |
 let parser=datatable(
  TimeGenerated:datetime,
  _ResourceId:string,
  Type:string,
  ActorUsername:string, // Mandatory
  ActorUsernameType:string, // Mandatory
  Dvc:string, // Mandatory
  EventCount:int, // Mandatory
  EventEndTime:datetime, // Mandatory
  EventProduct:string, // Mandatory
  EventResult:string, // Mandatory
  EventSchema:string, // Mandatory
  EventSchemaVersion:string, // Mandatory
  EventSeverity:string, // Mandatory
  EventStartTime:datetime, // Mandatory
  EventType:string, // Mandatory
  EventVendor:string, // Mandatory
  DvcAction:string, // Recommended
  DvcDomain:string, // Recommended
  DvcDomainType:string, // Recommended
  DvcFQDN:string, // Recommended
  DvcHostname:string, // Recommended
  DvcId:string, // Recommended
  DvcIdType:string, // Recommended
  DvcIpAddr:string, // Recommended
  EventResultDetails:string, // Recommended
  EventUid:string, // Recommended
  Src:string, // Recommended
  SrcDomain:string, // Recommended
  SrcDomainType:string, // Recommended
  SrcHostname:string, // Recommended
  SrcIpAddr:string, // Recommended
  ActingAppId:string, // Optional
  ActingAppType:string, // Optional
  ActiveAppName:string, // Optional
  ActorOriginalUserType:string, // Optional
  ActorSessionId:string, // Optional
  ActorUserId:string, // Optional
  ActorUserIdType:string, // Optional
  ActorUserType:string, // Optional
  AdditionalFields:dynamic, // Optional
  DvcDescription:string, // Optional
  DvcInterface:string, // Optional
  DvcMacAddr:string, // Optional
  DvcOriginalAction:string, // Optional
  DvcOs:string, // Optional
  DvcOsVersion:string, // Optional
  DvcScope:string, // Optional
  DvcScopeId:string, // Optional
  DvcZone:string, // Optional
  EventMessage:string, // Optional
  EventOriginalResultDetails:string, // Optional
  EventOriginalSeverity:string, // Optional
  EventOriginalSubType:string, // Optional
  EventOriginalType:string, // Optional
  EventOriginalUid:string, // Optional
  EventOwner:string, // Optional
  EventProductVersion:string, // Optional
  EventReportUrl:string, // Optional
  EventSubType:string, // Optional
  GroupId:string, // Optional
  GroupIdType:string, // Optional
  GroupName:string, // Optional
  GroupNameType:string, // Optional
  GroupOriginalType:string, // Optional
  GroupType:string, // Optional
  HttpUserAgent:string, // Optional
  NewPropertyValue:string, // Optional
  PreviousPropertyValue:string, // Optional
  SrcDeviceType:string, // Optional
  SrcDvcId:string, // Optional
  SrcDvcIdType:string, // Optional
  SrcDvcScope:string, // Optional
  SrcDvcScopeId:string, // Optional
  SrcFQDN:string, // Optional
  SrcGeoCity:string, // Optional
  SrcGeoCountry:string, // Optional
  SrcGeoLatitude:string, // Optional
  SrcGeoLongitude:string, // Optional
  SrcGeoRegion:string, // Optional
  TargetOriginalUserType:string, // Optional
  TargetUserId:string, // Optional
  TargetUserIdType:string, // Optional
  TargetUsername:string, // Optional
  TargetUsernameType:string, // Optional
  TargetUserType:string, // Optional
  Hostname:string, // Alias
  IpAddr:string, // Alias
  UpdatedPropertyName:string, // Alias
  User:string // Alias
  )[];
  parser