id: dd9df55e-79b7-48e0-9d19-965fcadae5e9
name: Post Delivery Events over time
description: |
  This query visualises the daily amount of emails that had a post delivery action from zero-hour auto purge.
description-detailed: |
  This query visualises the daily amount of emails that had a post delivery action from zero-hour auto purge in Defender for Office 365
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailPostDeliveryEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  EmailPostDeliveryEvents
  | where TimeGenerated >= TimeStart
  | where ActionType has "ZAP"
  | make-series ZappedEmails = count() default = 0 on Timestamp from TimeStart to TimeEnd step 1d
  | render timechart
version: 1.0.0
