id: c6387bdd-c0ee-4b88-bbc2-3897586ecdda
name: Ransomware hits healthcare - Turning off System Restore
description: |
  Find attempts to stop System Restore and.
  Prevent the system from creating restore points.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
query: |
  DeviceProcessEvents  
  | where Timestamp > ago(7d)  
  // Pivoting for rundll32  
  and InitiatingProcessFileName =~ 'rundll32.exe'   
  // Looking for empty command line   
  and isnotempty(InitiatingProcessCommandLine)  
  // Looking for schtasks.exe as the created process  
  and FileName in~ ('schtasks.exe')  
  // Disabling system restore   
  and ProcessCommandLine has 'Change' and ProcessCommandLine has 'SystemRestore' 
  and ProcessCommandLine has 'disable'
