{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "author": "The Collective Consulting - support@thecollective.eu",
    "comments": "Solution template for Microsoft Graph Reconnaissance Detections"
  },
  "parameters": {
    "location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
      }
    },
    "workspace-location": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "[concat('Region to deploy solution resources -- separate from location selection',parameters('location'))]"
      }
    },
    "workspace": {
      "defaultValue": "",
      "type": "string",
      "metadata": {
        "description": "Workspace name for Log Analytics where Microsoft Sentinel is setup"
      }
    }
  },
  "variables": {
    "email": "support@thecollective.eu",
    "_email": "[variables('email')]",
    "_solutionName": "Microsoft Graph Reconnaissance Detections",
    "_solutionVersion": "3.0.0",
    "solutionId": "thecollectiveconsultingbv1584980370320.microsoft-graph-reconnaissance-detections",
    "_solutionId": "[variables('solutionId')]",
    "analyticRuleObject1": {
      "analyticRuleVersion1": "1.0.0",
      "_analyticRulecontentId1": "48b97b75-fbf6-4b76-9be3-c0b630819096",
      "analyticRuleId1": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', '48b97b75-fbf6-4b76-9be3-c0b630819096')]",
      "analyticRuleTemplateSpecName1": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('48b97b75-fbf6-4b76-9be3-c0b630819096')))]",
      "_analyticRulecontentProductId1": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','48b97b75-fbf6-4b76-9be3-c0b630819096','-', '1.0.0')))]"
    },
    "analyticRuleObject2": {
      "analyticRuleVersion2": "1.0.0",
      "_analyticRulecontentId2": "c483c74c-9259-40b3-8d34-dda3715daedf",
      "analyticRuleId2": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', 'c483c74c-9259-40b3-8d34-dda3715daedf')]",
      "analyticRuleTemplateSpecName2": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('c483c74c-9259-40b3-8d34-dda3715daedf')))]",
      "_analyticRulecontentProductId2": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','c483c74c-9259-40b3-8d34-dda3715daedf','-', '1.0.0')))]"
    },
    "analyticRuleObject3": {
      "analyticRuleVersion3": "1.0.0",
      "_analyticRulecontentId3": "1f8054ee-eb3b-47f0-adbb-d4cfb8cc5960",
      "analyticRuleId3": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', '1f8054ee-eb3b-47f0-adbb-d4cfb8cc5960')]",
      "analyticRuleTemplateSpecName3": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('1f8054ee-eb3b-47f0-adbb-d4cfb8cc5960')))]",
      "_analyticRulecontentProductId3": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','1f8054ee-eb3b-47f0-adbb-d4cfb8cc5960','-', '1.0.0')))]"
    },
    "analyticRuleObject4": {
      "analyticRuleVersion4": "1.0.0",
      "_analyticRulecontentId4": "81a12d9a-2174-4c53-81ba-1cc31bdd7cc5",
      "analyticRuleId4": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', '81a12d9a-2174-4c53-81ba-1cc31bdd7cc5')]",
      "analyticRuleTemplateSpecName4": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('81a12d9a-2174-4c53-81ba-1cc31bdd7cc5')))]",
      "_analyticRulecontentProductId4": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','81a12d9a-2174-4c53-81ba-1cc31bdd7cc5','-', '1.0.0')))]"
    },
    "analyticRuleObject5": {
      "analyticRuleVersion5": "1.0.0",
      "_analyticRulecontentId5": "dc7c9df8-bcf0-4223-a9d5-8adb68fff8fa",
      "analyticRuleId5": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', 'dc7c9df8-bcf0-4223-a9d5-8adb68fff8fa')]",
      "analyticRuleTemplateSpecName5": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('dc7c9df8-bcf0-4223-a9d5-8adb68fff8fa')))]",
      "_analyticRulecontentProductId5": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','dc7c9df8-bcf0-4223-a9d5-8adb68fff8fa','-', '1.0.0')))]"
    },
    "analyticRuleObject6": {
      "analyticRuleVersion6": "1.0.0",
      "_analyticRulecontentId6": "ff4ea1c0-02a0-4867-9fd5-fab5ee2ac2ff",
      "analyticRuleId6": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', 'ff4ea1c0-02a0-4867-9fd5-fab5ee2ac2ff')]",
      "analyticRuleTemplateSpecName6": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('ff4ea1c0-02a0-4867-9fd5-fab5ee2ac2ff')))]",
      "_analyticRulecontentProductId6": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','ff4ea1c0-02a0-4867-9fd5-fab5ee2ac2ff','-', '1.0.0')))]"
    },
    "_solutioncontentProductId": "[concat(take(variables('_solutionId'),50),'-','sl','-', uniqueString(concat(variables('_solutionId'),'-','Solution','-',variables('_solutionId'),'-', variables('_solutionVersion'))))]"
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject1').analyticRuleTemplateSpecName1]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "Conditional Access policy enumaration via Graph API_AnalyticalRules Analytics Rule with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject1').analyticRuleVersion1]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This rule aims to detect anyone enumerating the conditional access policies using the Graph API.\n\nInvestigation\n-------------------\n1. Scrutinize the user. Are they an IT profile?\n2. Scrutinize the IP this happens from. An unknown IP may be more suspicious",
                "displayName": "Conditional Access policy enumeration via Graph API",
                "enabled": false,
                "query": "MicrosoftGraphActivityLogs\n| where TimeGenerated> ago(1h)\n| where RequestUri contains \"https://graph.microsoft.com/v1.0/identity/conditionalAccess/policies/\"\n| where RequestMethod == \"GET\"\n| join kind=inner (IdentityInfo| where TimeGenerated > ago(14d)| distinct AccountUPN, AccountObjectId) on $left.UserId == $right.AccountObjectId",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "severity": "Medium",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "dataTypes": [
                      "MicrosoftGraphActivityLogs"
                    ],
                    "connectorId": "AzureActiveDirectory"
                  }
                ],
                "tactics": [
                  "Discovery"
                ],
                "techniques": [
                  "T1580",
                  "T1526"
                ],
                "entityMappings": [
                  {
                    "fieldMappings": [
                      {
                        "identifier": "FullName",
                        "columnName": "AccountUPN"
                      }
                    ],
                    "entityType": "Account"
                  },
                  {
                    "fieldMappings": [
                      {
                        "identifier": "Address",
                        "columnName": "IPAddress"
                      }
                    ],
                    "entityType": "IP"
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "matchingMethod": "Selected",
                    "lookbackDuration": "5h",
                    "enabled": true,
                    "groupByEntities": [
                      "Account"
                    ],
                    "groupByCustomDetails": [],
                    "groupByAlertDetails": [],
                    "reopenClosedIncident": false
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject1').analyticRuleId1,'/'))))]",
              "properties": {
                "description": "Microsoft Graph Reconnaissance Detections Analytics Rule 1",
                "parentId": "[variables('analyticRuleObject1').analyticRuleId1]",
                "contentId": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject1').analyticRuleVersion1]",
                "source": {
                  "kind": "Solution",
                  "name": "Microsoft Graph Reconnaissance Detections",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "The Collective Consulting",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "The Collective Consulting",
                  "email": "support@thecollective.eu",
                  "tier": "Partner",
                  "link": "https://thecollective.eu"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
        "contentKind": "AnalyticsRule",
        "displayName": "Conditional Access policy enumeration via Graph API",
        "contentProductId": "[variables('analyticRuleObject1')._analyticRulecontentProductId1]",
        "id": "[variables('analyticRuleObject1')._analyticRulecontentProductId1]",
        "version": "[variables('analyticRuleObject1').analyticRuleVersion1]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject2').analyticRuleTemplateSpecName2]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "Enterprise applications enumerated via Graph API_AnalyticalRules Analytics Rule with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject2').analyticRuleVersion2]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This rule aims to detect anyone enumerating the Enterprise Applications using the Graph API as part of reconnaissance.\n\nInvestigation\n-------------------------\n1. Scrutinize the user. Are they an IT profile?\n2. Scrutinize the IP address this is happening from\n3. Scrutinize the UserAgent.",
                "displayName": "Enterprise applications enumerated via Graph API",
                "enabled": false,
                "query": "let GetAllSPNs = MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(1h)\n| where RequestUri == \"https://graph.microsoft.com/v1.0/servicePrincipals\";\nlet UsersGettingMultipleSPNDetails = MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(1h)\n| where RequestUri == \"https://graph.microsoft.com/v1.0/applications\";\nGetAllSPNs\n| join kind=inner UsersGettingMultipleSPNDetails on UserId\n| extend diff = datetime_diff('minute', TimeGenerated, TimeGenerated1) \n| where datetime_diff('minute', TimeGenerated, TimeGenerated1) between (0..60)\n| join kind=inner (IdentityInfo| where TimeGenerated > ago(14d)| distinct AccountUPN, AccountObjectId) on $left.UserId == $right.AccountObjectId\n| project-reorder TimeGenerated, TimeGenerated1",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "severity": "Medium",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "dataTypes": [
                      "MicrosoftGraphActivityLogs"
                    ],
                    "connectorId": "AzureActiveDirectory"
                  }
                ],
                "tactics": [
                  "Discovery"
                ],
                "techniques": [
                  "T1526",
                  "T1580"
                ],
                "entityMappings": [
                  {
                    "fieldMappings": [
                      {
                        "identifier": "FullName",
                        "columnName": "AccountUPN"
                      }
                    ],
                    "entityType": "Account"
                  },
                  {
                    "fieldMappings": [
                      {
                        "identifier": "Address",
                        "columnName": "IPAddress"
                      }
                    ],
                    "entityType": "IP"
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "matchingMethod": "Selected",
                    "lookbackDuration": "5h",
                    "enabled": true,
                    "groupByEntities": [
                      "Account"
                    ],
                    "groupByCustomDetails": [],
                    "groupByAlertDetails": [],
                    "reopenClosedIncident": false
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject2').analyticRuleId2,'/'))))]",
              "properties": {
                "description": "Microsoft Graph Reconnaissance Detections Analytics Rule 2",
                "parentId": "[variables('analyticRuleObject2').analyticRuleId2]",
                "contentId": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject2').analyticRuleVersion2]",
                "source": {
                  "kind": "Solution",
                  "name": "Microsoft Graph Reconnaissance Detections",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "The Collective Consulting",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "The Collective Consulting",
                  "email": "support@thecollective.eu",
                  "tier": "Partner",
                  "link": "https://thecollective.eu"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
        "contentKind": "AnalyticsRule",
        "displayName": "Enterprise applications enumerated via Graph API",
        "contentProductId": "[variables('analyticRuleObject2')._analyticRulecontentProductId2]",
        "id": "[variables('analyticRuleObject2')._analyticRulecontentProductId2]",
        "version": "[variables('analyticRuleObject2').analyticRuleVersion2]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject3').analyticRuleTemplateSpecName3]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "Foreign access to mailbox using Graph_AnalyticalRules Analytics Rule with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject3').analyticRuleVersion3]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject3')._analyticRulecontentId3]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This rule detects when a mailbox is successfully accessed using Graph API by a user who is not the owner of this mailbox.\n\nInvestigation\n------------------\n1. Verify whether this isn't a shared mailbox\n2. Scrutinize the IP this happened from\n3. Scrutinize the user who did this. Could this be within their job function?",
                "displayName": "Foreign access to mailbox using Graph",
                "enabled": false,
                "query": "MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(1h)\n| where RequestUri contains \"https://graph.microsoft.com/v1.0/users/\" and RequestUri contains \"/mailFolders/Inbox/messages\"\n| join kind=inner (IdentityInfo\n    | where TimeGenerated > ago(14d)\n    | distinct AccountUPN, AccountObjectId)\n    on $left.UserId == $right.AccountObjectId\n// Very hacky way to get the target mailbox's owner UPN\n| extend MailboxTargetUPN = split(RequestUri, @\"/users/\", 1)\n| extend MailboxTargetUPN = iif(MailboxTargetUPN contains_cs \"MailFolders\", split(tostring(MailboxTargetUPN[0]), @\"/MailFolders/\", 0)[0], MailboxTargetUPN)\n| extend MailboxTargetUPN = iif(MailboxTargetUPN contains_cs \"mailFolders\", split(tostring(MailboxTargetUPN[0]), @\"/mailFolders/\", 0)[0], MailboxTargetUPN)\n| where MailboxTargetUPN != AccountUPN\n| where ResponseStatusCode == 200\n| extend AccountUPN = tostring(AccountUPN), AlertText = strcat(\"User \", AccountUPN, \" read out the mailbox \", MailboxTargetUPN, \" using Graph API. This may be part of reconnaissance by an actor who compromised the account trying to read out mailboxes that do not belong to them.\")",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "severity": "Medium",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "dataTypes": [
                      "MicrosoftGraphActivityLogs"
                    ],
                    "connectorId": "AzureActiveDirectory"
                  }
                ],
                "tactics": [
                  "Collection"
                ],
                "techniques": [
                  "T1114"
                ],
                "entityMappings": [
                  {
                    "fieldMappings": [
                      {
                        "identifier": "FullName",
                        "columnName": "AccountUPN"
                      }
                    ],
                    "entityType": "Account"
                  },
                  {
                    "fieldMappings": [
                      {
                        "identifier": "Address",
                        "columnName": "IPAddress"
                      }
                    ],
                    "entityType": "IP"
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                  "alertDescriptionFormat": "{{{AlertText}}",
                  "alertDisplayNameFormat": "Foreign access to mailbox using Graph",
                  "alertDynamicProperties": []
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "matchingMethod": "Selected",
                    "lookbackDuration": "5h",
                    "enabled": true,
                    "groupByEntities": [
                      "Account"
                    ],
                    "groupByCustomDetails": [],
                    "groupByAlertDetails": [],
                    "reopenClosedIncident": false
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject3').analyticRuleId3,'/'))))]",
              "properties": {
                "description": "Microsoft Graph Reconnaissance Detections Analytics Rule 3",
                "parentId": "[variables('analyticRuleObject3').analyticRuleId3]",
                "contentId": "[variables('analyticRuleObject3')._analyticRulecontentId3]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject3').analyticRuleVersion3]",
                "source": {
                  "kind": "Solution",
                  "name": "Microsoft Graph Reconnaissance Detections",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "The Collective Consulting",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "The Collective Consulting",
                  "email": "support@thecollective.eu",
                  "tier": "Partner",
                  "link": "https://thecollective.eu"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject3')._analyticRulecontentId3]",
        "contentKind": "AnalyticsRule",
        "displayName": "Foreign access to mailbox using Graph",
        "contentProductId": "[variables('analyticRuleObject3')._analyticRulecontentProductId3]",
        "id": "[variables('analyticRuleObject3')._analyticRulecontentProductId3]",
        "version": "[variables('analyticRuleObject3').analyticRuleVersion3]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject4').analyticRuleTemplateSpecName4]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "Mailbox enumeration using Microsoft Graph_AnalyticalRules Analytics Rule with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject4').analyticRuleVersion4]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject4')._analyticRulecontentId4]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This rule will detect any single user attempting to access more than 20 mailboxes within an hour using Microsoft Graph API.\n\nInvestigation\n---------------------\n1. Scrutinize what kind of user is doing this. Are they technical? If not, it's more suspicious\n2. Look at which mailboxes are being accessed. Perhaps these are shared mailboxes being read out by a script?\n3. Look at the User Agent being used. If it's a Powershell UA, there's a high chance this is GraphRunner.",
                "displayName": "Mailbox enumeration using Microsoft Graph",
                "enabled": false,
                "query": "MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(1h)\n| where RequestUri contains \"https://graph.microsoft.com/v1.0/users/\" and RequestUri contains \"/mailFolders/Inbox/messages\"\n| join kind=inner (IdentityInfo| where TimeGenerated > ago(14d) | distinct AccountUPN, AccountObjectId) on $left.UserId == $right.AccountObjectId\n// Only check for other mailboxes than the one of the user\n| where RequestUri !contains AccountUPN\n| summarize count() by AccountUPN\n// More than 20 mailboxes scanned\n| where count_ > 20",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "severity": "Medium",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "dataTypes": [
                      "MicrosoftGraphActivityLogs"
                    ],
                    "connectorId": "AzureActiveDirectory"
                  }
                ],
                "tactics": [
                  "Discovery",
                  "Collection"
                ],
                "techniques": [
                  "T1526",
                  "T1114"
                ],
                "entityMappings": [
                  {
                    "fieldMappings": [
                      {
                        "identifier": "FullName",
                        "columnName": "AccountUPN"
                      }
                    ],
                    "entityType": "Account"
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": {
                  "alertDynamicProperties": []
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "matchingMethod": "AllEntities",
                    "lookbackDuration": "5h",
                    "enabled": true,
                    "groupByEntities": [],
                    "groupByCustomDetails": [],
                    "groupByAlertDetails": [],
                    "reopenClosedIncident": false
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject4').analyticRuleId4,'/'))))]",
              "properties": {
                "description": "Microsoft Graph Reconnaissance Detections Analytics Rule 4",
                "parentId": "[variables('analyticRuleObject4').analyticRuleId4]",
                "contentId": "[variables('analyticRuleObject4')._analyticRulecontentId4]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject4').analyticRuleVersion4]",
                "source": {
                  "kind": "Solution",
                  "name": "Microsoft Graph Reconnaissance Detections",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "The Collective Consulting",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "The Collective Consulting",
                  "email": "support@thecollective.eu",
                  "tier": "Partner",
                  "link": "https://thecollective.eu"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject4')._analyticRulecontentId4]",
        "contentKind": "AnalyticsRule",
        "displayName": "Mailbox enumeration using Microsoft Graph",
        "contentProductId": "[variables('analyticRuleObject4')._analyticRulecontentProductId4]",
        "id": "[variables('analyticRuleObject4')._analyticRulecontentProductId4]",
        "version": "[variables('analyticRuleObject4').analyticRuleVersion4]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject5').analyticRuleTemplateSpecName5]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "Security groups enumerated via Graph API_AnalyticalRules Analytics Rule with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject5').analyticRuleVersion5]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject5')._analyticRulecontentId5]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This rule aims to detect the enumeration of security groups via the Graph API by looking for requests on the Groups endpoint with a specific filter on \"securityEnabled eq true\".\n\nInvestigation steps\n-----------------------\n1. Scrutinize the user. Are they an IT profile?\n2. Look at the User Agent. If it is powershell, it is suspicious as this may be GraphRunner.",
                "displayName": "Security groups enumerated via Graph API",
                "enabled": false,
                "query": "MicrosoftGraphActivityLogs\n| where TimeGenerated> ago(1h)\n| where RequestUri == \"https://graph.microsoft.com/v1.0/groups?=securityEnabled%20eq%20true\"\n| join kind=inner (IdentityInfo| distinct AccountUPN, AccountObjectId) on $left.UserId == $right.AccountObjectId",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "severity": "Medium",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "dataTypes": [
                      "MicrosoftGraphActivityLogs"
                    ],
                    "connectorId": "AzureActiveDirectory"
                  }
                ],
                "tactics": [
                  "Discovery"
                ],
                "techniques": [
                  "T1069"
                ],
                "entityMappings": [
                  {
                    "fieldMappings": [
                      {
                        "identifier": "FullName",
                        "columnName": "AccountUPN"
                      }
                    ],
                    "entityType": "Account"
                  },
                  {
                    "fieldMappings": [
                      {
                        "identifier": "Address",
                        "columnName": "IPAddress"
                      }
                    ],
                    "entityType": "IP"
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "matchingMethod": "Selected",
                    "lookbackDuration": "5h",
                    "enabled": true,
                    "groupByEntities": [
                      "Account"
                    ],
                    "groupByCustomDetails": [],
                    "groupByAlertDetails": [],
                    "reopenClosedIncident": false
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject5').analyticRuleId5,'/'))))]",
              "properties": {
                "description": "Microsoft Graph Reconnaissance Detections Analytics Rule 5",
                "parentId": "[variables('analyticRuleObject5').analyticRuleId5]",
                "contentId": "[variables('analyticRuleObject5')._analyticRulecontentId5]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject5').analyticRuleVersion5]",
                "source": {
                  "kind": "Solution",
                  "name": "Microsoft Graph Reconnaissance Detections",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "The Collective Consulting",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "The Collective Consulting",
                  "email": "support@thecollective.eu",
                  "tier": "Partner",
                  "link": "https://thecollective.eu"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject5')._analyticRulecontentId5]",
        "contentKind": "AnalyticsRule",
        "displayName": "Security groups enumerated via Graph API",
        "contentProductId": "[variables('analyticRuleObject5')._analyticRulecontentProductId5]",
        "id": "[variables('analyticRuleObject5')._analyticRulecontentProductId5]",
        "version": "[variables('analyticRuleObject5').analyticRuleVersion5]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject6').analyticRuleTemplateSpecName6]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "Updatable groups enumerated via Graph API_AnalyticalRules Analytics Rule with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject6').analyticRuleVersion6]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject6')._analyticRulecontentId6]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This rule aims to detect the enumeration of updatable groups via Graph API. It will check for users calling the API to search for all groups AND having more than 10 EstimateAccess calls within the hour.\n\nInvestigation steps\n---------------------------\n1. Scrutinize the user doing this. Are they an IT profile?\n2. Look at the user agent being used. Powershell is highly suspicious as this may be GraphRunner.",
                "displayName": "Updatable groups enumerated via Graph API",
                "enabled": false,
                "query": "MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(1h)\n| where RequestUri contains \"https://graph.microsoft.com/beta/roleManagement/directory/estimateAccess\" or RequestUri == \"https://graph.microsoft.com/v1.0/groups\"\n| join kind=inner (IdentityInfo| where TimeGenerated > ago(14d) | distinct AccountUPN, AccountObjectId) on $left.UserId == $right.AccountObjectId\n| summarize make_set(RequestUri), AmountsOfAccessEstimated = countif(RequestUri contains \"https://graph.microsoft.com/beta/roleManagement/directory/estimateAccess\") by AccountUPN\n| where set_RequestUri contains \"https://graph.microsoft.com/v1.0/groups\"\n| where AmountsOfAccessEstimated > 10",
                "queryFrequency": "PT1H",
                "queryPeriod": "P14D",
                "severity": "Medium",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "dataTypes": [
                      "MicrosoftGraphActivityLogs"
                    ],
                    "connectorId": "AzureActiveDirectory"
                  }
                ],
                "tactics": [
                  "Discovery"
                ],
                "techniques": [
                  "T1069"
                ],
                "entityMappings": [
                  {
                    "fieldMappings": [
                      {
                        "identifier": "FullName",
                        "columnName": "AccountUPN"
                      }
                    ],
                    "entityType": "Account"
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "matchingMethod": "AllEntities",
                    "lookbackDuration": "5h",
                    "enabled": true,
                    "groupByEntities": [],
                    "groupByCustomDetails": [],
                    "groupByAlertDetails": [],
                    "reopenClosedIncident": false
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject6').analyticRuleId6,'/'))))]",
              "properties": {
                "description": "Microsoft Graph Reconnaissance Detections Analytics Rule 6",
                "parentId": "[variables('analyticRuleObject6').analyticRuleId6]",
                "contentId": "[variables('analyticRuleObject6')._analyticRulecontentId6]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject6').analyticRuleVersion6]",
                "source": {
                  "kind": "Solution",
                  "name": "Microsoft Graph Reconnaissance Detections",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "The Collective Consulting",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "The Collective Consulting",
                  "email": "support@thecollective.eu",
                  "tier": "Partner",
                  "link": "https://thecollective.eu"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject6')._analyticRulecontentId6]",
        "contentKind": "AnalyticsRule",
        "displayName": "Updatable groups enumerated via Graph API",
        "contentProductId": "[variables('analyticRuleObject6')._analyticRulecontentProductId6]",
        "id": "[variables('analyticRuleObject6')._analyticRulecontentProductId6]",
        "version": "[variables('analyticRuleObject6').analyticRuleVersion6]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentPackages",
      "apiVersion": "2023-04-01-preview",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "version": "3.0.0",
        "kind": "Solution",
        "contentSchemaVersion": "3.0.0",
        "displayName": "Microsoft Graph Reconnaissance Detections",
        "publisherDisplayName": "The Collective Consulting",
        "descriptionHtml": "<p><strong>Note:</strong> Please refer to the following before installing the solution:</p>\n<p>• Review the solution <a href=\"https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/Microsoft%20Graph%20Reconnaissance%20Detections/ReleaseNotes.md\">Release Notes</a></p>\n<p>• There may be <a href=\"https://aka.ms/sentinelsolutionsknownissues\">known issues</a> pertaining to this Solution, please refer to them before installing.</p>\n<p>This query pack contains 6 analytic rules which are scoped to reconnaissance of Entra ID environments using the Graph API. Adding these to your Sentinel Workspace will generate an incident when activity correlates with what the rule is trying to detect.</p>\n<p><strong>Analytic Rules:</strong> 6</p>\n<p><a href=\"https://aka.ms/azuresentinel\">Learn more about Microsoft Sentinel</a> | <a href=\"https://aka.ms/azuresentinelsolutionsdoc\">Learn more about Solutions</a></p>\n",
        "contentKind": "Solution",
        "contentProductId": "[variables('_solutioncontentProductId')]",
        "id": "[variables('_solutioncontentProductId')]",
        "icon": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/Graph.png\" width=\"120px\" height=\"60px\">",
        "contentId": "[variables('_solutionId')]",
        "parentId": "[variables('_solutionId')]",
        "source": {
          "kind": "Solution",
          "name": "Microsoft Graph Reconnaissance Detections",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "The Collective Consulting",
          "email": "[variables('_email')]"
        },
        "support": {
          "name": "The Collective Consulting",
          "email": "support@thecollective.eu",
          "tier": "Partner",
          "link": "https://thecollective.eu"
        },
        "dependencies": {
          "operator": "AND",
          "criteria": [
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
              "version": "[variables('analyticRuleObject1').analyticRuleVersion1]"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
              "version": "[variables('analyticRuleObject2').analyticRuleVersion2]"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject3')._analyticRulecontentId3]",
              "version": "[variables('analyticRuleObject3').analyticRuleVersion3]"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject4')._analyticRulecontentId4]",
              "version": "[variables('analyticRuleObject4').analyticRuleVersion4]"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject5')._analyticRulecontentId5]",
              "version": "[variables('analyticRuleObject5').analyticRuleVersion5]"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject6')._analyticRulecontentId6]",
              "version": "[variables('analyticRuleObject6').analyticRuleVersion6]"
            }
          ]
        },
        "firstPublishDate": "2024-07-08",
        "lastPublishDate": "2024-07-08",
        "providers": [
          "Graph"
        ],
        "categories": {
          "domains": [
            "Application"
          ]
        }
      },
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_solutionId'))]"
    }
  ],
  "outputs": {}
}
