id: 4894a60b-d2ee-4f24-be61-0d0c96a84e63
name: LSASS Memory Dumping using WerFault.exe - Command Identification
description: |
  'This use case is meant to identify WerFault.exe (Windows Error Reporting) creating a memory dump of lsass.exe (Local Security Authority Subsystem Service, a process responsible for the enforcement of security policies on Windows systems, which generates and stores credentials in its process memory). This is accomplished by using a mechanism called "Silent Process Exit", which can allow for specific actions to occur when the process terminates itself or if another process terminates it. For this specific method, the action will be modified to create a memory dump file of the process terminated - in this case lsass.exe.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
query: |
  SecurityEvent
  | where NewProcessName endswith "werfault.exe"
  | where ObjectName endswith "lsass.exe"
  | project NewProcessName, ObjectName