id: 37cba0d1-8aa5-4f8f-bb26-25a45475ca9a
name: Metasploit / Impacket PsExec Process Creation Activity
description: |
  'This use case is meant to detect process creations containing names consistent with the schema used by Metasploit or Impacket's PsExec tool. Metasploit and Impacket's PsExec tooling is commonly used by malicious actors for lateral movement & performing actions on remote systems.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
query: |
  SecurityEvent
  | where ParentProcessName has "services.exe"
  | where NewProcessName matches regex "C:\\\\Windows\\\\[a-zA-Z]{8}.exe"
  | where EventID == "4688"
  | project EventID, NewProcessName, CommandLine, Computer, ParentProcessName