{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/ASimAuditEventAWSCloudTrail')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "Audit Event ASIM parser for AWS CloudTrail activity",
        "category": "ASIM",
        "FunctionAlias": "ASimAuditEventAWSCloudTrail",
        "query": "let parser = (disabled: bool) {\n  let UserTypeLookup = datatable(ActorOriginalUserType: string, ActorUserType: string)\n  [\n      \"AWSService\", \"Service\",\n      \"Directory\", \"Other\",\n      \"Unknown\", \"Other\",\n      \"Root\", \"Admin\"\n  ];\n  AWSCloudTrail\n  | where not(disabled)\n  | where EventName != \"ConsoleLogin\" or EventName != \"UserAuthentication\"\n  | extend\n      EventSchema = 'AuditEvent',\n      EventSchemaVersion = '0.1.2',\n      EventCount = int(1),\n      EventStartTime = TimeGenerated,\n      EventEndTime = TimeGenerated,\n      EventProduct = \"CloudTrail\",\n      EventVendor = \"AWS\",\n      Dvc = \"CloudTrail\",\n      Type = \"AWSCloudTrail\",\n      EventResult = iff(isempty(ErrorMessage) == True and isempty(ErrorCode) == True, 'Success', 'Failure'),\n      EventType = case(\n          EventName startswith \"Abort\", \"Set\",\n          EventName == \"AcceptHandshake\", \"Status\",\n          EventName == \"AcceptVpcPeeringConnection\", \"Status\",\n          EventName startswith \"Accept\", \"Set\",\n          EventName startswith \"Add\", \"Set\",\n          EventName startswith \"Allocate\", \"Create\",\n          EventName startswith \"Associate\", \"Set\",\n          EventName startswith \"Assume\", \"Read\",\n          EventName startswith \"Attach\", \"Set\",\n          EventName startswith \"Authorize\", \"Set\",\n          EventName == \"AutomatedDefaultVpcCreation\" \"Automated\", \"Create\",\n          EventName == \"BatchDeleteImage\", \"Delete\",\n          EventName == \"BatchEnableStandards\", \"Set\",\n          EventName == \"BidEvictedEvent\", \"Set\",\n          EventName startswith \"Batch\", \"Read\",\n          EventName startswith \"Bid\", \"Set\",\n          EventName startswith \"Change\", \"Set\",\n          EventName startswith \"Check\", \"Read\",\n          EventName startswith \"Close\", \"Delete\",\n          EventName startswith \"Complete\", \"Status\",\n          EventName startswith \"Configure\", \"Create\",\n          EventName startswith \"Copy\", \"Set\",\n          EventName startswith \"Create\", \"Create\",\n          EventName startswith \"Deactivate\", \"Delete\",\n          EventName startswith \"Decrypt\", \"Read\",\n          EventName startswith \"Delete\", \"Delete\",\n          EventName startswith \"Deregister\", \"Delete\",\n          EventName startswith \"Describe\", \"Read\",\n          EventName startswith \"Detach\", \"Set\",\n          EventName startswith \"Disable\", \"Set\",\n          EventName startswith \"Disassociate\", \"Set\",\n          EventName startswith \"Download\", \"Read\",\n          EventName startswith \"Enable\", \"Set\",\n          EventName startswith \"Encrypt\", \"Read\",\n          EventName == \"FailoverDBCluster\", \"Set\",\n          EventName startswith \"GenerateDataKey\", \"Create\",\n          EventName startswith \"Generate\", \"Read\",\n          EventName startswith \"Get\", \"Read\",\n          EventName startswith \"Head\", \"Read\",\n          EventName startswith \"Import\", \"Create\",\n          EventName startswith \"Initiate\", \"Set\",\n          EventName startswith \"Invite\", \"Set\",\n          EventName startswith \"Invoke\", \"Set\",\n          EventName startswith \"List\", \"Read\",\n          EventName startswith \"Lookup\", \"Read\",\n          EventName startswith \"Modify\", \"Set\",\n          EventName startswith \"Move\", \"Set\",\n          EventName == \"PolicyExecutionEvent\", \"Status\",\n          EventName == \"PreflightRequest\", \"Status\",\n          EventName startswith \"Publish\", \"Set\",\n          EventName startswith \"Put\", \"Create\",\n          EventName startswith \"Reboot\", \"Set\",\n          EventName startswith \"Redeem\", \"Set\",\n          EventName startswith \"ReEncrypt\", \"Read\",\n          EventName startswith \"Register\", \"Set\",\n          EventName startswith \"Release\", \"Delete\",\n          EventName startswith \"Remove\", \"Set\",\n          EventName startswith \"Replace\", \"Set\",\n          EventName startswith \"Restore\", \"Set\",\n          EventName startswith \"Resume\", \"Set\",\n          EventName startswith \"Resync\", \"Set\",\n          EventName startswith \"Retire\", \"Set\",\n          EventName startswith \"Revoke\", \"Set\",\n          EventName startswith \"Rotate\", \"Set\",\n          EventName == \"RotationStarted\", \"Status\",\n          EventName == \"RunInstances\", \"Create\",\n          EventName == \"RunTask\", \"Set\",\n          EventName startswith \"Scan\", \"Read\",\n          EventName == \"ScheduleKeyDeletion\", \"Delete\",\n          EventName == \"Search\", \"Read\",\n          EventName startswith \"Select\", \"Read\",\n          EventName == \"SendHeartBeat\", \"Status\",\n          EventName startswith \"Send\", \"Set\",\n          EventName == \"SharedSnapshotVolumeCreated\", \"Create\",\n          EventName startswith \"Sign\", \"Set\",\n          EventName startswith \"Simulate\", \"Set\",\n          EventName == \"StartLogging\", \"Set\",\n          EventName startswith \"Start\", \"Status\",\n          EventName startswith \"Stop\", \"Stop\",\n          EventName startswith \"Suspend\", \"Set\",\n          EventName startswith \"Synchronize\", \"Set\",\n          EventName startswith \"Tag\", \"Set\",\n          EventName startswith \"Terminate\", \"Delete\",\n          EventName startswith \"Transfer\", \"Set\",\n          EventName startswith \"Untag\", \"Set\",\n          EventName startswith \"Update\", \"Set\",\n          EventName == \"UploadLayerPart\", \"Create\",\n          EventName startswith \"Upload\", \"Set\",\n          \"Other\"\n      )\n  | project-rename\n      EventSubType = EventTypeName,\n      EventUid = AwsEventId,\n      EventMessage = ErrorMessage,\n      EventOriginalType = EventName,\n      EventProductVersion = EventVersion,\n      TargetAppName = EventSource\n  | extend TargetAppType = iff(isempty(TargetAppName), \"\", \"Service\")\n  // Parse Object\n  | extend Resources = todynamic(Resources)\n  | mv-apply Resources on (where Resources.ARN != \"\") // Get first object that has an ARN\n  | extend \n      ObjectType = \"Cloud Resource\",\n      Object = tostring(Resources.ARN),\n      ObjectId = tostring(Resources.ARN),\n      OriginalObjectType = tostring(Resources.type)\n  | extend\n      ActorUserIdType = iff(isempty(UserIdentityAccountId), \"\", \"AWSId\"),\n      ActorUsernameType = iff(isempty(UserIdentityUserName), \"\", \"Simple\"),\n      SrcIpAddr = iff(ipv4_is_in_range(SourceIpAddress, \"0.0.0.0/0\"), SourceIpAddress, \"\"),\n      TargetHostname = tostring(todynamic(RequestParameters).Host)\n  | project-rename \n      ActorUserId = UserIdentityAccountId,\n      ActorUsername = UserIdentityUserName,\n      ActorOriginalUserType = UserIdentityType,\n      HttpUserAgent = UserAgent\n  | lookup UserTypeLookup on ActorOriginalUserType\n  | extend ActorUserType = coalesce(ActorUserType, \"Regular\")\n  | invoke _ASIM_ResolveFQDN('TargetAppName')\n  | project-rename\n      TargetFQDN = FQDN,\n      TargetDomain = Domain\n  | extend TargetDomainType = \"FQDN\"\n  // Aliases\n  | extend\n      Operation = EventOriginalType,\n      Application = TargetAppName,\n      IpAddr = SrcIpAddr,\n      Src = SrcIpAddr,\n      User = ActorUserId\n  | extend AdditionalFields = bag_pack(\n      \"ActorAccessKeyId\", UserIdentityAccessKeyId,\n      \"ActorARN\", UserIdentityArn,\n      \"ReadOnly\", ReadOnly,\n      \"ManagementEvent\", ManagementEvent,\n      \"RequestID\", AwsRequestId,\n      \"AWSRegion\", AWSRegion,\n      \"APIVersion\", APIVersion,\n      \"RequestParameters\", RequestParameters\n  )\n  | project\n      TimeGenerated,\n      EventSchema,\n      EventSchemaVersion,\n      EventCount,\n      EventStartTime,\n      EventEndTime,\n      EventProduct,\n      EventVendor,\n      Dvc,\n      Type,\n      EventResult,\n      EventType,\n      EventSubType,\n      EventUid,\n      EventMessage,\n      EventOriginalType,\n      EventProductVersion,\n      TargetAppName,\n      TargetAppType,\n      ObjectType,\n      Object,\n      ObjectId,\n      OriginalObjectType,\n      ActorUserIdType,\n      ActorUsernameType,\n      SrcIpAddr,\n      TargetHostname,\n      ActorUserId,\n      ActorUsername,\n      ActorOriginalUserType,\n      ActorUserType,\n      HttpUserAgent,\n      TargetFQDN,\n      TargetDomain,\n      TargetDomainType,\n      Operation,\n      Application,\n      IpAddr,\n      Src,\n      User,\n      AdditionalFields,\n      WorkspaceId,\n      TenantId\n};\nparser(disabled)",
        "version": 1,
        "functionParameters": "disabled:bool=False"
      }
    }
  ]
}