id: 9b212beb-76ad-4b33-af0b-448d3e0d1eca
name: successive-tk-domain-calls
description: |-
  Jupyter, otherwise known as SolarMarker, is a malware family and cluster of components known for its info-stealing and backdoor capabilities that mainly proliferates through search engine optimization manipulation and malicious advertising in order to successfully encourage users to download malicious templates and documents. This malware has been popular since 2020 and currently is still active as of 2021.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceNetworkEvents
tactics:
- Initial access
query: |-
  DeviceNetworkEvents
  | where RemoteUrl endswith ".tk"
  | summarize make_set(RemoteUrl) by DeviceId,bin(Timestamp, 10m)
  | extend domainCount = array_length(set_RemoteUrl)
  | where  domainCount >= 5
