id: 4396f8c3-d114-4154-9f4c-048ba522ed04
name: Contrast Blocks
description: |
  'Creates Incidents for Blocked events sourced from the Contrast Protect agent.'
severity: Low
requiredDataConnectors:
  - connectorId: ContrastProtect
    dataTypes:
      - CommonSecurityLog
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - Exfiltration
relevantTechniques:
  - T1566
query: |
  CommonSecurityLog 
  | where DeviceVendor == "Contrast Security"
  | where AdditionalExtensions contains "BLOCKED"
  | extend DeviceProduct
  | extend IPCustomEntity = SourceIP
  | extend DeviceVersion
  | extend Activity
  | extend ApplicationProtocol
  | extend URLCustomEntity = RequestURL
  | extend RequestMethod
  | extend AdditionalExtensions
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: URLCustomEntity