id: 42c945dc-388c-4891-ac85-d46d317b961c
name: Contrast Suspicious
description: |
  'Creates Incidents for Suspicious events sourced from the Contrast Protect agent.'
severity: Medium
requiredDataConnectors:
  - connectorId: ContrastProtect
    dataTypes:
      - ContrastProtect
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - Exfiltration
query: |
  CommonSecurityLog 
  | where DeviceVendor == "Contrast Security"
  | where AdditionalExtensions contains "SUSPICIOUS"
  | extend DeviceProduct
  | extend IPCustomEntity = SourceIP
  | extend DeviceVersion
  | extend Activity
  | extend ApplicationProtocol
  | extend URLCustomEntity = RequestURL
  | extend RequestMethod
  | extend AdditionalExtensions
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: URLCustomEntity