id: ef7ef44e-6129-4d8e-94fe-b5530415d8e5
name: Microsoft Sentinel Analytics Rules Administrative Operations
description: |
  'Identifies Microsoft Sentinel Analytics Rules administrative operations'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
  let opValues = dynamic(["Microsoft.SecurityInsights/alertRules/write", "Microsoft.SecurityInsights/alertRules/delete"]);
  // Microsoft Sentinel Analytics - Rule Create / Update / Delete
  AzureActivity
  | where Category =~ "Administrative"
  | where OperationNameValue in~ (opValues)
  | where ActivitySubstatusValue in~ ("Created", "OK")
  | sort by TimeGenerated desc
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])
  | extend Account_0_Name = Name
  | extend Account_0_UPNSuffix = UPNSuffix
  | extend IP_0_Address = CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 2.0.1
