id: 5a1f9655-c893-4091-8dc0-7f11d7676506
name: Microsoft Sentinel Workbooks Administrative Operations
description: |
  'Identifies set of Microsoft Sentinel Workbooks administrative operational detection queries for hunting activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
  let opValues = dynamic(["microsoft.insights/workbooks/write", "microsoft.insights/workbooks/delete"]);
  // Microsoft Sentinel Workbook Create / Update / Delete
  AzureActivity
  | where Category =~ "Administrative"
  | where OperationNameValue in~ (opValues)
  | where ActivitySubstatusValue in~ ("Created", "OK")
  | sort by TimeGenerated desc
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])
  | extend Account_0_Name = Name
  | extend Account_0_UPNSuffix = UPNSuffix
  | extend IP_0_Address = CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 2.0.1
