id: 17201aa8-0916-4078-a020-7ea3a9262889
name: Microsoft Sentinel Connectors Administrative Operations
description: |
  'Identifies a set of Microsoft Sentinel Data Connectors for administrative and operational detection queries for hunting activities.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
  let opValues = dynamic(["Microsoft.SecurityInsights/dataConnectors/write", "Microsoft.SecurityInsights/dataConnectors/delete"]);
  // Microsoft Sentinel Data Connectors Update / Delete
  AzureActivity
  | where OperationNameValue in~ (opValues)
  | where ActivitySubstatusValue in~ ("Created", "OK")
  | sort by TimeGenerated desc
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])
  | extend Account_0_Name = Name
  | extend Account_0_UPNSuffix = UPNSuffix
  | extend IP_0_Address = CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 2.0.1
