id: e94d6756-981c-4f02-9a81-d006d80c8b41
name: Azure Network Security Group NSG Administrative Operations
description: |
  'Identifies a set of Azure NSG administrative and operational detection queries for hunting activities.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
  let opValues = dynamic(["Microsoft.Network/networkSecurityGroups/write", "Microsoft.Network/networkSecurityGroups/delete"]);
  // Azure NSG Create / Update / Delete
  AzureActivity
  | where Category =~ "Administrative"
  | where OperationNameValue in~ (opValues)
  | where ActivitySubstatusValue in~ ("Created", "OK","Accepted")
  | sort by TimeGenerated desc
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])
  | extend Account_0_Name = Name
  | extend Account_0_UPNSuffix = UPNSuffix
  | extend IP_0_Address = CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 2.0.1