id: 57784ba5-7791-422e-916f-65ef94fe1dbb
name: Azure Virtual Network Subnets Administrative Operations
description: |
  'Identifies a set of Azure Virtual Network Subnets for administrative and operational detection queries for hunting activities.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
  let opValues = dynamic(["Microsoft.Network/virtualNetworks/subnets/write","Microsoft.Network/virtualNetworks/subnets/delete"]);
  // Creating, Updating or Deleting Virtual Network Subnets
  AzureActivity
  | where CategoryValue =~ "Administrative"
  | where OperationNameValue in~ (opValues)
  | where ActivitySubstatusValue in~ ("Created","Accepted")
  | sort by TimeGenerated desc
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])
  | extend Account_0_Name = Name
  | extend Account_0_UPNSuffix = UPNSuffix
  | extend IP_0_Address = CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 2.0.1
