id: fd68706e-8e3e-4ccd-9230-1f267bdad4c8
name: Admin overrides
description: |
  This query helps in reviewing malicious emails allowed due to admin overrides
description-detailed: |
  This query helps in reviewing malicious emails allowed due to admin defined detection overrides in Defender for Office 365
  Reference - https://learn.microsoft.com/en-us/defender-office-365/step-by-step-guides/understand-overrides-in-email-entity and https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/email-protection-basics-in-microsoft-365-part-five-mastering/ba-p/4139035
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562
query: |
  EmailEvents
  | where DeliveryLocation == "Inbox/folder" 
  | where isnotempty(ThreatTypes) and OrgLevelAction == "Allow" 
  | count
version: 1.0.0