id: 74e076da-58e8-436d-b7bc-68888dbb6091
name: Total Emails with User Overrides (Block)
description: |
  Total Emails with User Overrides (Block)
description-detailed: |
  Total Emails with User Overrides (Block)
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where UserLevelPolicy != "" and UserLevelAction == "Block"
  | summarize count() by UserLevelPolicy
  // | render columnchart // Uncomment this line to render as a graph
version: 1.0.0