id: 8f8fd7c8-277a-48c3-ad67-c80b3037c5af
name: Total Emails with Admin Overrides (Allow)
description: |
  Total Emails with Admin Overrides (Allow)
description-detailed: |
  Total Emails with Admin Overrides (Allow)
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents 
  | where OrgLevelPolicy != "" and OrgLevelAction == "Allow" 
  | summarize count() by OrgLevelPolicy,bin(Timestamp, 1d)
version: 1.0.0
