id: b1f797d1-6ea4-4f8f-b663-6c8a1c1018e9
name: User overrides
description: |
  This query helps in reviewing malicious emails allowed due to user overrides
description-detailed: |
  This query helps in reviewing malicious emails allowed due to user defined detection overrides in Defender for Office 365
  Reference - https://learn.microsoft.com/en-us/defender-office-365/step-by-step-guides/understand-overrides-in-email-entity and https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/email-protection-basics-in-microsoft-365-part-five-mastering/ba-p/4139035
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562
query: |
  EmailEvents
  | where DeliveryLocation == "Inbox/folder" 
  | where isnotempty(ThreatTypes) and UserLevelAction == "Allow" 
  | count
version: 1.0.0