id: 7feb3c32-2a11-4eb8-a2d7-e3792b31cb90
name: 1Password - Possible data exfiltration
description: |
  'Detects exfiltration of data from 1Password.'
severity: Medium
status: Available
requiredDataConnectors:
  - connectorId: OnePasswordEventLogs_CL
    dataTypes:
      - OnePasswordEventLogs
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Exfiltration
relevantTechniques:
  - T1071
query: |
  let threshold = 20;
  let lookback = ago(14d);

  let onePasswordUserList =
      IdentityInfo // UEBA data must be enabled
      | where TimeGenerated between (lookback .. now())
      | where GroupMembership has_any ("SEC - 1P Users", "SEC - 1P Admins") // Microsoft Entra ID user groups for 1P users
      | distinct AccountUPN
      | summarize make_list(AccountUPN)
  ;

  let ipAddressBaseline =
      union SigninLogs, AADNonInteractiveUserSignInLogs
      | where TimeGenerated between (lookback .. now())
      | where ResultType == 0
      | where UserPrincipalName in (onePasswordUserList)
      | summarize signinCount=count() by IPAddress
      | where signinCount < threshold // must have signed in successfully at least 20 times from an IP address else it's considered suspicious behavior
      | distinct IPAddress
      | summarize make_list(IPAddress)
  ;

  OnePasswordEventLogs_CL
  | where action in~ ("share", "delshare")
  | where object_type in~ ("item")
  | where actor_details.email in~ (onePasswordUserList)
  | where session.ip !in (ipAddressBaseline)