id: 56ebae61-89cf-42d9-99f4-3dff8ba33885
name: Backup Deletion 
description: |
   'This hunting query will help detect attempts to delete backup. Though such an activity could be legitimate as part of regular business operations, often ransomwares also perform such actions so that once the files are encrypted by them, backups cannot be used to restore encrypted files and thus cause interruption to regular business services.'
requiredDataConnectors:
  - connectorId: MicrosoftDefenderAdvancedThreatProtection
    dataTypes:
      - SecurityAlert (MDATP)
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
tactics:
  - Impact
relevantTechniques:
  - T1490
tags:
  - HiveRansomware
  - Schema: ASIMProcessEvent
    SchemaVersion: 0.1.0
query: |
  ( union isfuzzy=true
  (SecurityEvent
  | where EventID==4688
  | extend FileName = Process, ProcessCommandLine = CommandLine
  | where FileName =~ "vssadmin.exe" and ProcessCommandLine has "delete shadows"
   or ProcessCommandLine has("bcdedit") and ProcessCommandLine has_any("recoveryenabled no", "bootstatuspolicy ignoreallfailures")
   or (ProcessCommandLine has "wmic" and ProcessCommandLine has "shadowcopy delete")
   or ProcessCommandLine has "wbadmin" and ProcessCommandLine has "delete" and ProcessCommandLine has_any("backup", "catalog", "systemstatebackup")
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, ProcessCustomEntity = NewProcessName
  ),
  (WindowsEvent
  | where EventID == 4688 
  | extend ProcessCommandLine = tostring(EventData.CommandLine)
  | where  EventData has "vssadmin.exe" and ProcessCommandLine has "delete shadows"
   or ProcessCommandLine has("bcdedit") and ProcessCommandLine has_any("recoveryenabled no", "bootstatuspolicy ignoreallfailures")
   or (ProcessCommandLine has "wmic" and ProcessCommandLine has "shadowcopy delete")
   or ProcessCommandLine has "wbadmin" and ProcessCommandLine has "delete" and ProcessCommandLine has_any("backup", "catalog", "systemstatebackup") 
  | extend Account = strcat(EventData.TargetDomainName,"\\", EventData.TargetUserName)
  | extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account
  ),
  (DeviceProcessEvents
  | where FileName =~ "vssadmin.exe" and ProcessCommandLine has "delete shadows"
   or ProcessCommandLine has("bcdedit") and ProcessCommandLine has_any("recoveryenabled no", "bootstatuspolicy ignoreallfailures")
   or (ProcessCommandLine has "wmic" and ProcessCommandLine has "shadowcopy delete")
   or ProcessCommandLine has "wbadmin" and ProcessCommandLine has "delete" and ProcessCommandLine has_any("backup", "catalog", "systemstatebackup") 
  | extend timestamp = TimeGenerated, AccountCustomEntity = AccountName, HostCustomEntity = DeviceName, ProcessCustomEntity = InitiatingProcessFileName
  ),
  (imProcessCreate
  | extend FileName = Process, ProcessCommandLine = CommandLine
  | where FileName =~ "vssadmin.exe" and ProcessCommandLine has "delete shadows"
   or ProcessCommandLine has("bcdedit") and ProcessCommandLine has_any("recoveryenabled no", "bootstatuspolicy ignoreallfailures")
   or (ProcessCommandLine has "wmic" and ProcessCommandLine has "shadowcopy delete")
   or ProcessCommandLine has "wbadmin" and ProcessCommandLine has "delete" and ProcessCommandLine has_any("backup", "catalog", "systemstatebackup")
  | extend timestamp = TimeGenerated, HostCustomEntity = Dvc, ProcessCustomEntity = Process
  )
  )
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
  - entityType: Process
    fieldMappings:
      - identifier: ProcessId
        columnName: ProcessCustomEntity