id: dde206fc-3f0b-4175-bb5d-42d2aae9d4c9
name: Cobalt Strike DNS Beaconing
description: |
  'Cobalt Strike is a famous Pen Test tool that is used by pen testers as well as attackers alike To compromise an environment. 
  The query tries to detect suspicious DNS queries known from Cobalt Strike beacons.
  This is based out of sigma rules described here: https://github.com/Neo23x0/sigma/blob/master/rules/network/net_mal_dns_cobaltstrike.yml'
requiredDataConnectors:
  - connectorId: DNS
    dataTypes:
      - DnsEvents
tactics:
  - CommandAndControl
relevantTechniques:
  - T1483
  - T1008
query: |

  let timeframe = 1d;
  let badNames = dynamic(["aaa.stage.", "post.1"]);
  (union isfuzzy=true
  (DnsEvents
  | where TimeGenerated >= ago(timeframe) 
  | where Name has_any (badNames)
  | extend Domain = Name, SourceIp = ClientIP, RemoteIP = todynamic(IPAddresses)
  | mvexpand RemoteIP
  | extend RemoteIP = tostring(RemoteIP)),
  (VMConnection
  | where TimeGenerated >= ago(timeframe)
  | where isnotempty(RemoteDnsCanonicalNames) 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where DNSName has_any (badNames)
  | extend Domain = DNSName, RemoteIP = RemoteIp
  ))
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by Domain, SourceIp, RemoteIP, Computer
  | extend timestamp = StartTimeUtc, HostCustomEntity = Computer, IPCustomEntity = RemoteIP
