id: 19abc034-139e-4e64-a05d-cb07ce8b003b
name: Malicious Connection to LDAP port for CVE-2021-44228 vulnerability
description: |
  'This hunting query looks for connection to LDAP port to find possible exploitation attempts for CVE-2021-44228 involving log4j vulnerability. 
   Log4j is an open-source Apache logging library that is used in many Java-based applications. Awarness of normal baseline traffic of an enviornment for java.exe
   while using this query will help detrmine normal from anaomalous.
   Refrence: https://www.microsoft.com/security/blog/2021/12/11/guidance-for-preventing-detecting-and-hunting-for-cve-2021-44228-log4j-2-exploitation/'
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection 
    dataTypes: 
      - DeviceNetworkEvents
  - connectorId: AzureMonitor(VMInsights) 
    dataTypes:
      - VMConnection
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
tags:
  - CVE-2021-44228
  - log4j 
  - log4shell
query: |
  let PrivateIPregex = @'^127\.|^10\.|^172\.1[6-9]\.|^172\.2[0-9]\.|^172\.3[0-1]\.|^192\.168\.';
  let Port = dynamic(['389', '1389']); 
  (union isfuzzy=true
  (DeviceNetworkEvents
  | where InitiatingProcessFileName has_any ("javaw.exe","java.exe")
  | where ActionType has "ConnectionSuccess"
  | where RemotePort in ('389', '1389')
  | where InitiatingProcessCommandLine has_any ('curl', 'wget')
  | where RemoteIPType =~ 'Public'
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by ActionType, DestinationIP = RemoteIP, RemoteUrl, DestinationPort = RemotePort, SourceIP = LocalIP, Type, InitiatingProcessAccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath,  InitiatingProcessParentFileName, ProcessName = InitiatingProcessFileName, Computer = DeviceName
  | extend timestamp = StartTime, IPCustomEntity = DestinationIP, HostCustomEntity = Computer
  ),
  (VMConnection
  | where ProcessName has_any ("javaw","java")
  | where DestinationPort in ('389', '1389')
  | extend DestinationIpType = iff(DestinationIp matches regex PrivateIPregex,"private" ,"public" )
  | where DestinationIpType == "public"
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by TimeGenerated, SourceIP = SourceIp , DestinationIP = DestinationIp, DestinationPort,  BytesReceived, BytesSent, ProcessName, Computer
  | extend timestamp = StartTime, IPCustomEntity = DestinationIP, HostCustomEntity = Computer
  )
  )
entityMappings: 
- entityType: IP
  fieldMappings:
    - identifier: Address
      columnName: IPCustomEntity
- entityType: Host
  fieldMappings:
    - identifier: FullName
      columnName: HostCustomEntity