id: 7098cae1-c632-4b40-b715-86d6b07720d7
name: Storage Alert Correlation with CommonSecurityLogs and StorageLogs
description: |
  'This query combines different Storage alerts with CommonSecurityLogs and StorageLogs helping analysts  triage and investigate any 
  possible Storage related attacks faster thus reducing MTTR'
requiredDataConnectors:
  - connectorId: Fortinet
    dataTypes:
      - CommonSecurityLog
  - connectorId: AzureSecurityCenter
    dataTypes:
      - SecurityAlert (ASC)
tactics:
  - CommandAndControl
  - Impact
relevantTechniques:
  - TA0008
  - T1586
  - T1078
query: |  

  let alertData = SecurityAlert
  | where TimeGenerated > ago(30min)
  | where DisplayName has_any ("Potential malware uploaded to a storage account","Storage account identified as source for distribution of malware")
  | extend Entities = parse_json(Entities)
  | mv-expand Entities;
  let ipData = alertData
  | where Entities['Type'] =~ "ip"
  | extend AttackerIP = tostring(Entities['Address']), AttackerCountry = tostring(Entities['Location']['CountryName']);
  let FileData = alertData
  | where Entities['Type'] =~ "file"
  | extend MaliciousFileDirectory = tostring(Entities['Directory']), MaliciousFileName = tostring(Entities['Name']), MaliciousFileHashes = tostring(Entities['FileHashes']);
  ipData
  | join (FileData) on VendorOriginalId
  | summarize by TimeGenerated, AttackerIP, AttackerCountry, DisplayName, ResourceId, AlertType, MaliciousFileDirectory, MaliciousFileName, MaliciousFileHashes
  | extend type = iff(DisplayName has "file", "File", "Blob")
  | join (
  union
  StorageFileLogs,
  StorageBlobLogs
  | where TimeGenerated > ago(30min)
   | where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
    | extend ClientIP = tostring(CallerIpAddress)
  | extend FileName = extract(@"\/([\w\-. ]+)\?", 1, Uri)
      | join kind=leftouter (
        union
        StorageFileLogs,
        StorageBlobLogs        
        | where TimeGenerated > ago(30min)        
        | where OperationName =~ "DeleteFile" or OperationName =~ "DeleteBlob"        
        | extend ClientIP = tostring(split(CallerIpAddress, ":", 0)[0])        
        | extend FileName = extract(@"\/([\w\-. ]+)\?", 1, Uri)        
        | extend SourceTable = iff(OperationName has "range", "StorageFileLogs", "StorageBlobLogs")        
        | extend p = pack("FileName", FileName, "Time", TimeGenerated, "SourceTable", SourceTable)        
        | summarize DeletedFileInfo=make_list(p), FilesDeleted=count() by ClientIP
        ) on ClientIP
  ) on $left.AttackerIP == $right.ClientIP
  | project AlertTimeGenerated = TimeGenerated,  AlertType, AttackerIP, AttackerCountry, MaliciousFileDirectory, MaliciousFileName;
  let commonsecuritylog =
  CommonSecurityLog
  | where DeviceVendor has "Fortinet"
  | where ApplicationProtocol has_any ("SSL","RDP")
  | where LogSeverity has_any ("2","3")
  | where isnotempty(SourceIP) and isnotempty(DestinationIP) and SourceIP != "0.0.0.0"
    | where DeviceAction !in ("close", "client-rst", "server-rst", "deny") and DestinationPort != 161
  | extend IpAddress = tostring(parse_json(SourceIP))
  | extend TimeGenerated2 = TimeGenerated
  | project DeviceProduct,LogSeverity,DestinationPort,DestinationIP,Message,SourceIP,SourcePort,Activity,SentBytes,ReceivedBytes,IpAddress,TimeGenerated2;
  ipData
  | join kind=inner CommonSecurityLog on $left.AttackerIP==$right.DestinationIP
  //| project AlertName,WorkspaceSubscriptionId,AttackerIP,AlertSeverity,SourceIP,DestinationIP,SentBytes,ReceivedBytes,TimeGenerated
  | summarize count() by TimeGenerated,AlertName,WorkspaceSubscriptionId,AlertSeverity,SourceIP,DestinationIP,SentBytes,ReceivedBytes