// Usage Instruction : 
// Paste below query in log analytics, click on Save button and select as Function from drop down by specifying function name and alias as PingFederateEvent.
// Function usually takes 10-15 minutes to activate. You can then use function alias from any other queries (e.g. PingFederateEvent | take 10).
// Reference : Using functions in Azure monitor log queries : https://docs.microsoft.com/azure/azure-monitor/log-query/functions
CommonSecurityLog 
| where DeviceProduct has 'PingFederate'
| extend EventVendor = DeviceVendor
| extend EventProduct = DeviceProduct
| extend EventProductVersion = DeviceVersion
| extend EventSeverity = LogSeverity
| extend SrcIpAddr = SourceIP
| extend SrcHostname = SourceHostName
| extend SrcUserName = SourceUserName
| extend EventMessage = Message
| extend EventSubType = DeviceEventClassID
| extend EventType = Activity
| extend DstUserName = DestinationUserID
| extend DstGeoCountry = extract(@'country=;?(\w+),.*', 1, AdditionalExtensions)
| extend EventResultDetails = extract(@'description=(.*?),.*', 1, AdditionalExtensions)
| extend DvcHostname = DeviceAddress
| project TimeGenerated
        , EventVendor
        , EventProduct
        , EventProductVersion
        , EventMessage
        , EventType
        , EventSubType
        , DstUserName
        , DstGeoCountry
        , DvcHostname
        , EventSeverity
        , SrcIpAddr
        , SrcHostname
        , SrcUserName
        , EventResultDetails
        , DeviceCustomString1Label
        , DeviceCustomString1
        , DeviceCustomString2Label
        , DeviceCustomString2
        , DeviceCustomString3Label
        , DeviceCustomString3
        , DeviceCustomString4Label
        , DeviceCustomString4
        , DeviceCustomString5Label
        , DeviceCustomString5
        , DeviceCustomString6Label
        , DeviceCustomString6
        , AdditionalExtensions
