id: 9d4e2cac-3380-4549-a87d-84b4bdaa5538
Function:
  Title: Parser for PingFederateEvent
  Version: '1.0.0'
  LastUpdated: '2023-08-23'
Category: Microsoft Sentinel Parser
FunctionName: PingFederateEvent
FunctionAlias: PingFederateEvent
FunctionQuery: |
    CommonSecurityLog 
    | where DeviceProduct has 'PingFederate'
    | extend EventVendor = DeviceVendor
    | extend EventProduct = DeviceProduct
    | extend EventProductVersion = DeviceVersion
    | extend EventSeverity = LogSeverity
    | extend SrcIpAddr = SourceIP
    | extend SrcHostname = SourceHostName
    | extend SrcUserName = SourceUserName
    | extend EventMessage = Message
    | extend EventSubType = DeviceEventClassID
    | extend EventType = Activity
    | extend DstUserName = DestinationUserID
    | extend DstGeoCountry = extract(@'country=;?(\w+),.*', 1, AdditionalExtensions)
    | extend EventResultDetails = extract(@'description=(.*?),.*', 1, AdditionalExtensions)
    | extend DvcHostname = DeviceAddress
    | project TimeGenerated
            , EventVendor
            , EventProduct
            , EventProductVersion
            , EventMessage
            , EventType
            , EventSubType
            , DstUserName
            , DstGeoCountry
            , DvcHostname
            , EventSeverity
            , SrcIpAddr
            , SrcHostname
            , SrcUserName
            , EventResultDetails
            , DeviceCustomString1Label
            , DeviceCustomString1
            , DeviceCustomString2Label
            , DeviceCustomString2
            , DeviceCustomString3Label
            , DeviceCustomString3
            , DeviceCustomString4Label
            , DeviceCustomString4
            , DeviceCustomString5Label
            , DeviceCustomString5
            , DeviceCustomString6Label
            , DeviceCustomString6
            , AdditionalExtensions