{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    },
    "location": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimNetworkSessionCiscoASA",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "Cisco ASA Network Sessions",
            "category": "Security",
            "FunctionAlias": "vimNetworkSessionCiscoASA",
            "query": "let CiscoASA_Network_NormalizedParser=(){CommonSecurityLog \n| where DeviceVendor == \"Cisco\" \n| where DeviceProduct ==\"ASA\"\n| where isnotempty(DeviceAction)\n| extend EventSchemaVersion=\"1.0.0\"\n  , EventCount=toint(1) \n  , EventVendor = \"Cisco\"\n  , EventProduct = \"ASA\"\n  , EventTimeIngested = ingestion_time()\n  | project-rename \n  DvcAction=DeviceAction,\n    NetworkProtocol = Protocol, \n    EventMessage = Message, \n  SrcIpAddr=SourceIP,\n    DstIpAddr=DestinationIP,\n    DstPortNumber=DestinationPort,\n    SrcPortNumber=SourcePort\n};\nCiscoASA_Network_NormalizedParser",
            "version": 1
          }
        }
      ]
    }
  ]
}