//Title:File Archiver in the browser URL click
//Description:Detects any click into to any file archiver in the browser phishing.
//Author:kddx017831
UrlClickEvents
| where Timestamp > ago(30d)
|extend dom=extract(@"^(?:https?:\/\/)?(?:[^@\n]+@)?(?:www\.)?([^:\/\n?]+)",0,Url)
|where dom endswith ".zip" or dom endswith ".dad" or dom endswith ".phd" or dom endswith ".mov"