id: eb2e5971-01be-41a7-b099-e255720f6d35
name: files-from-malicious-sender
description: |-
  This query checks devices for the presence of files that have been sent by a known malicious sender. To use this query, replace the email address with the address of the known malicious sender.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailAttachmentInfo
  - DeviceFileEvents
tactics:
- Initial access
query: |-
  //Get prevalence of files sent by a malicious sender in your organization
  EmailAttachmentInfo
  | where SenderFromAddress =~ "MaliciousSender@example.com"
  | where isnotempty(SHA256)
  | join (
  DeviceFileEvents
  | project FileName, SHA256
  ) on SHA256
