id: 95a5454e-9d28-456a-a2b2-7beee721f0c1
name: PhishingEmailUrlRedirector
description: |-
  This query was originally published on Twitter, by @MsftSecIntel.
  The query helps detect emails associated with a campaign that has used open redirector URLs. The campaign's URLs begin with the distinct pattern, hxxps://t. Attackers use URL redirection to manipulate users into visiting a malicious website or to evade detection.
  Reference - https://twitter.com/MsftSecIntel
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailUrlInfo
tactics:
- Initial access
query: |-
  EmailUrlInfo
  | where Url matches regex @"s?\:\/\/(?:www\.)?t\.(?:[\w\-\.]+\/+)+(?:r|redirect)\/?\?"
