id: dbc2438a-0d16-4890-aaae-cbe0dc433b08
name: Recorded Future - URL - Threat Actor Hunt
description: |
  'Recorded Future - URL - Threat Actor Hunt.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligenceUploadIndicatorsAPI
    dataTypes:
      - ThreatIntelligenceIndicator
tags:
  - RecordedFuture
query: |
  Squid_Proxy_URL_CL
  | where isnotempty(URL_s)
  | join kind=inner (ThreatIntelligenceIndicator
  | where Description startswith "Recorded Future - Threat Hunt"
  | where Active == true
  | distinct Url
  )
  on $left.URL_s == $right.Url
  | project URL_s
  | extend URL_0_Url = URL_s
entityMappings:
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: Url