id: 7b5eb44d-3533-440e-9774-73a4d99bc2b2
name: Recorded Future - Threat Hunting - IP- All Actors
description: |
  'Recorded Future Threat Hunting IP correlation for all actors.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligenceUploadIndicatorsAPI
    dataTypes:
      - ThreatIntelligenceIndicator
tactics:
  - CommandAndControl
relevantTechniques:
  - T0869
tags:
  - RecordedFuture
query: |
  NetScreen_Firewall_CL
  | join kind= innerunique  (ThreatIntelligenceIndicator
  | where Description startswith "Recorded Future - Threat Hunt"
  | where Active == true
  | distinct NetworkIP
  )
  on $left.Dst_IPv4_s == $right.NetworkIP
  | project Dst_IPv4_s
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Dst_IPv4_s
version: 1.0.0