id: d641a534-ead8-41aa-a7c8-2b35e6b64c9f
name: RecordedFuture Threat Hunting Domain All Actors
description: |
  'Recorded Future Threat Hunting domain correlation for all actors.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelIndicators
tags:
  - RecordedFuture
query: |
  // The source table (_Im_Dns) is a ASIM parser table, but can be replaced by any infrastructure table containing domain/dns data.
  // The following workbook: Recorded Future - Domain Correlation will help researching available data and selecting tables and columns
  _Im_Dns
  | where isnotempty(Domain)
  | join kind=inner (
  ThreatIntelIndicators
  // Only look for IOCs
  | where ObservableKey == 'domain-name:value'
  | where isnotempty(ObservableValue)
  // Only look at Recorded Future Threat Hunt Indicators.
  | where Data.description startswith "Recorded Future - Threat Hunt"
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
  | where IsActive == true and ValidUntil > now()
  ) on $left.Domain == $right.ObservableValue
  | project Domain, DstIpAddr
  | extend IP_0_Address = DstIpAddr
  | extend DNS_0_DomainName = Domain
entityMappings:
  - entityType: DNSResolution
    fieldMappings:
      - identifier: DomainName
        columnName: Domain
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DstIpAddr
