id: d641a534-ead8-41aa-a7c8-2b35e6b64c9f
name: Recorded Future - Threat Hunting - Domain- All Actors
description: |
  'Recorded Future Threat Hunting domain correlation for all actors.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligenceUploadIndicatorsAPI
    dataTypes:
      - ThreatIntelligenceIndicator
tags:
  - RecordedFuture
query: |
  Squid_Proxy_Domain_CL
  | where isnotempty(Domain_s)
  | join kind=inner (ThreatIntelligenceIndicator
  | where Active == true
  | where Description startswith "Recorded Future - Threat Hunt"
  | distinct DomainName
  ) on $left.Domain_s == $right.DomainName
  | project Domain_s, Src_IPv4_s
  | extend IP_0_Address = Src_IPv4_s
  | extend DNS_0_DomainName = Domain_s
entityMappings:
  - entityType: DNSResolution
    fieldMappings:
      - identifier: DomainName
        columnName: Domain_s
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Src_IPv4_s
