id: 905da21a-c7d2-4f5b-b8fc-c8321da3ee83
name: Recorded Future - Threat Hunting - Hash- All Actors
description: |
  'Recorded Future Threat Hunting hash correlation for all actors.'
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelligenceUploadIndicatorsAPI
    dataTypes:
      - ThreatIntelligenceIndicator
tactics:
  - InitialAccess
relevantTechniques:
  - T1566.001
tags:
  - RecordedFuture
query: |
  EndpointProtection_HASH_CL
  | where isnotempty(Hash_s)
  | join kind=inner (ThreatIntelligenceIndicator
  | where Description startswith "Recorded Future - Threat Hunt"
  | where Active == true
  | distinct FileHashValue
  )
  on $left.Hash_s == $right.FileHashValue
  | project Hash_s, Hash_Type_s
entityMappings:
  - entityType: FileHash
    fieldMappings:
      - identifier: Value
        columnName: Hash_s
  - entityType: FileHash
    fieldMappings:
      - identifier: Algorithm
        columnName: Hash_Type_s
version: 1.0.0