id: bb616d82-108f-47d3-9dec-9652ea0d3bf6
name: Account Created and Deleted in Short Timeframe
description: |
  'Search for user principal name (UPN) events. Look for accounts created and then deleted in under 24 hours. Attackers may create an account for their use, and then remove the account when no longer needed.
  Ref : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#short-lived-account'
severity: High
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1078.004
tags:
  - AADSecOpsGuide
query: |
  AuditLogs
  | where OperationName =~ "Add user"
  | extend UPN = tostring(TargetResources[0].userPrincipalName)
  | join kind=inner (AuditLogs
  | where OperationName =~ "Delete user"
  | extend UPN = tostring(TargetResources[0].userPrincipalName)
  | extend IPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) on UPN
  | extend timedelta = TimeGenerated1 - TimeGenerated
  | project-reorder TimeGenerated, TimeGenerated1, timedelta
  | where timedelta < timespan(24h) and timedelta > timespan(0h)
  | extend CustomAccountEntity = UPN, IPCustomEntity = IPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: CustomAccountEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.1
kind: scheduled
