id: 639aa695-9de9-4921-aa6b-6fdc35cb1eee
name: Guest accounts changed user type from guest to members in AzureAD
description: |
  'Guest Accounts are added in the Organization Tenants to perform various tasks i.e projects execution, support etc.. This detection notifies when guest users are changed from user type as should be in AzureAD to member and gain other rights in the tenant.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
status: Available
tactics:
  - InitialAccess
  - Persistence
  - Discovery
relevantTechniques:
  - T1078.004
  - T1136.003
  - T1087.004
query: |
  AuditLogs 
  | where OperationName contains "Update user"
  | where TargetResources[0].modifiedProperties[0].oldValue contains "Guest"
  | extend InvitedUser = TargetResources[0].userPrincipalName
  // Uncomment the below line if you want to get alerts for changed usertype from specific domains or users
  //| where InvitedUser has_any ("CUSTOM DOMAIN NAME#", "#EXT#")
  | extend InitiatedByActionUserInformation = iff(isnotempty(InitiatedBy.user.userPrincipalName), InitiatedBy.user.userPrincipalName, InitiatedBy.app.displayName)
  | extend InitiatedByIPAdress = InitiatedBy.user.ipAddress 
  | extend OldUserType = TargetResources[0].modifiedProperties[0].oldValue contains "Guest"
  | extend NewUserType = TargetResources[0].modifiedProperties[0].newValue contains "Member"
  | mv-expand OldUserType = TargetResources[0].modifiedProperties[0].oldValue to typeof(string)
  | mv-expand NewUserType = TargetResources[0].modifiedProperties[0].newValue to typeof(string)
  | where OldUserType != NewUserType
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: InvitedUser
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: InitiatedByActionUserInformation
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: InitiatedByIPAdress
version: 1.0.0
kind: Scheduled
