id: 84cccc86-5c11-4b3a-aca6-7c8f738ed0f7
name: Service Principal Assigned Privileged Role
description: |
  'Detects a privileged role being added to a Service Principal.
    Ensure that any assignment to a Service Principal is valid and appropriate - Service Principals should not be assigned to very highly privileged roles such as Global Admin.
    Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078.004
tags:
  - AADSecOpsGuide
query: |
  AuditLogs
    | where OperationName has_all ("member to role", "add")
    | where Result =~ "Success"
    | extend type_ = tostring(TargetResources[0].type)
    | where type_ =~ "ServicePrincipal"
    | where isnotempty(TargetResources)
    | extend ServicePrincipal = tostring(TargetResources[0].displayName)
    | extend SPID = tostring(TargetResources[0].id)
    | mv-expand TargetResources[0].modifiedProperties
    | extend TargetResources_0_modifiedProperties = columnifexists("TargetResources_0_modifiedProperties", '')
    | where isnotempty(TargetResources_0_modifiedProperties)
    | where TargetResources_0_modifiedProperties.displayName =~ "Role.DisplayName"
    | extend TargetRole = parse_json(tostring(TargetResources_0_modifiedProperties.newValue))
    | where TargetRole contains "admin"
    | extend AddedByApp = iif(
    isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).servicePrincipalName)),
    tostring(parse_json(tostring(InitiatedBy.app)).servicePrincipalName),
    tostring(parse_json(tostring(InitiatedBy.app)).displayName)
    )
    | extend AddedByUser = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | extend AddedBy = iif(isnotempty(AddedByApp), AddedByApp, AddedByUser)
    | extend IpAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
    | project-reorder TimeGenerated, ServicePrincipal, SPID, TargetRole, AddedBy, IpAddress
    | project-away AddedByApp, AddedByUser
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: SPID
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AddedBy
version: 1.0.1
kind: Scheduled
metadata:
    source:
        kind: Community
    author:
        name: Pete Bryan
    support:
        tier: Community
    categories:
        domains: [ "Security - Others", "Identity" ]