id: 6852d9da-8015-4b95-8ecf-d9572ee0395d
name: Suspicious Service Principal creation activity
description: |
  'This alert will detect creation of an SPN, permissions granted, credentials cretaed, activity and deletion of the SPN in a time frame (default 10 minutes)'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
      - AADServicePrincipalSignInLogs
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - PrivilegeEscalation
  - InitialAccess
relevantTechniques:
  - T1078
query: |
  let timeframe = 60m;
  let lookback = 10m;
  let account_created =
  AuditLogs 
    | where ActivityDisplayName == "Add service principal"
    | where Result == "success"
    | extend AppID = tostring(AdditionalDetails[1].value)
    | extend creationTime = ActivityDateTime
    | extend userPrincipalName_creator = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | extend ipAddress_creator = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress);
  let account_activity =
  AADServicePrincipalSignInLogs
    | extend Activities = pack("ActivityTime", TimeGenerated ,"IpAddress", IPAddress, "ResourceDisplayName", ResourceDisplayName)
    | extend AppID = AppId
    | summarize make_list(Activities) by AppID;
  let account_deleted =
  AuditLogs 
    | where OperationName == "Remove service principal"
    | where Result == "success"
    | extend AppID = tostring(AdditionalDetails[1].value)
    | extend deletionTime = ActivityDateTime
    | extend userPrincipalName_deleter = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | extend ipAddress_deleter = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress);
  let account_credentials =
  AuditLogs
    | where OperationName contains "Update application - Certificates and secrets management"
    | where Result == "success"
    | extend AppID = tostring(AdditionalDetails[1].value)
    | extend credentialCreationTime = ActivityDateTime;
  let roles_assigned =
  AuditLogs
    | where ActivityDisplayName == "Add app role assignment to service principal"
    | extend AppID = tostring(TargetResources[1].displayName)
    | extend AssignedRole =  iff(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].displayName)=="AppRole.Value", tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue))),"")
    | extend AssignedRoles = pack("Role", AssignedRole)
    |summarize  make_list(AssignedRoles) by AppID;
  account_created 
    | join kind= inner (account_activity) on AppID, AppID 
    | join kind= inner (account_deleted) on AppID, AppID 
    | join kind= inner (account_credentials) on AppID, AppID 
    | join kind= inner (roles_assigned) on AppID, AppID
    | where deletionTime - creationTime < lookback
    | where tolong(deletionTime - creationTime) >= 0
    | where creationTime > ago(timeframe)
    | extend AliveTime = deletionTime - creationTime
    | project AADTenantId, AppID, creationTime, deletionTime, userPrincipalName_creator, userPrincipalName_deleter, ipAddress_creator, ipAddress_deleter, list_Activities , list_AssignedRoles, AliveTime
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: userPrincipalName_creator
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: userPrincipalName_deleter
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ipAddress_creator
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ipAddress_deleter
version: 1.0.0
kind: Scheduled
