id: 3533f74c-9207-4047-96e2-0eb9383be587
name: Suspicious application consent for offline access
description: |
  'This will alert when a user consents to provide a previously-unknown Azure application with offline access via OAuth.
  Offline access will provide the Azure App with access to the listed resources without requiring two-factor authentication.
  Consent to applications with offline access and read capabilities should be rare, especially as the knownApplications list is expanded. Public contributions to expand this filter are welcome!
  For further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1d
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
relevantTechniques:
  - T1528
query: |
Proposing modification:
  let timeframe = 14d;
  AuditLogs
  | where TimeGenerated > ago(timeframe)
  | where LoggedByService =~ "Core Directory"
  | where Category =~ "ApplicationManagement"
  | where OperationName =~ "Consent to application"
  | where TargetResources has "offline"
  | extend AppDisplayName = tostring(TargetResources.[0].displayName)
  | extend AppClientId = tolower(tostring(TargetResources.[0].id))
  | where AppClientId !in ((externaldata(knownAppClientId:string, knownAppDisplayName:string)[@"https://github.com/Azure/Azure-Sentinel/blob/master/Sample%20Data/Feeds/Microsoft.OAuth.KnownApplications.csv"] with (format="csv")))
  | extend ConsentFull = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[4].newValue)))
  | parse ConsentFull with * "ConsentType: " GrantConsentType ", Scope: " GrantScope1 "]" *
  | where ConsentFull contains "offline_access" and ConsentFull contains "Files.Read" or ConsentFull contains "Mail.Read" or ConsentFull contains "Notes.Read" or ConsentFull contains "ChannelMessage.Read" or ConsentFull contains "Chat.Read" or ConsentFull contains "TeamsActivity.Read" or ConsentFull contains "Group.Read" or ConsentFull contains "EWS.AccessAsUser.All" or ConsentFull contains "EAS.AccessAsUser.All"
  | where GrantConsentType != "AllPrincipals" // NOTE: we are ignoring if OAuth application was granted to all users via an admin - but admin due diligence should be audited occasionally
  | extend GrantIpAddress = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)),
  tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), tostring(parse_json(tostring(InitiatedBy.app)).ipAddress))
  | extend GrantInitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)),
  tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName))
  | mv-expand AdditionalDetails
  | where tostring(parse_json(AdditionalDetails).key) =~ "User-Agent"
  | extend GrantUserAgent = tostring(parse_json(AdditionalDetails).value)
  | join kind = leftouter (AuditLogs
  | where TimeGenerated > ago(timeframe)
  | where LoggedByService =~ "Core Directory"
  | where Category =~ "ApplicationManagement"
  | extend AppClientId = tolower(tostring(TargetResources[0].id))
  | extend AppReplyURLs = parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue))
  )
  on AppClientId // replace with CorrelationId to show only first addition event
  | where OperationName1 =~ "Add service principal"
  | project TimeGenerated, GrantConsentType, GrantScope1, GrantInitiatedBy, AppDisplayName, AppReplyURLs, GrantIpAddress, GrantUserAgent, AppClientId, OperationName, ConsentFull
