id: 2a09f8cb-deb7-4c40-b08b-9137667f1c0b
name: User Added to Admin Role
description: |
  'Detects a user being added to a new privileged role. Monitor these additions to ensure the users are made eligible for these roles are intended to have these levels of access.
    Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078.004
tags:
  - AADSecOpsGuide
query: |
  AuditLogs
    | where OperationName in ("Add eligible member (permanent)", "Add eligible member (eligible)")
    | extend Role = tostring(TargetResources[0].displayName)
    | where Role contains "admin"
    | extend AddedBy = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | extend AddedUser = tostring(TargetResources[2].userPrincipalName)
    | project-reorder TimeGenerated, AddedUser, Role, AddedBy
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AddedBy
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AddedUser
version: 1.0.0
kind: Scheduled
