Parser:
  Title: Authentication ASIM parser for AWS sign-in logs
  Version: '0.1.0'
  LastUpdated: June 17, 2021
Product:
  Name: AWS
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Amazon Web Service sign in logs, stored in the  AWSCloudTrail table, to the ASIM Authentication schema.
ParserName: ASimAuthenticationAWSCloudTrail
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let AWSLogon=(disabled:bool=false){
  AWSCloudTrail | where not(disabled)
   | where EventName == 'ConsoleLogin'
   | extend
    EventVendor = 'AWS'
    , EventProduct='CloudTrail'
    , EventCount=int(1)
    , EventSchemaVersion='0.1.0'
    , EventResult= iff (ResponseElements has_cs 'Success', 'Success', 'Failure')
    , EventStartTime=TimeGenerated
    , EventEndTime=TimeGenerated
    , EventType='Logon'
    , LogonMethod=iff(AdditionalEventData has '"MFAUsed": "No"', 'NoMFA', 'MFA')
    , TargetUrl =tostring(todynamic(AdditionalEventData).LoginTo)
    , TargetUsernameType='Simple'
    , TargetUserIdType='AWSId'
    | project-rename
      EventOriginalUid= AwsEventId
    , EventOriginalResultDetails= ErrorMessage
    , TargetUsername= UserIdentityUserName
    , TargetUserType=UserIdentityType
    , TargetUserId=UserIdentityAccountId 
    , SrcDvcIpAddr=SourceIpAddress
    , HttpUserAgent=UserAgent
  // **** Aliases
  | extend
         User=TargetUsername
        , LogonTarget=tostring(split(TargetUrl,'?')[0])
        , Dvc=EventVendor
    };
    AWSLogon(disabled)
