Parser:
  Title: Authentication ASIM parser for Windows Security Events
  Version: '0.3.1'  
  LastUpdated: Jun 18, 2024
Product:
  Name: Security Events
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Security Authentication events (4624, 4625, 4634, and 4647), collected either by the Azure Monitor Agent, into SecurityEvent tables, to the ASIM Authentication schema.
ParserName: ASimAuthenticationMicrosoftSecurityEvents
EquivalentBuiltInParser: _ASim_Authentication_MicrosoftSecurityEvents
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let LogonEvents=dynamic([4624,4625]);
  let LogoffEvents=dynamic([4634,4647]);
  let LogonTypes=datatable(LogonType:int, EventSubType:string)[
        2, 'Interactive',
        3, 'Network',
        4, 'Batch',
        5, 'Service',
        7, 'Unlock',
        8, 'NetworkCleartext',
        9, 'NewCredentials',
        10, 'RemoteInteractive',
        11, 'CachedInteractive'];
  let LogonStatus=datatable 
        (EventStatus:string,EventOriginalResultDetails:string, EventResultDetails:string)[
        '0x80090325', 'SEC_E_UNTRUSTED_ROOT','Other',
        '0xc0000064', 'STATUS_NO_SUCH_USER','No such user or password',
        '0xc000006f', 'STATUS_INVALID_LOGON_HOURS','Logon violates policy',
        '0xc0000070', 'STATUS_INVALID_WORKSTATION','Logon violates policy',
        '0xc0000071', 'STATUS_PASSWORD_EXPIRED','Password expired',
        '0xc0000072', 'STATUS_ACCOUNT_DISABLED','User disabled',
        '0xc0000133', 'STATUS_TIME_DIFFERENCE_AT_DC','Other',
        '0xc000018d', 'STATUS_TRUSTED_RELATIONSHIP_FAILURE','Other',
        '0xc0000193', 'STATUS_ACCOUNT_EXPIRED','Account expired',
        '0xc0000380', 'STATUS_SMARTCARD_WRONG_PIN','Other',
        '0xc0000381', 'STATUS_SMARTCARD_CARD_BLOCKED','Other',
        '0xc0000382', 'STATUS_SMARTCARD_CARD_NOT_AUTHENTICATED','Other',
        '0xc0000383', 'STATUS_SMARTCARD_NO_CARD','Other',
        '0xc0000384', 'STATUS_SMARTCARD_NO_KEY_CONTAINER','Other',
        '0xc0000385', 'STATUS_SMARTCARD_NO_CERTIFICATE','Other',
        '0xc0000386', 'STATUS_SMARTCARD_NO_KEYSET','Other',
        '0xc0000387', 'STATUS_SMARTCARD_IO_ERROR','Other',
        '0xc0000388', 'STATUS_DOWNGRADE_DETECTED','Other',
        '0xc0000389', 'STATUS_SMARTCARD_CERT_REVOKED','Other',
        '0x80090302', 'SEC_E_UNSUPPORTED_FUNCTION','Other',
        '0x80090308', 'SEC_E_INVALID_TOKEN','Other',
        '0x8009030e', 'SEC_E_NO_CREDENTIALS','Other',
        '0xc0000008', 'STATUS_INVALID_HANDLE','Other',
        '0xc0000017', 'STATUS_NO_MEMORY','Other',
        '0xc0000022', 'STATUS_ACCESS_DENIED','Other',
        '0xc0000034', 'STATUS_OBJECT_NAME_NOT_FOUND','Other',
        '0xc000005e', 'STATUS_NO_LOGON_SERVERS','Other',
        '0xc000006a', 'STATUS_WRONG_PASSWORD','Incorrect password',
        '0xc000006d', 'STATUS_LOGON_FAILURE','Other',
        '0xc000006e', 'STATUS_ACCOUNT_RESTRICTION','Logon violates policy',
        '0xc0000073', 'STATUS_NONE_MAPPED','Other',
        '0xc00000fe', 'STATUS_NO_SUCH_PACKAGE','Other',
        '0xc000009a', 'STATUS_INSUFFICIENT_RESOURCES','Other',
        '0xc00000dc', 'STATUS_INVALID_SERVER_STATE','Other',
        '0xc0000106', 'STATUS_NAME_TOO_LONG','Other',
        '0xc000010b', 'STATUS_INVALID_LOGON_TYPE','Logon violates policy',
        '0xc000015b', 'STATUS_LOGON_TYPE_NOT_GRANTED','Logon violates policy',
        '0xc000018b', 'STATUS_NO_TRUST_SAM_ACCOUNT','Logon violates policy',
        '0xc0000224', 'STATUS_PASSWORD_MUST_CHANGE','Other',
        '0xc0000234', 'STATUS_ACCOUNT_LOCKED_OUT','User locked',
        '0xc00002ee', 'STATUS_UNFINISHED_CONTEXT_DELETED','Other'];
  let SecEventLogon=(disabled:bool=false){
      SecurityEvent 
      | where not(disabled)
      | where EventID in (LogonEvents) or 
              EventID in (LogoffEvents)
      | project-rename 
          ActorSessionId    = SubjectLogonId,
          ActorUserId       = SubjectUserSid,
          EventMessage      = Activity,
          EventOriginalType = EventID,
          EventOriginalUid  = EventOriginId,
          LogonProtocol     = AuthenticationPackageName,
          SrcDvcHostname    = WorkstationName,
          SrcDvcIpAddr      = IpAddress,
          TargetDvcHostname = Computer,
          TargetSessionId   = TargetLogonId,
          TargetUserId      = TargetUserSid
      | extend 
          ActorUserIdType    = 'SID',
          EventSchema = 'Authentication',
          ActorUsername      = iff (SubjectDomainName in ('-',''), SubjectUserName, SubjectAccount),
          ActorUsernameType  = iff(SubjectDomainName in ('-',''), 'Simple', 'Windows' ),
          EventCount         = int(1),
          EventEndTime       = TimeGenerated,
          EventProduct       = "Security Events",
          EventResult        = iff(EventOriginalType == 4625, 'Failure', 'Success'),
          EventSchemaVersion = '0.1.0',
          EventStartTime     = TimeGenerated,
          EventStatus        = iff(SubStatus=='0x0',Status,SubStatus),
          EventType          = iff(EventOriginalType in (LogoffEvents), 'Logoff', 'Logon'),
          EventVendor        = 'Microsoft',
          EventUid          = _ItemId,
          SrcDvcOs           = 'Windows',
          TargetUserIdType   = 'SID',
          TargetUsername     = iff (TargetDomainName in ('-',''), trim(@'\\',TargetUserName), trim(@'\\',TargetAccount)),
          TargetUsernameType = iff (TargetDomainName in ('-',''), 'Simple', 'Windows'),
          EventOriginalType = tostring(EventOriginalType)
      | project-away TargetUserName, AccountType
      | extend
          ActorUserType      = _ASIM_GetWindowsUserType (ActorUsername, ActorUserId),
          TargetUserType     = _ASIM_GetWindowsUserType (TargetUsername, TargetUserId)
      | lookup LogonStatus on EventStatus
      | lookup LogonTypes  on LogonType
      /// ** Aliases 
      | extend
          Dvc         = SrcDvcHostname,
          LogonTarget = TargetDvcHostname,
          User        = TargetUsername
      | project-away TemplateDSObjectFQDN,TemplateInternalName,TemplateOID,TemplateSchemaVersion,TemplateVersion,TenantId,TimeCollected,TokenElevationType,TransmittedServices,UserAccountControl,UserParameters,UserPrincipalName,UserWorkstations,VendorIds,VirtualAccount,Workstation,_ResourceId,AccessList,AccessMask,AccessReason,AccountDomain,TemplateContent,AccountExpires,AccountName,AccountSessionIdentifier,Account,AdditionalInfo2,AdditionalInfo,AllowedToDelegateTo,Attributes,AuditPolicyChanges,AuditsDiscarded,AuthenticationLevel,AuthenticationProvider,AuthenticationServer,AuthenticationService,AuthenticationType,AzureDeploymentID,AzureTableName,CACertificateHash,CAPublicKeyHash,CalledStationID,CallerProcessId,CallerProcessName,CallingStationID,CategoryId,CertificateDatabaseHash,Channel,ClassId,ClassName,ClientAddress,ClientIPAddress,ClientName,CommandLine,CompatibleIds,DCDNSName,DeviceDescription,DeviceId,DisplayName,Disposition,DomainBehaviorVersion,DomainName,DomainPolicyChanged,DomainSid,EAPType,ElevatedToken,ErrorCode,EventData,EventSourceName,EventStatus,ExtendedQuarantineState,FailureReason,FileHash,FilePathNoUser,FilePath,Filter,ForceLogoff,Fqbn,FullyQualifiedSubjectMachineName,FullyQualifiedSubjectUserName,GroupMembership,HandleId,HardwareIds,HomeDirectory,HomePath,ImpersonationLevel,InterfaceUuid,IpPort,KeyLength,Level,LmPackageName,LocationInformation,LockoutDuration,LockoutObservationWindow,LockoutThreshold,LoggingResult,LogonGuid,LogonHours,LogonID,LogonProcessName,LogonTypeName,LogonType,MG,MachineAccountQuota,MachineInventory,MachineLogon,ManagementGroupName,MandatoryLabel,MaxPasswordAge,MemberName,MemberSid,MinPasswordAge,MinPasswordLength,MixedDomainMode,NASIPv4Address,NASIPv6Address,NASIdentifier,NASPortType,NASPort,NetworkPolicyName,NewDate,NewMaxUsers,NewProcessId,NewProcessName,NewRemark,NewShareFlags,NewTime,NewUacValue,NewValueType,NewValue,ObjectName,ObjectServer,ObjectType,ObjectValueName,OemInformation,OldMaxUsers,OldRemark,OldShareFlags,OldUacValue,OldValueType,OldValue,OperationType,PackageName,ParentProcessName,PartitionKey,PasswordHistoryLength,PasswordLastSet,PasswordProperties,PreviousDate,PreviousTime,PrimaryGroupId,PrivateKeyUsageCount,PrivilegeList,ProcessId,ProcessName,Process,ProfilePath,Properties,ProtocolSequence,ProxyPolicyName,QuarantineHelpURL,QuarantineSessionID,QuarantineSessionIdentifier,QuarantineState,QuarantineSystemHealthResult,RelativeTargetName,RemoteIpAddress,RemotePort,RequestId,Requester,RestrictedAdminMode,RowKey,RowsDeleted,SamAccountName,ScriptPath,SecurityDescriptor,ServiceAccount,ServiceFileName,ServiceName,ServiceStartType,ServiceType,SessionName,ShareLocalPath,ShareName,SidHistory,SourceComputerId,SourceSystem,SrcDvcHostname,SrcDvcIpAddr,Status,StorageAccount,SubStatus,SubcategoryGuid,SubcategoryId,SubjectAccount,SubjectDomainName,SubjectKeyIdentifier,SubjectMachineName,SubjectMachineSID,SubjectUserName,Subject,TableId,TargetAccount,TargetDomainName,TargetDvcHostname,TargetInfo,TargetLinkedLogonId,TargetLogonGuid,TargetOutboundDomainName,TargetOutboundUserName,TargetServerName,TargetSid,TargetUser,Task,_ItemId
      };
    SecEventLogon(disabled=disabled)