Parser:
  Title: Authentication ASIM parser for AAD service principal sign-in logs
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: AAD
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/ASimAuthenticationDoc
Description: |
  This ASIM parser supports normalizing Azure Active Directory Service Principal sign in logs, stored in the AADServicePrincipalSignInLogs table, to the ASIM Authentication schema.
ParserName: ASimAuthenticationAADServicePrincipalSignInLogs
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let AADSvcPrincipal=(disabled:bool=false){
    AADServicePrincipalSignInLogs | where not(disabled)
    | extend
        EventVendor = 'Microsoft'
        , EventProduct = 'AAD'
        , EventCount=int(1)
        , EventSchemaVersion='0.1.0'
        , EventResult = iff (ResultType ==0, 'Success', 'Failure')
        //, EventResultDetails= ResultType
        , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)
        , EventStartTime = TimeGenerated
        , EventEndTime= TimeGenerated
        , EventType= 'Logon'
        , Location = todynamic(LocationDetails)
        , TargetAppId = ResourceIdentity
        , TargetAppName=ResourceDisplayName
      , TargetUserType='ServicePrincipal'
      , TargetUsername=ServicePrincipalName
      , TargetUserId=ServicePrincipalId
      , TargetUsernameType='Simple'
      , TargetUserIdType='AADID'
    | extend
        SrcGeoCity=tostring(Location.city)
        , SrcGeoCountry=tostring(Location.countryOrRegion)
        , SrcGeoLatitude=toreal(Location.geoCoordinates.latitude)
        , SrcGeoLongitude=toreal(Location.geoCoordinates.longitude)
    | project-rename
        EventOriginalUid =Id
        , TargetSessionId=CorrelationId
        , SrcDvcIpAddr=IPAddress
        | lookup ASIM_AADSTSErrorCodes on ResultType
       // ** Aliases
    | extend
          User=TargetUsername
      , LogonTarget=ResourceIdentity
      , Dvc=EventVendor};
  AADSvcPrincipal(disabled)
