Parser:
    Title: Authentication ASIM parser for Salesforce Service Cloud
    Version: "0.2.0"
    LastUpdated: May 6st, 2026
Product:
    Name: Salesforce Service Cloud
Normalization:
    Schema: Authentication
    Version: "0.1.4"
References:
    - Title: ASIM Authentication Schema
      Link: https://aka.ms/ASimAuthenticationDoc
    - Title: ASIM
      Link: https:/aka.ms/AboutASIM
    - Title: Salesforce Service Cloud
      Link: https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_eventlogfile_login.htm
Description: |
    This ASIM parser supports normalizing Salesforce sign in logs, stored in the SalesforceServiceCloud_CL or SalesforceServiceCloudV2_CL tables, to the ASIM Authentication schema.
ParserName: ASimAuthenticationSalesforceSC
EquivalentBuiltInParser: _ASim_Authentication_SalesforceSC
ParserParams:
    - Name: disabled
      Type: bool
      Default: false
    - Name: pack
      Type: bool
      Default: false
ParserQuery: |
    let parser = (
        disabled: bool = false,
        pack: bool = false
    ){
        let EventResultLookup = datatable (
            LoginStatus: string,
            DvcAction: string,
            EventResultDetails: string,
            EventResult: string,
            EventSeverity: string
        )[
            "LOGIN_CHALLENGE_ISSUED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_CHALLENGE_PENDING", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_DATA_DOWNLOAD_ONLY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_END_SESSION_TXN_SECURITY_POLICY", "Blocked", "Logon violates policy", "Failure", "Informational",
            "LOGIN_ERROR_API_TOO_OLD", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ASYNC_USER_CREATE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_AVANTGO_DISABLED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_AVANTGO_TRIAL_EXP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_CLIENT_NO_ACCESS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_CLIENT_REQ_UPDATE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_CSS_FROZEN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_CSS_PW_LOCKOUT", "Blocked", "User locked", "Failure", "Informational",
            "LOGIN_ERROR_DUPLICATE_USERNAME", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_EXPORT_RESTRICTED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_GLOBAL_BLOCK_DOMAIN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_HT_DOWN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_HTP_METHD_INVALID", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_INSECURE_LOGIN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_INVALID_GATEWAY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_INVALID_ID_FIELD", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_INVALID_PASSWORD", "Blocked", "Incorrect password", "Failure", "Informational",
            "LOGIN_ERROR_LOGINS_EXCEEDED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_MUST_USE_API_TOKEN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_MUTUAL_AUTHENTICATION", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_NETWORK_INACTIVE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_NO_HT_ACCESS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_NO_NETWORK_ACCESS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_NO_NETWORK_INFO", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_NO_SET_COOKIES", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_OFFLINE_DISABLED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_OFFLINE_TRIAL_EXP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_CLOSED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_DOMAIN_ONLY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_IN_MAINTENANCE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_INACTIVE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_IS_DOT_ORG", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_LOCKOUT", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_SIGNING_UP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_ORG_SUSPENDED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_OUTLOOK_DISABLED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_PAGE_REQUIRES_LOGIN", "Blocked", "Session expired", "Failure", "Informational",
            "LOGIN_ERROR_PASSWORD_EMPTY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_PASSWORD_LOCKOUT", "Blocked", "User locked", "Failure", "Informational",
            "LOGIN_ERROR_PORTAL_INACTIVE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_RATE_EXCEEDED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_RESTRICTED_DOMAIN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_RESTRICTED_TIME", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_SESSION_TIMEOUT", "Blocked", "Session expired", "Failure", "Informational",
            "LOGIN_ERROR_SSO_PWD_INVALID", "Blocked", "Incorrect password", "Failure", "Informational",
            "LOGIN_ERROR_SSO_SVC_DOWN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_SSO_URL_INVALID", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_STORE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_STORE_DOWN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_SWITCH_SFDC_INSTANCE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_SWITCH_SFDC_LOGIN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_SYNCOFFLINE_DISBLD", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_SYSTEM_DOWN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_USER_API_ONLY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_USER_FROZEN", "Blocked", "User locked", "Failure", "Informational",
            "LOGIN_ERROR_USER_INACTIVE", "Blocked", "User disabled", "Failure", "Informational",
            "LOGIN_ERROR_USER_NON_MOBILE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_USER_STORE_ACCESS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_USERNAME_EMPTY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_WIRELESS_DISABLED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ERROR_WIRELESS_TRIAL_EXP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_LIGHTNING_LOGIN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_NO_ERROR", "Allowed", "", "Success", "Informational",
            "LOGIN_OAUTH_API_DISABLED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_CONSUMER_DELETED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_DS_NOT_EXPECTED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_EXCEED_GET_AT_LMT", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_CODE_CHALLENGE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_CODE_VERIFIER", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_DEVICE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_DS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_DSIG", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_IP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_NONCE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_SIG_METHOD", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_TIMESTAMP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_TOKEN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_VERIFIER", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_INVALID_VERSION", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_MISSING_DS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_NO_CALLBACK_URL", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_NO_CONSUMER", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_NO_TOKEN", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_NONCE_REPLAY", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_PACKAGE_MISSING", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_PACKAGE_OLD", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_OAUTH_UNEXPECTED_PARAM", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_ORG_TRIAL_EXP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_READONLY_CANNOT_VALIDATE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_AUDIENCE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_CONFIG", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_FORMAT", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_IN_RES_TO", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_ISSUER", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_ORG_ID", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_PORTAL_ID", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_RECIPIENT", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_SESSION_LEVEL", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_SIGNATURE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_SITE_URL", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_STATUS", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_SUB_CONFIRM", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_TIMESTAMP", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_INVALID_USERNAME", "Blocked", "No such user", "Failure", "Informational",
            "LOGIN_SAML_INVALID_VERSION", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_MISMATCH_CERT", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_MISSING_ORG_ID", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_MISSING_PORTAL_ID", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_PROVISION_ERROR", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_REPLAY_ATTEMPTED", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_SAML_SITE_INACTIVE", "Blocked", "Other", "Failure", "Informational",
            "LOGIN_TWOFACTOR_REQ", "Blocked", "Logon violates policy", "Failure", "Informational",
            "OAUTH_APP_ACCESS_DENIED", "Blocked", "Logon violates policy", "Failure", "Informational",
            "OAUTH_TOKEN_IN_PROCESS", "Allowed", "Other", "Success", "Informational",
            "", "Allowed", "", "Success", "Informational"
        ];
        let SalesforceEventType = dynamic(['Login', 'LoginAs', 'Logout']);
        let DvcOsLookup = datatable(
            PlatformType: string,
            DvcOs: string,
            DvcOsVersion: string
        )[
            "1000", "Windows", "",
            "1008", "Windows", "2003",
            "1013", "Windows", "8.1",
            "1015", "Windows", "10",
            "2003", "Macintosh/Apple", "OSX",
            "4000", "Linux", "",
            "5005", "Android", "",
            "5006", "iPhone", "",
            "5007", "iPad", "",
            "5200", "Android", "10.0"
        ];
        let LogonMethodLookup = datatable(
            LoginType: string,
            LogonMethodOriginal: string,
            LogonMethod: string
        )[
            "7", "AppExchange", "Other",
            "A", "Application", "Other",
            "s", "Certificate-based login", "PKI",
            "k", "Chatter Communities External User", "Other",
            "n", "Chatter Communities External User Third Party SSO", "Other",
            "r", "Employee Login to Community", "Other",
            "z", "Lightning Login", "Username & Password",
            "l", "Networks Portal API Only", "Other",
            "6", "Remote Access Client", "Other",
            "i", "Remote Access 2.0", "Other",
            "I", "Other Apex API", "Other",
            "R", "Partner Product", "Other",
            "w", "Passwordless Login", "Passwordless",
            "3", "Customer Service Portal", "Other",
            "q", "Partner Portal Third-Party SSO", "Other",
            "9", "Partner Portal", "Other",
            "5", "SAML Idp Initiated SSO", "Other",
            "m", "SAML Chatter Communities External User SSO", "Other",
            "b", "SAML Customer Service Portal SSO", "Other",
            "c", "SAML Partner Portal SSO", "Other",
            "h", "SAML Site SSO", "Other",
            "8", "SAML Sfdc Initiated SSO", "Other",
            "E", "SelfService", "Other",
            "j", "Third Party SSO", "Other"
        ];
        let LogonProtocolLookup = datatable(
            LoginSubType: string,
            LogonProtocolOriginal: string,
            LogonProtocol: string
        )[
            "uiup", "UI Username-Password", "Basic Auth",
            "oauthpassword", "OAuth Username-Password", "OAuth",
            "oauthtoken", "OAuth User-Agent", "OAuth",
            "oauthhybridtoken", "OAuth User-Agent for Hybrid Apps", "OAuth",
            "oauthtokenidtoken", "OAuth User-Agent with ID Token", "OAuth",
            "oauthclientcredential", "OAuth Client Credential", "OAuth",
            "oauthcode", "OAuth Web Server", "OAuth",
            "oauthhybridauthcode", "OAuth Web Server for Hybrid Apps", "OAuth",
        ];
        let TempEventResultLookup = datatable(RequestStatus: string, TempEventResult: string)[
            "S", "Success",
            "F", "Failure",
            "A", "Failure",
            "R", "Success",
            "N", "Failure",
            "U", "NA"
        ];
        let UserTypeLookup = datatable(UserType: string, TargetUserType: string)[
            "CsnOnly", "Other",
            "CspLitePortal", "Other",
            "CustomerSuccess", "Other",
            "Guest", "Anonymous",
            "PowerCustomerSuccess", "Other",
            "PowerPartner", "Other",
            "SelfService", "Other",
            "Standard", "Regular",
            "A", "Application",
            "b", "Other",
            "C", "Other",
            "D", "Other",
            "F", "Other",
            "G", "Anonymous",
            "L", "Other",
            "N", "Service",
            "n", "Other",
            "O", "Other",
            "o", "Other",
            "P", "Other",
            "p", "Other",
            "S", "Regular",
            "X", "Admin"
        ];
        union isfuzzy=true
            (
                SalesforceServiceCloudV3_CL
                | where EventType in~ (SalesforceEventType)
                // remove schema-duplicated, unused fields
                | project-away DvcAction, EventResult
            ),
            (
                SalesforceServiceCloudV2_CL
                | where EventType in~ (SalesforceEventType)
                // remove schema-duplicated, unused fields
                | project-away DvcAction, EventResult
                // stub fields that are missing in some versions of the v2 table
                | extend
                    LoginType = column_ifexists("LoginType", "")
                    , LoginSubType = column_ifexists("LoginSubType", "")
                    , UserName = column_ifexists("UserName", "")
                    , DelegatedUserName = column_ifexists("DelegatedUserName", "")
                    , DelegatedUserId = column_ifexists("DelegatedUserId", "")
            ),
            (
                SalesforceServiceCloud_CL
                | where event_type_s in~ (SalesforceEventType)
                | project-rename
                    Timestamp = timestamp_s
                    , EventType = event_type_s
                    , BrowserType = browser_type_s
                    , SourceIp = source_ip_s
                    , ClientIp = client_ip_s
                    , Uri = uri_s
                    , UserType = user_type_s
                    , UserIdDerived = user_id_derived_s
                    , UserId = user_id_s
                    , UserEmail = user_email_s
                    , TlsProtocol = tls_protocol_s
                    , TimestampDerived = timestamp_derived_t
                    , RunTime = run_time_s
                    , RequestStatus = request_status_s
                    , RequestId = request_id_s
                    , OrganizationId = organization_id_s
                    , LoginStatus = login_status_s
                    , LoginKey = login_key_s
                    , DbTotalTime = db_total_time_s
                    , CpuTime = cpu_time_s
                    , CipherSuite = cipher_suite_s
                    , ApiVersion = api_version_s
                    , LoginType = login_type_s
                    , LoginSubType = login_sub_type_s
                    , SessionKey = session_key_s
                    , DelegatedUserName = delegated_user_name_s
                    , DelegatedUserId = delegated_user_id_s
                    , PlatformType = platform_type_s
                | extend TimeGenerated = todatetime(tostring(split(Timestamp, '.', 0)[0]))
            )
        | where not(disabled)
        | lookup LogonMethodLookup on LoginType
        | lookup LogonProtocolLookup on LoginSubType
        | lookup DvcOsLookup on PlatformType
        | lookup EventResultLookup on LoginStatus
        | lookup TempEventResultLookup on RequestStatus
        | lookup UserTypeLookup on UserType
        | project-rename
            EventProductVersion = ApiVersion,
            EventOriginalResultDetails = LoginStatus,
            TargetUserId = UserId,
            EventOriginalUid = RequestId,
            TlsCipher = CipherSuite,
            TlsVersion = TlsProtocol,
            TargetUserScopeId = OrganizationId,
            TargetUrl = Uri,
            TargetOriginalUserType = UserType,
            ActorUsername = DelegatedUserName,
            ActorUserId = DelegatedUserId
        | extend
            EventVendor = 'Salesforce',
            EventProduct = 'Service Cloud',
            EventCount = int(1),
            EventSchema = 'Authentication',
            EventSchemaVersion = '0.1.4',
            TargetAppName = "Salesforce Dot Com(SFDC)",
            TargetAppType = "SaaS application",
            EventUid = _ItemId,
            EventOriginalType = EventType,
            SrcIpAddr = coalesce(column_ifexists("SrcIpAddr", ""), SourceIp, ClientIp),
            TargetUsername = coalesce(UserEmail, UserName),
            HttpUserAgent = coalesce(BrowserType, column_ifexists("HttpUserAgent", ""))
        | extend
            EventType = case(
                EventType == "Login", "Logon",
                EventType == "LoginAs", "Logon",
                EventType == "Logout", "Logoff",
                ""
            ),
            TargetSessionId = coalesce(SessionKey, LoginKey),
            TargetUserScope = "Salesforce Organization",
            TargetUserIdType = iff(isnotempty(TargetUserId), "SalesforceId", ""),
            ActorUserIdType = iff(isnotempty(ActorUserId), "SalesforceId", ""),
            TargetUsernameType = iff(isnotempty(TargetUsername), "UPN", ""),
            ActorUsernameType = iff(isnotempty(ActorUsername), "UPN", ""),
            User = coalesce(TargetUsername, TargetUserId),
            Src = SrcIpAddr,
            IpAddr = SrcIpAddr,
            Dvc = EventProduct,
            EventResult = coalesce(EventResult, TempEventResult),
            Application = TargetAppName,
            EventStartTime = TimeGenerated,
            EventEndTime = TimeGenerated
        | extend ParsedHttpUserAgent = parse_user_agent(HttpUserAgent, "os").OperatingSystem
        | extend
            DvcOs = coalesce(tostring(ParsedHttpUserAgent.OperatingSystem.Family), column_ifexists("DvcOs", ""))
            , DvcOsVersion = coalesce(tostring(ParsedHttpUserAgent.OperatingSystem.MajorVersion), column_ifexists("DvcOsVersion", ""))
            , AdditionalFields = iif(
                pack, bag_pack(
                    "SessionType", column_ifexists("SessionType", ""),
                    "SessionLevel", column_ifexists("SessionLevel", ""),
                    "SessionKey", column_ifexists("SessionKey", ""),
                    "LoginKey", column_ifexists("LoginKey", ""),
                    "TlsVersion", column_ifexists("TlsVersion", ""),
                    "TlsCipher", column_ifexists("TlsCipher", "")
                ),
                dynamic(null)
            )
        | project
            EventProduct
            , EventProductVersion
            , EventVendor
            , EventCount
            //, EventReportUrl
            , EventSchemaVersion
            , EventSchema
            , TimeGenerated
            , EventOriginalUid
            , EventOriginalType
            //, EventOriginalSubType
            //, EventMessage
            , EventResult
            , EventResultDetails
            , EventOriginalResultDetails
            , EventStartTime
            , EventEndTime
            , EventType
            //, EventSubType
            , EventUid
            , EventSeverity
            //, EventOriginalSeverity
            //, EventOwner
            //, ActorSessionId
            , TargetSessionId
            , ActorUserId
            , ActorUsername
            //, ActorUserType
            , ActorUserIdType
            , ActorUsernameType
            //, ActorScopeId
            //, ActorOriginalUserType
            , TargetUserId
            , TargetUsername
            , TargetUserType
            //, SrcDvcId
            //, SrcDvcIdType
            //, SrcDeviceType
            //, SrcDvcOs
            , HttpUserAgent
            //, SrcIsp
            //, SrcGeoCity
            //, SrcGeoCountry
            //, SrcGeoRegion
            //, SrcGeoLatitude
            //, SrcGeoLongitude
            , SrcIpAddr
            //, SrcPortNumber
            //, SrcHostname
            //, SrcDomain
            //, SrcDomainType
            //, SrcFQDN
            //, SrcDescription
            //, SrcDvcScopeId
            //, SrcRiskLevel
            //, SrcOriginalRiskLevel
            //, ActingAppId
            //, ActingAppName
            //, ActingAppType
            //, ActingOriginalAppType
            //, TargetAppId
            , TargetAppName
            , TargetAppType
            //, TargetOriginalAppType
            //, TargetDvcId
            //, TargetDvcIdType
            //, TargetHostname
            //, TargetDomain
            //, TargetDomainType
            //, TargetFQDN
            //, TargetDescription
            //, TargetDeviceType
            //, TargetIpAddr
            //, TargetDvcOs
            , TargetUrl
            //, TargetPortNumber
            //, TargetDvcScope
            //, TargetDvcScopeId
            //, TargetGeoCity
            //, TargetGeoCountry
            //, TargetGeoRegion
            //, TargetGeoLatitude
            //, TargetGeoLongitude
            , LogonMethod
            , LogonProtocol
            , TargetUserIdType
            , TargetUsernameType
            //, UserScope
            //, UserScopeId
            , TargetOriginalUserType
            //, TargetUserSessionId
            , User
            , IpAddr
            //, SrcDvcHostnameType
            //, LogonTarget
            , Dvc
            //, DvcId
            //, DvcIpAddr
            //, DvcHostname
            //, DvcDomain
            //, DvcDomainType
            //, DvcFQDN
            //, DvcDescription
            //, DvcIdType
            //, DvcMacAddr
            //, DvcZone
            , DvcOs
            , DvcOsVersion
            , DvcAction
            //, DvcOriginalAction
            //, DvcScope
            //, DvcScopeOd
            , AdditionalFields
            , Type
            , Src
            //, Dst
            //, Rule
            //, RuleName
            //, RuleNumber
            //, ThreatId
            //, ThreatName
            //, ThreatCategory
            //, ThreatOriginalRiskLevel
            //, ThreatOriginalConfidence
            //, ThreatIsActive
            //, ThreatField
            //, ThreatConfidence
            //, ThreatRiskLevel
            //, ThreatFirstReportedTime
            //, ThreatLastReportedTime
            , Application
    };
    parser(disabled=disabled, pack=pack)