Parser:
  Title: Authentication ASIM parser for OktaSystemLogs
  Version: '0.1.0'
  LastUpdated: Mar 11, 2026
Product:
  Name: Okta
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
  - Title: ASIM Authentication Schema
    Link: https://aka.ms/ASimAuthenticationDoc
  - Title: ASIM
    Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Okta sign in logs, stored in OktaSystemLogs table, to the ASIM Authentication schema. 
ParserName: ASimAuthenticationOktaSystemLogs
EquivalentBuiltInParser: _ASim_Authentication_OktaSystemLogs
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let OktaSignInEvents= dynamic(["user.session.start", "user.session.end"]);
  let OutcomeReasonLookup = datatable(EventOriginalResultDetails: string, EventResultDetails: string)[
    "LOCKED_OUT", "User locked",
    "INVALID_CREDENTIALS", "Incorrect password",
    "UNKNOWN_USER", "No such user",
    "VERIFICATION_ERROR", "Incorrect key",
    "SSO_AUTHENTICATION_FAILURE", "Logon violates policy",
    "PASSWORD_EXPIRED", "Password expired",
    "USER_ACCOUNT_EXPIRED", "Account expired",
    "DEL_AUTH_TIMEOUT", "Session expired",
    "PASSWORD_BASED_LOGIN_DISALLOWED", "Logon violates policy"
  ];
  let SrcDeviceTypeLookup = datatable(OriginalClientDevice: string, SrcDeviceTypeMapped: string)
  [
    "Computer", "Computer",
    "Mobile", "Mobile Device",
    "Tablet", "Mobile Device"
  ];
  let parser = (disabled: bool) {
    OktaSystemLogs
    | where EventOriginalType in (OktaSignInEvents)
    | extend
      Type = "OktaSystemLogs",
      EventVendor = "Okta",
      EventProduct = "Okta",
      EventSchema = "Authentication",
      EventSchemaVersion = "0.1.3",
      EventCount = int(1),
      EventStartTime = TimeGenerated,
      EventEndTime = TimeGenerated
    | lookup OutcomeReasonLookup on EventOriginalResultDetails
    | extend EventResultDetails = iff(EventResult == "Failure", coalesce(EventResultDetails, "Other"), "")
    | lookup SrcDeviceTypeLookup on OriginalClientDevice
    | extend
      EventType = iff(EventOriginalType hassuffix 'start', "Logon", "Logoff"),
      ActingAppName,
      ActingAppType,
      TargetSessionId = ActorSessionId,
      TargetUserId = ActorUserId,
      TargetUserIdType = ActorUserIdType,
      ActorUsername = coalesce(ActorUsername, OriginalActorAlternateId),
      ActorUsernameType,
      TargetUsername = ActorUsername,
      TargetUsernameType = ActorUsernameType,
      TargetUserType = ActorUserType,
      EventResult,
      EventSeverity,
      HttpUserAgent,
      DvcAction,
      EventMessage,
      EventOriginalResultDetails,
      EventOriginalType,
      EventOriginalUid,
      LogonMethod,
      EventOriginalSeverity = OriginalSeverity,
      ActorOriginalUserType = OriginalUserType,
      SrcIsp,
      SrcIpAddr,
      SrcGeoRegion,
      SrcGeoLongitude = toreal(SrcGeoLongtitude),
      SrcGeoLatitude = toreal(SrcGeoLatitude),
      SrcGeoCountry,
      SrcGeoCity,
      SrcDvcOs,
      SrcDvcId,
      SrcDvcIdType,
      SrcDeviceType = SrcDeviceTypeMapped
    // Aliases
    | extend
      User = TargetUsername,
      Dvc = EventVendor,
      IpAddr = SrcIpAddr,
      Src = SrcIpAddr
    | project
      TimeGenerated,
      Type,
      EventVendor,
      EventProduct,
      EventSchema,
      EventSchemaVersion,
      EventCount,
      EventStartTime,
      EventEndTime,
      EventResultDetails,
      EventType,
      ActingAppName,
      ActingAppType,
      TargetSessionId,
      TargetUserId,
      TargetUserIdType,
      ActorUsername,
      ActorUsernameType,
      TargetUsername,
      TargetUsernameType,
      TargetUserType,
      EventResult,
      EventSeverity,
      HttpUserAgent,
      DvcAction,
      EventMessage,
      EventOriginalResultDetails,
      EventOriginalType,
      EventOriginalUid,
      LogonMethod,
      EventOriginalSeverity,
      ActorOriginalUserType,
      SrcIsp,
      SrcIpAddr,
      SrcGeoRegion,
      SrcGeoLongitude,
      SrcGeoLatitude,
      SrcGeoCountry,
      SrcGeoCity,
      SrcDvcOs,
      SrcDvcId,
      SrcDvcIdType,
      SrcDeviceType,
      User,
      Dvc,
      IpAddr
  };
  parser(disabled = disabled)