Parser:
  Title: Authentication ASIM parser for OktaV2
  Version: '0.4.0'
  LastUpdated: Jan 07, 2026
Product:
  Name: Okta
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
  - Title: ASIM Authentication Schema
    Link: https://aka.ms/ASimAuthenticationDoc
  - Title: ASIM
    Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Okta sign in logs, stored in OktaV2_CL table, to the ASIM Authentication schema. 
ParserName: ASimAuthenticationOktaV2
EquivalentBuiltInParser: _ASim_Authentication_OktaV2
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let parser=(disabled: bool=false) {
    let OktaSuccessfulOutcome = dynamic(['SUCCESS', 'ALLOW']);
    let OktaFailedOutcome = dynamic(['FAILURE', 'SKIPPED', 'DENY']);
    let OktaSigninEvents=dynamic(['user.session.start', 'user.session.end']);
    let SrcDeviceTypeLookup = datatable(OriginalClientDevice: string, SrcDeviceType: string)
    [
        "Computer", "Computer",
        "Mobile", "Mobile Device",
        "Tablet", "Mobile Device"
    ];
    let OutcomeReasonLookup = datatable(EventOriginalResultDetails: string, EventResultDetails: string)
    [
        "LOCKED_OUT", "User locked",
        "INVALID_CREDENTIALS", "Incorrect password",
        "UNKNOWN_USER", "No such user",
        "VERIFICATION_ERROR", "Incorrect key",
        "SSO_AUTHENTICATION_FAILURE", "Logon violates policy",
        "PASSWORD_EXPIRED", "Password expired",
        "USER_ACCOUNT_EXPIRED", "Account expired",
        "DEL_AUTH_TIMEOUT", "Session expired",
        "PASSWORD_BASED_LOGIN_DISALLOWED", "Logon violates policy"
    ];
    let emptyOctaV2Table = datatable(
    TimeGenerated: datetime,
    ActorDetailEntry: dynamic,
    ActorDisplayName: string,
    AuthenticationContext: string,
    AuthenticationProvider: string,
    AuthenticationStep: string,
    AuthenticationContextAuthenticationProvider: string,
    AuthenticationContextAuthenticationStep: int,
    AuthenticationContextCredentialProvider: string,
    AuthenticationContextInterface: string,
    AuthenticationContextIssuerId: string,
    AuthenticationContextIssuerType: string,
    DebugData: dynamic,
    DvcAction: string,
    EventResult:string,
    OriginalActorAlternateId: string,
    OriginalClientDevice: string,
    OriginalOutcomeResult: string,
    OriginalSeverity: string,
    OriginalTarget: dynamic,
    OriginalUserId: string,
    OriginalUserType: string,
    Request: dynamic,
    SecurityContextAsNumber: int,
    SecurityContextAsOrg: string,
    SecurityContextDomain: string,
    SecurityContextIsProxy: bool,
    TransactionDetail: dynamic,
    TransactionId: string,
    TransactionType: string
  )[];
      let OktaV2 = union isfuzzy=true emptyOctaV2Table, OktaV2_CL
          | where not(disabled)      
          | extend
              Type = "OktaV2_CL",
              EventOriginalType=column_ifexists('EventOriginalType', "") 
              ,
              OriginalActorAlternateId = column_ifexists('OriginalActorAlternateId', "")
              ,
              ActorUsername=column_ifexists('ActorUsername', "")
              ,
              SrcIpAddr = column_ifexists('SrcIpAddr', "")
          | where EventOriginalType in (OktaSigninEvents)
          | extend ActorUsernameType = _ASIM_GetUsernameType(ActorUsername)
          | extend 
              EventProduct='Okta'
              ,
              EventSchema = 'Authentication'
              ,
              EventVendor='Okta'
              ,
              EventCount=int(1)
              ,
              EventSchemaVersion='0.1.3'
              ,
              EventStartTime=TimeGenerated
              ,
              EventEndTime=TimeGenerated
              ,
              EventType=iff(EventOriginalType hassuffix 'start', 'Logon', 'Logoff')       
              ,
              TargetSessionId=column_ifexists('ActorSessionId', "")
              ,
              TargetUserId= column_ifexists('ActorUserId', "")
              ,
              TargetUsername=column_ifexists('ActorUsername', "")
              ,
              TargetUserType=column_ifexists('ActorUserType', "")
              ,
              TargetUserIdType=column_ifexists('ActorUserIdType', "")
              ,
              TargetUsernameType=column_ifexists('ActorUsernameType', "")
              ,
              SrcIpAddr = column_ifexists('SrcIpAddr', ""),
              EventResult = coalesce(EventResult,
                case (
                    OriginalOutcomeResult in (OktaSuccessfulOutcome), 'Success',
                    OriginalOutcomeResult in (OktaFailedOutcome), 'Failure',
                    'Partial')),
              //** extend non-normalized fields to be projected-away 
              ActorDetailEntry,
              ActorDisplayName,
              AuthenticationContextAuthenticationProvider,
              AuthenticationContextAuthenticationStep,
              AuthenticationContextCredentialProvider,
              AuthenticationContextInterface,
              AuthenticationContextIssuerId,
              AuthenticationContextIssuerType
              ,
              DebugData,
              DvcAction,
              ActorUsername = coalesce(ActorUsername, OriginalActorAlternateId),
              OriginalClientDevice,
              OriginalOutcomeResult,
              OriginalSeverity,
              OriginalTarget,
              ActorUserIdType = "OktaId",
              ActorUserId = OriginalUserId,
              Request,
              SecurityContextAsNumber,
              SecurityContextAsOrg,
              SecurityContextDomain,
              SecurityContextIsProxy
              ,
              TransactionDetail,
              TransactionId,
              TransactionType,
              SrcGeoPostalCode,
              SrcGeoRegion,
              SrcGeoCity,
              SrcGeoCountry
          | extend TargetUserType = case(
            TargetUserType == "System Principal", "System",
            TargetUserType
          )
          | extend ActorUserType = TargetUserType
          | extend ActorUsernameType = _ASIM_GetUsernameType(ActorUsername)
          | lookup OutcomeReasonLookup on EventOriginalResultDetails
          | extend EventResultDetails = iif(OriginalOutcomeResult in (OktaFailedOutcome), coalesce(EventResultDetails, "Other"), "")
          | lookup SrcDeviceTypeLookup on OriginalClientDevice
          | extend SrcDeviceType = coalesce(SrcDeviceType, "Other")
          // ** Aliases
          | extend 
              User=TargetUsername
              ,
              Dvc=EventVendor
              ,
              IpAddr=SrcIpAddr
          | project-away
              ActorDetailEntry,
              ActorDisplayName,
              AuthenticationContextAuthenticationProvider,
              AuthenticationContextAuthenticationStep,
              AuthenticationContextCredentialProvider,
              AuthenticationContextInterface,
              AuthenticationContextIssuerId,
              AuthenticationContextIssuerType,
              DebugData,
              DvcAction,
              OriginalActorAlternateId,
              OriginalClientDevice,
              OriginalOutcomeResult,
              OriginalSeverity,
              OriginalTarget,
              OriginalUserId,
              OriginalUserType,
              Request,
              SecurityContextAsNumber,
              SecurityContextAsOrg,
              SecurityContextDomain,
              SecurityContextIsProxy,
              TransactionId,
              TransactionType;
      OktaV2
  };
  parser(disabled = disabled)