Parser:
  Title: Authentication ASIM parser for Microsoft AAD SignInLogs
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Microsoft AAD (SigninLogs)
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/ASimAuthenticationDoc
Description: |
  This ASIM parser supports normalizing Microsoft AAD sig in logs, produced by the Microsoft AAD connector, to the ASIM Authentication normalized schema.
ParserName: ASimAuthenticationSigninLogs
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let AADSigninLogs=(disabled:bool=false){
  SigninLogs | where not(disabled)
  | extend
    EventVendor = 'Microsoft'
    , EventProduct = 'AAD'
    , EventCount=int(1)
    , EventSchemaVersion='0.1.0'
    , EventResult = iff (ResultType ==0, 'Success', 'Failure')
    , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)
    , EventStartTime = TimeGenerated
    , EventEndTime= TimeGenerated
    , EventType= 'Logon'
    , SrcDvcId=tostring(DeviceDetail.deviceId)
    , SrcDvcHostname =tostring(DeviceDetail.displayName)
    , SrcDvcOs=tostring(DeviceDetail.operatingSystem)
    // , SrcBrowser= tostring(DeviceDetail.browser)
    , Location = todynamic(LocationDetails)
    , TargetUsernameType='Upn'
    , TargetUserIdType='AADID'
    , SrcDvcIpAddr=IPAddress
  | extend
        SrcGeoCity=tostring(Location.city)
        , SrcGeoCountry=tostring(Location.countryOrRegion)
        , SrcGeoLatitude=toreal(Location.geoCoordinates.latitude)
        , SrcGeoLongitude=toreal(Location.geoCoordinates.longitude)
   | lookup AADSTSErrorCodes on ResultType
   | project-rename
       EventOriginalUid =Id
       , LogonMethod  = AuthenticationRequirement
       , HttpUserAgent=UserAgent
       , TargetSessionId=CorrelationId
       , TargetUserId = UserId
       , TargetUsername=UserPrincipalName
       , TargetUserType=UserType
       , TargetAppId = ResourceIdentity
       , TargetAppName=ResourceDisplayName
   | project-reorder
       TimeGenerated
       ,EventProduct
       , EventOriginalUid
       , EventResult
       , EventOriginalResultDetails
       , EventStartTime
       , EventEndTime
       , LogonMethod 
       , TargetSessionId
       , TargetUserId
       , TargetUsername
       , SrcDvcId
       , SrcDvcHostname 
       , SrcDvcOs
       , HttpUserAgent 
       , SrcGeoCity
       , SrcGeoCountry
       , TargetAppId
       , TargetAppName
       , SrcDvcIpAddr
       // ** Aliases
        | extend 
          User=TargetUsername
        , LogonTarget=TargetAppName
        , Dvc=EventVendor};
       AADSigninLogs(disabled)
