Parser:
  Title: Authentication ASIM parser for OktaV2
  Version: '0.4.0'
  LastUpdated: Jan 08, 2026
Product:
  Name: Okta
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
  - Title: ASIM Authentication Schema
    Link: https://aka.ms/ASimAuthenticationDoc
  - Title: ASIM
    Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Okta sign in logs, stored in OktaV2_CL table, to the ASIM Authentication schema. 
ParserName: ASimAuthenticationOktaV2
EquivalentBuiltInParser: _ASim_Authentication_OktaV2
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let parser=(disabled: bool=false) {
    let OktaSuccessfulOutcome = dynamic(['SUCCESS', 'ALLOW']);
    let OktaFailedOutcome = dynamic(['FAILURE', 'SKIPPED', 'DENY']);
    let OktaSigninEvents=dynamic(['user.session.start', 'user.session.end']);
    let SrcDeviceTypeLookup = datatable(OriginalClientDevice: string, SrcDeviceType: string)
    [
        "Computer", "Computer",
        "Mobile", "Mobile Device",
        "Tablet", "Mobile Device"
    ];
    let OutcomeReasonLookup = datatable(EventOriginalResultDetails: string, EventResultDetails: string)
    [
        "LOCKED_OUT", "User locked",
        "INVALID_CREDENTIALS", "Incorrect password",
        "UNKNOWN_USER", "No such user",
        "VERIFICATION_ERROR", "Incorrect key",
        "SSO_AUTHENTICATION_FAILURE", "Logon violates policy",
        "PASSWORD_EXPIRED", "Password expired",
        "USER_ACCOUNT_EXPIRED", "Account expired",
        "DEL_AUTH_TIMEOUT", "Session expired",
        "PASSWORD_BASED_LOGIN_DISALLOWED", "Logon violates policy"
    ];
    OktaV2_CL
    | where not(disabled)
    | where EventOriginalType in (OktaSigninEvents)
    | lookup OutcomeReasonLookup on EventOriginalResultDetails
    | extend EventResultDetails = iif(OriginalOutcomeResult in (OktaFailedOutcome), coalesce(EventResultDetails, "Other"), "")
    | lookup SrcDeviceTypeLookup on OriginalClientDevice
    | extend SrcDeviceType = coalesce(SrcDeviceType, "Other")
    | extend
        Type = "OktaV2_CL",
        EventProduct = "Okta",
        EventSchema = "Authentication",
        EventVendor = "Okta",
        EventCount = int(1),
        EventSchemaVersion='0.1.3',
        EventStartTime = TimeGenerated,
        EventEndTime = TimeGenerated,
        EventType=iff(EventOriginalType hassuffix 'start', 'Logon', 'Logoff'),
        ActorUsername = coalesce(ActorUsername, OriginalActorAlternateId),
        ActorUserIdType = "OktaId",
        EventResult = coalesce(EventResult,
            case (
                OriginalOutcomeResult in (OktaSuccessfulOutcome), 'Success',
                OriginalOutcomeResult in (OktaFailedOutcome), 'Failure',
                'Partial')),
        SrcIpAddr,
        ActorSessionId,
        ActorUserId,
        SrcGeoRegion,
        SrcGeoCity,
        SrcGeoCountry,
        SrcDvcOs,
        SrcDvcId,
        SrcDvcIdType,
        DvcAction,
        EventOriginalUid
    | project-rename
        TargetSessionId = ActorSessionId,
        TargetUserId = ActorUserId,
        TargetUsername = ActorUsername,
        TargetUserType = ActorUserType,
        TargetUserIdType = ActorUserIdType
    | extend TargetUserType = case(
        TargetUserType == "System Principal", "System",
        TargetUserType
        )
    | extend
        ActorUserType = TargetUserType,
        TargetUsernameType = _ASIM_GetUsernameType(TargetUsername),
        ActorUsernameType = _ASIM_GetUsernameType(ActorUsername)
    // ** Aliases
    | extend 
        User=TargetUsername,
        Dvc=EventVendor,
        IpAddr=SrcIpAddr
    | project
        TimeGenerated,
        EventOriginalType,
        EventOriginalResultDetails,
        EventOriginalUid,
        EventResultDetails,
        SrcDeviceType,
        Type,
        EventProduct,
        EventSchema,
        EventVendor,
        EventCount,
        EventSchemaVersion,
        EventStartTime,
        EventEndTime,
        EventType,
        TargetSessionId,
        TargetUserId,
        TargetUsername,
        TargetUserType,
        TargetUserIdType,
        SrcIpAddr,
        ActorSessionId,
        ActorUserId,
        ActorUsername,
        ActorUserType,
        ActorUserIdType,
        EventResult,
        SrcGeoRegion,
        SrcGeoCity,
        SrcGeoCountry,
        SrcDvcOs,
        SrcDvcId,
        SrcDvcIdType,
        DvcAction,
        TargetUsernameType,
        ActorUsernameType,
        User,
        Dvc,
        IpAddr
  };
  parser(disabled = disabled)