Parser:
  Title: Authentication ASIM parser for AAD non-interactive sign-in logs
  Version: '0.1'
  LastUpdated: Feb 19 2023
Product:
  Name: AAD
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/ASimAuthenticationDoc
Description: |
    This ASIM parser supports normalizing Azure Active Directory Non Interactive sign in logs, stored in the AADNonInteractiveUserSignInLogs table, to the ASIM Authentication schema.
ParserName: ASimAuthenticationAADNonInteractiveUserSignInLogs
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let AADNIAuthentication=(disabled:bool=false){
    AADNonInteractiveUserSignInLogs | where not(disabled)
    | extend
        EventVendor = 'Microsoft'
        , EventProduct = 'AAD'
        , EventSchemaVersion='0.1.0'
        , EventCount=int(1)
        , EventResult = iff (ResultType ==0, 'Success', 'Failure')
        , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)
        , EventStartTime = TimeGenerated
        , EventEndTime= TimeGenerated
        , EventType= 'Logon'
        , SrcDvcId=tostring(todynamic(DeviceDetail).deviceId)
        , SrcDvcHostname =tostring(todynamic(DeviceDetail).displayName)
        , SrcDvcOs=tostring(todynamic(DeviceDetail).operatingSystem)
        , Location = todynamic(LocationDetails)
        , TargetAppId = ResourceIdentity 
        , TargetUserType='NonInteractive'
        , TargetUsernameType='UPN'
        , TargetUserIdType='AADID'
        , TargetAppName=ResourceDisplayName
    | extend
        SrcGeoCity=tostring(Location.city)
        , SrcGeoCountry=tostring(Location.countryOrRegion)
        , SrcGeoLatitude=toreal(Location.geoCoordinates.latitude)
        , SrcGeoLongitude=toreal(Location.geoCoordinates.longitude)
    | project-rename
        EventOriginalUid =Id
        , LogonMethod = AuthenticationRequirement
        , HttpUserAgent=UserAgent
        , TargetSessionId=CorrelationId
        , TargetUserId = UserId
        , TargetUsername=UserPrincipalName
        , SrcDvcIpAddr=IPAddress
        | lookup ASIM_AADSTSErrorCodes on ResultType
    // -- Aliases
    | extend 
          User=TargetUsername
        , LogonTarget=ResourceIdentity
        , Dvc=EventVendor
    // -- Entity identifier explicit aliases
        , TargetUserUpn = ActorUsername
        , TargetUserAadId = TargetUserId
  };
  AADNIAuthentication(disabled)