Parser:
  Title: ASIM Authentication filtering parser for VMware vCenter
  Version: '0.1.0'
  LastUpdated: Mar 26, 2026
Product:
  Name: VMware vCenter
Normalization:
  Schema: Authentication
  Version: '0.1.4'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
- Title: VMware vCenter documentation
  Link: 
    https://www.vmware.com/products/cloud-infrastructure/vcenter/future-overview#overview
Description: |
  This ASIM filtering parser supports normalizing VMware vCenter logs to the ASIM Authentication normalized schema.
ParserName: vimAuthenticationVMwareVCenter
EquivalentBuiltInParser: _Im_Authentication_VMwareVCenter
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
  - Name: pack
    Type: bool
    Default: false
ParserQuery: |
  let parser = (starttime: datetime=datetime(null), 
    endtime: datetime=datetime(null), 
    username_has_any: dynamic = dynamic([]),
    targetappname_has_any: dynamic = dynamic([]),
    srcipaddr_has_any_prefix: dynamic = dynamic([]),
    srchostname_has_any: dynamic = dynamic([]),
    eventtype_in: dynamic = dynamic([]),
    eventresultdetails_in: dynamic = dynamic([]),
    eventresult: string = '*',
    disabled: bool=false,
    pack:bool = false) {
    let EventSeverityLookup = datatable (EventOriginalSeverity: string, EventSeverity: string) [
        "info", "Informational"
    ];
    let EventTypeLookup = datatable (EventOriginalType: string, EventType: string) [
        "vim.event.UserLoginSessionEvent", "Logon",
        "vim.event.UserLogoutSessionEvent", "LogOff"
    ];
    let LoginEvents = (T: (Message: string)) {
        T
        | where Message has "UserLoginSessionEvent"
        | parse Message with * "Event [" EventOriginalUid:string "] [1-1] [" EventTime:datetime "] [" EventOriginalType:string "] [" EventOriginalSeverity:string "]" * "[User " ActorUsername:string "@" SrcIpAddr:string " logged in as " HttpUserAgent:string "]" *;
    };
    let LogoutEvents = (T: (Message: string)) {
        T
        | where Message has "UserLogoutSessionEvent"
        | parse Message with * "Event [" EventOriginalUid: string "] [1-1] [" EventTime: datetime "] [" EventOriginalType: string "] [" EventOriginalSeverity:string "]" * "[User " ActorUsername:string "@" SrcIpAddr " logged out (login time:" LoginTime: string ", number of API invocations: " APIInvocationCount: string ", user agent:" HttpUserAgent: string ")]" *;
    };
    let vCenterLogs = vcenter_CLv2
    | where not(disabled)
        and (isnull(starttime) or TimeGenerated >= starttime) 
        and (isnull(endtime) or TimeGenerated <= endtime)
        and ((array_length(username_has_any) == 0) or Message has_any (username_has_any))
        and (array_length(targetappname_has_any) == 0) // TargetAppName not available in source
        and (array_length(srchostname_has_any) == 0) // SrcHostName not availabine in source
        and (array_length(eventresultdetails_in) == 0) // EventResultDetails not available in source
        and (eventresult == "*" or (eventresult == "Success")); // SrcIpAddr not available in source 
    union
        LoginEvents(vCenterLogs), LogoutEvents(vCenterLogs)
        | where ((array_length(srcipaddr_has_any_prefix) == 0) or has_any_ipv4_prefix(SrcIpAddr, srcipaddr_has_any_prefix))
        | extend
            EventVendor = "VMware",
            EventProduct = "vCenter",
            EventSchema = "Authentication",
            EventSchemaVersion = "0.1.4",
            Type = "vcenter_CL",
            EventStartTime = EventTime,
            EventEndTime = EventTime,
            EventCount = coalesce(toint(APIInvocationCount), int(1)),
            ActorUsernameType = "Simple",
            EventResult = "Success"
        | lookup EventTypeLookup on EventOriginalType
        | where (array_length(eventtype_in) == 0) or EventType in~ (eventtype_in)
        | lookup EventSeverityLookup on EventOriginalSeverity
        | project-rename
            EventOriginalResultDetails = Message
        | extend
            AdditionalFields = iff(pack, bag_pack("LoginTime", LoginTime), dynamic([])),
            IpAddr = SrcIpAddr,
            Dvc = EventProduct
        | project
            TimeGenerated,
            Type,
            EventVendor,
            EventProduct,
            EventSchema,
            EventSchemaVersion,
            EventStartTime,
            EventEndTime,
            EventCount,
            ActorUsernameType,
            EventResult,
            EventOriginalType,
            EventType,
            EventOriginalSeverity,
            EventOriginalResultDetails,
            EventOriginalUid,
            ActorUsername,
            SrcIpAddr,
            HttpUserAgent,
            AdditionalFields,
            IpAddr,
            Dvc;
  };
  parser(
      starttime=starttime,
      endtime=endtime,
      username_has_any=username_has_any,
      targetappname_has_any=targetappname_has_any,
      srcipaddr_has_any_prefix=srcipaddr_has_any_prefix,
      srchostname_has_any=srchostname_has_any,
      eventtype_in=eventtype_in,
      eventresultdetails_in=eventresultdetails_in,
      eventresult=eventresult,
      disabled=disabled,
      pack=pack
  )
