Parser:
  Title: ASIM Authentication parser for Barracuda WAF
  Version: '0.1'
  LastUpdated: Jun 13 2023
Product:
  Name: Barracuda WAF
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
- Title: Logs type Description in Barracuda WAF
  Link: https://campus.barracuda.com/product/webapplicationfirewall/doc/78810008/types-of-logs/
Description: |
  This ASIM parser supports normalizing the Barracuda WAF logs to the ASIM authentication normalized schema.
ParserName: vimAuthenticationBarracudaWAF
EquivalentBuiltInParser: _Im_Authentication_BarracudaWAF
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: targetusername_has
    Type: string
    Default: '*'
ParserQuery: |
  let barracudaSchema = datatable(
      LogType_s: string,
      UnitName_s: string,
      EventName_s: string,
      DeviceReceiptTime_s: string,
      HostIP_s: string,
      host_s: string,
      LoginIP_s: string,
      Severity_s: string,
      LoginPort_d: real,
      AdminName_s: string,
      EventMessage_s: string,
      TimeTaken_d: real,
      TenantId: string,
      Message: string,
      SourceSystem: string,
      _ResourceId: string,
      RawData: string,
      Computer: string,
      MG: string,
      ManagementGroupName: string,
      SourceIP: string,
      TimeGenerated: datetime
  )[];
  let SeverityLookup = datatable (severity: int, EventSeverity: string)
      [
      0, "High", 
      1, "High", 
      2, "High", 
      3, "Medium",
      4, "Low",
      5, "Low", 
      6, "Informational",
      7, "Informational" 
  ];
  let EventTypeLookup = datatable (
      EventName_s: string,
      EventType_lookup: string,
      EventResult: string
  )
      [
      "LOGIN", "Logon", "Success",
      "UNSUCCESSFUL_LOGIN", "Logoff", "Failure",
      "LOGOUT", "Logoff", "Success"
  ];
  let EventResultDetailsLookup = datatable (
      Reason: string,
      EventResultDetails: string
  )
      [
      "Invalid Username/Password", "Incorrect password",
      "Account Lockout", "User locked",
      "Expired or Disabled Accounts", "User disabled",
      "IP Blocking", "Logon violates policy",
      "Session Timeouts", "Session expired",
      "CAPTCHA Verification", "Other"
  ];
  let parser = (
        starttime: datetime = datetime(null),
        endtime: datetime = datetime(null),
        targetusername_has: string = "*",
        disabled: bool = false) { 
    let BarracudaCustom = 
        union isfuzzy=true
            barracudaSchema,
            barracuda_CL
        | where not(disabled)
            and (LogType_s == "AUDIT")
            and (EventName_s in ("LOGIN", "LOGOUT", "UNSUCCESSFUL_LOGIN"))
        | where (isnull(starttime) or TimeGenerated >= starttime)
            and (isnull(endtime) or TimeGenerated <= endtime)
            and (targetusername_has == '*' or (AdminName_s has targetusername_has))
        | parse trim(@'[^\w(")]+', EventMessage_s) with * "Reason=" Reason:string
        | extend Reason = trim(@'(")', Reason)
        | lookup EventResultDetailsLookup on Reason
        | lookup EventTypeLookup on EventName_s
        | extend 
            EventType = EventType_lookup,
            severity = toint(Severity_s)
        | lookup SeverityLookup on severity
        | extend
            Dvc = UnitName_s,
            EventCount = toint(1),
            EventProduct = "WAF",
            EventSchema = "Authentication",
            EventSchemaVersion = "0.1.3",
            EventVendor = "Barracuda"
        | extend
            SrcPortNumber = toint(LoginPort_d),
            DvcIpAddr = HostIP_s,
            SrcIpAddr = LoginIP_s,
            DvcHostname = host_s,
            ActorUsername = AdminName_s,
            EventStartTime = iff(isnotempty(TimeTaken_d), unixtime_milliseconds_todatetime(tolong(DeviceReceiptTime_s)-tolong(TimeTaken_d)), unixtime_milliseconds_todatetime(tolong(DeviceReceiptTime_s)))
        | extend
            ActorUsernameType = iff(isnotempty(ActorUsername), "Simple", ""),
            ActorUserType = iff(isnotempty(ActorUsername), "Admin", ""),
            EventEndTime = EventStartTime
        | extend
            IpAddr = SrcIpAddr,
            Src = SrcIpAddr
        | project-away
            *_s,
            *_d,
            severity,
            EventType_lookup,
            TenantId,
            Message,
            SourceSystem,
            _ResourceId,
            RawData,
            Computer,
            MG,
            ManagementGroupName,
            SourceIP,
            Reason;
    let BarracudaCEF = 
        CommonSecurityLog
        | where not(disabled) and DeviceVendor startswith "Barracuda" and (DeviceProduct == "WAF" or DeviceProduct == "WAAS")
        | where DeviceEventCategory == "AUDIT"
            and (toupper(ProcessName) in ("LOGIN", "LOGOUT", "UNSUCCESSFUL_LOGIN"))
        | where (isnull(starttime) or TimeGenerated >= starttime)
            and (isnull(endtime) or TimeGenerated <= endtime)
            and (targetusername_has == '*' or (DestinationUserName has targetusername_has))
        | parse trim(@'[^\w(")]+', Message) with * "Reason=" Reason:string
        | extend Reason = trim(@'(")', Reason)
        | lookup EventResultDetailsLookup on Reason
        | extend ProcessName = toupper(ProcessName)
        | lookup EventTypeLookup on $left.ProcessName == $right.EventName_s
        | extend 
            EventType = EventType_lookup,
            severity = toint(LogSeverity)
        | lookup SeverityLookup on severity
        | extend
            Dvc = DeviceName,
            EventCount = toint(1),
            EventProduct = "WAF",
            EventSchema = "Authentication",
            EventSchemaVersion = "0.1.3",
            EventVendor = "Barracuda"
        | extend
            SrcPortNumber = toint(SourcePort),
            DvcIpAddr = DeviceAddress,
            SrcIpAddr = SourceIP,
            DvcHostname = DeviceName,
            ActorUsername = DestinationUserName,
            EventStartTime = iff(isnotempty(FlexNumber2), unixtime_milliseconds_todatetime(tolong(ReceiptTime)-tolong(FlexNumber2)), unixtime_milliseconds_todatetime(tolong(ReceiptTime)))
        | extend
            ActorUsernameType = iff(isnotempty(ActorUsername), "Simple", ""),
            ActorUserType = iff(isnotempty(ActorUsername), "Admin", ""), 
            EventEndTime = EventStartTime
        | extend
            IpAddr = SrcIpAddr,
            Src = SrcIpAddr
        | project-away
            ThreatConfidence,
            EventType_lookup,
            CommunicationDirection,
            AdditionalExtensions,
            Device*,
            Source*,
            Destination*,
            Activity,
            LogSeverity,
            ApplicationProtocol,
            ProcessID,
            ExtID,
            Protocol,
            Reason,
            ReceiptTime,
            SimplifiedDeviceAction,
            OriginalLogSeverity,
            ProcessName,
            EndTime,
            ExternalID,
            File*,
            ReceivedBytes,
            Message,
            Old*,
            EventOutcome,
            Request*,
            StartTime,
            Field*,
            Flex*,
            Remote*,
            Malicious*,
            severity,
            ThreatSeverity,
            IndicatorThreatType,
            ThreatDescription,
            _ResourceId,
            SentBytes,
            ReportReferenceLink,
            Computer,
            TenantId;
    union isfuzzy = true 
    BarracudaCustom,
    BarracudaCEF
  };
  parser(
      starttime = starttime,
      endtime = endtime,
      targetusername_has = targetusername_has,
      disabled=disabled
  )