Parser:
  Title: Authentication ASIM filtering parser for OktaSystemLogs
  Version: '0.1.0'
  LastUpdated: Mar 11, 2026
Product:
  Name: Okta
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Okta sign in logs, stored in the OktaSystemLogs table, to the ASIM Authentication schema.
ParserName: vimAuthenticationOktaSystemLogs
EquivalentBuiltInParser: _Im_Authentication_OktaSystemLogs
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: username_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: targetappname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: srchostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: eventtype_in
    Type: dynamic
    Default: dynamic([])
  - Name: eventresultdetails_in
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let OktaSignInEvents= dynamic(["user.session.start", "user.session.end"]);
  let OutcomeReasonLookup = datatable(EventOriginalResultDetails: string, EventResultDetails: string)[
    "LOCKED_OUT", "User locked",
    "INVALID_CREDENTIALS", "Incorrect password",
    "UNKNOWN_USER", "No such user",
    "VERIFICATION_ERROR", "Incorrect key",
    "SSO_AUTHENTICATION_FAILURE", "Logon violates policy",
    "PASSWORD_EXPIRED", "Password expired",
    "USER_ACCOUNT_EXPIRED", "Account expired",
    "DEL_AUTH_TIMEOUT", "Session expired",
    "PASSWORD_BASED_LOGIN_DISALLOWED", "Logon violates policy"
  ];
  let SrcDeviceTypeLookup = datatable(OriginalClientDevice: string, SrcDeviceTypeMapped: string)
  [
    "Computer", "Computer",
    "Mobile", "Mobile Device",
    "Tablet", "Mobile Device"
  ];
  let parser = (
      starttime: datetime=datetime(null), 
      endtime: datetime=datetime(null), 
      username_has_any: dynamic = dynamic([]),
      targetappname_has_any: dynamic = dynamic([]),
      srcipaddr_has_any_prefix: dynamic = dynamic([]),
      srchostname_has_any: dynamic = dynamic([]),
      eventtype_in: dynamic = dynamic([]),
      eventresultdetails_in: dynamic = dynamic([]),
      eventresult: string = '*',
      disabled: bool=false
  ) {
    OktaSystemLogs
    | where not(disabled)
    | where EventOriginalType in (OktaSignInEvents)
    | where 
          (isnull(starttime) or TimeGenerated >= starttime) 
          and (isnull(endtime) or TimeGenerated <= endtime)
          and ((array_length(username_has_any) == 0) or ActorUsername has_any (username_has_any))
          and (array_length(targetappname_has_any) == 0) // TargetAppName not available in source
          and ((array_length(srcipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(SrcIpAddr, srcipaddr_has_any_prefix)))
          and (array_length(srchostname_has_any) == 0) // SrcHostname not available in source
    | extend
      Type = "OktaSystemLogs",
      EventVendor = "Okta",
      EventProduct = "Okta",
      EventSchema = "Authentication",
      EventSchemaVersion = "0.1.3",
      EventCount = int(1),
      EventStartTime = TimeGenerated,
      EventEndTime = TimeGenerated
    | lookup OutcomeReasonLookup on EventOriginalResultDetails
    | extend EventResultDetails = iff(EventResult == "Failure", coalesce(EventResultDetails, "Other"), "")
    | where (array_length(eventresultdetails_in) == 0) or EventResultDetails in~ (eventresultdetails_in)
    | lookup SrcDeviceTypeLookup on OriginalClientDevice
    | extend
      EventType = iff(EventOriginalType hassuffix 'start', "Logon", "Logoff")
    | where (eventresult == "*" or (EventResult == eventresult))
        and ((array_length(eventtype_in) == 0) or EventType in~ (eventtype_in))
    | extend
      ActingAppName,
      ActingAppType,
      TargetSessionId = ActorSessionId,
      TargetUserId = ActorUserId,
      TargetUserIdType = ActorUserIdType,
      ActorUsername = coalesce(ActorUsername, OriginalActorAlternateId),
      ActorUsernameType,
      TargetUsername = ActorUsername,
      TargetUsernameType = ActorUsernameType,
      TargetUserType = ActorUserType,
      EventResult,
      EventSeverity,
      HttpUserAgent,
      DvcAction,
      EventMessage,
      EventOriginalResultDetails,
      EventOriginalType,
      EventOriginalUid,
      LogonMethod,
      EventOriginalSeverity = OriginalSeverity,
      ActorOriginalUserType = OriginalUserType,
      SrcIsp,
      SrcIpAddr,
      SrcGeoRegion,
      SrcGeoLongitude = toreal(SrcGeoLongtitude),
      SrcGeoLatitude = toreal(SrcGeoLatitude),
      SrcGeoCountry,
      SrcGeoCity,
      SrcDvcOs,
      SrcDvcId,
      SrcDvcIdType,
      SrcDeviceType = SrcDeviceTypeMapped
    | extend TargetUserType = case(
      TargetUserType == "System Principal", "System",
      TargetUserType
    )
    // mapping ASimMatchingUsername
    | extend
        temp_isMatchTargetUsername=ActorUsername has_any(username_has_any)
    | extend 
        ASimMatchingUsername = case(
            array_length(username_has_any) == 0, "-",
            temp_isMatchTargetUsername, "TargetUsername",
            "No match"
        )
    // Aliases
    | extend
      User = TargetUsername,
      Dvc = EventVendor,
      IpAddr = SrcIpAddr,
      Src = SrcIpAddr
      | project
      TimeGenerated,
      Type,
      EventVendor,
      EventProduct,
      EventSchema,
      EventSchemaVersion,
      EventCount,
      EventStartTime,
      EventEndTime,
      EventResultDetails,
      EventType,
      ActingAppName,
      ActingAppType,
      TargetSessionId,
      TargetUserId,
      TargetUserIdType,
      ActorUsername,
      ActorUsernameType,
      TargetUsername,
      TargetUsernameType,
      TargetUserType,
      EventResult,
      EventSeverity,
      HttpUserAgent,
      DvcAction,
      EventMessage,
      EventOriginalResultDetails,
      EventOriginalType,
      EventOriginalUid,
      LogonMethod,
      EventOriginalSeverity,
      ActorOriginalUserType,
      SrcIsp,
      SrcIpAddr,
      SrcGeoRegion,
      SrcGeoLongitude,
      SrcGeoLatitude,
      SrcGeoCountry,
      SrcGeoCity,
      SrcDvcOs,
      SrcDvcId,
      SrcDvcIdType,
      SrcDeviceType,
      User,
      Dvc,
      IpAddr,
      ASimMatchingUsername
  };
  parser(
      starttime=starttime,
      endtime=endtime,
      username_has_any=username_has_any,
      targetappname_has_any=targetappname_has_any,
      srcipaddr_has_any_prefix=srcipaddr_has_any_prefix,
      srchostname_has_any=srchostname_has_any,
      eventtype_in=eventtype_in,
      eventresultdetails_in=eventresultdetails_in,
      eventresult=eventresult,
      disabled=disabled
  )
