Parser:
  Title: Authentication ASIM filtering parser for Okta
  Version: '0.4.0'
  LastUpdated: Jan 08, 2026
Product:
  Name: Okta
Normalization:
  Schema: Authentication
  Version: '0.1.3'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Okta sign in logs, stored in the OktaV2_CL table, to the ASIM Authentication schema.
ParserName: vimAuthenticationOktaV2
EquivalentBuiltInParser: _Im_Authentication_OktaV2
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: username_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: targetappname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: srchostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: eventtype_in
    Type: dynamic
    Default: dynamic([])
  - Name: eventresultdetails_in
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let parser=(
    starttime: datetime=datetime(null), 
    endtime: datetime=datetime(null), 
    username_has_any: dynamic = dynamic([]),
    targetappname_has_any: dynamic = dynamic([]),
    srcipaddr_has_any_prefix: dynamic = dynamic([]),
    srchostname_has_any: dynamic = dynamic([]),
    eventtype_in: dynamic = dynamic([]),
    eventresultdetails_in: dynamic = dynamic([]),
    eventresult: string = '*',
    disabled: bool=false
  ) {
    let OktaSuccessfulOutcome = dynamic(['SUCCESS', 'ALLOW']);
    let OktaFailedOutcome = dynamic(['FAILURE', 'SKIPPED', 'DENY']);
    let OktaSigninEvents=dynamic(['user.session.start', 'user.session.end']);
    let SrcDeviceTypeLookup = datatable(OriginalClientDevice: string, SrcDeviceType: string)
    [
        "Computer", "Computer",
        "Mobile", "Mobile Device",
        "Tablet", "Mobile Device"
    ];
    let OutcomeReasonLookup = datatable(EventOriginalResultDetails: string, EventResultDetails: string)
    [
        "LOCKED_OUT", "User locked",
        "INVALID_CREDENTIALS", "Incorrect password",
        "UNKNOWN_USER", "No such user",
        "VERIFICATION_ERROR", "Incorrect key",
        "SSO_AUTHENTICATION_FAILURE", "Logon violates policy",
        "PASSWORD_EXPIRED", "Password expired",
        "USER_ACCOUNT_EXPIRED", "Account expired",
        "DEL_AUTH_TIMEOUT", "Session expired",
        "PASSWORD_BASED_LOGIN_DISALLOWED", "Logon violates policy"
    ];
    OktaV2_CL
    | where not(disabled)
    | where EventOriginalType in (OktaSigninEvents)
    | where 
        (isnull(starttime) or TimeGenerated >= starttime) 
        and (isnull(endtime) or TimeGenerated <= endtime)
        and ((array_length(username_has_any) == 0) or ActorUsername has_any (username_has_any))
        and (array_length(targetappname_has_any) == 0) // TargetAppName not available in source
        and ((array_length(srcipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(SrcIpAddr, srcipaddr_has_any_prefix)))
        and (array_length(srchostname_has_any) == 0) // SrcHostname not available in source
    // Filtering on 'eventresult' and 'eventtype_in'
    | extend 
        EventType=iff(EventOriginalType hassuffix 'start', 'Logon', 'Logoff')
    | where (eventresult == "*" or (EventResult == eventresult))
        and ((array_length(eventtype_in) == 0) or EventType in~ (eventtype_in))
    // mapping ASimMatchingUsername
    | extend
        temp_isMatchTargetUsername=ActorUsername has_any(username_has_any)
        ,
        temp_isMatchActorUsername=ActorUsername has_any(username_has_any)
    | extend 
        ASimMatchingUsername = case(
            array_length(username_has_any) == 0,
            "-",
            temp_isMatchTargetUsername and temp_isMatchActorUsername,
            "Both",
            temp_isMatchTargetUsername,
            "TargetUsername",
            temp_isMatchActorUsername,
            "ActorUsername",
            "No match"
        )
    | lookup OutcomeReasonLookup on EventOriginalResultDetails
    | extend EventResultDetails = iif(OriginalOutcomeResult in (OktaFailedOutcome), coalesce(EventResultDetails, "Other"), "")
    // Filtering on eventresultdetails_in
    | where (array_length(eventresultdetails_in) == 0) or EventResultDetails in~ (eventresultdetails_in)
    | lookup SrcDeviceTypeLookup on OriginalClientDevice
    | extend SrcDeviceType = coalesce(SrcDeviceType, "Other")
    | extend
        Type = "OktaV2_CL",
        EventProduct = "Okta",
        EventSchema = "Authentication",
        EventVendor = "Okta",
        EventCount = int(1),
        EventSchemaVersion='0.1.3',
        EventStartTime = TimeGenerated,
        EventEndTime = TimeGenerated,
        EventType=iff(EventOriginalType hassuffix 'start', 'Logon', 'Logoff'),
        TargetSessionId = ActorSessionId,
        TargetUserId = ActorUserId,
        TargetUsername = ActorUsername,
        TargetUserType = ActorUserType,
        TargetUserIdType = ActorUserIdType,
        SrcIpAddr,
        ActorSessionId,
        ActorUserId,
        ActorUsername = coalesce(ActorUsername, OriginalActorAlternateId),
        ActorUserIdType = "OktaId",
        EventResult = coalesce(EventResult,
            case (
                OriginalOutcomeResult in (OktaSuccessfulOutcome), 'Success',
                OriginalOutcomeResult in (OktaFailedOutcome), 'Failure',
                'Partial')),
        SrcGeoRegion,
        SrcGeoCity,
        SrcGeoCountry,
        SrcDvcOs,
        SrcDvcId,
        SrcDvcIdType,
        DvcAction,
        EventOriginalUid
    | extend TargetUserType = case(
        TargetUserType == "System Principal", "System",
        TargetUserType
        )
    | extend
        ActorUserType = TargetUserType,
        TargetUsernameType = _ASIM_GetUsernameType(TargetUsername),
        ActorUsernameType = _ASIM_GetUsernameType(ActorUsername)
    // ** Aliases
    | extend 
        User=TargetUsername,
        Dvc=EventVendor,
        IpAddr=SrcIpAddr
    | project
        TimeGenerated,
        EventOriginalType,
        EventOriginalResultDetails,
        EventOriginalUid,
        EventResultDetails,
        SrcDeviceType,
        Type,
        EventProduct,
        EventSchema,
        EventVendor,
        EventCount = int(1),
        EventSchemaVersion='0.1.3',
        EventStartTime = TimeGenerated,
        EventEndTime = TimeGenerated,
        EventType,
        TargetSessionId,
        TargetUserId,
        TargetUsername,
        TargetUserType,
        TargetUserIdType,
        SrcIpAddr,
        ActorSessionId,
        ActorUserId,
        ActorUsername,
        ActorUserType,
        ActorUserIdType,
        EventResult,
        SrcGeoRegion,
        SrcGeoCity,
        SrcGeoCountry,
        SrcDvcOs,
        SrcDvcId,
        SrcDvcIdType,
        DvcAction,
        TargetUsernameType,
        ActorUsernameType,
        User,
        Dvc,
        IpAddr
  };
  parser (
      starttime=starttime,
      endtime=endtime,
      username_has_any=username_has_any,
      targetappname_has_any=targetappname_has_any,
      srcipaddr_has_any_prefix=srcipaddr_has_any_prefix,
      srchostname_has_any=srchostname_has_any,
      eventtype_in=eventtype_in,
      eventresultdetails_in=eventresultdetails_in,
      eventresult=eventresult,
      disabled=disabled
  )
