Parser:
  Title: Authentication ASIM schema function
  Version: '0.0'
  LastUpdated: June 9, 2021
Product:
  Name: Microsoft Sentinel
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/ASimAuthenticationDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Authentication schema.
ParserName: vimAuthenticationEmpty
ParserQuery: |
  let EmptyAuthenticationTable=datatable(
      EventProduct:string
    , EventProductVersion: string
    , EventVendor:string
    , EventCount:int
    , EventReportUrl:string
    , EventSchemaVersion:string
    , EventSchema:string
    , TimeGenerated:datetime
    , EventOriginalUid:string
    , EventOriginalType:string
    , EventOriginalSubType:string
    , EventMessage:string
    , EventResult:string
    , EventResultDetails:string
    , EventOriginalResultDetails:string
    , EventStartTime:datetime
    , EventEndTime:datetime
    , EventType:string
    , EventSubType:string
    , EventUid:string
    , EventSeverity:string
    , EventOriginalSeverity:string
    , EventOwner:string
    , ActorSessionId:string
    , TargetSessionId:string
    , ActorUserId:string
    , ActorUsername:string
    , ActorUserType:string
    , ActorUserIdType:string
    , ActorUsernameType:string
    , ActorScopeId:string
    , ActorOriginalUserType:string
    , TargetUserId:string
    , TargetUsername:string
    , TargetUserType:string
    , SrcDvcId:string
    , SrcDvcIdType:string
    , SrcDeviceType:string
    , SrcDvcOs:string
    , HttpUserAgent:string
    , SrcIsp:string
    , SrcGeoCity:string
    , SrcGeoCountry:string
    , SrcGeoRegion:string
    , SrcGeoLatitude:real
    , SrcGeoLongitude:real
    , SrcIpAddr:string
    , SrcPortNumber:string
    , SrcHostname:string
    , SrcDomain:string
    , SrcDomainType:string
    , SrcFQDN:string
    , SrcDescription:string
    , SrcDvcScopeId:string
    , SrcRiskLevel:int
    , SrcOriginalRiskLevel:string
    , ActingAppId:string
    , ActingAppName:string
    , ActingAppType:string
    , TargetAppId:string
    , TargetAppName:string
    , TargetAppType:string
    , TargetDvcId:string
    , TargetDvcIdType:string
    , TargetHostname:string
    , TargetDomain:string
    , TargetDomainType:string
    , TargetFQDN:string
    , TargetDescription:string
    , TargetDeviceType:string
    , TargetIpAddr:string
    , TargetDvcOs:string
    , TargetUrl:string
    , TargetPortNumber:int
    , TargetDvcScope:string
    , TargetDvcScopeId:string
    , TargetGeoCity:string
    , TargetGeoCountry:string
    , TargetGeoRegion:string
    , TargetGeoLatitude:real
    , TargetGeoLongitude:real
    , LogonMethod: string	
    , LogonProtocol: string	
    , TargetUserIdType: string	
    , TargetUsernameType: string	
    , UserScope:string
    , UserScopeId:string
    , TargetOriginalUserType:string
    , TargetUserSessionId:string
    , User: string	
    , IpAddr: string
    , SrcDvcHostnameType: string	
    , LogonTarget: string
    , Dvc: string	
    , DvcId: string
    , DvcIpAddr: string	
    , DvcHostname: string
    , DvcDomain:string
    , DvcDomainType:string
    , DvcFQDN:string
    , DvcDescription:string
    , DvcIdType:string
    , DvcMacAddr:string
    , DvcZone:string
    , DvcOs:string
    , DvcOsVersion:string
    , DvcAction:string
    , DvcOriginalAction:string
    , DvcScope:string
    , DvcScopeOd:string
    , AdditionalFields:dynamic
    , Type:string
    , Src:string
    , Dst:string
    , Rule:string
    , RuleName:string
    , RuleNumber:int
    , ThreatId:string
    , ThreatName:string
    , ThreatCategory:string
    , ThreatOriginalRiskLevel:string
    , ThreatOriginalConfidence:string
    , ThreatIsActive:bool
    , ThreatField:string
    , ThreatConfidence:int
    , ThreatRiskLevel:string
    , ThreatFirstReportedTime:datetime
    , ThreatLastReportedTime:datetime
    , Application:string
    )[];
  EmptyAuthenticationTable
