id: fd68706e-8e3e-4ccd-9230-1f267bdad4c8
name: Admin overrides
description: |
  This query helps in reviewing malicious emails allowed due to admin overrides
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents
  | where DeliveryLocation == "Inbox/folder" 
  | where isnotempty(ThreatTypes) and OrgLevelAction == "Allow" 
  | count
