id: 85000725-df05-479e-8cfd-78310b659714
name: Total Emails with Admin Overrides (Allow)
description: |
  This query visualises the total ammount of emails subject to an admin policy with action of allow, independent of action taken, summarizing the data by type of override
description-detailed: |
  This query visualises the total ammount of emails subject to an admin policy with action of allow, independent of action taken, summarizing the data by type of override
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents 
  | where OrgLevelPolicy != "" and OrgLevelPolicy != "SecOps Mailbox" and OrgLevelAction == "Allow"
  | summarize count() by OrgLevelPolicy,bin(Timestamp, 1d)
version: 1.0.0
