id: b1f797d1-6ea4-4f8f-b663-6c8a1c1018e9
name: User overrides
description: |
  This query helps in reviewing malicious emails allowed due to user overrides
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - Initial access
query: |
  EmailEvents
  | where DeliveryLocation == "Inbox/folder" 
  | where isnotempty(ThreatTypes) and UserLevelAction == "Allow" 
  | count
