{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "# PC Matic SuperShield Incident Overview"
      },
      "name": "Headline"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "9a199167-2dde-49dd-8f01-23e9d1fa8151",
            "version": "KqlParameterItem/1.0",
            "name": "InternalWSs",
            "type": 1,
            "isRequired": true,
            "query": "SecurityIncident\r\n| take 1\r\n| parse IncidentUrl with * \"/workspaces/\" Workspace \"/\" *\r\n| project Workspace",
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 2592000000
            },
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "7806fefd-432f-4828-9756-8c0be5c08d07",
            "version": "KqlParameterItem/1.0",
            "name": "InternalSub",
            "type": 1,
            "isRequired": true,
            "query": "SecurityIncident\r\n| take 1\r\n| parse IncidentUrl with * \"/subscriptions/\" subscriptions \"/\" *\r\n| project subscriptions",
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 2592000000
            },
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "55d3ab63-6e1f-4d02-8d9e-2225526689c7",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "isRequired": true,
            "query": "summarize by subscriptionId\r\n| project subscriptionId, Subscription=strcat(\"/subscriptions/\", subscriptionId)\r\n| extend selected = iff(subscriptionId =~ '{InternalSub}', true, false)\r\n",
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 1,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "95a45501-31b5-4ea2-bcb3-eb208e0080e2",
            "version": "KqlParameterItem/1.0",
            "name": "Workspace",
            "type": 5,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "//resources | where type =~ 'Microsoft.operationsmanagement/solutions' | where name contains //'SecurityInsights' | project id //= tostring(properties.workspaceResourceId)\r\n\r\nwhere type =~ 'microsoft.operationalinsights/workspaces'\r\n| project value =id, label = name, selected = iff(name =~ '{InternalWSs}', true, false)\r\n\r\n\r\n",
            "crossComponentResources": [
              "value::all"
            ],
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "3a87d4f7-42cc-4c62-b543-6b5d9ab8cf27",
            "version": "KqlParameterItem/1.0",
            "name": "Severity",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "SecurityIncident\r\n| summarize Count = count(IncidentNumber) by Severity\r\n| project Value = Severity, Label = strcat(Severity, \": \", Count)",
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "selectAllValue": "*",
              "showDefault": false
            },
            "timeContextFromParameter": "TimeRange",
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "81085d3a-5aca-488e-b7c6-ecf1167e59f7",
            "version": "KqlParameterItem/1.0",
            "name": "Tactics",
            "type": 2,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "SecurityIncident\r\n| extend Tactics = todynamic(AdditionalData.tactics)\r\n| mv-expand Tactics to typeof(string)\r\n| summarize Count=count(IncidentNumber) by Tactics\r\n| project Value = Tactics, Label = strcat(Tactics, \": \", Count)",
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "selectAllValue": "*",
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 172800000
            },
            "timeContextFromParameter": "TimeRange",
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "0f9efb0d-ac34-41d0-8a19-165840eb2a71",
            "version": "KqlParameterItem/1.0",
            "name": "Owner",
            "type": 2,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "SecurityIncident\r\n| extend owner = tostring(Owner.assignedTo) \r\n| summarize Count=count(IncidentNumber) by Owner= case(owner==\"\", \"Unassigned\",owner)\r\n| project Value = Owner, Label = strcat(Owner, \": \", Count)",
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "selectAllValue": "*",
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 172800000
            },
            "timeContextFromParameter": "TimeRange",
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "cf86113b-59ad-4fc9-aeb7-9b44e230641e",
            "version": "KqlParameterItem/1.0",
            "name": "Product",
            "label": "Product Name",
            "type": 2,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "SecurityIncident\r\n| extend Product = tostring(parse_json(tostring(AdditionalData.alertProductNames))[0]) \r\n| summarize Count=count(IncidentNumber) by Product\r\n| project Value = Product, Label = strcat(Product, \": \", Count)\r\n",
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "selectAllValue": "*",
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 172800000
            },
            "timeContextFromParameter": "TimeRange",
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "1fea48e7-99b2-4664-8eb6-bd35fc4efaf0",
            "version": "KqlParameterItem/1.0",
            "name": "resourceGroup",
            "type": 1,
            "query": "resources\r\n| where type =~ 'microsoft.operationalinsights/workspaces'\r\n| where id == \"{Workspace:lable}\"\r\n| project resourceGroup",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "isHiddenWhenLocked": true,
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "2908f26a-6238-43ed-9aa0-546c9041d918",
            "version": "KqlParameterItem/1.0",
            "name": "Help",
            "label": "Show Help",
            "type": 10,
            "isRequired": true,
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "showDefault": false
            },
            "jsonData": "[{ \"value\": \"Yes\", \"label\": \"Yes\"},\r\n {\"value\": \"No\", \"label\": \"No\", \"selected\":true }]",
            "timeContextFromParameter": "TimeRange"
          }
        ],
        "style": "above",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "0",
      "name": "parameters - 6"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "e7c5c0b0-afab-4bbb-83e7-f2077fba8e4b",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "label": "Incident Creation Time",
            "type": 4,
            "description": "This field is required by Sentinel. It is typically set automatically. If you experience any errors, please try setting this field manually.",
            "isRequired": true,
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 604800000
                }
              ]
            },
            "value": {
              "durationMs": 604800000
            }
          },
          {
            "id": "9aec751b-07bd-43ba-80b9-f711887dce45",
            "version": "KqlParameterItem/1.0",
            "name": "IncidentNumber",
            "label": "Incident Number",
            "type": 1,
            "description": "This field is required by Sentinel. It is typically set automatically. If you experience any errors, please try setting this field manually.",
            "isRequired": true,
            "timeContext": {
              "durationMs": 172800000
            },
            "timeContextFromParameter": "TimeRange",
            "value": "39"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "50",
      "name": "parameters - 6 - Copy",
      "styleSettings": {
        "margin": "0px"
      }
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "parameters": [
          {
            "id": "f978edb2-9886-4bff-8e12-8280800321c3",
            "version": "KqlParameterItem/1.0",
            "name": "IncidentID",
            "label": "Incident Name",
            "type": 1,
            "query": "SecurityIncident\r\n| where IncidentNumber == {IncidentNumber}\r\n| take 1\r\n| project IncidentName",
            "crossComponentResources": [
              "{Workspace}"
            ],
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "3b8e6cdd-4578-49cb-a515-1f9dec104fd7",
            "version": "KqlParameterItem/1.0",
            "name": "RuleId",
            "label": "Rule Id",
            "type": 1,
            "query": "SecurityIncident\r\n| where IncidentNumber == {IncidentNumber}\r\n| summarize arg_max(TimeGenerated, RelatedAnalyticRuleIds) by IncidentNumber\r\n| project RelatedAnalyticRuleIds",
            "crossComponentResources": [
              "{Workspace}"
            ],
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "version": "KqlParameterItem/1.0",
            "name": "IncidentTitle",
            "label": "Incident Title",
            "type": 1,
            "query": "SecurityIncident\r\n| where IncidentNumber == {IncidentNumber}\r\n| take 1\r\n| project Title",
            "crossComponentResources": [
              "{Workspace}"
            ],
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "id": "e10553bb-8879-4dd6-aec0-f02a888e29fa"
          },
          {
            "version": "KqlParameterItem/1.0",
            "name": "IncidentSeverity",
            "label": "Incident Severity",
            "type": 1,
            "query": "SecurityIncident\r\n| where IncidentNumber == {IncidentNumber}\r\n| take 1\r\n| project Severity",
            "crossComponentResources": [
              "{Workspace}"
            ],
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "id": "2cc5c22f-ed2e-4428-bfdd-324d0b9ed3f4"
          },
          {
            "id": "3913e4bd-1ddf-4321-8b43-029bf62db314",
            "version": "KqlParameterItem/1.0",
            "name": "IncidentStatus",
            "type": 1,
            "isRequired": true,
            "query": "SecurityIncident\r\n| where IncidentNumber == {IncidentNumber}\r\n| order by LastModifiedTime desc\r\n| take 1\r\n| project Status\r\n",
            "crossComponentResources": [
              "{Workspace}"
            ],
            "isHiddenWhenLocked": true,
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "conditionalVisibility": {
        "parameterName": "IncidentNumber",
        "comparison": "isEqualTo",
        "value": "e"
      },
      "customWidth": "50",
      "name": "Invisible parameters"
    },
    {
      "type": 1,
      "content": {
        "json": "# Block/Allow Process"
      },
      "name": "Headline - Copy",
      "styleSettings": {
        "margin": "0px"
      }
    },
    {
      "type": 1,
      "content": {
        "json": "Set these fields to block or allow a process by file hash, file path, digital signature, or script for a single device, or the entire account, company, or group. Click the \"Save Settings\" button, and confirm the action. Once you receive notification that the process succeeded, click the \"(Block/Allow) Process\" button, and confirm the action. This will trigger a Logic App. If the Logic App fails, you will receive an email detailing the issue."
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isNotEqualTo",
        "value": "Active"
      },
      "customWidth": "50",
      "name": "text - 16 - Copy"
    },
    {
      "type": 1,
      "content": {
        "json": "This process is already on a black or whitelist. To remove it, please click the button below."
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isEqualTo",
        "value": "Active"
      },
      "customWidth": "50",
      "name": "text - 16 - Copy - Copy"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "8a0f8caf-3f1f-424b-8e30-82b1bc40803f",
            "version": "KqlParameterItem/1.0",
            "name": "blockAllow",
            "label": "Block/Allow",
            "type": 2,
            "description": "Allow or block this process",
            "isRequired": true,
            "value": "allow",
            "typeSettings": {
              "showDefault": false
            },
            "jsonData": "[\r\n    {\r\n        \"value\":\"allow\",\r\n        \"label\":\"Allow\"\r\n    },\r\n    {\r\n        \"value\":\"block\",\r\n        \"label\":\"Block\"\r\n    }\r\n]",
            "timeContext": {
              "durationMs": 86400000
            }
          },
          {
            "id": "eb8c3ff4-2a41-4f44-ae4e-43c4c5dc2bbe",
            "version": "KqlParameterItem/1.0",
            "name": "processBy",
            "label": "By",
            "type": 2,
            "description": "MD5 Hash, File Path, Digital Signature or Script",
            "isRequired": true,
            "typeSettings": {
              "showDefault": false
            },
            "jsonData": "[\r\n    {\r\n        \"value\":\"hash\",\r\n        \"label\":\"Hash\"\r\n    },\r\n    {\r\n        \"value\":\"path\",\r\n        \"label\":\"File Path\"\r\n    },\r\n    {\r\n        \"value\":\"sign\",\r\n        \"label\":\"Digital Signature\"\r\n    },\r\n    {\r\n        \"value\":\"script\",\r\n        \"label\":\"Script\"\r\n    }\r\n]",
            "timeContext": {
              "durationMs": 86400000
            },
            "value": "hash"
          },
          {
            "id": "a96fe87d-1e7e-449e-9bb5-43f060cca8d6",
            "version": "KqlParameterItem/1.0",
            "name": "processFor",
            "label": "For",
            "type": 2,
            "description": "Account, Company, Group or Device",
            "isRequired": true,
            "value": "group",
            "typeSettings": {
              "showDefault": false
            },
            "jsonData": "[\r\n    {\r\n        \"value\":\"account\",\r\n        \"label\":\"Entire Account\"\r\n    },\r\n    {\r\n        \"value\":\"company\",\r\n        \"label\":\"Company\"\r\n    },\r\n    {\r\n        \"value\":\"group\",\r\n        \"label\":\"Group\"\r\n    },\r\n    {\r\n        \"value\":\"device\",\r\n        \"label\":\"Device\"\r\n    }\r\n]",
            "timeContext": {
              "durationMs": 86400000
            }
          }
        ],
        "style": "above",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isNotEqualTo",
        "value": "Active"
      },
      "name": "parameters - 16"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "846ce932-6103-4de8-b419-88f161cb31e0",
            "version": "KqlParameterItem/1.0",
            "name": "groupId",
            "label": "Group Name",
            "type": 2,
            "query": "SuperShieldActivity\r\n|distinct GroupID,GroupName",
            "timeContext": {
              "durationMs": 86400000
            },
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "value": "15554"
          }
        ],
        "style": "above",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "conditionalVisibilities": [
        {
          "parameterName": "processFor",
          "comparison": "isEqualTo",
          "value": "group"
        },
        {
          "parameterName": "IncidentStatus",
          "comparison": "isNotEqualTo",
          "value": "Active"
        }
      ],
      "name": "parameters - 19"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "7ca087da-32c8-43b9-a7f5-4f2babe94e5e",
            "version": "KqlParameterItem/1.0",
            "name": "TenantId",
            "label": "Tenant ID",
            "type": 1,
            "description": "Security check",
            "isRequired": true,
            "timeContext": {
              "durationMs": 86400000
            },
            "value": "06980532-a990-4ad1-8a8c-f227a94234c6"
          }
        ],
        "style": "above",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isNotEqualTo",
        "value": "Active"
      },
      "name": "parameters - 18"
    },
    {
      "type": 11,
      "content": {
        "version": "LinkItem/1.0",
        "style": "list",
        "links": [
          {
            "id": "1534e7c8-d02b-45c4-a28d-eb17c666133a",
            "linkTarget": "ArmAction",
            "linkLabel": "Save Settings",
            "preText": "",
            "style": "primary",
            "linkIsContextBlade": true,
            "armActionContext": {
              "path": "/subscriptions/{InternalSub}/resourceGroups/{resourceGroup}/providers/Microsoft.OperationalInsights/workspaces/{InternalWSs}/providers/Microsoft.SecurityInsights/incidents/{IncidentID}?api-version=2022-07-01-preview",
              "body": "{\r\n  \"properties\": {\r\n    \"title\": \"{IncidentTitle}\",\r\n    \"severity\": \"{IncidentSeverity}\",\r\n    \"status\": \"Active\",\r\n    \"labels\": [\r\n      {\r\n        \"labelname\":\"{blockAllow}\",\r\n        \"labelType\": \"User\"\r\n      },\r\n      {\r\n        \"labelname\":\"{processBy}\",\r\n        \"labelType\": \"User\"\r\n      },\r\n      {\r\n        \"labelname\":\"{processFor}\",\r\n        \"labelType\": \"User\"\r\n      },\r\n      {\r\n        \"labelname\":\"{groupId}\",\r\n        \"labelType\": \"User\"\r\n      }\r\n    ]\r\n  }\r\n}",
              "responseType": "text",
              "httpMethod": "PUT",
              "title": "Save Settings",
              "description": "# Save these settings?\n## This will update the incident with these block/allow settings.",
              "actionName": "Save Settings",
              "runLabel": "Save Settings"
            }
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isNotEqualTo",
        "value": "Active"
      },
      "name": "links - 20"
    },
    {
      "type": 11,
      "content": {
        "version": "LinkItem/1.0",
        "style": "list",
        "links": [
          {
            "id": "185caf2d-f986-4d10-a608-4f87b80d1446",
            "linkTarget": "ArmAction",
            "linkLabel": "{blockAllow:label} Process",
            "style": "primary",
            "linkIsContextBlade": true,
            "armActionContext": {
              "path": "/subscriptions/{InternalSub}/resourceGroups/{resourceGroup}/providers/Microsoft.OperationalInsights/workspaces/{InternalWSs}/providers/Microsoft.SecurityInsights/incidents/{IncidentID}/runPlaybook?api-version=2021-10-01-preview",
              "body": "{\r\n\r\n\"LogicAppsResourceId\":\"/subscriptions/{InternalSub}/resourceGroups/{resourceGroup}/providers/Microsoft.Logic/workflows/BlockAllowProcess\",\r\n\r\n \"TenantId\":\"{TenantId}\"\r\n\r\n}",
              "httpMethod": "POST",
              "title": "{blockAllow:label} Process",
              "description": "# {blockAllow:label} this process?\n## The data will update your local SuperShield whitelist or blacklist.",
              "actionName": "Block/Allow Process",
              "runLabel": "{blockAllow:label} Process"
            }
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isNotEqualTo",
        "value": "Active"
      },
      "name": "links - 17"
    },
    {
      "type": 11,
      "content": {
        "version": "LinkItem/1.0",
        "style": "list",
        "links": [
          {
            "id": "94011cfe-8c90-4f20-b8dc-e352b02a0ceb",
            "linkTarget": "ArmAction",
            "linkLabel": "Remove from Black/Whitelist",
            "style": "primary",
            "linkIsContextBlade": true,
            "armActionContext": {
              "path": "/subscriptions/{InternalSub}/resourceGroups/{resourceGroup}/providers/Microsoft.OperationalInsights/workspaces/{InternalWSs}/providers/Microsoft.SecurityInsights/incidents/{IncidentID}/runPlaybook?api-version=2021-10-01-preview",
              "body": "{\r\n\r\n\"LogicAppsResourceId\":\"/subscriptions/{InternalSub}/resourceGroups/{resourceGroup}/providers/Microsoft.Logic/workflows/RemoveProcess\",\r\n\r\n \"TenantId\":\"{TenantId}\"\r\n\r\n}",
              "httpMethod": "POST",
              "title": "Remove Process",
              "description": "# Remove this process from the black/whitelist?\n## The data will update your local SuperShield whitelist or blacklist.",
              "actionName": "Remove Process",
              "runLabel": "Remove Process"
            }
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "IncidentStatus",
        "comparison": "isEqualTo",
        "value": "Active"
      },
      "name": "links - 17 - Copy"
    },
    {
      "type": 1,
      "content": {
        "json": "## Incident Entities"
      },
      "name": "text - 2 - Copy - Copy - Copy - Copy - Copy",
      "styleSettings": {
        "margin": "50px 0px 0px 0px"
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":\"null\",\"headers\":[],\"method\":\"POST\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{resourceGroup}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/providers/Microsoft.SecurityInsights/incidents/{IncidentID}/entities\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-04-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.metaData\"}}]}",
        "size": 2,
        "noDataMessage": "No entities were found",
        "noDataMessageStyle": 4,
        "queryType": 12,
        "visualization": "piechart",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "entityKind",
            "formatter": 12,
            "formatOptions": {
              "palette": "blue"
            }
          },
          "leftContent": {
            "columnMatch": "count",
            "formatter": 1,
            "numberFormat": {
              "unit": 0,
              "options": {
                "style": "decimal"
              }
            }
          },
          "showBorder": false,
          "sortCriteriaField": "Order",
          "sortOrderField": 1,
          "size": "auto"
        }
      },
      "customWidth": "30",
      "name": "Entities"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":\"null\",\"headers\":[],\"method\":\"POST\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{resourceGroup}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/providers/Microsoft.SecurityInsights/incidents/{IncidentID}/entities\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-04-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.entities\",\"columns\":[{\"path\":\"$.kind\",\"columnid\":\"Kind\"},{\"path\":\"$.properties.friendlyName\",\"columnid\":\"Name\"}]}}]}",
        "size": 2,
        "noDataMessage": "No entities were found",
        "noDataMessageStyle": 4,
        "queryType": 12,
        "visualization": "table",
        "gridSettings": {
          "hierarchySettings": {
            "treeType": 1,
            "groupBy": [
              "Kind"
            ],
            "expandTopLevel": true
          }
        },
        "tileSettings": {
          "titleContent": {
            "columnMatch": "kind",
            "formatter": 1,
            "numberFormat": {
              "unit": 0,
              "options": {
                "style": "decimal"
              }
            }
          },
          "subtitleContent": {
            "columnMatch": "properties",
            "formatter": 1
          },
          "showBorder": false,
          "sortCriteriaField": "kind",
          "sortOrderField": 1,
          "size": "auto"
        }
      },
      "customWidth": "70",
      "name": "Entities List"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 1,
            "content": {
              "json": "## Recent activities"
            },
            "name": "text - 2 - Copy - Copy - Copy - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| where Severity in ({Severity}) or '{Severity:label}' ==  \"All\"\n| extend Tactics = todynamic(AdditionalData.tactics)\n| where Tactics in ({Tactics}) or '{Tactics:label}' ==  \"All\"\n| extend Owner = todynamic(Owner.assignedTo) \n| where Owner in ({Owner}) or '{Owner:label}' ==  \"All\"\n| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) \n| where Product in ({Product}) or '{Product:label}' ==  \"All\"\n| where IncidentNumber == '{IncidentNumber}' or '{IncidentNumber}' ==  ''\n| order by LastModifiedTime \n| project LastModifiedTime,IncidentNumber, Title, Product, IncidentUrl, ModifiedBy,Status, Severity, Owner\n| take 250\n\n\n",
              "size": 1,
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "table",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "IncidentUrl",
                    "formatter": 7,
                    "formatOptions": {
                      "linkTarget": "Url",
                      "linkLabel": "Go to incident >"
                    }
                  }
                ],
                "labelSettings": [
                  {
                    "columnId": "LastModifiedTime",
                    "label": "Last Modified Time"
                  },
                  {
                    "columnId": "IncidentNumber",
                    "label": "Incident Number"
                  },
                  {
                    "columnId": "IncidentUrl",
                    "label": "Link to incident"
                  },
                  {
                    "columnId": "ModifiedBy",
                    "label": "Modified By"
                  }
                ]
              },
              "tileSettings": {
                "showBorder": false,
                "titleContent": {
                  "columnMatch": "Column1",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "IncidentNumber",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                }
              }
            },
            "name": "query - 2 - Copy - Copy - Copy - Copy"
          }
        ]
      },
      "name": "Incidents tactic over time"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 1,
            "content": {
              "json": "## Incident's Comments"
            },
            "name": "text - 2 - Copy - Copy - Copy - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| where IncidentNumber == '{IncidentNumber}' or '{IncidentNumber}' ==  ''\n| summarize arg_max(TimeGenerated,Status, Severity, Owner, AdditionalData, IncidentUrl, Comments) by IncidentNumber\n| where Severity in ({Severity}) or '{Severity:label}' ==  \"All\"\n| extend Tactics = todynamic(AdditionalData.tactics)\n| where Tactics in ({Tactics}) or '{Tactics:label}' ==  \"All\"\n| extend Owner = todynamic(Owner.assignedTo) \n| where Owner in ({Owner}) or '{Owner:label}' ==  \"All\"\n| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) \n| where Product in ({Product}) or '{Product:label}' ==  \"All\"\n| mv-expand Comments to typeof(string)\n| extend Message = extract('message\":\"(.*?)\"',1,tostring(Comments)), Author = extract('name\":\"(.*?)\"',1,tostring(Comments)), CreatedTimeUTC = extract('createdTimeUtc\":\"(.*?)\"',1,tostring(Comments))\n| project CreatedTimeUTC, Author, Message, IncidentNumber, Owner\n| take 250\n\n\n",
              "size": 1,
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "table",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "IncidentUrl",
                    "formatter": 7,
                    "formatOptions": {
                      "linkTarget": "Url",
                      "linkLabel": "Go to incident >"
                    }
                  }
                ],
                "sortBy": [
                  {
                    "itemKey": "IncidentNumber",
                    "sortOrder": 2
                  }
                ]
              },
              "sortBy": [
                {
                  "itemKey": "IncidentNumber",
                  "sortOrder": 2
                }
              ],
              "tileSettings": {
                "showBorder": false,
                "titleContent": {
                  "columnMatch": "Column1",
                  "formatter": 1
                },
                "leftContent": {
                  "columnMatch": "IncidentNumber",
                  "formatter": 12,
                  "formatOptions": {
                    "palette": "auto"
                  },
                  "numberFormat": {
                    "unit": 17,
                    "options": {
                      "maximumSignificantDigits": 3,
                      "maximumFractionDigits": 2
                    }
                  }
                }
              }
            },
            "name": "query - 2 - Copy - Copy - Copy - Copy"
          }
        ]
      },
      "name": "Incidents tactic over time - Copy"
    }
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}