id: a6c435a2-b1a0-466d-b730-9f8af69262e6
name: Brute force attack against user credentials (Uses Authentication Normalization)
description: |
  'Identifies evidence of brute force activity against a user highlighting multiple authentication failures 
  and by a successful authentication within a given time window. 
  (The query does not enforce any sequence - eg requiring the successful authentication to occur last.)
  Default Failure count is 10, Default Success count is 1 and default Time Window is 20 minutes.
  To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/AzSentinelAuthentication)'
severity: Medium
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
relevantTechniques:
  - T1110
tags:
  - Id: 28b42356-45af-40a6-a0b4-a554cdfd5d8a
    version: 1.0.0
  - Schema: ASIMAuthentication
    SchemaVersion: 0.1.0
query: |
 WindowsEvent
| where EventID == 4624 and has_any_ipv4(tostring(EventData), suspicious_signins)
| extend LogonType = tostring(EventData.LogonType)

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: TargetUsername
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcDvcIpAddr
version: 1.0.0
kind: Scheduled
