id: 9ae540c9-c926-4100-8f07-1eac22596292
name: Silverfort - Certifried Incident
description: |
  'An Active Directory domain privilege escalation vulnerability that enables a privileged user to access the Domain Controller by abusing Active Directory Certificate Service'
severity: High
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1552 #Abusing Certificate Services
query: |-
  CommonSecurityLog 
  | where DeviceVendor has 'Silverfort'
  | where DeviceProduct has 'Admin Console'
  | where DeviceEventClassID == "NewIncident"
  | where Message has "Certifried"
  | extend UserName = parse_json(replace('^""|""$', '', Message))['userName']
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: UserName
queryFrequency: PT15M
queryPeriod: PT15M
triggerOperator: GreaterThan
triggerThreshold: 0
version: 1.0.0
kind: Scheduled
