id: d6abed70-4043-46da-9304-a98f3446fa5f
name: Silverfort - Log4Shell Incident
description: |
  'Vulnerability allows attackers to execute arbitrary code on affected systems by exploiting a flaw in the way Log4j handles log messages containing specially crafted strings'
severity: High
query: |-
  CommonSecurityLog 
  | where DeviceVendor has 'Silverfort'
  | where DeviceProduct has 'Admin Console'
  | where DeviceEventClassID == "NewIncident"
  | where Message has "Log4Shell"
queryFrequency: PT15M
queryPeriod: PT15M
triggerOperator: GreaterThan
triggerThreshold: 0
version: 1.0.0
kind: Scheduled

