id: bdfd2c45-10a0-44e7-a90a-ba7b6bdd9ff2
name: Silverfort - NoPacBreach Incident
description: |
  'The NoPac vulnerability involves privilege escalation, allowing attackers to gain unauthorized access and potentially take control of an entire Active Directory domain'
severity: High
query: |-
  CommonSecurityLog 
  | where DeviceVendor has 'Silverfort'
  | where DeviceProduct has 'Admin Console'
  | where DeviceEventClassID == "NewIncident"
  | where Message has "NoPacBreach"
queryFrequency: PT15M
queryPeriod: PT15M
triggerOperator: GreaterThan
triggerThreshold: 0
version: 1.0.0
kind: Scheduled
