id: 46ff357b-9e98-465b-9e45-cd52fa4a7522
name: Silverfort - UserBruteForce Incident
description: |
  'A security weakness that allows attackers to gain unauthorized access to user accounts by systematically guessing the username and password combinations.'
severity: High
query: |-
  CommonSecurityLog 
  | where DeviceVendor has 'Silverfort'
  | where DeviceProduct has 'Admin Console'
  | where DeviceEventClassID == "NewIncident"
  | where Message has "UserBruteForce"
queryFrequency: PT15M
queryPeriod: PT15M
triggerOperator: GreaterThan
triggerThreshold: 0
version: 1.0.0
kind: Scheduled
