id: 46ff357b-9e98-465b-9e45-cd52fa4a7522
name: Silverfort - UserBruteForce Incident
description: |
  'A security weakness that allows attackers to gain unauthorized access to user accounts by systematically guessing the username and password combinations.'
severity: High
requiredDataConnectors:
  - connectorId: SilverfortAma
    dataTypes:
      - CommonSecurityLog
tactics:
  - CredentialAccess
relevantTechniques:
  - T1110 #Brute Force
query: |-
  CommonSecurityLog 
  | where DeviceVendor has 'Silverfort'
  | where DeviceProduct has 'Admin Console'
  | where DeviceEventClassID == "NewIncident"
  | where Message has "UserBruteForce"
  | extend UserName = parse_json(replace('^""|""$', '', Message))['userName']
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: UserName
queryPeriod: 15m
queryFrequency: 15m
triggerOperator: gt
triggerThreshold: 0
version: 1.0.0
kind: Scheduled
