id: 7ec1e61d-f3b7-4f40-bb1a-357a63913c23
kind: Scheduled
name: Power Apps - App activity from unauthorized geo
description: Identifies Power Apps activity from countries in a predefined list of
  unauthorized countries.
severity: Low
status: Available
requiredDataConnectors:
  - connectorId: PowerPlatformAdmin
    dataTypes:
      - PowerPlatformAdminActivity
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
query: |
  let unauthorized_country_codes = dynamic([
      // Specify the disallowed two letter country codes
      // example: disallowed_country_codes = dynamic(["RU", "KP", "IR"])
      ]);
  let query_frequency = 1h;
  let query_lookback = 14d;
  let powerapps_events = dynamic(["LaunchPowerApp", "AppDlpEvaluationResultChange", "UpdatePowerApp", "PublishPowerApp", "RecordScopesConsent", "CreatePowerApp", "PowerAppPermissionEdited", "PowerAppPermissionDeleted", "ImportExistingCanvasApp", "DeletePowerApp", "ImportNewCanvasApp", "PromotePowerAppVersion", "RemoveHeroApp", "DeletePowerAppVersion", "PublishSolutionCanvasAppVersion", "AdminModifyAppPermissions", "AdminModifyAppOwner", "AdminQuarantineApp", "AdminDeleteApp", "AdminSetAppBypassConsent", "PatchPowerApp"]);
  PowerPlatformAdminActivity
  | where TimeGenerated >= ago(query_frequency)
  | where EventOriginalType in (powerapps_events)
  | extend Property = tostring(Properties)
  | extend SrcIpAddr = extract(@"\""enduser\.ip_address\""\s*:\s*\""(.*?)\""", 1, Property)
  | extend SrcIpAddr = iif(SrcIpAddr startswith "::ffff:", replace_string(SrcIpAddr, "::ffff:", ""), SrcIpAddr)
  | extend AppId = extract(@"\""powerplatform\.analytics\.resource\.power_app\.id\""\s*:\s*\""(.*?)\""", 1, Property)
  | extend AppId = tolower(replace_string(AppId, "/providers/Microsoft.PowerApps/apps/", ""))
  | extend AppName = extract(@"\""powerplatform\.analytics\.resource\.power_app\.display_name\""\s*:\s*\""(.*?)\""", 1, Property),
      EnvironmentId = extract(@"\""powerplatform\.analytics\.resource\.environment\.id\""\s*:\s*\""(.*?)\""", 1, Property),
      EnvironmentName = extract(@"\""powerplatform\.analytics\.resource\.environment\.name\""\s*:\s*\""(.*?)\""", 1, Property)
  | extend EnvironmentId = tolower(replace_string(EnvironmentId, "/providers/Microsoft.BusinessAppPlatform/environments/Default-", ""))
  | summarize FirstEvent = min(TimeGenerated) by ActorName, SrcIpAddr, AppName, AppId, EnvironmentId, EnvironmentName
  | join kind=inner (
      SigninLogs
      | where TimeGenerated >= ago(query_lookback)
      | where Location in (unauthorized_country_codes)
      | summarize by IPAddress, Location)
      on $left.SrcIpAddr == $right.IPAddress
  | extend
      PowerAppsEntityId = 27593,
      DataverseId = 32780,
      AccountName = tostring(split(ActorName, '@')[0]),
      UPNSuffix = tostring(split(ActorName, '@')[1])
  | project
      FirstEvent,
      ActorName,
      SrcIpAddr,
      Location,
      AppName,
      AppId,
      EnvironmentId,
      EnvironmentName,
      PowerAppsEntityId,
      AccountName,
      UPNSuffix
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: AccountName
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: CloudApplication
    fieldMappings:
      - identifier: AppId
        columnName: PowerAppsEntityId
      - identifier: Name
        columnName: AppName
alertDetailsOverride:
  alertDisplayNameFormat: Power Apps activity from an unauthorized location
  alertDescriptionFormat: 'User {{ActorName}} activity associated with app {{AppName}}
    from an unauthorized geolocation: {{Location}}'
customDetails:
  App: AppId
  Environment: EnvironmentId
  EnvironmentName: EnvironmentName
version: 3.2.3
