{
    "name": "CloudNSSEndpointDLPLogs_ccp",
    "apiVersion": "2022-09-01-preview",
    "type": "Microsoft.SecurityInsights/dataConnectorDefinitions",
    "location": "[parameters('workspace-location')]",
    "kind": "Customizable",
    "properties": {
      "connectorUiConfig": {
        "id": "CloudNSSEndpointDLPLogs_ccp",
        "title": "Zscaler Internet Access Cloud NSS Endpoint DLP Log Push Connector",
        "publisher": "Zscaler",
        "descriptionMarkdown": "The [Zscaler](https://www.zscaler.com/) connector provides the capability to read ZIA Endpoint DLP log data in Microsoft Sentinel.",
        "graphQueries": [
          {
            "metricName": "ZIAEndpointDLPLogs",
            "legend": "CommonSecurityLog",
            "baseQuery": "CommonSecurityLog | where DeviceProduct == 'NSSEndpointDLPlog'"
          }
        ],
        "sampleQueries": [
          {
            "description": "ZIA - All Endpoint DLP Transactions",
            "query": "CommonSecurityLog\n | where DeviceProduct == 'NSSEndpointDLPlog'\n | sort by TimeGenerated desc"
          },
          {
            "description": "ZIA - Endpoint DLP Blocked Actions",
            "query": "CommonSecurityLog\n | where DeviceProduct == 'NSSEndpointDLPlog'\n | where DeviceAction == 'Blocked'\n | sort by TimeGenerated desc"
          }
        ],
        "dataTypes": [
          {
            "name": "CommonSecurityLog",
            "lastDataReceivedQuery": "CommonSecurityLog\n            | where DeviceProduct == 'NSSEndpointDLPlog'\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
          }
        ],
        "connectivityCriteria": [
          {
            "type": "IsConnectedQuery",
            "value": [
              "CommonSecurityLog\n            | where DeviceProduct == 'NSSEndpointDLPlog'\n            | summarize LastLogReceived = max(TimeGenerated)\n            | project IsConnected = LastLogReceived > ago(7d)"
            ]
          }
        ],
        "availability": {
          "status": 1
        },
        "permissions": {
          "resourceProvider": [
            {
              "provider": "Microsoft.OperationalInsights/workspaces",
              "permissionsDisplayText": "read and write permissions are required.",
              "providerDisplayName": "Workspace",
              "scope": "Workspace",
              "requiredPermissions": {
                "write": true,
                "read": true,
                "delete": true
              }
            }
          ],
          "customs": [
            {
              "name": "Microsoft Entra",
              "description": "Permission to create an app registration in Microsoft Entra ID. Typically requires Entra ID Application Developer role or higher."
            },
            {
              "name": "Microsoft Azure",
              "description": "Permission to assign Monitoring Metrics Publisher role on data collection rule (DCR). Typically requires Azure RBAC Owner or User Access Administrator role"
            }
          ]
        },
        "instructionSteps": [
          {
            "title": "1. Create ARM Resources and Provide the Required Permissions",
            "description": "This connector reads data from the tables that Zscaler uses in a Microsoft Analytics Workspace, if the Cloud NSS option is enabled in Zscaler then raw event data is sent to the Microsoft Sentinel Ingestion API.",
            "instructions": [
              {
                "type": "Markdown",
                "parameters": {
                  "content": "#### Automated Configuration and Secure Data Ingestion with Entra Application \nClicking on \"Deploy\" will trigger the creation of Log Analytics tables and a Data Collection Rule (DCR). \nIt will then create an Entra application, link the DCR to it, and set the entered secret in the application. This setup enables data to be sent securely to the DCR using an Entra token."
                }
              },
              {
                "parameters": {
                  "label": "Deploy Zscaler Internet Access Cloud NSS Endpoint DLP Log connector resources",
                  "applicationDisplayName": "Zscaler Internet Access Cloud NSS Endpoint DLP Log connector Application"
                },
                "type": "DeployPushConnectorButton"
              }
            ]
          },
          {
            "title": "2. Push your logs into the workspace",
            "description": "Use the following parameters to configure the your machine to send the logs to the workspace.",
            "instructions": [
              {
                "parameters": {
                  "label": "Tenant ID (Directory ID)",
                  "fillWith": [
                    "TenantId"
                  ]
                },
                "type": "CopyableLabel"
              },
              {
                "parameters": {
                  "label": "Entra App Registration Application ID",
                  "fillWith": [
                    "ApplicationId"
                  ],
                  "placeholder": "Deploy push connector to get the App Registration Application ID"
                },
                "type": "CopyableLabel"
              },
              {
                "parameters": {
                  "label": "Entra App Registration Secret",
                  "fillWith": [
                    "ApplicationSecret"
                  ],
                  "placeholder": "Deploy push connector to get the App Registration Secret"
                },
                "type": "CopyableLabel"
              },
              {
                "parameters": {
                  "label": "Data Collection Endpoint Uri",
                  "fillWith": [
                    "DataCollectionEndpoint"
                  ],
                  "placeholder": "Deploy push connector to get the Data Collection Endpoint Uri"
                },
                "type": "CopyableLabel"
              },
              {
                "parameters": {
                  "label": "Data Collection Rule Immutable ID",
                  "fillWith": [
                    "DataCollectionRuleId"
                  ],
                  "placeholder": "Deploy push connector to get the Data Collection Rule Immutable ID"
                },
                "type": "CopyableLabel"
              }
            ]
          }
        ]
      }
    }
  }
