Parser:
  Title: ASIM Microsoft WindowsEvent Process Termination Events Parser
  Version: '1.0.0'
  LastUpdated: Aug 11, 2021
Product:
  Name: Windows Event
Normalization:
  Schema: ProcessEvent
  Version: '1.0.0'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/AzSentinelProcessEventsDoc 
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: ASIM WindowsEvents Parser
ParserName: vimProcessTerminationMicrosoftWindowsEvents
ParserQuery: |
             let ProcessEvents=(){
              WindowsEvent
              // -- Filter
              | where EventID == 4689
              // -- Map
              | extend
                // Event
                  EventCount = int(1),
                  EventVendor = "Microsoft",
                  EventProduct = "Security Events",
                  EventSchemaVersion = "1.0.0",
                  EventStartTime = todatetime(TimeGenerated),
                  EventEndTime = todatetime(TimeGenerated),
                  EventType = "ProcessTerminated",
                  EventResult = 'Success',
                  EventOriginalType = EventID,
                 // EventOriginalUid = EventOriginId, Field will be added later on
                  EventResultDetails = Data.Status,
                  EventOriginalResultDetails = Data.Status, 
                // Device
                  DvcId = Data.SourceComputerId,
                  DvcHostname = Computer,
                  DvcOs = "Windows",
                // Users
                  ActorUserId = Data.SubjectUserSid,
                  ActorUserIdType = "SID",
                  ActorUsername = Data.SubjectUserName,
                  ActorUsernameType = iff(Data.SubjectDomainName == '-','Simple', 'Windows'),
                  ActorSessionId = toint(Data.SubjectLogonId),
                  ActorDomainName = Data.SubjectDomainName,
                // Processes 
                  TargetProcessId = toint(Data.ProcessId),
                  TargetProcessName = Data.ProcessName,
                  TargetProcessCommandLine = Data.CommandLine,
                  TargetProcessTokenElevation = Data.TokenElevationType
                // Aliases
                | extend 
                  User = ActorUsername,
                  Dvc = DvcHostname,
                  Process = TargetProcessName
              }; ProcessEvents