Parser:
  Title: ASIM Microsoft WindowsEvent Process Termination Events Parser
  Version: '0.1.0'
  LastUpdated: Aug 11, 2021
Product:
  Name: Windows Event
Normalization:
  Schema: ProcessEvent
  Version: '0.1.0'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/AzSentinelProcessEventsDoc 
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: ASIM WindowsEvents Parser
ParserName: vimProcessTerminationMicrosoftWindowsEvents
ParserQuery: |    
        let ProcessEvents=(){
          WindowsEvent | where EventID == 4689
              // -- Filter
              // -- Map
                 | extend
              // Event
            EventCount = int(1),
            EventVendor = "Microsoft",
            EventProduct = "Security Event",
            EventSchemaVersion = "0.1.0",
            EventStartTime = todatetime(TimeGenerated),
            EventEndTime = todatetime(TimeGenerated),
            EventType = "ProcessTerminated",
            EventResult = 'Success',
            EventOriginalType = tostring(EventID),
          // EventOriginalUid = EventOriginId, Field will be added later on
            EventResultDetails = tostring(Data.Status),
            EventOriginalResultDetails = tostring(Data.Status), 
          // Device
            DvcId = tostring(Data.SourceComputerId),
            DvcHostname = Computer,
            DvcOs = "Windows",
          // Users
            ActorUserId = tostring(Data.SubjectUserSid),
            ActorUserIdType = "SID",
            ActorUsername = tostring(iff (Data.SubjectDomainName == '-', Data.SubjectUserName, strcat(Data.SubjectDomainName, @"\" , Data.SubjectUserName))),
            ActorUsernameType = iff(Data.SubjectDomainName == '-','Simple', 'Windows'),
            ActorSessionId = tostring(toint(Data.SubjectLogonId)),
          // Processes 
            TargetProcessId = tostring(toint(Data.ProcessId)),
            TargetProcessName = tostring(Data.ProcessName),
            TargetProcessCommandLine = tostring(Data.CommandLine),
            TargetProcessTokenElevation = tostring(Data.TokenElevationType)
          // Aliases
              | extend 
            User = ActorUsername,
            Dvc = DvcHostname,
            Process = TargetProcessName
             }; ProcessEvents