{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
          "AzureSentinelLogAnalyticsWorkspaceName": {
            "defaultValue": "your Azure Sentinel Workspace Name",
            "type": "string"
          },
        "PlaybookName": {
            "defaultValue": "Sync-Comments-to-M365Defender",
            "type": "string"
        },
        "UserName": {
            "defaultValue": "<username>@<domain>",
            "type": "string"
          },
        "TenantID": {
            "defaultValue": "Your Azure Active Directory Tenant ID",
            "type": "string"
          },
        "ClientID": {
            "defaultValue": "Your Azure Active Directory Application Client ID",
            "type": "string"
          },
        "Secret": {
            "defaultValue": "Your Azure Active Directory Application Secret",
            "type": "string"
          }
    },
    "variables": {
        "AzureMonitorLogsConnectionName": "[concat('azuremonitorlogs-', parameters('PlaybookName'))]"
    },
    "resources": [
        {
            "type": "Microsoft.Web/connections",
            "apiVersion": "2016-06-01",
            "name": "[variables('AzureMonitorLogsConnectionName')]",
            "location": "[resourceGroup().location]",
            "properties": {
              "displayName": "[parameters('UserName')]",
              "customParameterValues": {},
              "api": {
                "id": "[concat('/subscriptions/', subscription().subscriptionId, '/providers/Microsoft.Web/locations/', resourceGroup().location, '/managedApis/azuresentinel')]"
              }
            }
          },
        {
            "type": "Microsoft.Logic/workflows",
            "apiVersion": "2017-07-01",
            "name": "[parameters('PlaybookName')]",
            "location": "[resourceGroup().location]",
            "dependsOn": [
                "[resourceId('Microsoft.Web/connections', variables('AzureMonitorLogsConnectionName'))]"
            ],
            "properties": {
                "state": "Enabled",
                "definition": {
                    "$schema": "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#",
                    "contentVersion": "1.0.0.0",
                    "parameters": {
                        "$connections": {
                            "defaultValue": {},
                            "type": "Object"
                        }
                    },
                    "triggers": {
                        "Recurrence": {
                            "recurrence": {
                                "frequency": "Day",
                                "interval": 1
                            },
                            "type": "Recurrence"
                        }
                    },
                    "actions": {
                        "For_each": {
                            "foreach": "@body('Run_query_and_list_results')?['value']",
                            "actions": {
                                "HTTP": {
                                    "runAfter": {
                                        "Parse_JSON": [
                                            "Succeeded"
                                        ]
                                    },
                                    "type": "Http",
                                    "inputs": {
                                        "authentication": {
                                            "audience": "https://api.security.microsoft.com",
                                            "clientId": "[parameters('ClientID')]",
                                            "secret": "[parameters('Secret')]",
                                            "tenant": "[parameters('TenantID')]",
                                            "type": "ActiveDirectoryOAuth"
                                        },
                                        "body": {
                                            "comment": "@{body('Parse_JSON')?['message']}"
                                        },
                                        "headers": {
                                            "Content-Type": "application/json"
                                        },
                                        "method": "PATCH",
                                        "uri": "https://api.security.microsoft.com/api/incidents/@{items('For_each')?['ProviderIncidentId']}"
                                    }
                                },
                                "Parse_JSON": {
                                    "runAfter": {},
                                    "type": "ParseJson",
                                    "inputs": {
                                        "content": "@items('For_each')?['Comments']",
                                        "schema": {
                                            "properties": {
                                                "author": {
                                                    "properties": {
                                                        "email": {
                                                            "type": "string"
                                                        },
                                                        "name": {
                                                            "type": "string"
                                                        },
                                                        "objectId": {
                                                            "type": "string"
                                                        },
                                                        "userPrincipalName": {
                                                            "type": "string"
                                                        }
                                                    },
                                                    "type": "object"
                                                },
                                                "createdTimeUtc": {
                                                    "type": "string"
                                                },
                                                "lastModifiedTimeUtc": {
                                                    "type": "string"
                                                },
                                                "message": {
                                                    "type": "string"
                                                }
                                            },
                                            "type": "object"
                                        }
                                    }
                                }
                            },
                            "runAfter": {
                                "Run_query_and_list_results": [
                                    "Succeeded"
                                ]
                            },
                            "type": "Foreach"
                        },
                        "Run_query_and_list_results": {
                            "runAfter": {},
                            "type": "ApiConnection",
                            "inputs": {
                                "body": "SecurityIncident\n| where ProviderName == \"Microsoft 365 Defender\" and isnotempty(Comments)\n| mv-expand Comments\n| extend CommentCreationTime = todatetime(parse_json(Comments.createdTimeUtc))\n| where CommentCreationTime >= ago(24h)\n| summarize by Title, tostring(Comments), ProviderIncidentId",
                                "host": {
                                    "connection": {
                                        "name": "@parameters('$connections')['azuremonitorlogs']['connectionId']"
                                    }
                                },
                                "method": "post",
                                "path": "/queryData",
                                "queries": {
                                    "resourcegroups": "[resourceGroup().name]",
                                    "resourcename": "[parameters('AzureSentinelLogAnalyticsWorkspaceName')]",
                                    "resourcetype": "Log Analytics Workspace",
                                    "subscriptions": "[subscription().subscriptionId]",
                                    "timerange": "Last 24 hours"
                                }
                            }
                        }
                    },
                    "outputs": {}
                },
                "parameters": {
                    "$connections": {
                        "value": {
                            "azuremonitorlogs": {
                                "connectionId": "[resourceId('Microsoft.Web/connections', variables('AzureMonitorLogsConnectionName'))]",
                                "connectionName": "[variables('AzureMonitorLogsConnectionName')]",
                                "id": "[concat('/subscriptions/', subscription().subscriptionId, '/providers/Microsoft.Web/locations/', resourceGroup().location, '/managedApis/azuremonitorlogs')]"
                              }
                        }
                    }
                }
            }
        }
    ]
}