id: 8e4a010a-972c-4124-8c27-1efcd7e3125a
name: Detect DNS request to malicious Domain (ASIM DNS Solution)
description: |
  'This Analytics rule looks for Domain IOCs in DNS query logs. Incident will be created if DNSQuery matches with any value present in the Watchlist - 'DNSMonitoringConfiguration'.\n\nThe rule utilize [ASIM](https://aka.ms/AboutASIM) normalization, and is applied to any source which supports the ASIM DNS schema'
severity: Medium
status: Available 
tags:
  - Schema: ASimNetworkSessions
    SchemaVersion: 0.2.4
requiredDataConnectors:
  - connectorId: GCPDNSDataConnector
    dataTypes:
      - GCPCloudDNS
  - connectorId: AzureFirewall
    dataTypes:
      - AzureDiagnostics
  - connectorId: CiscoUmbrellaDataConnector
    dataTypes:
      - Cisco_Umbrella_proxy_CL
  - connectorId: Corelight
    dataTypes:
      - Corelight
  - connectorId: InfobloxNIOS
    dataTypes:
      - Syslog
  - connectorId: NXLogDnsLogs
    dataTypes:
      - NXLog_DNS_Server_CL
  - connectorId: DNS
    dataTypes:
      - DnsEvents
  - connectorId: AIVectraStream
    dataTypes:
      - VectraStream
  - connectorId: Zscaler
    dataTypes:
      - CommonSecurityLog
  - connectorId: ISCBind
    dataTypes:
      - Syslog

queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
query: |
  let DNS_IOCs = materialize(_GetWatchlist('DNS_Solution_Domain_IOCs')
    | where wl_Type == 'Detection' and wl_Enabled == 'TRUE'
    | project
        wl_DNSDomain,
        wl_Name,
        wl_Description,
        wl_Type,
        wl_ThresholdType,
        wl_Threshold,
        wl_Severity,
        wl_Tactic,
        wl_Enabled);
  imDns
  | join kind=inner['DNS_IOCs'] where DnsQuery has wl_DNSDomain
  | project
    SrcIpAddr,
    DnsQuery,
    EventResultDetails,
    Name=wl_Name,
    Description=wl_Description,
    TimeGenerated,
    Tactic=wl_Tactic,
    Severity=wl_Severity


eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:

alertDetailsOverride:
  alertDisplayNameFormat: "Reqest to malicious Domain '{{DnsQuery}}' by ClientIP: '{{SrcIpAddr}}' has been detected."
  alertDescriptionFormat: "Alert details:\nName: '{{Name}}'\nDescription: '{{Description}}'\nTimeGenerated: '{{TimeGenerated}}'"
version: 1.0.0
kind: Scheduled