id: 5b8344eb-fa28-4ac3-bcff-bc19d5d63089
name: Detect DNSQueries reporting multiple errors from different client sources - Static threshold based (ASIM Domain Solution)
description: |
  'This rule creates an incident in the event where multiple clients are reporting errors for the same DNSQuery.\n\nThe rule utilize [ASIM](https://aka.ms/AboutASIM) normalization, and is applied to any source which supports the ASIM DNS schema'
severity: Medium
status: Available 
tags:
  - Schema: ASimDns
    SchemaVersion: 0.1.6
requiredDataConnectors:
  - connectorId: GCPDNSDataConnector
    dataTypes:
      - GCPCloudDNS
  - connectorId: AzureFirewall
    dataTypes:
      - AzureDiagnostics
  - connectorId: CiscoUmbrellaDataConnector
    dataTypes:
      - Cisco_Umbrella_proxy_CL
  - connectorId: Corelight
    dataTypes:
      - Corelight
  - connectorId: InfobloxNIOS
    dataTypes:
      - Syslog
  - connectorId: NXLogDnsLogs
    dataTypes:
      - NXLog_DNS_Server_CL
  - connectorId: DNS
    dataTypes:
      - DnsEvents
  - connectorId: AIVectraStream
    dataTypes:
      - VectraStream
  - connectorId: Zscaler
    dataTypes:
      - CommonSecurityLog
  - connectorId: ISCBind
    dataTypes:
      - Syslog

queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
  - T1205
query: |
  let threshold = materialize (_GetWatchlist('DNS_Solution_Monitoring_Configuration')
  | where wl_RuleName=='Multiple errors reported for same DNSQuery' and wl_Type == 'Detection'
  | project toint(wl_Threshold));
  //let threshold = 2;
  let errors = dynamic(['NXDOMAIN', 'SERVFAIL', 'REFUSED']);
  imDns
  | where EventResultDetails has_any (errors)
  | summarize SrcIPs = make_set(SrcIpAddr, 100) by DnsQuery, bin(TimeGenerated, 10min)
  | where array_length(SrcIPs) >= toscalar(threshold)
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:

alertDetailsOverride:
  alertDisplayNameFormat: "[Static threshold] Multiple errors for the same DNSQuery has been detected - '{{DnsQuery}}'"
  alertDescriptionFormat: "Multiple errors were detected for the same DNSQuery. \n\nClients requesting this DNSQuery include:\n\n'{{SrcIPs}}'"
version: 1.0.0
kind: Scheduled