id: 18f7de84-de55-4983-aca3-a18bc846b4e0 
name: TI map File entity to VMConnection Event
description: |
  'Identifies a match in VMConnection Event data from any FileName IOC from TI'
severity: Medium
requiredDataConnectors:
  - connectorId: VMConnection
    dataTypes:
      - VMConnection
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
query: |
  
  let dt_lookBack = 1h;
  let ioc_lookBack = 14d;
  ThreatIntelligenceIndicator
  | where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
  | where Active == true
  | where isnotempty(FileName)
  | extend TI_ProcessEntity = tostring(split(FileName, ".")[-2])
  |  join (
     VMConnection | where TimeGenerated >= ago(dt_lookBack)
            | where isnotempty(ProcessName)
     | extend VMConnection_TimeGenerated = TimeGenerated
  )
  on $left.TI_ProcessEntity == $right.ProcessName
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
  | project LatestIndicatorTime, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, VMConnection_TimeGenerated, FileName, Computer, Direction, SourceIp, DestinationIp, DestinationPort, Protocol 
  | extend timestamp = VMConnection_TimeGenerated, IPCustomEntity = case( Direction =~ 'Outbound', DestinationIp, Direction =~ 'Inbound', SourceIp,'Not Available'), HostCustomEntity = Computer