id: 106813db-679e-4382-a51b-1bfc463befc3
name: (Preview) TI map URL entity to PaloAlto data
description: |
  'Identifies a match in PaloAlto data from any URL IOC from TI'
severity: Medium
requiredDataConnectors:
  - connectorId: PaloAltoNetworks
    dataTypes:
      - CommonSecurityLog
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
query: |

  let dt_lookBack = 1h;
  let ioc_lookBack = 14d;
  ThreatIntelligenceIndicator
  | where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
  | where Active == true
  // Picking up only IOC's that contain the entities we want
  | where isnotempty(Url)
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
  | join (
    CommonSecurityLog
    | where TimeGenerated >= ago(dt_lookBack)
    // Select on Palo Alto logs
    | where DeviceVendor == "Palo Alto Networks"
    | where DeviceEventClassID == 'url'		 
    //Select logs where URL data is populated
    | extend Url = columnifexists("RequestURL", "None")
    | extend Url = iif(Url == "", extract("([^\"]+)", 1, tolower(AdditionalExtensions)), Url)
    | extend Url = iif(Url !startswith "http://" and ApplicationProtocol != "ssl", strcat('http://', trim('"', RequestURL)), iif(Url !startswith "https://" and ApplicationProtocol == "ssl", strcat('https://', trim('"', RequestURL)), RequestURL))
    | where Url != "None" and isnotempty(Url)
    | extend CSL_TimeGenerated = TimeGenerated
  ) on Url
  | project LatestIndicatorTime, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, DeviceAction, SourceIP, CSL_TimeGenerated, Url, DeviceName
  | extend timestamp = CSL_TimeGenerated, IPCustomEntity = SourceIP, HostCustomEntity = DeviceName 
