id: 79f9bb6b-6d31-412e-b3bc-6e5ad1303112
name: Credential Harvesting Using LaZagne
description: 
  Detects the use of LaZagne to steal credentials from the SAM database by Ryuk ransomware operators.
description-detailed: |
  This query was originally published in the threat analytics report, Ryuk ransomware. There is also a related blog.
  Ryuk is human-operated ransomware. Much like DoppelPaymer ransomware, Ryuk is spread manually, often on networks that are already infected with Trickbot.
  During a typical Ryuk campaign, an operator will use LaZagne, a credential theft tool, to access stored passwords for service accounts. The accounts are then used to jump from desktop clients to servers or domain controllers, allowing for better reconnaissance, faster movement, and a more severe impact on the target.
  The following query detects credential theft by LaZagne.
  The See also section below lists links to other queries associated with Ryuk ransomware.
  References:
  https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/
  https://www.microsoft.com/wdsi/threats/malware-encyclopedia-description?Name=Ransom:Win32/Ryuk&threatId=-2147232689
  https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/
  https://github.com/AlessandroZ/LaZagne
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - CredentialAccess
query: |
  // Find credential theft via SAM database export by LaZagne
  DeviceProcessEvents
  | where TimeGenerated > ago(7d)
  | where FileName =~ 'reg.exe'
      and ProcessCommandLine has 'save'
      and ProcessCommandLine has 'hklm'
      and ProcessCommandLine has 'sam'
  | project DeviceId, TimeGenerated, InitiatingProcessId,
  InitiatingProcessFileName, ProcessId, FileName, ProcessCommandLine
version: 1.0.0