id: b252c28e-1518-43f0-934b-ea42b52b2568
name: Potential Build Process Compromise - MDE
description: |
  'The query looks for source code files being modified immediately after a build process is started. The purpose of this is to look for malicious code injection during the build process. This query uses Microsoft Defender for Endpoint telemetry.
  More details: https://techcommunity.microsoft.com/t5/azure-sentinel/monitoring-the-software-supply-chain-with-azure-sentinel/ba-p/2176463'
severity: Medium
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
      - DeviceFileEvents
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1554
tags:
  - Id: 1bf6e165-5e32-420e-ab4f-0da8558a8be2
  - version: 1.0.0
  - Solorigate
  - NOBELIUM
query: |
  // How far back to look for events from
  let timeframe = 1d;
  // How close together build events and file modifications should occur to alert (make this smaller to reduce FPs)
  let time_window = 5m;
  // Edit this to include build processes used
  let build_processes = dynamic(["MSBuild.exe", "dontnet.exe", "VBCSCompiler.exe"]);
  // Include any processes that you want to allow to edit files during/around the build process
  let allow_list = dynamic([]);
  imProcessCreate
  | where TimeGenerated > ago(timeframe)
  // Look for build process starts
  | where TargetProcessName has_any (build_processes) // FileName --> TargetProcessName 
  | summarize by BuildParentProcess=TargetProcessName, BuildAccount = User , DvcHostname, BuildCommand=CommandLine, timekey= bin(TimeGenerated, time_window), BuildProcessTime=TimeGenerated
  | join kind=inner(
  imFileEvent
  | where TimeGenerated > ago(timeframe)
  | where ActingProcessName !in (allow_list)
  | where EventType in  ("FileCreated", "FileModified")
  // Look for code files, edit this to include file extensions used in build.
  | where TargetFileName endswith ".cs" or TargetFileName endswith ".cpp"
  | summarize by FileEditParentProcess=ParentProcessName , FileEditAccount = User, DvcHostname, FileEdited=FilePath, FileEditProcess=Process , timekey= bin(TimeGenerated, time_window), FileEditTime=TimeGenerated)
  // join where build processes and file modifications seen at same time on same host
  on timekey, DvcHostname
  // Limit to only where the file edit happens after the build process starts
  | where BuildProcessTime <= FileEditTime
  | summarize make_set(FileEdited), make_set(FileEditProcess), make_set(FileEditAccount) by timekey, DvcHostname, BuildParentProcess, BuildProcess
  | extend HostCustomEntity=DvcHostname, timestamp=timekey
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
version: 1.0.0