id: cd8d946d-10a4-40a9-bac1-6d0a6c847d65
name: Suspicious access of BEC related documents
description: |
  'This query looks for users with suspicious spikes in the number of files accessed that relate to topics commonly accessed as part of Business Email Compromise (BEC) attacks. The query looks for access to files in storage that relate to topics such as invoices or payments, and then looks for users accessing these files in significantly higher numbers than in the previous 14 days. Incidents raised by this analytic should be investigated to see if the user accessing these files should be accessing them, and if the volume they accessed them at was related to a legitimate business need. 
  This query contains thresholds to reduce the chance of false positives, these can be adjusted to suit individual environments. In addition false positives could be generated by legitimate, scheduled actions that occur less often than every 14 days, additional exclusions can be added for these actions on username or IP address entities. This query uses the imFileEvent schema from ASIM, you will first need to ensure you have ASIM deployed in your environment. Ref https://learn.microsoft.com/azure/sentinel/normalization-about-parsers'
severity: Medium
requiredDataConnectors: []
queryFrequency: 1d
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Collection
relevantTechniques:
  - T1530
eventGroupingSettings:
  aggregationKind: SingleAlert
query: |
  let BEC_Keywords = dynamic(['invoice','invoices','payment','payroll','paycheck','transfer','bank statement','bank details','wire','closing','funds','bank account','account details','iban','ACH','remit','remittance','purchase','deposit','pro-forma','bank',"platnosc","PO#","Zahlung","Rechnung","Paiement", "virement bancaire","Bankuberweisung","virement","hacked","phishing","payrollhelpdesk","direct deposit"]);
  // Adjust these thresholds based on your environment
  let threshold = 10;
  let deviation = 2;
  // Create a baseline of activity
  let baseline_events = (
  imFileEvent
  | where TimeGenerated between (ago(14d)..ago(1d))
    // Remove anonymous access due to noise, monitor for this seperately
  | where isnotempty(User)
  | where User !~ "app@sharepoint"
  | where EventType =~ "FileAccessed"
  | extend OriginalEvent = columnifexists("EventOriginalType","Unknown")
  | where OriginalEvent !~ "FileSyncDownloadedFull"
  | where EventProduct in ("SharePoint 365", "Azure File Storage", "OneDrive" , "SharePoint")
  | where FilePath has_any(BEC_Keywords)
  | extend _AuthDetails = column_ifexists("AuthorizationDetails", "None")
  | extend SPuser = case(gettype(_AuthDetails) == "array", tostring(parse_json(tostring(_AuthDetails[0].principals))[0].id), "Unknown")
  | extend User = case(isnotempty(User), User, SPuser)
    // Look for unique files accessed
  | summarize baseline_file_count=dcount(FileName) by User, bin(TimeGenerated, 1d)
  | summarize baseline_count = avg(baseline_file_count) by User);
  let current_events = materialize(imFileEvent
  | where TimeGenerated > ago(1d)
  | where isnotempty(User)
  | where User !~ "app@sharepoint"
  | where EventType =~ "FileAccessed"
  | extend OriginalEvent = columnifexists("EventOriginalType","Unknown")
  | where OriginalEvent !~ "FileSyncDownloadedFull"
  | where EventProduct in ("SharePoint 365", "Azure File Storage", "OneDrive" , "SharePoint")
  | where FilePath has_any(BEC_Keywords)
  | extend _AuthDetails = column_ifexists("AuthorizationDetails", "None")
  | extend SPuser = case(gettype(_AuthDetails) == "array", tostring(parse_json(tostring(_AuthDetails[0].principals))[0].id), "Unknown")
  | extend User = case(isnotempty(User), User, SPuser));
  current_events
  | summarize number_of_files_accessed = dcount(FilePath), files_accessed=make_set(FilePath, MaxSize=1000) by User, bin(TimeGenerated, 1d)
  // Look for situations where volume of files accessed is significantly above baseline activity
  | where number_of_files_accessed > threshold
  | join kind=inner baseline_events on User
  | where number_of_files_accessed > (baseline_count*deviation)
  | join kind=leftouter current_events on User
  | extend IpAddr = columnifexists("IpAddr", SrcIpAddr)
  | project-reorder TimeGenerated, User, EventType, EventResult, EventProduct, FilePath, HttpUserAgent, IpAddr, number_of_files_accessed, baseline_count, files_accessed
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: User
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IpAddr
  - entityType: File
    fieldMappings:
      - identifier: Name
        columnName: FilePath
alertDetailsOverride:
  alertDisplayNameFormat: Suspicious access of {{number_of_files_accessed}} BEC related documents by {{User}} 
version: 1.0.0
kind: Scheduled