id: b7f1c8d6-6782-44e1-9ed3-21d35d0b338a
name: Malcious URLs clicked in Teams with a SafetyTip
description: |
  This query shows the malicous URLs click by users in Teams and highlights if there was a URL warning SafetyTip applied on the message
description-detailed: |
  This query helps hunt for malicious URLs clicked in Teams with a SafetyTip, using Microsoft Defender for Office 365 and Advance hunting in Microsoft Defender XDR
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - UrlClickEvents
  - MessageUrlInfo
  - MessageEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  //This query shows the malicous URLs click by users in Teams and displays if there was a URL warning SafetyTip applied on the message 
  UrlClickEvents
  | where ThreatTypes !="" and Workload =="Teams"
  | join MessageUrlInfo on Url
  | join MessageEvents on TeamsMessageId
  | project Timestamp, ThreatTypes, ActionType, Workload, TeamsMessageId, SenderEmailAddress, SafetyTip
version: 1.0.0