id: 6610945e-9496-4ef4-9bc4-a511a3f2a477
name: Top malicious URLs clicked by users in Teams
description: |
  This query helps hunt for top malicious URLs clicked by users in Teams  
description-detailed: |
  This query helps hunt for top malicious URLs clicked by users in Teams using Microsoft Defender for Office 365 and Advance hunting in Microsoft Defender XDR
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  //This query shows the top 20 URL's that have a detection associated with it and the most ammount of clicks registered from Microsoft Teams 
  UrlClickEvents
  | where ThreatTypes !="" and Workload =="Teams"
  | summarize count() by Url, ThreatTypes, ActionType, Workload
  | project Url, ThreatTypes, ActionType, Workload, ClickCount=count_
  | top 20 by ClickCount
version: 1.0.0