id: efe27064-6d35-4720-b7f5-e0326695613d
name: URL click on ZAP email
description: |
  In this query, we looking for Url clicks on emails wich get actioned by Zerohour auto purge
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
   - UrlClickEvents
   - Alertinfo
   - AlertEvidence
tactics:
- Initial access
query: |
  AlertInfo
  | where Title contains "Email messages containing malicious URL removed after delivery" and Timestamp > ago (7d)
  | join kind=inner (AlertEvidence| where EntityType == "MailMessage") on AlertId 
  | join UrlClickEvents on NetworkMessageId