id: 809a4327-9041-4fa7-a5f6-57971a926224
name: URL click count by click action
description: |
  This query helps reviewing URL click count by ClickAction
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - UrlClickEvents
tactics:
- Initial access
query: |
  UrlClickEvents 
  | where Timestamp > ago(30d) 
  | extend UrlBlocked = ActionType has_any("ClickBlocked") 
  | extend UrlAllowed = ActionType has_any('ClickAllowed') 
  | extend UrlPendingVerdict = ActionType has_any('UrlScanInProgress') 
  | extend ErrorPage = ActionType has_any('UrlErrorPage') 
  | summarize Blocked = countif(UrlBlocked), Allowed = countif(UrlAllowed), PendingVerdict = countif(UrlPendingVerdict), Error = countif(ErrorPage), ClickedThrough = countif(IsClickedThrough)
