id: 03e61096-20d0-46eb-b8e0-a507dd00a19f
name: URLClick details based on malicious URL click alert
description: |
  In this query, we looking for Url clicks on emails wich are generated the alert-A potentially malicious URL click was detected
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
   - UrlClickEvents
   - Alertinfo
   - AlertEvidence
tactics:
- Initial access
query: |
  AlertInfo
  | where Title contains "Potentially malicious" and Timestamp > ago (30d)
  | join kind=inner (AlertEvidence| where EntityType == "MailMessage") on AlertId 
  | join UrlClickEvents on NetworkMessageId