{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/vimNetworkSessionCiscoFTD')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "Network Session ASIM filtering parser for Cisco FTD",
        "category": "ASIM",
        "FunctionAlias": "vimNetworkSessionCiscoFTD",
        "query": "let parser = (\n    starttime: datetime=datetime(null),\n    endtime: datetime=datetime(null),\n    srcipaddr_has_any_prefix: dynamic=dynamic([]),\n    dstipaddr_has_any_prefix: dynamic=dynamic([]),\n    ipaddr_has_any_prefix: dynamic=dynamic([]),\n    dstportnumber: int=int(null),\n    hostname_has_any: dynamic=dynamic([]),\n    dvcaction: dynamic=dynamic([]),\n    eventresult: string='*',\n    disabled: bool=false,\n    pack: bool=false\n)\n{\n    let FTDBase =\n        CommonSecurityLog\n        | where not(disabled)\n        | where (\n            (isnull(starttime) or TimeGenerated >= starttime)\n            and (isnull(endtime) or TimeGenerated <= endtime)\n            //SourceIP, DestinationIP, IpAddr and DestinationPort filtered after the parse-kv\n        )\n        | where DeviceVendor == \"Cisco\" and DeviceProduct == \"FTD\"\n        | where DeviceEventClassID in (\n            '430001', //intrusion event\n            '430002', //connection event logged at the beginning of the connection\n            '430003', //connection event logged at the end of the connection\n            '430005', //file malware event\n            '430007' //elephant Flow\n        )\n        | project-rename\n            Raw = Message, //Message used in Intrusion logs\n            EventUid = _ItemId,\n            DvcIpAddr = DeviceAddress,\n            EventOriginalType = DeviceEventClassID\n        | extend\n            Raw = trim_start(@'%FTD-\\d+-\\d+:', Raw),\n            Hostname = coalesce(DeviceName, Computer, '')\n        | parse-kv Raw as (\n            DeviceUUID: string,\n            InstanceID: string,\n            FirstPacketSecond: datetime,\n            ConnectionID: string,\n            SrcIP: string,\n            DstIP: string,\n            SrcPort: int,\n            DstPort: int,\n            Protocol: string,\n            IngressInterface: string,\n            EgressInterface: string,\n            ACPolicy: string,\n            AccessControlRuleName: string,\n            IngressVRF: string,\n            EgressVRF: string,\n            IngressZone: string,\n            EgressZone: string,\n            NAPPolicy: string\n        ) with (pair_delimiter=',', kv_delimiter=':')\n        | where (\n            ((array_length(srcipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(SrcIP, srcipaddr_has_any_prefix)))\n            and ((array_length(dstipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(DstIP, dstipaddr_has_any_prefix)))\n            and ((array_length(ipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(DstIP, ipaddr_has_any_prefix)) or (has_any_ipv4_prefix(SrcIP, ipaddr_has_any_prefix)))\n            and (isnull(dstportnumber) or DstPort == dstportnumber)\n            and ((array_length(hostname_has_any) == 0) or (Hostname has_any (hostname_has_any)))\n            //DvcAction and Result filtered in each branch below\n        )\n        | project-rename\n            EventStartTime = FirstPacketSecond,\n            DvcInboundInterface = IngressInterface,\n            DvcOutboundInterface = EgressInterface,\n            DvcId = DeviceUUID,\n            EventOriginalUid = ConnectionID,\n            DvcZone = IngressVRF,\n            DstIpAddr = DstIP,\n            SrcIpAddr = SrcIP,\n            SrcPortNumber = SrcPort,\n            DstPortNumber = DstPort,\n            DstZone = EgressZone,\n            NetworkRuleName = AccessControlRuleName,\n            Rule = ACPolicy,\n            DvcDescription = NAPPolicy,\n            DvcInterface = InstanceID\n        | extend\n            EventEndTime = TimeGenerated,\n            EventProductVersion = tostring(split(Raw, '-')[1]),\n            NetworkProtocol = toupper(Protocol)\n    ;\n    let Intrusion =\n        FTDBase\n        | where EventOriginalType == '430001'\n        | parse-kv Raw as (\n            Priority: string,\n            GID: int,\n            SID: int,\n            Revision: int,\n            Message: string,\n            Classification: string,\n            IntrusionPolicy: string,\n            InlineResult: string,\n            SnortRuleGroups: string,\n            MitreAttackGroups: string\n        ) with (pair_delimiter=',', kv_delimiter=':')\n        | project-rename\n            EventOriginalResultDetails = InlineResult,\n            EventMessage = Message,\n            EventOriginalSeverity = Priority,\n            NetworkRuleNumber = SID,\n            ThreatCategory = Classification\n        | extend\n            ThreatName = EventMessage,\n            ThreatId = strcat(GID, ':', NetworkRuleNumber, ':', Revision)\n        | extend\n            EventResult = iff(EventOriginalResultDetails in ('Alert', 'Block', 'Would block'), 'Success', 'Failure'),\n            DvcAction = case(\n                EventOriginalResultDetails in ('Alert', 'Would block'), 'Allow',\n                EventOriginalResultDetails == 'Block', 'Deny',\n                ''\n            ),\n            EventSeverity = case(\n                EventOriginalSeverity == '1', 'High',\n                EventOriginalSeverity == '2', 'Medium',\n                EventOriginalSeverity == '3', 'Low',\n                'Informational'\n            )\n        | where (\n            ((array_length(dvcaction) == 0) or (DvcAction has_any (dvcaction)))\n            and ((eventresult == \"*\") or (EventResult == eventresult))\n        )\n        | extend\n            EventType = 'IDS',\n            EventResultDetails = case(\n                EventOriginalResultDetails == 'Would block', 'Simulation',\n                EventOriginalResultDetails == 'Block', 'Terminated',\n                'NA'\n            ),\n            AdditionalFields = iff(\n                pack,\n                bag_pack(\n                    'IntrusionPolicy', IntrusionPolicy,\n                    'SnortRuleGroups', SnortRuleGroups,\n                    'MitreAttackGroups', MitreAttackGroups\n                ),\n                dynamic({})\n            )\n    ;\n    let Connections =\n        FTDBase\n        | where EventOriginalType in (\n            '430002',\n            '430003',\n            '430007'\n        )\n        | parse-kv Raw as (\n            EventPriority: string,\n            AccessControlRuleAction: string,\n            ['Prefilter Policy']: string,\n            User: string,\n            InitiatorPackets: long,\n            ResponderPackets: long,\n            InitiatorBytes: long,\n            ResponderBytes: long,\n            ClientAppDetector: string,\n            Client: string,\n            ApplicationProtocol: string,\n            ConnectionDuration: int,\n            DNSQuery: string,\n            DNSRecordType: string,\n            DNSResponseType: string,\n            DNS_TTL: long,\n            ReferencedHost: string,\n            AccessControlRuleReason: string,\n            SLActualAction: string,\n            SSLExpectedAction: string,\n            URL: string,\n            NAT_InitiatorPort: int,\n            NAT_ResponderPort: int,\n            NAT_InitiatorIP: string,\n            NAT_ResponderIP: string,\n            EVE_Fingerprint: string,\n            EVE_Process: string,\n            EVE_ProcessConfidencePct: string,\n            EVE_ThreatConfidencePct: int,\n            EVE_ThreatConfidenceIndex: string\n        ) with (pair_delimiter=',', kv_delimiter=':')\n        | project-rename\n            PrefilterPolicy = ['Prefilter Policy'],\n            EventOriginalResultDetails = AccessControlRuleAction,\n            EventOriginalSeverity = EventPriority,\n            NetworkApplicationProtocol = ApplicationProtocol,\n            NetworkDuration = ConnectionDuration,\n            DstBytes = ResponderBytes,\n            SrcBytes = InitiatorBytes,\n            DstPackets = ResponderPackets,\n            SrcPackets = InitiatorPackets,\n            SrcUsername = User,\n            SrcAppName = Client,\n            ThreatCategory = AccessControlRuleReason,\n            SrcNatIpAddr = NAT_InitiatorIP,\n            SrcNatPortNumber = NAT_InitiatorPort,\n            DstNatIpAddr = NAT_ResponderIP,\n            DstNatPortNumber = NAT_ResponderPort\n        | extend\n            EventResult = case(\n                EventOriginalResultDetails in ('Block', 'Block with reset'), 'Failure', \n                EventOriginalResultDetails in ('Allow', 'Fastpath', 'Trust'), 'Success',\n                ''\n                ),\n            DvcAction = case(\n                EventOriginalResultDetails in ('Allow', 'Fastpath', 'Trust'), 'Allow',\n                EventOriginalResultDetails == 'Block', 'Deny',\n                EventOriginalResultDetails == 'Block with reset', 'Reset',\n                ''\n            ),\n            EventSeverity = case(\n                EventOriginalSeverity =~ 'High', 'High',\n                EventOriginalSeverity =~ 'Medium', 'Medium',\n                EventOriginalSeverity =~ 'Low', 'Low',\n                'Informational'\n            )\n        | where (\n            ((array_length(dvcaction) == 0) or (DvcAction has_any (dvcaction)))\n            and ((eventresult == \"*\") or (EventResult == eventresult))\n        )\n        | extend\n            EventType = 'NetworkSession',\n            EventResultDetails = case(\n                EventOriginalResultDetails in ('Block', 'Drop'), 'Terminated',\n                EventOriginalResultDetails == 'Block with reset', 'Reset',\n                EventOriginalResultDetails in ('Allow', 'Fastpath', 'Trust'), 'NA',\n                'Unknown'\n            ),\n            ThreatConfidence = EVE_ThreatConfidencePct,\n            EventReportUrl = coalesce(URL, DNSQuery),\n            EventSubType = case(\n                EventOriginalType == '430002', 'Start',\n                EventOriginalType == '430003', 'End',\n                ''\n            ),\n            EventMessage = strcat(SrcIpAddr, ':', SrcPortNumber, ' -> ', DstIpAddr, ':', DstPortNumber, ' [', EventOriginalResultDetails, ']'),\n            NetworkBytes = DstBytes + SrcBytes,\n            NetworkPackets = DstPackets + SrcPackets,\n            AdditionalFields = iff(\n                pack,\n                bag_pack(\n                    'PrefilterPolicy', PrefilterPolicy,\n                    'DNSQuery', DNSQuery,\n                    'DNSRecordType', DNSRecordType,\n                    'DNSResponseType', DNSResponseType,\n                    'DNS_TTL', DNS_TTL,\n                    'ReferencedHost', ReferencedHost,\n                    'SLActualAction', SLActualAction,\n                    'SSLExpectedAction', SSLExpectedAction,\n                    'URL', URL,\n                    'EVE_Fingerprint', EVE_Fingerprint,\n                    'EVE_Process', EVE_Process,\n                    'EVE_ProcessConfidencePct', EVE_ProcessConfidencePct,\n                    'EVE_ThreatConfidencePct', EVE_ThreatConfidencePct,\n                    'EVE_ThreatConfidenceIndex', EVE_ThreatConfidenceIndex\n                ),\n                dynamic({})\n            )\n    ;\n    let File =\n        FTDBase\n        | where EventOriginalType == '430005'\n        | parse-kv Raw as (\n            FileDirection: string,\n            FileAction: string,\n            FileSHA256: string,\n            SHA_Disposition: string,\n            SperoDisposition: string,\n            ThreatName: string,\n            ThreatScore: string,\n            FileName: string,\n            FileType: string,\n            FileSize: string,\n            Client: string,\n            WebApplication: string,\n            FilePolicy: string,\n            FileStorageStatus: string,\n            FileSandboxStatus: string,\n            URI: string\n        ) with (pair_delimiter=',', kv_delimiter=':')\n        | project-rename\n            EventOriginalResultDetails = FileAction,\n            SrcAppName = Client,\n            ThreatOriginalRiskLevel = ThreatScore,\n            EventReportUrl = URI,\n            ThreatCategory = SHA_Disposition\n        | extend\n            ThreatRiskLevel = toint(ThreatOriginalRiskLevel)\n        | extend\n            EventResult = iff(EventOriginalResultDetails == 'Malware Block', 'Success', 'Failure'),\n            DvcAction = case(\n                EventOriginalResultDetails == 'Malware Block', 'Deny',\n                isnotempty(EventOriginalResultDetails), 'Allow',\n                ''\n            ),\n            EventSeverity = case(\n                EventOriginalResultDetails != 'Malware Block', 'High',\n                isnotempty(EventOriginalResultDetails), 'Low',\n                'Informational'\n            )\n        | where (\n            ((array_length(dvcaction) == 0) or (DvcAction has_any (dvcaction)))\n            and ((eventresult == \"*\") or (EventResult == eventresult))\n        )\n        | extend\n            EventType = 'EndpointNetworkSession',\n            EventResultDetails = case(\n                EventOriginalResultDetails == 'Malware Block', 'Terminated',\n                isnotempty(EventOriginalResultDetails), 'NA',\n                'Unknown'\n            ),\n            EventMessage = strcat(SrcIpAddr, ':', SrcPortNumber, ' -> ', DstIpAddr, ':', DstPortNumber, ' [', FileName, ' - ', EventOriginalResultDetails, ']'),\n            SrcAppType = 'Other',\n            NetworkDirection = case(\n                FileDirection =~ 'Download', 'Inbound',\n                FileDirection =~ 'Upload', 'Outbound',\n                ''\n            ),\n            AdditionalFields = iff(\n                pack,\n                bag_pack(\n                    'FileDirection', FileDirection,\n                    'FileSHA256', FileSHA256,\n                    'SperoDisposition', SperoDisposition,\n                    'FileName', FileName,\n                    'FileType', FileType,\n                    'FileSize', FileSize,\n                    'WebApplication', WebApplication,\n                    'FilePolicy', FilePolicy,\n                    'FileStorageStatus', FileStorageStatus,\n                    'FileSandboxStatus', FileSandboxStatus\n                ),\n                dynamic({})\n            )\n    ;\n    union Intrusion, Connections, File\n    | extend DvcIpAddr = iff(DvcIpAddr != 'Unknown IP', DvcIpAddr, '')\n    | project\n        //Common columns\n        TimeGenerated,\n        Type,\n        EventUid,\n        DvcIpAddr,\n        EventOriginalType,\n        EventStartTime,\n        DvcInboundInterface,\n        DvcOutboundInterface,\n        DvcId,\n        EventOriginalUid,\n        DvcZone,\n        DstIpAddr,\n        SrcIpAddr,\n        SrcPortNumber,\n        DstPortNumber,\n        DstZone,\n        DvcInterface,\n        EventEndTime,\n        EventProductVersion,\n        NetworkProtocol,\n        EventOriginalResultDetails,\n        EventMessage,\n        ThreatCategory,\n        EventResultDetails,\n        EventType,\n        EventResult,\n        DvcAction,\n        EventSeverity,\n        AdditionalFields,\n        Hostname,\n        //Columns not available in all branches\n        NetworkRuleName = column_ifexists('NetworkRuleName', ''),\n        DvcDescription = column_ifexists('DvcDescription', ''),\n        EventOriginalSeverity = column_ifexists('EventOriginalSeverity', ''),\n        NetworkRuleNumber = column_ifexists('NetworkRuleNumber', int(null)),\n        ThreatName = column_ifexists('ThreatName', ''),\n        ThreatId = column_ifexists('ThreatId', ''),\n        NetworkApplicationProtocol = column_ifexists('NetworkApplicationProtocol', ''),\n        NetworkDuration = column_ifexists('NetworkDuration', int(null)),\n        DstBytes = column_ifexists('DstBytes', long(null)),\n        SrcBytes = column_ifexists('SrcBytes', long(null)),\n        DstPackets = column_ifexists('DstPackets', long(null)),\n        SrcPackets = column_ifexists('SrcPackets', long(null)),\n        SrcUsername = column_ifexists('SrcUsername', ''),\n        SrcAppName = column_ifexists('SrcAppName', ''),\n        EventReportUrl = column_ifexists('EventReportUrl', ''),\n        EventSubType = column_ifexists('EventSubType', ''),\n        NetworkBytes = column_ifexists('NetworkBytes', long(null)),\n        NetworkPackets = column_ifexists('NetworkPackets', long(null)),\n        ThreatOriginalRiskLevel = column_ifexists('ThreatOriginalRiskLevel', ''),\n        ThreatRiskLevel = column_ifexists('ThreatRiskLevel', int(null)),\n        SrcAppType = column_ifexists('SrcAppType', ''),\n        NetworkDirection = column_ifexists('NetworkDirection', ''),\n        SrcNatIpAddr = column_ifexists('SrcNatIpAddr', ''),\n        SrcNatPortNumber = column_ifexists('SrcNatPortNumber', int(null)),\n        DstNatIpAddr = column_ifexists('DstNatIpAddr', ''),\n        DstNatPortNumber = column_ifexists('DstNatPortNumber', int(null)),\n        ThreatConfidence = column_ifexists('ThreatConfidence', int(null))\n    | extend\n        EventCount = int(1),\n        EventSchema = 'NetworkSession',\n        EventSchemaVersion = '0.2.7',\n        EventProduct = 'FTD',\n        EventVendor = 'Cisco',\n        DvcInterface = DvcInboundInterface,\n        DvcIdType = 'Other',\n        DvcOriginalAction = EventResultDetails,\n        Dvc = DvcId,\n        IpAddr = SrcIpAddr,\n        Duration = NetworkDuration,\n        Dst = DstIpAddr,\n        SrcUsernameType = case(\n            SrcUsername has '@', 'UPN',\n            SrcUsername has @'\\', 'Windows',\n            SrcUsername =~ 'Not Found', '',\n            isnotempty(SrcUsername), 'Simple',\n            ''\n        ),\n        Rule = tostring(NetworkRuleNumber),\n        ASimMatchingIpAddr = case(\n            array_length(ipaddr_has_any_prefix) == 0, '',\n            has_any_ipv4_prefix(SrcIpAddr, ipaddr_has_any_prefix) and has_any_ipv4_prefix(DstIpAddr, ipaddr_has_any_prefix), 'Both',\n            has_any_ipv4_prefix(SrcIpAddr, ipaddr_has_any_prefix), 'SrcIpAddr',\n            has_any_ipv4_prefix(DstIpAddr, ipaddr_has_any_prefix), 'DstIpAddr',\n            ''\n        )\n};\nparser(\n    starttime: starttime,\n    endtime: endtime,\n    srcipaddr_has_any_prefix: srcipaddr_has_any_prefix,\n    dstipaddr_has_any_prefix: dstipaddr_has_any_prefix,\n    ipaddr_has_any_prefix: ipaddr_has_any_prefix,\n    dstportnumber: dstportnumber,\n    hostname_has_any: hostname_has_any,\n    dvcaction: dvcaction,\n    eventresult: eventresult,\n    disabled: disabled,\n    pack: pack\n)",
        "version": 1,
        "functionParameters": "starttime:datetime=datetime(null),endtime:datetime=datetime(null),srcipaddr_has_any_prefix:dynamic=dynamic([]),dstipaddr_has_any_prefix:dynamic=dynamic([]),ipaddr_has_any_prefix:dynamic=dynamic([]),dstportnumber:int=int(null),hostname_has_any:dynamic=dynamic([]),dvcaction:dynamic=dynamic([]),eventresult:string='*',disabled:bool=False,pack:bool=False"
      }
    }
  ]
}