id: 059b9184-5cd2-41f6-8450-8cea3a881a01
name: incident reports. 
description: |  incident reports. 
severity: Information
requiredDataConnectors:
  - connectorId: SecurityIncident
    dataTypes:
      - SecurityEvent
tactics:
  - NA
relevantTechniques:
  - NA

query: |

SecurityIncident
| where Status contains "closed"
| extend create_day = startofday(CreatedTime)
| extend closed_day = startofday(ClosedTime)
| extend create_week_day =  startofweek(CreatedTime)
| extend closed_week_day = startofweek(ClosedTime)
| extend create_month =  startofmonth(CreatedTime)
| extend closed_month = startofmonth(ClosedTime)
| extend Incident_Closed_On_SameDay = iif(create_day == closed_day, "This Incident is  closed on Same day", "" )
| extend Incident_Closed_In_Same_Week = iif( create_week_day == closed_week_day , "This Incident is  closed in Same Week", "" )
| extend Incident_Closed_In_Same_Month = iif( create_month  == closed_month , "This Incident is  closed in Same Month", "" )
| project  Title, IncidentName, IncidentNumber, Status, CreatedTime, ClosedTime, Incident_Closed_On_SameDay, Incident_Closed_In_Same_Week, Incident_Closed_In_Same_Month


// We can also use the below line for further formatting. Just remove the last line that has 'project ' and use the below line instead. 
//| summarize count() by Incident_Closed_In_Same_Month, Incident_Closed_In_Same_Week, Incident_Closed_On_SameDay
//or 
//| summarize arg_max(TimeGenerated, *) by LastModifiedTime
//to find the unique incidents that are updated recently. 
