id: f6354c94-3a95-4235-8530-414f016a7bf6
name: Inbound emails with QR code URLs
description: |
  In this query, we summarize volume of inbound emails with QR code URLs in last 30 days
description-detailed: |
  In this query, we summarize volume of inbound emails with QR code URLs in last 30 days using Defender for Office 365 data.
  Reference - https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/hunting-and-responding-to-qr-code-based-phishing-attacks-with/ba-p/4074730
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
  - EmailUrlInfo
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where Timestamp > ago(30d)
  | where EmailDirection == "Inbound"
  | join EmailUrlInfo on NetworkMessageId
  | where UrlLocation == "QRCode"
  | summarize dcount(NetworkMessageId) by bin(Timestamp, 1d)
  | render timechart
version: 1.0.0 