Parser:
  Title: ASIM M365 Defender for Endpoint Registry Events Parser
  Version: '0.1'
  LastUpdated: June 29, 2021
Product:
  Name: Microsoft 365 Defender
Normalization:
  Schema: RegistryEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/AzSentinelRegistryEventsDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: ASIM M365 Defender for endpoint Registry Events Parser
ParserName: vimRegistryEventMicrosoft365D
ParserQuery: |
              let ProcessEvents_M365D=()
              {
                DeviceRegistryEvents
                | extend
                  // Event
                  EventOriginalUid = tostring(ReportId), 
                  EventCount = int(1), 
                  EventProduct = 'M365 Defender for Endpoint', 
                  EventVendor = 'Microsoft', 
                  EventSchemaVersion = '0.1.0', 
                  EventStartTime = todatetime(TimeGenerated), 
                  EventEndTime = todatetime(TimeGenerated), 
                  EventType = ActionType 

                  // Registry
                  RegistryKey = iff (ActionType in ("RegistryKeyDeleted", "RegistryValueDeleted"), PreviousRegistryKey, RegistryKey),
                  RegistryValue = iff (ActionType == "RegistryValueDeleted", PreviousRegistryValueName, RegistryValueName),
                  // RegistryValueType -- original name is fine 
                  // RegistryValueData -- original name is fine 
                  RegistryKeyModified = iff (ActionType == "RegistryKeyRenamed", PreviousRegistryKey, ""),
                  RegistryValueModified = iff (ActionType == "RegistryValueSet", PreviousRegistryValueName, ""),
                  // RegistryValueTypeModified -- Recommended only
                  RegistryValueDataModified = PreviousPreviousValueData,

                  // Device
                  DvcHostname = DeviceName, 
                  DvcId = DeviceId, 
                  DvcOs = 'Windows', 
                  Dvc = DeviceName 

                  // Users
                | extend
                  ActorUsername = iff (InitiatingProcessAccountDomain == '', InitiatingProcessAccountName, strcat(InitiatingProcessAccountDomain, '\\', InitiatingProcessAccountName)), 
                  ActorUsernameType = iff(InitiatingProcessAccountDomain == '','Simple', 'Windows'), 
                  ActorUserIdType = 'SID', 
 
                | project-rename
                  ActorUserId = InitiatingProcessAccountSid, 

                  ActorUserAadId = InitiatingProcessAccountObjectId, 
                  ActorUserUpn = InitiatingProcessAccountUpn, 

                  // Processes
                | extend
                  ActingProcessId = tostring(InitiatingProcessId), 
                  ParentProcessId = tostring(InitiatingProcessParentId) 

                | project-rename
                  ParentProcessName = InitiatingProcessFolderPath, 

                  ParentProcessCreationTime = InitiatingProcessParentCreationTime, 

                  ActingProcessName = InitiatingProcessFolderPath, 
                  ActingProcessCommandLine = InitiatingProcessCommandLine, 

                  ActingProcessMD5 = InitiatingProcessMD5, 
                  ActingProcessSHA1 = InitiatingProcessSHA1, //OK
                  ActingProcessSHA256 = InitiatingProcessSHA256, 
                  ActingProcessIntegrityLevel = InitiatingProcessIntegrityLevel, 
                  ActingProcessTokenElevation = InitiatingProcessTokenElevation, 
                  ActingProcessCreationTime = InitiatingProcessCreationTime 

                  // ActingProcessFileSize = InitiatingProcessFileSize, 
                  // ActingProcessCompany = InitiatingProcessVersionInfoCompanyName, 
                  // ActingProcessFileProduct = InitiatingProcessVersionInfoProductName, 
                  // ActingProcessFileVersion = InitiatingProcessVersionInfoProductVersion, 
                  // ActingProcessFileInternalName = InitiatingProcessVersionInfoInternalFileName, 
                  // ActingProcessFileOriginallName = InitiatingProcessVersionInfoOriginalFileName, 
                  // ActingProcessFileDescription = InitiatingProcessVersionInfoFileDescription 

                  // -- aliases
                | extend 
                  Username = ActorUsername,
                  UserId = ActorUserId
                  UserIdType = ActorUserIdType
                  User = ActorUsername,
                  CommandLine = TargetProcessCommandLine,
                  Process = TargetProcessName


               };
               RegistryEvents_M365D