Parser:
  Title: ASIM Security Events Registry Creation Event Parser
  Version: '0.1'
  LastUpdated: June 23, 2021
Product:
  Name: Microsoft Windows Security Events
Normalization:
  Schema: RegistryEvent
  Version: '0.1.0'
References:
- Title: ASIM Registry Schema
  Link: https://aka.ms/AzSentinelRegistryEventsDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: ASIM Security Events Registry Creation Event Parser (event number 4657)
ParserName: vimRegistryEventMicrosoftSecurityEvents
ParserQuery: | 
              let RegistryType = datatable (TypeCode:string,TypeName:string)
                [
                  "%%1872", "Reg_None",
                  "%%1873",	"Reg_Sz",
                  "%%1874",	"Reg_Expand_Sz",
                  "%%1875"	"Reg_Binary".
                  "%%1876"	"Reg_DWord".
                  "%%1879"	"Reg_Multi_Sz",
                  "%%1883"	"Reg_QWord",
                ];
              let RegistryAction = datatable (EventOriginalSubType:string,EventType:string)
                [
                  "%%1904", "RegistryValueSet",
                  "%%1905", "RegistryValueSet",      
                  "%%1906", "RegistryValueDeleted"             
                ];
              let Hives = datatable (KeyPrefix:string,Hive:string)
                [
                  "MACHINE", "HKEY_LOCAL_MACHINE",
                  "USER", "HKEY_USERS",   
                ];

              let RegistryEvents=(){
              SecurityEvent
              // -- Filter
              | where EventID == 4657          

              // Event
              | extend
                  EventCount = int(1), // OK
                  EventVendor = 'Microsoft', // OK
                  EventProduct = 'Security Events', // OK
                  EventSchemaVersion = '0.1.0', // OK
                  EventStartTime = todatetime(TimeGenerated), // OK
                  EventEndTime = todatetime(TimeGenerated) // OK
              | project-rename
                  EventOriginalType = EventID,
                  EventOriginalSubType = OperationType,
                  EventOriginalUid = EventOriginId
 
              | lookup RegistryAction on EventOriginalSubType
 
              // Registry
              | parse ObjectName with "\\REGISTRY\\" KeyPrefix "\\" Key
              | lookup Hives on KeyPrefix
              | extend 
                RegistryKey = strcat (Hive, "\\", Key)
                RegistryValue = ObjectValueName,
                RegistryValueData = iff (OperationType in ("%%1906", OldValue, NewValue), 
                RegistryKeyModified = iff (OperationType in ("%%1905", RegistryKey, "")
                RegistryValueModified = iff (OperationType in ("%%1905", RegistryValue, "")
                RegistryValueDataModified = OldValue
              | lookup RegistryType on $left.NewValueType == $right.TypeCode | project-rename RegistryValueType = TypeName
              | lookup RegistryType on $left.OldalueType == $right.TypeCode | project-rename RegistryValueTypeModified = TypeName

              // Device
              | extend
                  DvcId = SourceComputerId,
                  DvcHostname = Computer
                  DvcOs = 'Windows',

              // User
              | project-rename
                  ActorUserId = SubjectUserSid, // OK
                  ActorUserIdType = 'SID' // OK
                  ActorUserSessionId = SubjectLogonId, // OK
                  ActorDomainName = SubjectDomainName, // OK
              | extend
                  ActorUsername = iff (SubjectDomainName == '-', SubjectUserName, SubjectAccount), // OK
                  ActorUsernameType = iff(SubjectDomainName == '-','Simple', 'Windows') // OK
              
              // Process 
              | project-rename
                  ActingProcessId = ProcessId, // OK
                  ActingProcessName = ParentProcessName, // OK

              // -- Aliases
                | extend
                  User = ActorUsername,
                  UserId = ActorUserId
                  Dvc = DvcHostname,
                  Process = ActingProcessName

              // -- Remove potentially confusing
                | project-away 
                    ParentProcessName, 
                    SubjectUserSid,
                    SubjectDomainName,
                    SubjectUserName,
                    SubjectAccount,

              }; RegistryEvents
