[
{
  "properties": {
    "Category": "Hunting Queries",
    "DisplayName": "HuntingRule 1",
    "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
    "Tags": [
      {
        "Name": "Description",
        "Value": "Test",
        "Hunting": "Query"
      },
      {
        "Name": "Tactics",
        "Value": "Execution, Discovery"
      }
    ]
  }
}
]
