Parser:
  Title: Empty Authentication Table
  Version: '0.0'
  LastUpdated: June 9, 2021
Product:
  Name: Azure Sentinel
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/AzSentinelAuthenticationDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
      This Query creates an empty table of the authentication schema.
ParserName: vimAuthenticationEmpty
ParserQuery: |
  let EmptyAuthenticationTable=(){
  let schema=datatable(
      EventProduct:string
    , EventProductVersion: string
    , EventVendor:string
    , EventCount:int
    , EventReportUrl:string
    , EventSchemaVersion:string
    , TimeGenerated:datetime
    , EventOriginalUid:string
    , EventOriginalType:string
    , EventMessage:string
    , EventResult:string
    , EventResultDetails:string
    , EventOriginalResultDetails:string
    , EventStartTime:datetime
    , EventEndTime:datetime
    , EventType:string
    , EventSubType:string
    , ActorSessionId:string
    , TargetSessionId:string
    , ActorUserId:string
    , ActorUsername:string
    , ActorUserType:string
    , TargetUserId:string
    , TargetUsername:string
    , TargetUserType:string
    , SrcDvcId:string
    , SrcDvcHostname:string
    , SrcDvcType:string
    , SrcDvcIpAddr:string
    , SrcDvcOs:string
    , HttpUserAgent:string
    , SrcIsp:string
    , SrcGeoCity:string
    , SrcGeoCountry:string
    , SrcGeoRegion:string
    , SrcGeoLatitude:real
    , SrcGeoLongitude:real
    , ActingAppId:string
    , ActingAppName:string
    , ActingAppType:string
    , TargetAppId:string
    , TargetAppName:string
    , TargetAppType:string
    , TargetDvcId:string
    , TargetDvcHostname:string
    , TargetDvcType:string
    , TargetDvcIpAddr:string
    , TargetDvcOs:string
    , TargetUrl:string
    , TargetPortNumber:int
    , _ResourceId:string
    , LogonMethod: string	
    , LogonProtocol: string	
    , ActorUserIdType: string	 
    , ActorUsernameType: string	 
    , TargetUserIdType: string	
    , TargetUsernameType: string	
    , User: string	
    , SrcDvcHostnameType: string	
   	, LogonTarget: string	 
  	, TargetDvcHostnameType: string	
    , TargetDvc: string	
    , Dvc: string	
    , DvcIpAddr: string	
    , DvcHostname: string
    , AdditionalFields:dynamic
    )[];
    schema
  };
  EmptyAuthenticationTable
