Parser:
  Title: Azure active directory non interactive authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure active directory nonInteractive signin logs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  TODO
ParserName: vimAuthAADNonInteractiveUserSignInLogs
ParserQuery: |
  let AADNIAuthentication=(){
  AADNonInteractiveUserSignInLogs
  | extend
      EventVendor = "Microsoft"
      , EventProduct = "Azure Active Directory"
      , EventResult = iff (ResultType ==0, "Success", "Failure")
      , EventResultDetails= ResultType
      , EventOriginalResultDetails = ResultDescription
      , EventStartTime = TimeGenerated
      , EventEndTime= TimeGenerated
      , RiskEventType= "Logon"
      , SrcDvcId=tostring(todynamic(DeviceDetail).deviceId)
      , SrcDvcHostname=tostring(todynamic(DeviceDetail).displayName)
      , SrcDvcOs=tostring(todynamic(DeviceDetail).operatingSystem)
      , HttpUserAgentOriginal=UserAgent
      , HttpUserAgentName= tostring(todynamic(DeviceDetail).browser)
      , SrcGeoCity=tostring(todynamic(LocationDetails).city)
      , SrcGeoCounty=tostring(todynamic(LocationDetails).countryOrRegion)
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , ResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
      , ActorUserType="NonInteractive"
      , ActorUserNameType='Upn'
      , ActorUserIdType='AADID'
     // , ResourceName=ResourceDisplayName
  | project-rename
      EventUid =Id
      , EventOriginalId = ResultType
      , EventKind = AuthenticationRequirement /// ???
      , TargetSessionId=CorrelationId
      , SessionDuration= DurationMs
      , ActorUserId = UserId
      , ActorUserName=UserPrincipalName
      , SrcDvcIp=IPAddress
     , AppName=AppDisplayName
  | project-reorder
      TimeGenerated
      ,EventProduct
      , EventUid
      , EventOriginalId
      , EventResult
      , EventResultDetails
      , EventOriginalResultDetails
      , EventStartTime
      , EventEndTime
      , EventKind
      , TargetSessionId
      , SessionDuration
      , ActorUserId
      , ActorUserName
      , SrcDvcId
      , SrcDvcHostname
      , SrcDvcOs
      , ResourceId
      , HttpUserAgentOriginal 
      , HttpUserAgentName
      , SrcGeoCity
      , SrcGeoLocation
      , AppId
      , AppName};
      AADNIAuthentication