Parser:
  Title: Azure active directory authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure SigninLogs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
  This Query Parser maps Azure Active Directory Signin logs (SigninLogs) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAuthSigninLogs
ParserQuery: |
  let AADSI=(){
  SigninLogs
  | extend
    EventVendor = "Microsoft"
    , EventProduct = "Azure Active Directory"
    , EventResult = iff (ResultType ==0, "Success", "Failure")
    , EventResultDetails= ResultType
    , EventOriginalResultDetails = ResultDescription
    , EventStartTime = TimeGenerated
    , EventEndTime= TimeGenerated
    , EventType= "Logon"
    , SrcHostId=tostring(DeviceDetail.deviceId)
    , SrcHostname=tostring(DeviceDetail.displayName)
    , SrcHostOs=tostring(DeviceDetail.operatingSystem)
    , HttpUserAgent=UserAgent
    , SrcBrowser= tostring(DeviceDetail.browser)
    , SrcGeoCity=LocationDetails.city
    , SrcGeoCountry=LocationDetails.countryOrRegion
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , ActorUserNameType='Upn'
      , ActorUserIdType='AADID'
      , _ResourceId=ResourceId
    , ResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
   // , ResourceName=ResourceDisplayName
   | project-rename
       EventOriginalUid =Id
       , AuthenticationMethod  = AuthenticationRequirement
       , TargetSessionId=CorrelationId
       , SessionDuration= DurationMs
       , ActorUserId = UserId
       , ActorUserName=UserPrincipalName
       , ActorUserType=UserType
       , SrcDvcIp=IPAddress
       , AppName=AppDisplayName
   | project-reorder
       TimeGenerated
       ,EventProduct
       , EventOriginalUid
       , EventResult
       , EventResultDetails
       , EventOriginalResultDetails
       , EventStartTime
       , EventEndTime
       , AuthenticationMethod 
       , TargetSessionId
       , SessionDuration
       , ActorUserId
       , ActorUserName
       , SrcHostId
       , SrcHostname
       , SrcHostOs
       , _ResourceId
       , HttpUserAgent 
       , SrcBrowser
       , SrcGeoCity
       , SrcGeoLocation
       , AppId
       , AppName];
       AADSI