Parser:
  Title: Azure active directory service principal authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure active directory service principal signin logs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
  This Query Parser maps Azure Active Directory Service Principal sign in logs (AADServicePrincipalSignInLogs) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAADServicePrincipalSignInLogs
ParserQuery: |
  let AADSP=(){
  AADServicePrincipalSignInLogs
  | extend
      EventVendor = "Microsoft"
      , EventProduct = "Azure Active Directory"
      , EventResult = iff (ResultType ==0, "Success", "Failure")
      , EventResultDetails= ResultType
      , EventOriginalResultDetails = ResultDescription
      , EventStartTime = TimeGenerated
      , EventEndTime= TimeGenerated
      , EventType= "Logon"
      , SrcGeoCity=tostring(todynamic(LocationDetails).city)
      , SrcGeoCounty=tostring(todynamic(LocationDetails).countryOrRegion)
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , ResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
     // , ResourceName=ResourceDisplayName
     , ActorUserType="ServicePrincipal"
     , ActorUserNameType='Upn'
     , ActorUserIdType='AADID'
  | project-rename
      EventUid =Id
      , EventOriginalId = ResultType
      , TargetSessionId=CorrelationId
      , SessionDuration= DurationMs
      , SrcIpAddr=IPAddress
  | project-reorder
      TimeGenerated
      ,EventProduct
      , EventUid
      , EventOriginalId
      , EventResult
      , EventResultDetails
      , EventOriginalResultDetails
      , EventStartTime
      , EventEndTime
      , TargetSessionId
      , SessionDuration
      , ResourceId
      , SrcGeoCity
      , SrcGeoLocation
      , AppId};
      AADSP