Parser:
  Title: Amazon web services authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Amazon web services cloud trail
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  TODO
ParserName: vimAuthAWSCloudTrail
ParserQuery: |
  AWSCloudTrail
   | where EventName == "ConsoleLogin"
   | extend
    EventVendor = "Amazon"
    , EventResult= iff (ResponseElements has_cs "Success", "Success", "Failure")
    // , EventResultDetais
    , EvventStartTime=TimeGenerated
    , EventEndTime=TimeGenerated
    , EventType="Logon"
    , EventKind=iff(AdditionalEventData has '"MFAUsed": "No"', "No", "Yes")
    // SessionId
    // SessionDuration
    , urlOriginal=tostring(todynamic(AdditionalEventData).LoginTo)
    | project-rename
    EventProduct=SourceSystem // maybe prefer literal string "AWSCloudTrail"
    , EventUid= AwsEventId
    , EventOriginalResultDetails= ErrorMessage
    , ActorUserId = UserIdentityPrincipalid /// 
    , ActorUserName= UserIdentityUserName
    , ActorUserType=UserIdentityType
    , TargetUserId=UserIdentityAccountId
    , SrcDvcIpAddr=SourceIpAddress
    , HttpUserAgentOriginal=UserAgent
    , DstGeoRegion=AWSRegion
