Parser:
  Title: Azure active directory authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure SigninLogs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  TODO
ParserName: vimAuthSigninLogs
ParserQuery: |
  let AADSI=(){
  SigninLogs
  | extend
    EventVendor = "Microsoft"
    , EventProduct = "Azure Active Directory"
    , EventResult = iff (ResultType ==0, "Success", "Failure")
    , EventResultDetails= ResultType
    , EventOriginalResultDetails = ResultDescription
    , EventStartTime = TimeGenerated
    , EventEndTime= TimeGenerated
    , RiskEventType= "Logon"
    , SrcDvcId=tostring(DeviceDetail.deviceId)
    , SrcDvcHostname=tostring(DeviceDetail.displayName)
    , SrcDvcOs=tostring(DeviceDetail.operatingSystem)
    , HttpUserAgentOriginal=UserAgent
    , HttpUserAgentName= tostring(DeviceDetail.browser)
    , SrcGeoCity=LocationDetails.city
    , SrcGeoCounty=LocationDetails.countryOrRegion
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , ActorUserNameType='Upn'
      , ActorUserIdType='AADID'
    , ResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
   // , ResourceName=ResourceDisplayName
   | project-rename
       EventUid =Id
       , EventOriginalId = ResultType
       , EventKind = AuthenticationRequirement /// ???
       , TargetSessionId=CorrelationId
       , SessionDuration= DurationMs
       , ActorUserId = UserId
       , ActorUserName=UserPrincipalName
       , ActorUserType=UserType
       , SrcDvcIp=IPAddress
      , AppName=AppDisplayName
   | project-reorder
       TimeGenerated
       ,EventProduct
       , EventUid
       , EventOriginalId
       , EventResult
       , EventResultDetails
       , EventOriginalResultDetails
       , EventStartTime
       , EventEndTime
       , EventKind
       , TargetSessionId
       , SessionDuration
       , ActorUserId
       , ActorUserName
       , SrcDvcId
       , SrcDvcHostname
       , SrcDvcOs
       , ResourceId
       , HttpUserAgentOriginal 
       , HttpUserAgentName
       , SrcGeoCity
       , SrcGeoLocation
       , AppId
       , AppName];
       AADSI