Parser:
  Title: Azure active directory service principal authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure active directory service principal signin logs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  TODO
ParserName: vimAADServicePrincipalSignInLogs
ParserQuery: |
    let AADSP=(){
  AADServicePrincipalSignInLogs
  | extend
      EventVendor = "Microsoft"
      , EventProduct = "Azure Active Directory"
      , EventResult = iff (ResultType ==0, "Success", "Failure")
      , EventResultDetails= ResultType
      , EventOriginalResultDetails = ResultDescription
      , EventStartTime = TimeGenerated
      , EventEndTime= TimeGenerated
      , RiskEventType= "Logon"
      , SrcGeoCity=tostring(todynamic(LocationDetails).city)
      , SrcGeoCounty=tostring(todynamic(LocationDetails).countryOrRegion)
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , ResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
     // , ResourceName=ResourceDisplayName
     , ActorUserType="ServicePrincipal"
     , ActorUserNameType='Upn'
     , ActorUserIdType='AADID'
  | project-rename
      EventUid =Id
      , EventOriginalId = ResultType
      , SessionId=CorrelationId
      , SessionDuration= DurationMs
      , SrcDvcIp=IPAddress
  | project-reorder
      TimeGenerated
      ,EventProduct
      , EventUid
      , EventOriginalId
      , EventResult
      , EventResultDetails
      , EventOriginalResultDetails
      , EventStartTime
      , EventEndTime
      , SessionId
      , SessionDuration
      , ResourceId
      , SrcGeoCity
      , SrcGeoLocation
      , AppId};
      AADSP