Parser:
  Title: Amazon web services authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Amazon web services cloud trail
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  TODO
ParserName: vimAuthAWSCloudTrail
ParserQuery: |
  let AWSLogon=(){
  AWSCloudTrail
   | where EventName == "ConsoleLogin"
   | extend
    EventVendor = "Amazon"
    , EventResult= iff (ResponseElements has_cs "Success", "Success", "Failure")
    // , EventResultDetais
    , EventStartTime=TimeGenerated
    , EventEndTime=TimeGenerated
    , EventType="Logon"
    , AuthenticationMethod=iff(AdditionalEventData has '"MFAUsed": "No"', "No", "Yes")
    // SessionId
    // SessionDuration
    , urlOriginal=tostring(todynamic(AdditionalEventData).LoginTo)
    | project-rename
    EventProduct=SourceSystem // maybe prefer literal string "AWSCloudTrail"
    , EventOriginalUid= AwsEventId
    , EventOriginalResultDetails= ErrorMessage
    , ActorUserId = UserIdentityPrincipalid /// 
    , ActorUserName= UserIdentityUserName // This mandatort value is always empty
    , ActorUserNameType='Simple' 
    , ActorUserType=UserIdentityType
    , ActorUserId=UserIdentityAccountId // Assuming error on IB's mapping. Why is this suddenly "Target user"
    , ActorUserIdType='AWSId' // need a new id type, again, assuming this is Actor, not target user
    , SrcDvcIpAddr=SourceIpAddress
    , HttpUserAgentOriginal=UserAgent
    , DstGeoRegion=AWSRegion};
    AWSLogon
