{
    "id": "CybleThreatIntel",
    "title": "Cyble Threat Intel",
    "publisher": "Cyble",
    "descriptionMarkdown": "The Cyble Threat Intel Alerts API connector pushes real-time alerts from Cyble to Microsoft Sentinel and is designed to be used with the Cyble Solution for Sentinel. The connector writes logs to a table titled **SecurityIncident**.",
    "graphQueries": [
        {
            "metricName": "Total data received",
            "legend": "SecurityIncident",
            "baseQuery": "SecurityIncident"
        }
    ],
    "dataTypes": [
        {
            "name": "SecurityIncident",
            "lastDataReceivedQuery": "SecurityIncident\n           | where Labels has 'Cyble-Incidents'\n           | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
    ],
    "connectivityCriterias": [
        {
            "type": "IsConnectedQuery",
            "value": [
                "SecurityIncident\n           | where Labels has 'Cyble-Incidents'\n             | summarize LastLogReceived = max(TimeGenerated)\n            | project IsConnected = LastLogReceived > ago(30d)"
            ]
        }
    ],
    "sampleQueries": [
        {
            "description": "Cyble Threat Alerts",
            "query": "SecurityIncident\n   | where Labels has 'Cyble-Incidents'\n  | sort by TimeGenerated desc"
        }
    ],
    "availability": {
        "status": 1,
        "isPreview": false
    },
    "permissions": {
        "resourceProvider": [
            {
                "provider": "Microsoft.OperationalInsights/workspaces",
                "permissionsDisplayText": "read and write permissions on the workspace are required.",
                "providerDisplayName": "Workspace",
                "scope": "Workspace",
                "requiredPermissions": {
                    "write": true,
                    "read": true,
                    "delete": true
                }
            }
        ],
        "customs": [
            {
                "name": "Microsoft.Web/sites permissions",
                "description": "Read and write permissions to Azure Logic App to create a Azure Logic App is required. [See the documentation to learn more about Azure Logic App](https://learn.microsoft.com/azure/logic-apps/)."
            },
            {
                "name": "Cyble Alerts API Credentials and Endpoint",
                "description": "**Cyble Access Token**, **Cyble Endpoint** is required for Cyble Threat Intel Connector.\n Follow the instructions in [Cyble Vision Application](https://cyble.ai) to obtain them."
            }
        ]
    },
    "instructionSteps": [
        {
            "description": ">**NOTE:** This connector operates to establish a connection with the Cyble Alerts API, enabling the retrieval of its logs for Microsoft Sentinel workspace. Pulling logs into Sentinel via logic app could lead to extra charges related to data ingestion. For a detailed understanding of these potential costs, it's advisable to consult the Azure logic app pricing page.  Check the [Azure Logic App pricing page](https://azure.microsoft.com/pricing/details/logic-apps/) for details. "
        },
        {
            "description": "**STEP 1 - Configuration steps for the Cyble Threat Intel Connector**\n\n Follow the instructions in [Cyble Vision Application](https://cyble.ai) to obtain the Cyble Alerts API credentials. \n"
        },
        {
            "description": "**STEP 2 - Launch Azure Resource Manager (ARM) Template**\n\n Use this method for automated deployment of the Logic App using an ARM Template.\n\nClick the **Deploy to Azure** button below. \n\n [![Deploy To Azure](https://aka.ms/deploytoazurebutton)](https://aka.ms/sentinel-CybleLogicApp-playbook) \n",
            "title": ""
        },
        {
            "title": "",
            "description": "**STEP 3 - Fill the following information**\n\n",
            "innerSteps": [
                {
                    "description": "Enter the subscription name under which you intend to deploy the resources.",
                    "title": "Subscription Name"
                },
                {
                    "description": "Specify the resource group. If necessary, you can create a new resource group at this point.\n>**NOTE:** Within the same resource group, you can't mix Windows and Linux apps in the same region. Select existing resource group without Windows apps in it or create new resource group.",
                    "title": "Resource Group"
                },
                {
                    "description": "Specify the region where your resources will be located.",
                    "title": "Region"
                },
                {
                    "description": "Assign a name for the workflow.",
                    "title": "Workflow Name"
                },
                {
                    "description": "Specify the name for the organization's **Sentinel Log Analytics** workspace.",
                    "title": "Workspace Name"
                },
                {
                    "description": "Provide your unique access token for authentication.",
                    "title": "Cyble Access Token"
                },
                {
                    "description": "Specify the endpoint to establish the correct API endpoint.",
                    "title": "Cyble Endpoint"
                },
                {
                    "description": "Determine how often the workflow should run.",
                    "title": "Frequency Minutes"
                }
            ]
        },
        {
            "title": "",
            "description": "**STEP 4 - Deploy your Resources**\n\nMark the checkbox labeled **I agree to the terms and conditions stated above**. \n\nClick **Purchase** to deploy."
        }
    ],
    "additionalRequirementBanner": "",
    "kind": "GenericUI",
    "metadata": {
        "contentId": "Cyble Threat Intel",
        "kind": "DataConnector",
        "version": "1.0.0",
        "source": {
            "kind": "Solution",
            "name": "Cyble Threat Intel Solutions",
            "sourceId": "CybleThreatIntelConnector"
        },
        "author": {
            "name": "Cyble",
            "email": "support@cyble.com"
        },
        "support": {
            "tier": "Developer",
            "name": "Cyble",
            "email": "support@cyble.com",
            "link": "https://cyble.com"
        }
    }
}