Parser:
  Title: ASIM M365D Process Events
  Version: '0.1'
  LastUpdated: May 23, 2021
Product:
  Name: Microsoft 365 Defender
Normalization:
  Schema: ProcessEvents
  Version: '0.1.0'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/AzSentinelProcessDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: ASIM process events parser for M365 Defender for endpoint
ParserName: vimProcessEventsMicrosft365D
ParserQuery: |
                let ProcessEvents_M365D=(){
                DeviceProcessEvents
                | extend
                // Event
                  EventOriginalUid = ReportId,
                  EventCount = int(1),
                  EventProduct = "M365 Defender for Endpoint",
                  EventVendor = "Microsoft",
                  EventSchemaVersion = "0.1.0",
                  EventStartTime = todatetime(TimeGenerated),
                  EventEndTime = todatetime(TimeGenerated),
                  EventType = "ProcessCreated",

                  // Device
                  DvcHostname = DeviceName,
                  DvcId = DeviceId,
                  DvcOs = "Windows",
                  Dvc = DvcHostname

                  // Users
                  ActorUsername = iff (InitiatingProcessAccountDomain == '', InitiatingProcessAccountName, strcat(InitiatingProcessAccountDomain, InitiatingProcessAccountName)),
                  ActorUsernameType = iff(InitiatingProcessAccountDomain == '','Simple', 'Windows'),
                  ActorUserId = InitiatingProcessAccountSid,
                  ActorUserIdType = "SID",
                  ActorUserAadId = InitiatingProcessAccountObjectId,
                  ActorUserUpn = InitiatingProcessAccountUpn,

                  TargetUsername = iff (AccountDomain == '', AccountName, strcat(AccountDomain, AccountName)),
                  TargetUsernameType = iff(AccountDomain == '','Simple', 'Windows'),
                  TargetUserUpn = AccountUpn,
                  TargetUserId = AccountSid,
                  TargetUserIdType = "SID",

                  User = coalesce(TargetUsername, ActorUsername);

                  // Processes

                  ParentProcessName = InitiatingProcessParentFileName, 
                  ParentProcessId = InitiatingProcessParentId,
                  ParentProcessCreationTime = InitiatingProcessParentCreationTime
                  
                  TargetProcessName = FileName,
                  TargetProcessCommandLine = ProcessCommandLine,
                  TargetProcessId = ProcessId,
                  TargetProcessMD5 = MD5,
                  TargetProcessSHA1 = SHA1,
                  TargetProcessSHA256 = SHA256,
                  TargetProcessIntegrityLevel = ProcessIntegrityLevel,
                  TargetProcessSessionId = LogonId,
                  TargetProcessTokenElevation = ProcessTokenElevation,
                  TargetProcessCreationTime = ProcessCreationTime,
                  
                  CommandLine = ProcessCommandLine,
                  Process = FileName,

                  ActingProcessName = InitiatingProcessFileName, 
                  ActingProcessCommandLine = InitiatingProcessCommandLine, 
                  ActingProcessId = InitiatingProcessId,
                  ActingProcessMD5 = InitiatingProcessMD5, 
                  ActingProcessSHA1 = InitiatingProcessSHA1, 
                  ActingProcessSHA256 = InitiatingProcessSHA256, 
                  ActingProcessIntegrityLevel = InitiatingProcessIntegrityLevel,
                  ActingProcessSessionId = InitiatingProcessLogonId,
                  ActingProcessTokenElevation = InitiatingProcessTokenElevation,
                  ActingProcessCreationTime = InitiatingProcessCreationTime,
                  };
                  ProcessEvents_M365D