Parser:
  Title: Windows event log - event id 4688
  Version: '0.1'
  LastUpdated: May 30, 2021
Product:
  Name: Windows Security Events 
Normalization:
  Schema: ProcessEvents
  Version: '0.1.0'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/AzSentinelProcessDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: ASIM process craetion parser for Security Events (event number 4688)
ParserName: vimProcessCreateMicrosftSecurityEvents
ParserQuery: | 
              let ProcessEvents=(){
              SecurityEvent    
              | where EventID == 4688
              |project-rename
              //***** Mandatory Fields - name change *****
                  EventProduct = EventSourceName,
                  DvcHostName = Computer,
              //***** Optional Fields - name change ******
                  EventOriginalUid = EventOriginId, 
                  ActorUserDomain = SubjectDomainName,
                  ActorUserName = SubjectUserName,
                  ActorUserId = SubjectUserSid,
                  ActingProcessFileName = ParentProcessName,
                  ActorAccount = SubjectAccount,
                  DvcId = SourceComputerId,
                  TargetUserDomain = TargetDomainName,
                  TargetProcessFileName = Process,
                  TargetProcessFilePath = NewProcessName,
                  TargetProcessCommandLine = CommandLine,
                //TargetProcessGuid = ProcessGuid,
                  TargetProcessTokenElevation = TokenElevationType
              | extend
              //***** Mandatory Fields - calculating value ******
                  EventCount = int(1),
                  EventVendor = "Microsoft",
                  EventSchemaVersion = "0.0.1",
                  EventStartTime = todatetime(TimeGenerated),
                  EventEndTime = todatetime(TimeGenerated),
                  EventType = "ProcessCreated",
                  DvcOs = "Windows",
                  TargetUserIdType = "SID",
                  ActorUserIdType = "SID",
                  TargetProcessId = toint(NewProcessId),
              //***** Optional Fields - calculating value ****** 
                  ActingProcessId = toint(ProcessId),
                  ActorUserSessionId = toint(SubjectLogonId),
                  TargetUserSessionId = toint(TargetLogonId)
                  //***** Aliases ******
              | extend
                  TargetUser = TargetUserName,
                  TargetProcessName = TargetProcessFilePath,
                  Dvc = DvcHostName
              }; ProcessEvents


