id: 797cabdd-e162-42ff-b555-554583738d35
name: Threat classification - BEC LLM detections - summary
description: |
  This query helps to provide a summary of Threat classification - BEC LLM detections in Microsoft Defender for Office 365.
description-detailed: |
  This query helps to provide a summary of Threat classification - BEC LLM detections in Microsoft Defender for Office 365.
  More details: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/microsoft-ignite-redefining-email-security-with-llms-to-tackle-a-new-era-of-soci/4302421
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where ThreatClassification has_any ("Contact establishment","Gift card","Task","Business intelligence","PII gathering","Payroll","Invoice")
  | summarize count() by ThreatClassification
  | render piechart
version: 1.0.0