id: 2e5e8fca-2ed6-4c25-b816-a76531e3ab73
Function:
  Title: Parser for ForgeRockParser
  Version: '1.0.0'
  LastUpdated: '2023-08-08'
Category: Microsoft Sentinel Parser
FunctionName: ForgeRockParser
FunctionAlias: ForgeRockParser
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor =~ "ForgeRock Inc"
    | extend User_Name = split(split(AdditionalExtensions, ";", 3)[0], "=", 1)[0] // extract userID from 4th field in json payload