id: 95fd1e1a-ab3b-41ab-bd7c-c1f09d6206c3
Function:
  Title: Parser for ForgeRockParser
  Version: '1.0.0'
  LastUpdated: '2023-08-16'
Category: Microsoft Sentinel Parser
FunctionName: ForgeRockParser
FunctionAlias: ForgeRockParser
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor =~ "ForgeRock Inc"
    | extend User_Name = split(split(AdditionalExtensions, ";", 3)[0], "=", 1)[0] // extract userID from 4th field in json payload