id: 78809fa1-a294-44c2-bab1-ba38fae0f0d0
Function:
  Title: Parser for ForgeRockParser
  Version: '1.0.0'
  LastUpdated: '2023-08-23'
Category: Microsoft Sentinel Parser
FunctionName: ForgeRockParser
FunctionAlias: ForgeRockParser
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor =~ "ForgeRock Inc"
    | extend User_Name = split(split(AdditionalExtensions, ";", 3)[0], "=", 1)[0] // extract userID from 4th field in json payload