id: ff3343c1-702c-46f5-be04-af599d773f02
Function:
  Title: Parser for ForgeRockParser
  Version: '1.0.0'
  LastUpdated: '2023-08-22'
Category: Microsoft Sentinel Parser
FunctionName: ForgeRockParser
FunctionAlias: ForgeRockParser
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor =~ "ForgeRock Inc"
    | extend User_Name = split(split(AdditionalExtensions, ";", 3)[0], "=", 1)[0] // extract userID from 4th field in json payload