id: 214e9c76-0a32-4673-9f05-e8c5146aeba7
Function:
  Title: Parser for ForgeRockParser
  Version: '1.0.0'
  LastUpdated: '2023-08-03'
Category: Microsoft Sentinel Parser
FunctionName: ForgeRockParser
FunctionAlias: ForgeRockParser
FunctionParams:
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor =~ "ForgeRock Inc"
    | extend User_Name = split(split(AdditionalExtensions, ";", 3)[0], "=", 1)[0] // extract userID from 4th field in json payload