id: 93f71607-f35d-4aa6-aec9-c2f8a62cbd8a
name: AnyDesk Execution from Abnormal Folder - Potential Malicious Use of RMM Tool
description: |
  Anydesk is a common and widely utilized tool for remotely controlling machines. However, it has also been adopted by many actors to remotely access victim machines and deploying malware or ransomware payloads. This Hunt Package is designed to exclude common paths where AnyDesk is executed from. Due to AnyDesk being able to be installed or executed from nearly any directory, Analysts should review whether AnyDesk is allowed, and follow internal policies if it is not authorized. Some common "red flag" type directories can be temporary directories, ProgramData and System32. Additionally, to appear more legitimate, some attackers may utilize installation paths that include legitimate sounding names, such as "Microsoft Management" or "Customer Service".
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - CommandAndControl
relevantTechniques:
  - T1219
query: |
  SecurityEvent
  | where Activity has "Process"
  | where NewProcessName endswith "AnyDesk.exe"
  | where not(NewProcessName has_any (
    "\\AppData\\",
    "\\Downloads\\",
    "Program Files (x86)\\anydesk",
    "Program Files\\anydesk"
    )
  )
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData 
  | order by TimeGenerated
version: 1.0.0
