id: 8289e2ad-bc74-4ae3-bfaa-cdeb4335135c
name: Autorun or ASEP Registry Key Modification
description: |
  A common method that adversaries and malicious software alike achieve persistence is by adding a program to the startup folder or referencing it with a Registry run key. Adding an entry to the "run keys" in the Registry or startup folder allows the referenced program to be executed when a user logs in. They are often utilized for legitimate purposes, however when utilized maliciously the key name/value is often obviously suspicious, such as random names, or objects loaded from temp or public folders.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1547.001
query: |
  SecurityEvent
  | where TimeGenerated > ago(1d)
  | where ObjectName has_any (
    "\\software\\Microsoft\\Windows\\CurrentVersion\\Run",
    "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Run",
    "\\software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Run",
    "\\software\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Run"
  ) or ObjectName has_any (
    "\\software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders",
    "\\software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders",
    "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit",
    "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell",
    "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs",
    "\\software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs",
    "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Load",
    "\\software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Load",
    "\\software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run",
    "\\Image File Execution Options\\vds.exe\\debugger"
  )
  | where not ObjectValueName has_any (
    "\\Microsoft Visual Studio\\Installer\\",
    "\\ClickToRun\\OfficeClickToRun.exe",
    "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell",
    "\\Microsoft\\OneDrive\\",
    "\\Windows\\system32\\SearchIndexer.exe",
    "\\Microsoft\\Teams\\",
    "\\Microsoft\\Edge\\Application\\"
  )
  | where not ParentProcessName has_any (
    "Program Files (x86)\\Microsoft\\Edge\\Application",
    "Program Files\\Microsoft OneDrive\\",
    "Program Files\\WindowsApps\\MSTeams"
  )
  | where not NewValue has_any (
    "\\Windows\\System32\\ctfmon.exe"
  )
  | where not NewValue contains "\\ProgramData\\Package Cache\\" and ParentProcessName has_any (
    "vc_redist.x86.exe",
    "vc_redist.x64.exe"
  )
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData 
  | order by TimeGenerated
version: 1.0.0
