id: 262d9692-6d36-4b10-9fc5-159930cff604
name: Creating a Shadow Copy
description: |
  This Threat Hunt package identifies suspicious activities related shadow copies being created from a variety of techniques.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Collection
  - CredentialAccess
relevantTechniques:
  - T1003.003
  - T1005
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, tostring(EventID), CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId), SubjectUserName, SubjectLogonId, SubjectUserSid, SourceComputerId
  | where (CommandLine has "create" and CommandLine contains "shadow") or CommandLine has "Checkpoint-Computer"
  | order by TimeGenerated
version: 1.0.0
