id: 3e8f06d3-4946-4c4a-85b0-cd2804d3401b
name: Dump LSASS via Renamed procdump
description: |
  Identify ProcDump usage as a means to dump LSASS data. ProcDump is a SysInternals tool that can be used to dump process memory, dumping the process memory of lsass.exe which can be used to obtain credentials.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - CredentialAccess
relevantTechniques:
  - T1003
query: |
  SecurityEvent
  | where NewProcessName endswith ".exe"
  | where CommandLine has "lsass"
  | where CommandLine has_any ("-ma","-mm")
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData 
  | order by TimeGenerated
version: 1.0.0
