id: 606cd1ac-622d-4645-9553-2b04df7407d8
name: Execution BAT Script to Unpack Payload
description: |
  This Hunt Package is meant to identify a nuanced method of execution of a .bat file that can be indicative of an unpacking sequence that leads to the deployment of an additional executable.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1140
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, tostring(EventID), CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId), SubjectUserName, SubjectLogonId, SubjectUserSid, SourceComputerId
  | order by TimeGenerated
  | where CommandLine contains "cmd.exe"
  | where CommandLine contains "/c"
  | where CommandLine contains ".bat"
  | where CommandLine has_any (
    "AppData",
    "Downloads",
    "Temp"
  )
version: 1.0.0
