id: 8fedb48c-396b-4cd5-9483-69d7fc3eecee
name: File Created In Startup Folder
description: |
  This package is designed to detect the activity around a file being created and put in the Windows Startup Folder.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1547.001
query: |
  SecurityEvent
  | where TimeGenerated >= ago(1d)
  | where EventID == "4663"
  | where SubjectUserName !endswith "$"
  | where ObjectName has @"Microsoft\Windows\Start Menu\Programs\Startup\"
  | where not(Process endswith "SearchProtocolHost.exe")
  | where EventData has_any ("0x2", "%%4417")
  | project TimeGenerated, Computer, EventID, ObjectName, Process, processId = tolong(NewProcessId), SubjectUserName
version: 1.0.0
