id: 749f7e2c-5eeb-407d-a5ef-cfcecbe5d810
name: MeshAgent Suspicious Child Process - Potential Malicious RMM Tool Usage
description: |
  Identifies the default installation process executing suspect applications, such as powershell, schtasks, cmd and other applications that can by abused by built in modules.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - CommandAndControl
  - Execution
relevantTechniques:
  - T1059.001
  - T1059.003
  - T1219
query: |
  SecurityEvent
  | where ParentProcessName has "meshagent.exe" and NewProcessName has_any (
    "cmd.exe",
    "powershell.exe",
    "pwsh.exe",
    "bcdedit.exe",
    "schtasks.exe"
  ) or NewProcessName has "meshagent.exe" and CommandLine has_any (
    "-kvm1",
    "-b64exec"
  )
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData 
  | order by TimeGenerated
version: 1.0.0
