id: 3f329a8c-0102-4a61-8cf3-63948aab5ef4
name: NetSupport Manager Execution from Abnormal Folder - Potential Malicious Use of RMM Tool
description: |
  NetSupport is a common and widely utilized tool for remotely controlling machines, and was even utilized as the base code for the NetSupport RAT. It has been adopted by many actors to remotely access victim machines and deploying additional malware or ransomware payloads. This Hunt Package is designed to exclude common paths where NetSupport is executed from. Due to NetSupport being able to be installed or executed from nearly any directory, Analysts should review whether NetSupport is allowed, and follow internal policies if it is not authorized. Some common "red flag" type directories can be temporary directories, Temp and System32. Additionally, to appear more legitimate, some attackers may utilize installation paths that include legitimate sounding names, such as "Microsoft Management" or "Customer Service".
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - CommandAndControl
relevantTechniques:
  - T1219
query: |
  SecurityEvent
  | where NewProcessName endswith "client32.exe"
  | where not(NewProcessName has_any (
    "Program Files (x86)\\NetSupport",
    "Program Files\\NetSupport",
    "\\ProgramData\\NetSupport\\",
    "\\AppData\\Local\\NetSupport\\"
    )
  )
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData 
  | order by TimeGenerated
version: 1.0.0
