id: ccdd03de-8fbf-436b-99ba-00dfee83d42f
name: Powershell History Modification or Deletion
description: |
  Adversaries may attempt to clear the command history of compromised hosts to conceal the actions that they have performed during an attack. This content will detect if PowerShell's history was cleared, disabled, or modified.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1070
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, EventID, CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId)
  | where CommandLine has_any("Clear-History","del (Get-PSReadlineOption).HistorySavePath*","rm (Get-PSReadlineOption).HistorySavePath","Remove-Item (Get-PSReadlineOption).HistorySavePath","Set-PSReadlineOption -HistorySaveStyle SaveNothing")
version: 1.0.0
