id: eebb7f80-07f3-4d37-aab7-51c1ad31f1b3
name: Python Executing from Non-Standard Directory
description: |
  This Threat Hunt package identifies suspicious Python executions originating from non-standard directories, such as hidden or unconventional locations signaling potential malware infection.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Execution
relevantTechniques:
  - T1059.006
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, tostring(EventID), CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId), SubjectUserName, SubjectLogonId, SubjectUserSid, SourceComputerId
  | where NewProcessName matches regex ".*python(?:[23](?:\\.\\d+)?w?)?" 
  | where not(NewProcessName matches regex @".*(C:\\Python|\\Program Files\\Python|\\WindowsApps\\PythonSoftwareFoundation|\\AppData\\Local\\Programs\\Python|\\AppData\\Local\\Microsoft\\WindowsApps|/usr/bin/|/usr/local/bin/|/opt/python/|/\\.local/bin/|/\\.pyenv/versions/|/miniconda3/bin/|/anaconda3/bin/|/snap/bin/|/opt/homebrew/bin/|/usr/local/opt/python|/Library.*/Frameworks/Python.*\\.framework).*")
  | order by TimeGenerated
version: 1.0.0
