id: bb771c73-e7ab-4705-92a2-ce322b33621d
name: Remote Atera Agent Download - Command Line
description: |
  This Threat Hunt package identifies when a tool like a lolbin is used to fetch the Atera's Remote Montoring and Management (RMM) agent directly from Atera's distribution domain.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - CommandAndControl
  - Execution
relevantTechniques:
  - T1059
  - T1219
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, tostring(EventID), CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId), SubjectUserName, SubjectLogonId, SubjectUserSid, SourceComputerId
  | where CommandLine has "atera.com"
  | where CommandLine has "GetAgent"
  | where CommandLine has "integratorLogin"
  | order by TimeGenerated
version: 1.0.0
