id: 2e3e9910-70c1-4822-804a-ee9919b0c419
name: Shadow Copies Deletion Using Operating Systems Utilities
description: |
  Ransomware is known to delete Windows shadow copies before it begins encrypting the data on the victim host. This tactic is typically carried out with powershell, vssadmin or wmic. This package identifies activity by powershell, wmic, vssadmin or vssvc with command line arguments containing delete and variations of shadow.
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Impact
relevantTechniques:
  - T1490
query: |
  SecurityEvent
  | where CommandLine contains "shadow" and CommandLine contains "delete"
  | where (NewProcessName has_any (
    "powershell.exe",
    "wmic.exe",
    "vssadmin.exe",
    "vssvc.exe"
  ) or CommandLine has_any (
    "wmic",
    "vssadmin",
    "vssvc"
  ))
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData| order by TimeGenerated
version: 1.0.0
