id: b6365ad5-0ccd-4426-97bc-b9484eb9579f
name: User Added to Default Privileged Windows Security Groups
description: |
  This package is designed to capture the activity surrounding the execution of command line arguments that add a user to default privileged Windows Security Groups (local and domain).
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - DefenseEvasion
  - InitialAccess
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1078.003
  - T1136.002
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, tostring(EventID), CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId), SubjectUserName, SubjectLogonId, SubjectUserSid, SourceComputerId
  | where CommandLine has_all("net","/add")
  | where CommandLine has_any (
    "group",
    "localgroup"
  )
  | where CommandLine has_any ( 
    "Administrators",
    "Domain Admins",
    "DnsAdmins",
    "Enterprise Admins",
    "Hyper-V Administrators",
    "Schema Admins"
  )
  | order by TimeGenerated
version: 1.0.0
