id: f80d951a-eddc-4171-b9d0-d616bb83efdc
name: Admin promotion after Role Management Application Permission Grant
description: |
  'This rule looks for a service principal being granted the Microsoft Graph RoleManagement.ReadWrite.Directory (application) permission before being used to add an Azure AD object or user account to an Admin directory role (i.e. Global Administrators).
  This is a known attack path that is usually abused when a service principal already has the AppRoleAssignment.ReadWrite.All permission granted. This permission allows an app to manage permission grants for application permissions to any API.
  A service principal can promote itself or other service principals to admin roles (i.e. Global Administrators). This would be considered a privilege escalation technique.
  Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions, https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'
severity: High
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1h
queryPeriod: 2h
triggerOperator: gt
triggerThreshold: 0
status: Available
tactics:
  - PrivilegeEscalation
  - Persistence
relevantTechniques:
  - T1098.003
  - T1078.004
tags:
  - SimuLand
query: |
  let query_frequency = 1h;
  let query_period = 2h;
  AuditLogs
  | where TimeGenerated > ago(query_frequency)
  | where Category == "RoleManagement" and LoggedByService == "Core Directory" and AADOperationType == "Assign"
  //| where OperationName in ("Add eligible member to role", "Add member to role")
  | where isnotempty(InitiatedBy["app"])
  | mv-expand TargetResource = TargetResources
  | mv-expand modifiedProperty = TargetResource["modifiedProperties"]
  | where tostring(modifiedProperty["displayName"]) in ("Role.DisplayName", "RoleDefinition.DisplayName")
  | extend RoleAssignment = tostring(modifiedProperty["newValue"])
  | where RoleAssignment contains "Admin"
  | project
      RoleAssignment_TimeGenerated = TimeGenerated,
      RoleAssignment_OperationName = OperationName,
      RoleAssignment_Result = Result,
      RoleAssignment,
      TargetType = tostring(TargetResources[0]["type"]),
      Target = iff(isnotempty(TargetResources[0]["displayName"]), tostring(TargetResources[0]["displayName"]), tolower(TargetResources[0]["userPrincipalName"])),
      TargetId = tostring(TargetResources[0]["id"]),
      RoleAssignment_InitiatedBy = InitiatedBy,
      RoleAssignment_TargetResources = TargetResources,
      RoleAssignment_AdditionalDetails = AdditionalDetails,
      RoleAssignment_CorrelationId = CorrelationId,
      AppServicePrincipalId = tostring(InitiatedBy["app"]["servicePrincipalId"])
  | join kind=inner (
      AuditLogs
      | where TimeGenerated > ago(query_period)
      | where Category == "ApplicationManagement" and LoggedByService == "Core Directory"
      | where OperationName == "Add app role assignment to service principal"
      | mv-expand TargetResource = TargetResources
      | mv-expand modifiedProperty = TargetResource["modifiedProperties"]
      | where tostring(modifiedProperty["displayName"]) == "AppRole.Value"
      | extend PermissionGrant = tostring(modifiedProperty["newValue"])
      | where PermissionGrant has "RoleManagement.ReadWrite.Directory"
      | mv-apply modifiedProperty = TargetResource.modifiedProperties on (
          summarize modifiedProperties = make_bag(
              pack(tostring(modifiedProperty["displayName"]),
                  pack("oldValue", trim(@'[\"\s]+', tostring(modifiedProperty["oldValue"])),
                      "newValue", trim(@'[\"\s]+', tostring(modifiedProperty["newValue"])))))
      )
      | project
          PermissionGrant_TimeGenerated = TimeGenerated,
          PermissionGrant_OperationName = OperationName,
          PermissionGrant_Result = Result,
          PermissionGrant,
          AppDisplayName = tostring(modifiedProperties["ServicePrincipal.DisplayName"]["newValue"]),
          AppServicePrincipalId = tostring(modifiedProperties["ServicePrincipal.ObjectID"]["newValue"]),
          PermissionGrant_InitiatedBy = InitiatedBy,
          PermissionGrant_TargetResources = TargetResources,
          PermissionGrant_AdditionalDetails = AdditionalDetails,
          PermissionGrant_CorrelationId = CorrelationId
  ) on AppServicePrincipalId
  | where PermissionGrant_TimeGenerated < RoleAssignment_TimeGenerated
  | project PermissionGrant_TimeGenerated, PermissionGrant_OperationName, PermissionGrant_Result, PermissionGrant, AppDisplayName, AppServicePrincipalId, PermissionGrant_InitiatedBy, PermissionGrant_TargetResources, PermissionGrant_AdditionalDetails, PermissionGrant_CorrelationId, RoleAssignment_TimeGenerated, RoleAssignment_OperationName, RoleAssignment_Result, RoleAssignment, TargetType, Target, TargetId, RoleAssignment_InitiatedBy, RoleAssignment_TargetResources, RoleAssignment_AdditionalDetails, RoleAssignment_CorrelationId
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AppDisplayName
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Target
version: 1.0.3
kind: Scheduled
