id: 4902eddb-34f7-44a8-ac94-8486366e9494
name: Excessive Amount of Denied Connections from a Single Source (AsimNetworkSession)
description: |
  'This creates an incident in the event that a single source IP address generates a excessive amount of denied connections.
   To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/AdvancedSentinelInformationModel)'
severity: Medium
tags:
  - Id: 3d645a88-2724-41a7-adea-db74c439cf79
    version: 1.0.0
  - Schema: ASimNetworkSessions
    SchemaVersion: 0.2.1
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1499
query: |
  let threshold = 5000;
  imNetworkSession(eventresult='Failure')
  | summarize Count=count() by SrcIpAddr, bin(TimeGenerated,5m)
  | where Count > threshold
  | extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
alertDetailsOverride:
  alertDisplayNameFormat: Excessive amount of denied connections from {{SrcIpAddr}} (AsimNetworkSession)
version: 1.0.0
kind: Scheduled