id: 3f0c20d5-6228-48ef-92f3-9ff7822c1954
name: Suspicious User-Agent Detected - Hacking Tool
description: |
  'Detects suspicious user agent strings used by known hack tools'
severity: Medium
tags:
  - Id: 8d537f3c-094f-430c-a588-8a87da36ee3a
    version: 1.0.0
  - Schema: ASIMNetworkSessions
    SchemaVersion: 0.1.1
requiredDataConnectors:
  - connectorId: CiscoUmbrellaDataConnector
    dataTypes:
      - Cisco_Umbrella_proxy_CL
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandandControl
query: |
  let timeframe = 15m;
  let user_agents=dynamic([
     '(hydra)',
     ' arachni/',
     ' BFAC ',
     ' brutus ',
     ' cgichk ',
     'core-project/1.0',
     ' crimscanner/',
     'datacha0s',
     'dirbuster',
     'domino hunter',
     'dotdotpwn',
     'FHScan Core',
     'floodgate',
     'get-minimal',
     'gootkit auto-rooter scanner',
     'grendel-scan',
     ' inspath ',
     'internet ninja',
     'jaascois',
     ' zmeu ',
     'masscan',
     ' metis ',
     'morfeus fucking scanner',
     'n-stealth',
     'nsauditor',
     'pmafind',
     'security scan',
     'springenwerk',
     'teh forest lobster',
     'toata dragostea',
     ' vega/',
     'voideye',
     'webshag',
     'webvulnscan',
     ' whcc/',
     ' Havij',
     'absinthe',
     'bsqlbf',
     'mysqloit',
     'pangolin',
     'sql power injector',
     'sqlmap',
     'sqlninja',
     'uil2pn',
     'ruler',
     'Mozilla/5.0 (Windows; U; Windows NT 5.1; pt-PT; rv:1.9.1.2) Gecko/20090729 Firefox/3.5.2 (.NET CLR 3.5.30729)'
     ]);
  imWebSession(httpuseragent_has_any=user_agents)
  | project SrcIpAddr, DstIpAddr, UrlOriginal, TimeGenerated,HttpUserAgentOriginal
  | extend IpCustomEntity = SrcIpAddr, UrlCustomEntity = UrlOriginal
entityMappings:
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: UrlCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled