id: 42436753-9944-4d70-801c-daaa4d19ddd2
name: Suspicious User-Agent Detected - Windows PowerShell
description: |
  'Rule helps to detect Powershell user-agent activity by an unusual process other than a web browser.'
severity: Medium
tags:
  - Id: b12b3dab-d973-45af-b07e-e29bb34d8db9
    version: 1.0.0
  - Schema: ASIMNetworkSessions
    SchemaVersion: 0.1.1
requiredDataConnectors: []
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandandControl
  - DefenseEvasion
query: |
  let querytimeframe = 15m;
  imWebSession(starttime=querytimeframe, httpuseragent_has_any="WindowsPowerShell")
  | project SrcIpAddr, DstIpAddr, UrlOriginal, TimeGenerated,HttpUserAgentOriginal
  | extend IpCustomEntity = SrcIpAddr, UrlCustomEntity = UrlOriginal
entityMappings:
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: UrlCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled