{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    },
    "location": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimFileEventMicrosoftSysmonDeleted",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "Sysmon Events 23 and 26 - File Deleted",
            "category": "Security",
            "FunctionAlias": "vimFileEventMicrosoftSysmonDeleted",
            "query": "let Sysmon23_26_Event=(){\n    Event\n      | where Source == \"Microsoft-Windows-Sysmon\"\n      | where EventID in (23,26)\n      | parse EventData with \n      '<DataItem type=\"System.XmlData\" time=\"'Time:datetime\n              '\" sourceHealthServiceId=\"'sourceHealthServiceId\n              '\"><EventData xmlns=\"http://schemas.microsoft.com/win/2004/08/events/event\"><Data Name=\"RuleName\">'RuleName:string\n              '</Data><Data Name=\"UtcTime\">'UtcTime:datetime\n              '</Data><Data Name=\"ProcessGuid\">{'ProcessGuid:string\n              '}</Data><Data Name=\"ProcessId\">'ProcessId:string\n              '</Data><Data Name=\"User\">'User:string\n              '</Data><Data Name=\"Image\">'Image:string\n              '</Data><Data Name=\"TargetFilename\">'TargetFilename:string\n              '</Data><Data Name=\"Hashes\">SHA1='SHA1:string',MD5='MD5:string',SHA256='SHA256:string',IMPHASH='IMPHASH:string\n              '</Data><Data Name=\"IsExecutable\">'isExecutable:string\n              '</Data>' DataSuffix\n      | parse DataSuffix with '<Data Name=\"Archived\">'Archived'</Data></EventData></DataItem>'\n      | extend\n          EventType='FileDeleted'\n          , EventProduct='Sysmon'\n          , EventSchemaVersion = \"0.1.0\"\n          , EventResult='Success'\n          , EventCount=int(1)\n          , EventStartTime = TimeGenerated\n          , EventEndTime = TimeGenerated\n          , DvcOs='Windows'\n          , ActorUsernameType = 'Windows'\n          , TargetFileName_wo_Path=tostring(split(TargetFilename,'\\\\')[-1])\n          | project-rename\n              DvcHostname = Computer\n              , ActorUsername = User\n              , ActingProcessName = Image\n              , ActingProcessId = ProcessId\n              , ActingProcessGuid = ProcessGuid\n              , EventOriginalId=EventID\n              , TargetFileMD5=MD5\n              , TargetFileSHA1=SHA1\n              , TargetFileSHA256=SHA256\n              , TargetFileIMPHASH=IMPHASH\n              , TargetFilePath=TargetFilename\n              ,TargetFileName=TargetFileName_wo_Path\n          | extend\n              User = ActorUsername\n              , Process = ActingProcessName\n              , Dvc = DvcHostname\n              , FilePath = TargetFilePath\n          | project-away EventData, RenderedDescription, ParameterXml\n              };\n// this is the parser for sysmon from WindowsEvent table\nlet Sysmon23_26_WindowsEvent=(){\n    WindowsEvent\n        | where Provider == \"Microsoft-Windows-Sysmon\"\n        | where EventID in (23,26)\n        | extend hash = split(EventData.Hashes,'=')\n        | extend hash_algorithm = tostring(hash[0]),\n                hash_value = tostring(hash[1])\n        | extend TargetFileMD5 = iff(hash_algorithm == \"MD5\", hash_value, \"\"),\n                TargetFileSHA1 =  iff(hash_algorithm == \"SHA1\", hash_value, \"\"),\n                TargetFileSHA256 = iff(hash_algorithm == \"SHA256\", hash_value, \"\"),\n                TargetFileIMPHASH = iff(hash_algorithm == \"IMPHASH\", hash_value, \"\")\n        | extend\n                EventType='FileDeleted',\n                EventProduct='Sysmon',\n                EventMessage=tostring(EventData.RenderedDescription),\n                EventSchemaVersion = \"0.1.0\",\n                EventResult='Success',\n                EventCount=int(1),\n                EventStartTime = TimeGenerated,\n                EventEndTime = TimeGenerated,\n                DvcOs='Windows',\n                ActorUsernameType = 'Windows',\n                TargetFileName_wo_Path=tostring(split(tostring(EventData.TargetFilename),'\\\\')[-1]),\n                TargetFilePath=tostring(EventData.TargetFilename),\n                DvcHostname = Computer,\n                ActorUsername = tostring(EventData.User),\n                ActingProcessName = tostring(EventData.Image),\n                ActingProcessId = tostring(EventData.ProcessId),\n                ActingProcessGuid = tostring(EventData.ProcessGuid)\n        | project-rename\n                    EventOriginalId=EventID,\n                    TargetFileName=TargetFileName_wo_Path\n        | project-away hash, hash_algorithm, hash_value, EventData\n};\nunion isfuzzy=true Sysmon23_26_Event,\n                  Sysmon23_26_WindowsEvent\n",
            "version": 1
          }
        }
      ]
    }
  ]
}