//Shows authentication volume by user agent. Tracking via user agent is one way to differentiate between types of connecting device. In homogeneous enterprise environments the user agent associated with an attacker device may stand out as unusual. Examining authentications by new devices is a potential avenue to discover unauthorized access.

OfficeActivity
| where RecordType startswith "Az"
| where Operation startswith "UserLoggedIn"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| extend machineIndex=indexof(UserAgent, "machine_id") 
| extend UserAgent = substring(UserAgent, 0, machineIndex) 
| project Operation, UserId, TimeGenerated , UserAgent
| summarize userAgentCount=count() by UserAgent
| sort by userAgentCount desc;
