id: 17201aa8-0916-4078-a020-7ea3a9262889
name: Azure Sentinel Connectors Administrative Operations
description: |
  'Identifies set of Azure Sentinel Data Connectors administrative operational detection queries for hunting activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 

let timeframe = 1d; 
// Azure Sentinel Data Connectors Update / Delete
AzureActivity
| where Category == "Administrative"
| where TimeGenerated >= ago(timeframe)
| where OperationNameValue in ("Microsoft.SecurityInsights/dataConnectors/write", "Microsoft.SecurityInsights/dataConnectors/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc
| extend AccountCustomEntity = Caller
| extend IPCustomEntity = CallerIpAddress
