id: 97ff9459-dade-404a-b90e-d93b9acde1a4
name: Potential Process Doppelgänging
description: |
   'This query detects Process Doppelgänging, a technique that calls several APIs related to NTFS transactions which allow to substitute the PE content before even the process is created.
   Ref: https://blog.menasec.net/2019/02/threat-hunting-24-detecting-process.html'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  -  DefenseEvasion
  -  PrivilegeEscalation
relevantTechniques:
  - T1055
query: |
 // Enter a reference list of trusted processes
 let TrustedProcessList = dynamic ([ "c:\\windows\\system32\\svchost.exe","c:\\windows\\system32\\lsass.exe","c:\\windows\\servicing\\TrustedInstaller.exe","c:\\windows\\system32\\poqexec.exe","TiWorker.exe"]);
 SecurityEvent
    | where EventID == 4985 and not (ProcessName has_any (TrustedProcessList)) and SubjectLogonId !="0x3e7"
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, ProcessName, SubjectUserName, SubjectLogonId
