Parser:
  Title: ASIM Microsoft 365 Defender DeviceLogonEvent Authentication parser
  Version: '0.1.0'
  LastUpdated: July 1, 2021
Product:
  Name: MMicrosoft 365 Defender
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/AzSentinelAuthenticationDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
      This Query Parser maps M365 Defender Device Logon Events (DeviceLogonEvents) to the Azure Sentinel Information Model Authenticaion schema.
ParserName: vimAuthenticationM365Defender
ParserQuery: |
  let FaliureReason=datatable(EventOriginalResultDetails:string, EventResultDetails:string)[
    'InvalidUserNameOrPassword','No such user or password' 
    // What other will we find here?
    ];
    let AuthM365D=(){
    DeviceLogonEvents 
    // ---   Already mapped
    // // TimeGenerated - exists
    //
    | project-rename 
       EventOriginalResultDetails=FailureReason 
       , EventSubType=LogonType
    | extend 
    //
       // ----  Untouched
       TimeGenerated
    // 
      // ----  Event
       , EventCount=int(1)
       , EventStartTime=TimeGenerated
       , EventEndTime=TimeGenerated
       , EventOriginalType = EventSubType // Previously:LogonType
       , EventProduct='M365 Defender for EndPoint'
      ,  EventResult = case(ActionType =='LogonSuccess', 'Success'
                            , ActionType=='LogonFailed', 'Failure'
                            , ActionType=='LogonAttempted', 'NA' //// Not sure what this is
                            , 'NA')
      , EventSchemaVersion='0.1.0'
      , EventType='Logon'
      , EventVendor ='Microsoft'
    //    -   No Data
    //  EventOriginalUid 
    //  EventProductVersion 
    //  EventReportUrl
    //  EventMessage 
    //  
    //  
    //  ----   Target and Actor Users
     | project-rename 
         TargetUserId=AccountSid
       , ActorUserId =InitiatingProcessAccountSid
      | extend 
         TargetUserIdType ='SID'
       , TargetUsername = strcat(AccountDomain,'\\',AccountName)
       , TargetUsernameType='Windows'
    //    -  No Data
      // TargetUserType 
    // 
    // ActingAppName 
    // ActingAppType 
    // ActorSessionId 
      , ActorUserIdType='SID'
    // ActorUserType 
      , ActorUsername=coalesce(InitiatingProcessAccountUpn, strcat(InitiatingProcessAccountDomain,'\\',InitiatingProcessAccountName)) // InitiatingProcessAccountName
      , ActorUsernameType=case(isnotempty( InitiatingProcessAccountUpn), 'Upn/Email'
                                , isnotempty(InitiatingProcessAccountDomain), 'Windows'
                                , 'Simple')
     //, AdditionalFields:already exists
      | project-rename 
        DvcHostname=DeviceName
      , LogonProtocol=Protocol
      , TargetDvcId=DeviceId
      , TargetDvcIpAddr=RemoteIP
    // No Data
    // DvcIpAddr 
    // HttpUserAgent 
    // LogonMethod 
    //
      , SrcDvcHostname=RemoteDeviceName 
      // SrcDvcHostnameType == Requires calculation. not sure it is worth it
    // SrcDvcId 
    // SrcDvcIpAddr 
    // SrcDvcOs 
    // SrcDvcType 
    // SrcGeo fields 
    //
    // TargetAppId 
    // TargetAppName 
    // TargetAppType 
    // TargetDvc 
      | extend 
        TargetDvcHostname=DvcHostname
        ,  TargetDvcHostnameType='FQDN'
        , TargetDvcIdType='MDE'
    // TargetDvcOs
    // TargetDvcType
      , TargetPortNumber=RemotePort
      , TargetSessionId =LogonId
      // EventResultDetails
      | lookup FaliureReason on EventOriginalResultDetails 
    // TargetUrl 
    // -----------  Alias
      | extend 
        User=TargetUsername 
        , LogonTarget=TargetDvcHostname
        , Dvc=TargetDvcHostname
    // No data
        // // _ResourceId - no data 
        };