Parser:
  Title: Azure active directory non interactive authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure active directory nonInteractive signin logs
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
    This Query Parser maps Azure Active Directory Non Interactive sign in logs (AADNonInteractiveUserSignInLogs) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAuthAADNonInteractiveUserSignInLogs
ParserQuery: |
  let AADNIAuthentication=(){
    AADNonInteractiveUserSignInLogs
    | extend
        EventVendor = 'Microsoft'
        , EventProduct = 'AAD Non Interactive'
        , EventSchemaVersion='0.1.0'
        , EventCount=1
        , EventResult = iff (ResultType ==0, 'Success', 'Failure')
        //, EventResultDetails= ResultType
        , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)
        , EventStartTime = TimeGenerated
        , EventEndTime= TimeGenerated
        , EventType= 'Logon'
        , SrcHostId=tostring(todynamic(DeviceDetail).deviceId)
        , SrcHostname=tostring(todynamic(DeviceDetail).displayName)
        , SrcHostOs=tostring(todynamic(DeviceDetail).operatingSystem)
        , HttpUserAgent=UserAgent
        , SrcBrowser= tostring(todynamic(DeviceDetail).browser)
        , Locatoin = todynamic(LocationDetails)
        , TargetResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
        , TargetUserType='NonInteractive'
        , TargetUsernameType='Upn'
        , TargetUserIdType='AADID'
        , TargetResourceName=ResourceDisplayName
    | extend
        , SrcGeoCity=tostring(Location.city)
        , SrcGeoCountry=tostring(Location.countryOrRegion)
        , SrcGeoLocationLatitude=tostring(Location.geoCoordinates.latitude)
        , SrcGeoLocationLongitude=tostring(Location.geoCoordinates.longitude)
    | project-rename
        EventOriginalUid =Id
        , AuthMethod = AuthenticationRequirement
        , TargetSessionId=CorrelationId
        , SessionDuration= DurationMs
        , TargetUserId = UserId
        , TargetUsername=UserPrincipalName
        , SrcIpAddr=IPAddress
      , TargetAppName=AppDisplayName
      , TargetAppId=AppId
    | lookup (AADSTSErrorCodes | project-rename ResultType=Error, EventResultDetails=ErrorDescription ) on ResultType
    | project-reorder
        TimeGenerated
        ,EventProduct
        , EventOriginalUid
        , EventResult
        //, EventResultDetails
        , EventOriginalResultDetails
        , EventStartTime
        , EventEndTime
        , AuthMethod 
        , TargetSessionId
        , SessionDuration
        , TargetUserId
        , TargetUsername
        , SrcHostId
        , SrcHostname
        , SrcHostOs
        , HttpUserAgent 
        , SrcBrowser
        , SrcGeoCountry
        , SrcGeoCity
        , TargetAppId
        , TargetAppName
        // Aliases
        | extend 
          Username=TargetUsername
        , AuthTarget=ResourceIdentity
        , Dvc=EventVendor};
  AADNIAuthentication