Parser:
  Title: Azure active directory authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure SigninLogs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
  This Query Parser maps Azure Active Directory Signin logs (SigninLogs) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAuthSigninLogs
ParserQuery: |
  let AADSigninLogs=(){
  SigninLogs
  | extend
    EventVendor = 'Microsoft'
    , EventProduct = 'AAD Sign In Logs'
    , EventCount=1
    , EventSchemaVersion='0.1.0'
    , EventResult = iff (ResultType ==0, 'Success', 'Failure')
    //, EventResultDetails= ResultType
    , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)
    , EventStartTime = TimeGenerated
    , EventEndTime= TimeGenerated
    , EventType= 'Logon'
    , SrcHostId=tostring(DeviceDetail.deviceId)
    , SrcHostname=tostring(DeviceDetail.displayName)
    , SrcHostOs=tostring(DeviceDetail.operatingSystem)
    , HttpUserAgent=UserAgent
    , SrcBrowser= tostring(DeviceDetail.browser)
    , Locatoin = todynamic(LocationDetails)
    , TargetUsernameType='Upn'
    , TargetUserIdType='AADID'
    , TargetResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
     , TargetResourceName=ResourceDisplayName
  | extend
        , SrcGeoCity=tostring(Location.city)
        , SrcGeoCountry=tostring(Location.countryOrRegion)
        , SrcGeoLocationLatitude=tostring(Location.geoCoordinates.latitude)
        , SrcGeoLocationLongitude=tostring(Location.geoCoordinates.longitude)
   | lookup (AADSTSErrorCodes | project-rename ResultType=Error, EventResultDetails=ErrorDescription ) on ResultType
   | project-rename
       EventOriginalUid =Id
       , LogonMethod  = AuthenticationRequirement
       , TargetSessionId=CorrelationId
       , SessionDuration= DurationMs
       , TargetUserId = UserId
       , TargetUsername=UserPrincipalName
       , TargetUserType=UserType
       , SrcDvcIp=IPAddress
       , TargetAppName=AppDisplayName
       , TargetAppId=AppId
   | project-reorder
       TimeGenerated
       ,EventProduct
       , EventOriginalUid
       , EventResult
       // , EventResultDetails
       , EventOriginalResultDetails
       , EventStartTime
       , EventEndTime
       , LogonMethod 
       , TargetSessionId
       , SessionDuration
       , TargetUserId
       , TargetUsername
       , SrcHostId
       , SrcHostname
       , SrcHostOs
       , HttpUserAgent 
       , SrcBrowser
       , SrcGeoCity
       , SrcGeoCountry
       , TargetAppId
       , TargetAppName
       // Aliases
        | extend 
          Username=TargetUsername
       , LogonTarget=ResourceIdentity
       , Dvc=EventVendor};
       AADSigninLogs