Parser:
  Title: ASIM AWS authentication
  Version: '0.1.0'
  LastUpdated: June 17, 2021
Product:
  Name: Amazon web services cloud trail
Normalization:
  Schema: Authentication
  Version: '0.1.0'
References:
- Title: ASIM Authentication Schema
  Link: https://aka.ms/AzSentinelAuthenticationDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
      This Query Parser maps Amazon Web Service sign in logs (AWSCloudTrail) to the Advanced SIEM Information Model authenticaion schema.
ParserName: vimAuthenticationAWSCloudTrail
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: targetusername_has
    Type: string
    Default: '*'
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let AWSLogon=(starttime:datetime=datetime(null), endtime:datetime=datetime(null), targetusername_has:string="*", disabled:bool=false){
  AWSCloudTrail | where not(disabled)
  // ************************************************************************* 
  //       <Prefilterring>
  // *************************************************************************
  | where 
    (isnull(starttime)   or TimeGenerated >= starttime) 
    and (isnull(endtime)     or TimeGenerated <= starttime) 
    and (targetusername_has=='*' or (UserIdentityPrincipalid has targetusername_has ))
  // ************************************************************************* 
  //       </Prefilterring>
  // ************************************************************************* 
   | where EventName == 'ConsoleLogin'
   | extend
    EventVendor = 'AWS'
    , EventProduct='AWSCloudTrail'
    , EventCount=int(1)
    , EventSchemaVersion='0.1.0'
    , EventResult= iff (ResponseElements has_cs 'Success', 'Success', 'Failure')
    , EventStartTime=TimeGenerated
    , EventEndTime=TimeGenerated
    , EventType='Logon'
    , LogonMethod=iff(AdditionalEventData has '"MFAUsed": "No"', 'NoMFA', 'MFA')
    , TargetUrl =tostring(todynamic(AdditionalEventData).LoginTo)
    , TargetUsernameType='Simple'
    , TargetUserIdType='AWSId'
    , TargetUsername= tostring(split(UserIdentityPrincipalid,':',1))
    | project-rename
      EventOriginalUid= AwsEventId
    , EventOriginalResultDetails= ErrorMessage
    , TargetUserType=UserIdentityType
    , TargetUserId=UserIdentityAccountId 
    , SrcDvcIpAddr=SourceIpAddress
    , HttpUserAgent=UserAgent
  // **** Aliases
  | extend
         User=TargetUsername
        , LogonTarget=tostring(split(TargetUrl,'?')[0])
        , Dvc=EventVendor
    };
    AWSLogon(starttime, endtime, targetusername_has, disabled)
