id: c10b22a0-6021-46f9-bdaf-05bf2350a554
name: Total ZAP count
description: |
  This query helps reviewing count of total ZAP events
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailPostDeliveryEvents
tactics:
  - Initial access
query: |
  EmailPostDeliveryEvents 
  | where Timestamp > ago(30d) 
  | where ActionType == "Phish ZAP" or ActionType == "Malware ZAP" 
  | count
