id: c10b22a0-6021-46f9-bdaf-05bf2350a554
name: Total ZAP count
description: |
  This query helps reviewing count of total ZAP events
description-detailed: |
  This query helps reviewing count of total ZAP events in Defender for Office 365
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailPostDeliveryEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailPostDeliveryEvents 
  | where Timestamp > ago(30d) 
  | where ActionType == "Phish ZAP" or ActionType == "Malware ZAP" 
  | count
version: 1.0.0