id: 0fd18337-e908-496a-b228-5f43be4e2629
name: Dataminr - alert enrichment using ASIM File Event
description: |
  'Rule helps to generate an incident which execute the Dataminr Pulse Alert Enrichment workflow when new data is available in ASIM File Event.'
severity: Medium
status: Available
requiredDataConnectors:
  - connectorId: DataminrPulseAlerts
    dataTypes:
      - imFileEvent
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: GreaterThan
triggerThreshold: 0
tactics: 
  - Execution
relevantTechniques:
  - T1053
query: |
  imFileEvent
  | where isnotempty(TargetFileMD5)
      or isnotempty(SrcFileMD5)
      or isnotempty(TargetFileSHA1)
      or isnotempty(SrcFileSHA1)
      or isnotempty(TargetFileSHA256)
      or isnotempty(SrcFileSHA256)
      or isnotempty(TargetFileSHA512)
      or isnotempty(SrcFileSHA512)
      or isnotempty(Hash)
incidentConfiguration:
  createIncident: true
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  SrcFileMD5: SrcFileMD5
  TargetFileMD5: TargetFileMD5
  SrcFileSHA1: SrcFileSHA1
  TargetFileSHA1: TargetFileSHA1
  SrcFileSHA256: SrcFileSHA256
  TargetFileSHA256: TargetFileSHA256
  TargetFileSHA512: TargetFileSHA512
  Hash: Hash
  SrcFileSHA512: SrcFileSHA512
entityMappings:
  - entityType: FileHash
    fieldMappings:
      - identifier: Value
        columnName: SrcFileMD5
version: 1.0.0
kind: Scheduled