id: 15725ed8-d1e5-43e8-aafc-ac8ef08883dd
name: Admin and User Submission Trend
description: |
  Admin and User Submission Trend
description-detailed: |
  Admin and User Submission Trend
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let totalAdminSubmission = CloudAppEvents
  | where ActionType == "AdminSubmission"
  | make-series Count= count() default = 0 on Timestamp step 1d
  | extend Details = "Admin submissions";
  let totalUserSubmission = CloudAppEvents
  | where ActionType == "UserSubmission"
  | make-series Count= count() default = 0 on Timestamp step 1d
  | extend Details = "User submissions";
  union totalAdminSubmission,totalUserSubmission
  | project Count, Details, Timestamp
  | render linechart
version: 1.0.0





