id: 1c390fd7-2668-4445-9b7d-055f3851be5f
name: Status of submissions
description: |
  This query helps reviewing status of submissions
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - Initial access
query: |
  CloudAppEvents
  | where Timestamp > ago(30d) 
  | extend Record= (parse_json(RawEventData)).RecordType 
  | extend SubmissionState = (parse_json(RawEventData)).SubmissionState  
  | extend UserKey = (parse_json(RawEventData)).UserKey 
  | where Record == 29 
  | where ActionType == "UserSubmission" or ActionType == "AdminSubmission" 
  | summarize count() by tostring(SubmissionState) 
  | sort by count_
