Parser:
  Title: Alert event ASIM schema function
  Version: '0.1.0'
  LastUpdated: Oct 18 2024
Product:
  Name: Microsoft
Normalization:
  Schema: Alert
  Version: '0.1'
References:
- Title: ASIM Alert Schema
  Link: https://aka.ms/ASimAlertDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Dhcp Event schema.
ParserName: vimAlertEmpty
EquivalentBuiltInParser: _Im_Alert_Empty
ParserQuery: |
  let EmptyAlertEvents =datatable (
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // ****** Event fields ******
  , EventType:string
  , EventProduct:string
  , EventProductVersion:string
  , EvenMessage:string
  , EventVendor:string
  , EventSchema:string
  , EventSchemaVersion:string
  , EventSeverity:string
  , EventSubType:string
  , EventOriginalUid:string
  , EventOriginalType:string
  , EventOriginalSubType:string
  , EventEndTime:datetime
  , EventReportUrl:string
  , EventStartTime:datetime
  //****** Device fields ******
  , DvcId:string
  , DvcHostname:string
  , DvcDomain:string
  , DvcIpAddr:string
  , DvcOs:string
  , DvcOsVersion:string
  , DvcMacAddr:string
  , DvcScopeId:string
  , DvcFQDN:string
  //****** Alert fields ******
  , AlertId:string
  , AlertName:string
  , AlertDescription:string
  , AlertStatus:string
  , AlertOriginalStatus:string
  , AlertSource:string
  , AlertVerdict:string
  , AlertVerdictDate:datetime
  , AttackTactics:string
  , AttackTechniques:string
  , IndicatorType:string
  , IndicatorAssociation:string
  , AlertSourceAnalyticDetails:string
  //****** Inspection fields ******
  , Rule: string
  , RuleNumber:int
  , RuleName:string
  , RuleDescription:string
  , ThreatId:string
  , ThreatName:string
  , ThreatFirstReportedTime:datetime
  , ThreatLastReportedTime:datetime
  , ThreatCategory:string
  , ThreatOriginalCategory:string
  , ThreatIsActive:bool
  , ThreatRiskLevel:int
  , ThreatOriginalRiskLevel:string
  , ThreatConfidence:int
  , ThreatOriginalConfidence:string
  //****** Source User fields ******
  , UserId:string
  , Username:string
  , SessionId:string
  , UserScopeId:string
  //****** System fields ******
  , Hostname:string
  , IpAddr:string
  , PortNumber:int
  , GeoLongitude:real
  , GeoLatitude:real
  , GeoCity:string
  , GeoCountry:string
  , GeoRegion:string
  //****** Process fields ******
  , ProcessId:string
  , ProcessName:string
  , ProcessCommandLine:string
  , ProcessFileCompany:string
  //****** File fields ******
  , FileName:string
  , FilePath:string
  , FileSHA1:string
  , FileMD5:string
  , FileSHA256:string
  , FileSize:int
  //****** Registry fields ******
  , RegistryKey:string
  , RegistryValue:string
  , RegistryValueType:string
  , RegistryValueData:string
  //****** Email fields ******
  , EmailSubject:string
  , EmailMessageId:string
  )[];
  EmptyAlertEvents