---
"$schema": https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#
contentVersion: 1.0.0.0
parameters:
  workspace:
    type: String
resources:
  - id: "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'),
    'Microsoft.SecurityInsights'),'/alertRules/52a51512-5c38-4e0e-a741-aa2afe6c8d34')]"
    name: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/52a51512-5c38-4e0e-a741-aa2afe6c8d34')]"
    type: Microsoft.OperationalInsights/workspaces/providers/alertRules
    kind: Scheduled
    apiVersion: 2022-09-01-preview
    properties:
      displayName: Ransomware Alert
    description: Take custom fields in alert
    severity: High
    enabled: true
    query: |
      let outliers =
          SecurityAlert
          | where TimeGenerated > now() - 300d
          | summarize by AlertName;
      HeliosAuditNativePoller_CL
      | where id_s !in (outliers)
      | extend d=parse_json(propertyList_s)
      | extend entityId=d[0].value
      | extend object=d[1].value
      | extend source=d[3].value
      | extend cid=d[4].value
      | extend cluster=d[6].value
      | extend jobId=d[7].value
      | extend jobName=d[8].value
      | extend jobInstanceId=d[10].value
      | extend jobStartTimeUsecs=d[11].value
      | extend anomalyStrength=d[12].value
      | extend severity = case(anomalyStrength >= 70, "High",
          anomalyStrength < 30, "Low",
          "Medium"
          )
      | summarize arg_max(TimeGenerated, *) by id_s
      | project
          TimeGenerated,
          alertDocument_alertDescription_s,
          alertDocument_alertHelpText_s,
          alertDocument_alertName_s,
          anomalyStrength,
          cid,
          cluster,
          entityId,
          id_s,
          jobId,
          jobInstanceId,
          jobName,
          jobStartTimeUsecs,
          object,
          severity,
          source;
queryFrequency: PT5M
queryPeriod: PT5M
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics: []
techniques: []
alertRuleTemplateName:
  incidentConfiguration:
    createIncident: true
    groupingConfiguration:
      enabled: false
      reopenClosedIncident: false
      lookbackDuration: PT5H
      matchingMethod: AllEntities
      groupByEntities: []
      groupByAlertDetails: []
      groupByCustomDetails: []
    eventGroupingSettings:
      aggregationKind: AlertPerResult
    alertDetailsOverride:
      alertDisplayNameFormat: "{{source}}"
      alertDescriptionFormat: "{{alertDocument_alertDescription_s}}"
      alertSeverityColumnName: severity
    customDetails:
      Snapshot_Details: alertDocument_alertHelpText_s
      Anamoly_Strength: anomalyStrength
      cid: cid
      entityId: entityId
      jobId: jobId
      jobInstanceId: jobInstanceId
      jobStartTimeUsecs: jobStartTimeUsecs
      object: object
    entityMappings:
      - entityType: Host
        fieldMappings:
          - identifier: HostName
        columnName: object
    - entityType: CloudApplication
      fieldMappings:
        - identifier: Name
          columnName: cluster
    - entityType: FileHash
      fieldMappings:
        - identifier: Value
          columnName: entityId
    - entityType: DNS
      fieldMappings:
        - identifier: DomainName
          columnName: source
    - entityType: Malware
      fieldMappings:
        - identifier: Name
          columnName: anomalyStrength
      sentinelEntitiesMappings:
