---
"$schema": https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#
contentVersion: 1.0.0.0
parameters:
  workspace:
    type: String
resources:
- id: "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'),
    'Microsoft.SecurityInsights'),'/alertRules/52a51512-5c38-4e0e-a741-aa2afe6c8d34')]"
  name: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/52a51512-5c38-4e0e-a741-aa2afe6c8d34')]"
  type: Microsoft.OperationalInsights/workspaces/providers/alertRules
  kind: Scheduled
  apiVersion: 2022-09-01-preview
  properties:
    displayName: Ransomware Alert
    description: Take custom fields in alert
    severity: High
    enabled: true
    query: "let outliers = \n    SecurityAlert\n    | where TimeGenerated > now()
      - 300d    \n    | summarize by AlertName;\nHeliosAuditNativePoller_CL\n| where
      id_s !in (outliers)\n| extend d=parse_json(propertyList_s) \n| extend entityId=d[0].value\n|
      extend object=d[1].value \n| extend source=d[3].value \n| extend cid=d[4].value
      \n| extend cluster=d[6].value \n| extend jobId=d[7].value \n| extend jobName=d[8].value
      \n| extend jobInstanceId=d[10].value \n| extend jobStartTimeUsecs=d[11].value
      \n| extend anomalyStrength=d[12].value \n| extend severity = case(anomalyStrength
      >= 70, \"High\",\n                        anomalyStrength < 30, \"Low\",\n                        \"Medium\"\n
      \                       )\n| summarize arg_max(TimeGenerated, *) by id_s\n|
      project\n    TimeGenerated,\n    alertDocument_alertDescription_s,\n    alertDocument_alertHelpText_s,\n
      \   alertDocument_alertName_s,\n    anomalyStrength,\n    cid,\n    cluster,\n
      \   entityId,\n    id_s,\n    jobId,\n    jobInstanceId,\n    jobName,\n    jobStartTimeUsecs,\n
      \   object,\n    severity,\n    source;\n\n"
    queryFrequency: PT5M
    queryPeriod: PT5M
    triggerOperator: GreaterThan
    triggerThreshold: 0
    suppressionDuration: PT5H
    suppressionEnabled: false
    tactics: []
    techniques: []
    alertRuleTemplateName:
    incidentConfiguration:
      createIncident: true
      groupingConfiguration:
        enabled: false
        reopenClosedIncident: false
        lookbackDuration: PT5H
        matchingMethod: AllEntities
        groupByEntities: []
        groupByAlertDetails: []
        groupByCustomDetails: []
    eventGroupingSettings:
      aggregationKind: AlertPerResult
    alertDetailsOverride:
      alertDisplayNameFormat: "{{source}}"
      alertDescriptionFormat: "{{alertDocument_alertDescription_s}}"
      alertSeverityColumnName: severity
    customDetails:
      Snapshot_Details: alertDocument_alertHelpText_s
      Anamoly_Strength: anomalyStrength
      cid: cid
      entityId: entityId
      jobId: jobId
      jobInstanceId: jobInstanceId
      jobStartTimeUsecs: jobStartTimeUsecs
      object: object
    entityMappings:
    - entityType: Host
      fieldMappings:
      - identifier: HostName
        columnName: object
    - entityType: CloudApplication
      fieldMappings:
      - identifier: Name
        columnName: cluster
    - entityType: FileHash
      fieldMappings:
      - identifier: Value
        columnName: entityId
    - entityType: DNS
      fieldMappings:
      - identifier: DomainName
        columnName: source
    - entityType: Malware
      fieldMappings:
      - identifier: Name
        columnName: anomalyStrength
    sentinelEntitiesMappings:
