id: 9c1e9381-79dd-4ddf-9570-b73a1dc59fe0
name: Anomaly Sign In Event from an IP
description: |
  'Identifies anomalies event from a given IP address to an Application in the last hour.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs 
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
query: |
  SigninLogs
  | where TimeGenerated >= ago(1h)
  | summarize SuccessCount = countif(ResultType == 0), FailureCount = countif(ResultType !=0),EventCount = count() by AppDisplayName, IPAddress, bin(TimeGenerated,15m)
  | order by TimeGenerated
  | summarize EventCount = make_list(EventCount), TimeGenerated = make_list(TimeGenerated), SuccessCount = make_list(SuccessCount), FailureCount = make_list(FailureCount) by IPAddress, AppDisplayName
  | extend (Anomalies, Score, Baseline) = series_decompose_anomalies(EventCount,1.5,-1,'linefit')
  | mv-expand EventCount,TimeGenerated,Anomalies,Baseline,Score
  | where Anomalies == 1
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPAddress
  - entityType: CloudApplication
    fieldMappings:
      - identifier: Name
        columnName: AppDisplayName
customDetails:
  Score: Score
  Baseline: Baseline
version: 1.0.0
kind: Scheduled
