{
    "id": "SAP",
    "title": "SAP",
    "publisher": "Microsoft",
    "logo": "https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Solutions/SAP/Workbooks/SAPVMIcon.svg",
    "descriptionMarkdown": "SAP systems and applications handle massive volumes of business-critical data, hosted on cloud/on-premises infrastructure. Due to the complexity of the SAP ecosystem, security operations (SecOps) teams face the challenge of effectively monitoring and protecting their organization against growing threats. A breach of the SAP system could result in data loss, disruption to business processes, loss of revenue, and major reputation damage.\n The Microsoft Sentinel SAP connector, part of the Microsoft Sentinel Solution for SAP® Applications, ingests SAP logs to Microsoft Sentinel workspaces. You can access raw data using the built-in Microsoft Sentinel Solution for SAP content or using custom content. The connector ingests SAP NetWeaver (RFC) application layer logs, including Security Auditlogs, Application logs, ChangeDocuments, Spool Logs, Change Request data, User masterdata, and more.\n The Microsoft Sentinel solution for SAP will be generally available with a six-month free promotion starting in August 2022. Billing will start in February 2023, as an add-on charge in addition to the existing Microsoft Sentinel consumption-billing model for monitoring SAP production systems.",
    "graphQueries": [
        {
            "metricName": "Total data received",
            "legend": "SAP",
            "baseQuery": "SAPConnectorOverview()"
        }
    ],
    "sampleQueries": [
        {
            "description": "SAP Connector Overview",
            "query": "SAPConnectorOverview()"
        },
        {
            "description": "Users Get Privileged",
            "query": "SAPUsersGetPrivileged()"
        }
    ],
    "connectivityCriterias": [
        {
            "type": "SentinelKinds",
            "value": [
                "SAP"
            ]
        },
        {
            "type": "IsConnectedQuery",
            "value": [
                "SAPConnectorOverview()\n            | summarize LastLogReceived = max(TimeGenerated) \n                | project IsConnected = LastLogReceived > ago(7d)"
            ]
        }
    ],
    "isConnectivityCriteriasMatchSome": true,
    "dataTypes": [
        {
            "name": "SAPConnectorOverview",
            "lastDataReceivedQuery": "SAPConnectorOverview() \n| summarize Time = max(TimeGenerated) \n            | where isnotempty(Time)"
        },
        {
            "name": "SAPAuditLog",
            "lastDataReceivedQuery": "SAPAuditLog \n| summarize Time = max(TimeGenerated) \n            | where isnotempty(Time)"
        }
    ],
    "availability": {
        "status": 2,
        "isPreview": false,
        "featureFlag": {
            "feature": "MdatpRawData",
            "featureStates": {
                "1": 2,
                "2": 2,
                "3": 2,
                "4": 2,
                "5": 2
            }
        }
    },
    "permissions": {
        "tenant": [
            "GlobalAdmin",
            "SecurityAdmin"
        ],
        "resourceProvider": [
            {
                "provider": "Microsoft.OperationalInsights/workspaces",
                "permissionsDisplayText": "read and write permissions.",
                "providerDisplayName": "Workspace",
                "scope": "Workspace",
                "requiredPermissions": {
                    "read": true,
                    "write": true,
                    "delete": true
                }
            }
        ],
        "customs": [
            {
                "name": "Documentation",
                "description": "Complete documentation including on-premise and any cloud coverage"
            },
            {
                "name": "Infrastructure (Azure)",
                "description": "* Azure Ubuntu, RHEL, or SLES Virtual Machine with a system managed identity.\n* Azure Key Vault with write-read access policy assigned to the Virtual Machine identity."
            },
            {
                "name": "SAP systems",
                "description": "SAP ABAP NetWeaver systems support. Review the complete Basis Requirements.\nSAP ABAP connector user with a password or certificate (SNC).\nApply the user permissions with the authorization profile, or use the Sample Authorizations Role CR / Transport form.\nOptionally deploy the ALL logs CR (single CR) on SAP (STMS)."
            },
            {
                "name": "Pricing",
                "description": "The Microsoft Sentinel solution for SAP will be billed as an add-on charge from May 2023, at $2 per production system ID (SID) per hour in addition to the existing Microsoft Sentinel consumption-billing model. The solution will be free when a workspace is in a Microsoft Sentinel free trial. Systems configured for development and test usage will remain free of the additional charge. Please see offer page for more details."
            }
        ]
    }
}