{
    "Name": "baseVISION Threat Intelligence",
    "Author": "baseVISION - support@basevision.ch",
    "Logo": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Solutions/baseVISION%20Threat%20Intel/Workbooks/Images/baseVISION.svg\" width=\"75px\" height=\"75px\">",
    "Description": "The baseVISION Threat Intel Feeds offering provides tactical threat intelligence to detect and protect against known threats within an organization's environment before they can cause harm. The service leverages multiple sources integrated into its platform, curated and maintained by specialists to ensure quality, including Indicators of Compromise (IOCs), confidence levels, and expiration. The sources include data gathered from customers during incident analysis and response, as well as paid feeds from highly rated threat intelligence providers.\n\n**Important:** _This Sentinel Solution provides additional components to our Threat Intel Feeds which can be bought via Microsoft Azure Marketplace._\r\n\n",
    "WorkbookBladeDescription": "This workbook provides insights into Threat Intel feeds integrated into the selected Microsoft Sentinel Workspace regarding quality, speed and efficienty.",
    "PlaybooksBladeDescription": "**Telemetry**: This playbook is triggered every four hours and sends basic telemetry to baseVISION to improve the feeds. The telemetry data only contains IOC's provided by baseVISION together with the analysts classification of incidents associated with it.\r\n**Defender XDR**: This playbook is triggered every 15 minutes and sends IOCs to Microsoft Defender XDR. The IOCs are filtered based on the confidence level and are not part of the Microsoft Feeds to stay withtin the 15000 limit of Microsoft Defender XDR. After the deployment you need to grant the managed identity access to the Microsoft Defender XDR API. Copy the following script which can be executed in the Cloud Shell or in a local PowerShell session. # Replace with your managed identity object ID\n\n$miName = \"la-basevisionti-defenderxdr-uami\"\n\n# The app ID of the Defender API where the permissions are required\n\n$appId = \"fc780465-2017-40d4-a0c5-307022471b92\"\n\n# Replace with the API permissions required by your app\n\n$permissionsToAdd = @(\"Ti.ReadWrite.All\")\n\nConnect-AzureAD\n\n$miObjectID = (Get-AzADServicePrincipal -DisplayName $miName).Id\n\n$app = Get-AzureADServicePrincipal -Filter \"AppId eq '$appId'\"\n\nforeach ($permission in $permissionsToAdd)\n\n{\n\n   $role = $app.AppRoles | where Value -Like $permission | Select-Object -First 1\n\n   New-AzureADServiceAppRoleAssignment -Id $role.Id -ObjectId $miObjectID -PrincipalId $miObjectID -ResourceId $app.ObjectId\n\n",
    "Data Connectors": [
      
    ],
    "Workbooks": [
      "Workbooks/baseVISION-TIFeedDashboard.json"
    ],
    "Analytic Rules": [
      
    ],
    "Playbooks": [
      "Playbooks/la-basevisionti-telemetry.json",
      "Playbooks/la-basevisionti-defenderxdr.json"
    ],
    "Metadata": "SolutionMetadata.json",
    "BasePath": "C:\\Repos\\Azure-Sentinel-BvTiFeed\\Solutions\\baseVISION Threat Intel",
    "Version": "2.0.2",
    "TemplateSpec": true,
    "Is1PConnector": false
  }