id: 5090ad7b-4b47-4cab-9015-bffb43aecde8
name: Acronis - Multiple Inboxes with Malicious Content Detected
description: Many inboxes containing malicious content could indicate a potential ongoing phishing attack.
severity: Medium
query: |
    CommonSecurityLog
    | where DeviceVendor == "Acronis"
    | where DeviceEventClassID in
    ("MaliciousURLDetectedInM365MailboxBackup",
    "MalwareDetectedInM365MailboxBackup",
    "MaliciousEmailDetectedPerceptionPointWarning")
    | extend EventDate = startofday(TimeGenerated)
    | summarize MachineCount = dcount(DeviceExternalID) by EventDate
    | where MachineCount >= 3
queryFrequency: 5h
queryPeriod: 5h
triggerOperator: gt
triggerThreshold: 0
tactics:
    - InitialAccess
relevantTechniques:
    - T1566.002
    - T1566.001
incidentConfiguration:
    createIncident: true
    groupingConfiguration:
        enabled: true
        reopenClosedIncident: true
        lookbackDuration: P1D
        matchingMethod: AllEntities
        groupByAlertDetails:
            - DisplayName
eventGroupingSettings:
    aggregationKind: SingleAlert
alertDetailsOverride:
    alertDisplayNameFormat: 'Acronis - Multiple Inboxes {{MachineCount}} with Malicious Content Detected on {{EventDate}}'
    alertDynamicProperties: []
version: 1.0.0
kind: Scheduled
requiredDataConnectors: []
