id: 1385f0ce-69d9-4abf-8039-52080c8c7017
name: Acronis - Multiple Endpoints Accessing Malicious URLs
description: 'Multiple endpoints accessing malicious URLs could indicate an ongoing phishing attack, with several employees interacting with those URLs.'
severity: Medium
query: |
    CommonSecurityLog
    | where DeviceVendor == "Acronis"
    | where DeviceEventClassID == "MaliciousUrlDetected"
    | extend EventDate = startofday(TimeGenerated)
    | summarize MachineCount = dcount(DeviceExternalID) by EventDate
    | where MachineCount >= 3
queryFrequency: 5h
queryPeriod: 5h
triggerOperator: gt
triggerThreshold: 0
tactics:
    - Execution
relevantTechniques:
    - T1204.001
incidentConfiguration:
    createIncident: true
    groupingConfiguration:
        enabled: true
        reopenClosedIncident: true
        lookbackDuration: P1D
        matchingMethod: AllEntities
eventGroupingSettings:
    aggregationKind: SingleAlert
alertDetailsOverride:
    alertDisplayNameFormat: 'Acronis - Multiple Endpoints ({{MachineCount}}) Accessing Malicious URLs on {{EventDate}}'
    alertDynamicProperties: []
entityMappings: []
version: 1.0.0
kind: Scheduled
requiredDataConnectors: []
