id: 84037130-a623-46c2-9144-0c0955ac4112
name: Acronis - Login from Abnormal IP - Low Occurrence
description: Suspicious login from an IP address observed up to two times in the last two weeks.
severity: Medium
query: |
    CommonSecurityLog
    | where DeviceVendor == "Acronis audit"
    | extend initiator_ip = tostring(parse_json(DeviceCustomString1).initiator_ip)
    | summarize LoginCount = count() by initiator_ip
    | where LoginCount <= 2
    | order by LoginCount asc
queryFrequency: 1d
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
    - InitialAccess
relevantTechniques:
    - T1078
incidentConfiguration:
    createIncident: true
    groupingConfiguration:
        enabled: true
        reopenClosedIncident: true
        lookbackDuration: P7D
        matchingMethod: Selected
        groupByEntities:
            - IP
eventGroupingSettings:
    aggregationKind: AlertPerResult
alertDetailsOverride:
    alertDisplayNameFormat: 'Acronis - Login from Abnormal IP ({{initiator_ip}}) - Low Occurrence ({{LoginCount}})'
    alertDynamicProperties: []
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: initiator_ip
version: 1.0.0
kind: Scheduled
requiredDataConnectors: []
