id: a783ade7-bf43-416d-b809-8f5b06d87790
name: Acronis - Multiple Endpoints Infected by Ransomware
description: Detects when three or more distinct endpoints report ransomware detections within a single day.
severity: High
query: |
    CommonSecurityLog
    | where DeviceVendor == "Acronis"
    | where DeviceEventClassID == "ActiveProtectionBlocksSuspiciousActivity"
    | extend EventDate = startofday(TimeGenerated)
    | summarize MachineCount = dcount(DeviceExternalID) by EventDate
    | where MachineCount >= 3
queryFrequency: 5h
queryPeriod: 5h
triggerOperator: gt
triggerThreshold: 0
tactics:
    - Impact
relevantTechniques:
    - T1486
incidentConfiguration:
    createIncident: true
    groupingConfiguration:
        enabled: true
        reopenClosedIncident: true
        lookbackDuration: P1D
        matchingMethod: AllEntities
eventGroupingSettings:
    aggregationKind: SingleAlert
alertDetailsOverride:
    alertDisplayNameFormat: 'Acronis - Multiple Endpoints ({{MachineCount}}) Infected by Ransomware on {{EventDate}}'
    alertDynamicProperties: []
version: 1.0.0
kind: Scheduled
requiredDataConnectors: []
