SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes: 
- DataType: AuditLogs
RequiredInputFieldsSets:
- - Account_Name
  - Account_UPNSuffix
- - Account_AadUserId
BaseQuery: |- 
  let UserConsentToApplication = (Account_Name:string, Account_UPNSuffix:string, Account_AadUserId:string){
  let account_upn = iff(Account_Name != "" and Account_UPNSuffix != ""
  , strcat(Account_Name,"@",Account_UPNSuffix)
  ,"" );
  AuditLogs
  | where OperationName == "Consent to application"
  | extend Source_Account_UPNSuffix = tostring(todynamic(InitiatedBy) ["user"]["userPrincipalName"]), Source_Account_AadUserId = tostring(todynamic(InitiatedBy) ["user"]["id"])
  | where (account_upn != "" and account_upn =~ Source_Account_UPNSuffix) 
  or (Account_AadUserId != "" and Account_AadUserId =~ Source_Account_AadUserId)
  | extend Target_CloudApplication_Name = tostring(todynamic(TargetResources)[0]["displayName"]), Target_CloudApplication_AppId = tostring(todynamic(TargetResources)[0]["id"])
  };
  UserConsentToApplication('{{Account_Name}}', '{{Account_UPNSuffix}}', '{{Account_AadUserId}}')

Activities:
     EnabledByDefault: true
     Title: "The user consented to OAuth application {{Target_CloudApplication_Name}} {{Count}} time(s)"
     Content: "The user consented to OAuth application {{Target_CloudApplication_Name}} {{Count}} time(s)"
     Items: 
        - Id: 5e9ecee5-e7a4-4a2a-94c4-9c0e22e1b673
          Description: This activity lists user's consents to OAuth applications.
          QueryDefinitions:
            SummarizeBy: Target_CloudApplication_AppId, Target_CloudApplication_Name
