SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes: 
- DataType: AuditLogs
RequiredInputFieldsSets:
- - Account_Name
  - Account_UPNSuffix
- - Account_AadUserId
BaseQuery: |- 
  let UserConsentToApplication = (account_username:string, account_upnsuffix:string, account_aaduserid:string){
  let account_upn = iff(account_username != "" and account_upnsuffix != ""
  , strcat(account_username,"@",account_upnsuffix)
  ,"" );
  AuditLogs
  | where OperationName == "Consent to application"
  | extend Source_Account_UPNSuffix = tostring(todynamic(InitiatedBy) ["user"]["userPrincipalName"]), Source_Account_AadUserId = tostring(todynamic(InitiatedBy) ["user"]["id"])
  | where (account_upn != "" and account_upn =~ Source_Account_UPNSuffix) 
  or (account_aaduserid != "" and account_aaduserid =~ Source_Account_AadUserId)
  | extend Target_CloudApplication_Name = tostring(todynamic(TargetResources)[0]["displayName"]), Target_CloudApplication_AppId = tostring(todynamic(TargetResources)[0]["id"])
  };
  UserConsentToApplication('{{Account_Name}}', '{{Account_UPNSuffix}}', '{{Account_AadUserId}}')

Activities:
     EnabledByDefault: true
     Title: "The user consented to OAuth application '{{Target_CloudApplication_Name}}' '{{Count}}' times"
     Content: "The user consented to OAuth application '{{Target_CloudApplication_Name}}' '{{Count}}' times"
     Items: 
        - Id: 5e9ecee5-e7a4-4a2a-94c4-9c0e22e1b673
          Description: This activity lists user's consents to OAuth applications.
          QueryDefinitions:
            SummarizeBy: Target_CloudApplication_AppId, Target_CloudApplication_Name