SchemaVersion: 1.0
Type: KQL
Provider: Sentinel
DataTypes:
  - DataType: SecurityEvent
RequiredInputFieldsSets:
  - - Account_Name
    - Account_NTDomain
  - - Account_SID
BaseQuery: |
  let WellKnownLocalSID = 'S-1-5-32-5[0-9][0-9]$';
  let WellKnownGroupSID = 'S-1-5-21-[0-9]*-[0-9]*-[0-9]*-5[0-9][0-9]$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-1102$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-1103$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-498$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-1000$';
  let GetGroupAddForUser = (v_Account_Name:string, v_Account_NTDomain:string, v_Account_SID:string){
  SecurityEvent
  | where EventID in (4728, 4732, 4756)
  | where AccountType =~ 'User'
  | extend Account_Name = case(
  // Handles mixed use scenario of NTDomain\AccountName@UPNSuffix
  SubjectUserName has '@' and SubjectUserName has '\\', tostring(split(tostring(split(SubjectUserName, '\\')[1]),'@')[0]),
  SubjectUserName has '@', tostring(split(SubjectUserName, '@')[0]),
  SubjectUserName has '\\', tostring(split(SubjectUserName, '\\')[1]),
  SubjectUserName
  )
  | extend Account_NTDomain = case(
  SubjectDomainName has '\\', tostring(split(SubjectDomainName, '\\')[0]),
  // Handles UPN scenario of AccountName@UPNSuffix to pull potential NTDomain from
  SubjectDomainName has '@', tostring(split(tostring(split(SubjectDomainName, '@')[1]),'.')[0]),
  SubjectDomainName
  )
  | extend MemberAdded = case( MemberName has 'CN=', tostring(split(tostring(split(MemberName, ',')[0]),'CN=')[1]), MemberName == '-', MemberSid, MemberName)
  | extend MemberNameMatch = iff(isnotempty(v_Account_Name) and MemberAdded has v_Account_Name, true, false)
  | extend MemberNTDomainMatch = iff(isnotempty(v_Account_NTDomain) and MemberAdded has v_Account_NTDomain, true, false)
  | extend MemberSidMatch = iff(isnotempty(v_Account_SID) and MemberSid =~ v_Account_SID, true, false)
  | extend SubjectNameMatch = iff(isnotempty(v_Account_Name) and SubjectUserName =~ v_Account_Name, true, false)
  | extend SubjectNTDomainMatch = iff(isnotempty(v_Account_NTDomain) and SubjectDomainName =~ v_Account_NTDomain, true, false)
  | extend SubjectSidMatch = iff(isnotempty(v_Account_SID) and SubjectUserSid has v_Account_SID, true, false)
  | where (MemberNameMatch == true and MemberNTDomainMatch == true) or MemberSidMatch == true or (SubjectNameMatch == true and SubjectNTDomainMatch == true) or SubjectSidMatch == true 
  | project TimeGenerated, EventID, Activity, Computer, MemberName, MemberAdded, MemberSid, TargetUserName, TargetDomainName, TargetSid, UserPrincipalName, SubjectAccount, SubjectUserName, SubjectUserSid, WellKnownGroupSID, WellKnownLocalSID, 
  MemberNameMatch, MemberNTDomainMatch, MemberSidMatch, SubjectNameMatch, SubjectNTDomainMatch, SubjectSidMatch  
  | extend GroupName = TargetUserName, AddedBy = SubjectAccount
  //support for Activities
  | extend timestamp = TimeGenerated, AccountCustomEntity = SubjectAccount
  };
  GetGroupAddForUser('{{Account_Name}}', '{{Account_NTDomain}}', '{{Account_SID}}')
# The queries for the insights.
Insights:
 Id: bec9d204-c96c-4a34-8042-b49e89dbff89
 DisplayName: Group additions
 Description: |
   Summary of user additions to Groups for the specific user. Specifically, we provide the count of All Groups, [Privileged Groups](https://docs.microsoft.com/windows/security/identity-protection/access-control/active-directory-security-groups) and Remote Desktop Users Group.
 DefaultTimeRange: 
   BeforeRange: 12h
   AfterRange: 12h
 TableQuery:
  ColumnsDefinitions:
  - Header: "Groups"
    OutputType: String
    SupportDeepLink: false
  - Header: GroupCount
    OutputType: Number
    SupportDeepLink: true
  - Header: HostCount
    OutputType: Number
    SupportDeepLink: true
  QueriesDefinitions:

  # UserAddedToPrivilegedGroups
  - Filter:    "where ((MemberNameMatch == true and MemberNTDomainMatch == true) or MemberSidMatch == true) and (TargetSid matches regex WellKnownLocalSID or TargetSid matches regex WellKnownGroupSID)"
    Summarize: "summarize GroupCount = dcount(GroupName), HostCount = dcount(Computer) by SubjectAccount"
    Project:   "project Title = 'Privileged', GroupCount, HostCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: HostCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UserAddedToRemoteDesktopGroup
  - Filter:    "where ((MemberNameMatch == true and MemberNTDomainMatch == true) or MemberSidMatch == true) and TargetSid in ('S-1-5-32-555')"
    Summarize: "summarize GroupCount = dcount(GroupName), HostCount = dcount(Computer) by SubjectAccount"
    Project:   "project Title = 'Remote Desktop', GroupCount, HostCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: HostCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UserAddedToPrivilegedGroupsExcludeRDP
  - Filter:    "where ((MemberNameMatch == true and MemberNTDomainMatch == true) or MemberSidMatch == true) and (TargetSid matches regex WellKnownLocalSID or TargetSid matches regex WellKnownGroupSID) | where TargetSid !in ('S-1-5-32-555')"
    Summarize: "summarize GroupCount = dcount(GroupName), HostCount = dcount(Computer) by SubjectAccount"
    Project:   "project Title = 'Privileged(non-RDP)', GroupCount, HostCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: HostCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UserAddedToGroups
  - Filter:    "where (MemberNameMatch == true and MemberNTDomainMatch == true) or MemberSidMatch == true"
    Summarize: "summarize GroupCount = dcount(GroupName), HostCount = dcount(Computer) by SubjectAccount"
    Project:   "project Title = 'All Groups', GroupCount, HostCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: HostCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # GroupsAddedUsersTo
  - Filter:    "where (SubjectNameMatch == true and SubjectNTDomainMatch == true) or SubjectSidMatch == true"
    Summarize: "summarize GroupCount = dcount(GroupName), HostCount = dcount(Computer) by SubjectAccount"
    Project:   "project Title = 'Groups this user added users to', GroupCount, HostCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: HostCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UsersAddedToGroups
  - Filter:    "where (SubjectNameMatch == true and SubjectNTDomainMatch == true) or SubjectSidMatch == true "
    Summarize: "summarize GroupCount = dcount(MemberAdded), HostCount = dcount(Computer) by SubjectAccount"
    Project:   "project Title = 'Users this user added to Groups', GroupCount, HostCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: HostCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

 ChartQuery: 
  Title: "Group additions per hour"
  DataSets: 
   - Query: "summarize Count = count() by bin(TimeGenerated, 1h) | extend Legend = 'Total'"
     XColumnName: "TimeGenerated"
     YColumnName: "Count"
     LegendColumnName: "Legend"
  Type: LineChart

 AdditionalQuery:
  Text: "See all group additions related to user"
  Query: "project TimeGenerated, EventID, Activity, Computer, MemberName, MemberAdded, MemberSid, TargetUserName, TargetDomainName, TargetSid, UserPrincipalName, SubjectAccount, SubjectUserName, SubjectUserSid, WellKnownGroupSID, WellKnownLocalSID | order by TimeGenerated desc"

Activities:
 EnabledByDefault: true
 Items:
 - Id: febba410-e7d6-4c63-8fe5-2b93f448b7a1
   Title: "The account was added to a privileged group {{TargetUserName}}"
   Content: "The account was added to a  privileged group by '{{SubjectAccount}}' '{{Count}}' times"
   Description: "This activity displays the account was added to a privileged group event"
   QueryDefinitions:
    Filter: "where ((MemberNameMatch == true and (MemberNTDomainMatch == true or MemberDnsDomainMatch == true or MemberUPNSuffixMatch == true)) or MemberSidMatch == true) and (TargetSid matches regex WellKnownLocalSID or TargetSid matches regex WellKnownGroupSID) | where TargetSid !in ('S-1-5-32-555')"
    SummarizeBy: "SubjectAccount, TargetUserName, TargetSid"
 - Id: 5ae2baf4-de7b-40f0-a861-8852266bfcd0
   Title: "The account was added to a remote desktop group {{TargetUserName}}"
   Content: "The account was added to a  remote desktop group by '{{SubjectAccount}}' '{{Count}}' times"
   Description: "This activity displays the account was added to Remote Desktop group"
   QueryDefinitions:
    Filter: "where ((MemberNameMatch == true and (MemberNTDomainMatch == true or MemberDnsDomainMatch == true or MemberUPNSuffixMatch == true)) or MemberSidMatch == true) and TargetSid in ('S-1-5-32-555')"
    SummarizeBy: "SubjectAccount, TargetUserName, TargetSid"
 - Id: bf56473d-b9bd-4eb1-96d0-8569ec7a9003
   Title: "The account has added {{SubjectAccount}} to group {{TargetUserName}}"
   Content: "The account has added {{SubjectAccount}} to group {{TargetUserName}}"
   Description: "This activity displays the account was added to Remote Desktop group"
   QueryDefinitions:
    Filter: "where (SubjectNameMatch == true and (SubjectNTDomainMatch == true or SubjectDnsDomainMatch == true or SubjectUPNSuffixMatch == true)) or SubjectSidMatch == true"
    SummarizeBy: "SubjectAccount, TargetUserName, TargetSid"
