SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes: 
- DataType: OfficeActivity
RequiredInputFieldsSets:
- - Account_Name
  - Account_UPNSuffix
- - Account_Sid
BaseQuery: |- 
  let TLQ_UserActedOnForeignMailbox = (Account_Name:string, Account_UPNSuffix:string, account_sid:string){
  let account_upn = iff(Account_Name!="" and Account_UPNSuffix != ""
  ,strcat(Account_Name,"@",Account_UPNSuffix)
  ,"");
  OfficeActivity
  | where RecordType == "ExchangeItem" and UserType =="Regular" and Operation !contains "InboxRule"
  | where LogonUserSid != MailboxOwnerSid 
  | where ((account_sid != "" and LogonUserSid =~ account_sid)
       or ( account_upn != "" and UserId =~ account_upn ))
  };
  TLQ_UserActedOnForeignMailbox('{{Account_Name}}', '{{Account_UPNSuffix}}', '{{Account_Sid}}')

Activities:
     EnabledByDefault: true
     Title: "The user acted on another's mailbox"
     Content: "The user acted on mailbox {{MailboxOwnerUPN}} {{Count}} time(s)"
     Items: 
        - Id: 1f82f263-d694-469a-9717-1b3edf9d3bb2
          Description: This activity lists user's activities on others' mailbox
          QueryDefinitions:
            SummarizeBy: MailboxOwnerSid, MailboxOwnerUPN
