id: 3b7df29e-a798-4b6b-9ef7-73b9a3cf56a2
name: AWS route table attribute modifications
description: |
  Identifies route table modifications that may indicate attempts to redirect traffic or gain unauthorized access to network resources.
severity: Low
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562.004
query: |
  AWSCloudTrail
  | where EventName in ("CreateRoute", "DeleteRoute", "ReplaceRoute") and isempty(ErrorCode) and isempty(ErrorMessage)
  | project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, 
  UserIdentityUserName, SessionMfaAuthenticated,UserIdentityArn, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
  | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
  | order by TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0