id: b9b0fd12-d72d-4f66-a013-c1acdeea2670
name: RDS instance master password changed
description: |
  'Detected change of the RDS Master password. Verify if this was intentional, or if it was caused by a malicious actor.'
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Privilege Escalation
relevantTechniques:
  - T1484
query: |
    AWSCloudTrail
    | where  EventName == "ModifyDBCluster" and isempty(ErrorCode) and isempty(ErrorMessage)
    | where isnotempty(tostring(parse_json(RequestParameters).masterUserPassword))
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | extend timestamp = TimeGenerated, IPCustomEntity = SourceIpAddress, AccountCustomEntity = UserIdentityUserName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity