id: 7e258a45-b356-44f6-9a62-2643cef7b869
name: AWS IAM AccessDenied discovery events
description: |
  Identifies excessive AccessDenied discovery events for IAM users within short intervals, which may indicate stolen credentials being used to enumerate permissions and resources.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Discovery
relevantTechniques:
  - T1087.002
  - T1087.003
  - T1087.004
  - T1069.002
  - T1069.003
query: |
    AWSCloudTrail
    | where ErrorMessage in ("Access Denied","AccessDenied") and UserIdentityType == 'IAMUser' and UserAgent !endswith ".amazonaws.com"
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), failures = count() by SourceIpAddress, UserIdentityUserName, UserIdentityArn, bin(TimeGenerated, 1h)
    | where failures >= 5
    | order by failures desc, EndTime desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0