id: d022a62c-643b-4e8a-b583-0230e32a96e4
name: AWS IAM user and group object changes
description: |
  Identifies IAM user and group object creation or deletion events that may indicate unauthorized identity administration, privilege abuse, or defense evasion activity.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - PrivilegeEscalation
  - DefenseEvasion
relevantTechniques:
  - T1078.004
  - T1484.001
  - T1136.003
  - T1098.001
query: |
    AWSCloudTrail
     | where  EventName in~ ("DeleteUser", "DeleteGroup", "CreateUser") and isempty(ErrorMessage) and isempty(ErrorCode)
     | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
     | project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, 
       UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
     | order by TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0