id: 2b8cecfe-f705-432d-9f38-08207b9473e1
name: AWS IAM Assume Role Brute Force
description: |
  Identify repeated failed AssumeRole attempts against existing IAM roles, which may indicate privilege escalation or lateral movement using a compromised identity.
severity: High
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - CredentialAccess
  - PrivilegeEscalation
relevantTechniques:
  - T1110.001
  - T1098.003
query: |
  AWSCloudTrail
  | where EventName == "AssumeRole" and ErrorMessage == "AccessDenied"
  | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
  | summarize TimeGenerated = max(TimeGenerated), failed_roles=dcount(ErrorMessage) by SourceIpAddress, UserIdentityUserName
  | where failed_roles > 2
  | order by failed_roles desc, TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0