id: 5b6ee21d-da53-46eb-827c-eab2a9ba3d2f
name: AWS IAM suspicious STS AssumeRole from unseen identity
description: |
  Identifies STS AssumeRole operations for IAM roles not historically seen from the calling identity, which may indicate credential abuse or lateral movement.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
  - connectorId: AWSS3
    dataTypes:
      - AWSCloudTrail
tactics:
  - InitialAccess
  - DefenseEvasion
  - PrivilegeEscalation
relevantTechniques:
  - T1078.004
query: |

  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 14d;
  // Generating historical table of AssumeRole operations for IAM Roles to be compared with last 24 hour
  AWSCloudTrail
  | where TimeGenerated between (starttime..endtime)
  | where EventName == "AssumeRole" | extend RoleArn = tostring(parse_json(RequestParameters).roleArn)
  | project TimeGenerated, EventSource, EventName, UserIdentityType, UserIdentityInvokedBy , SourceIpAddress, RoleArn
  // Doing Leftanti join to find new AssumeRole operation for IAM role which was not seen historically generated from previous table.
  | join kind= leftanti
  (
    AWSCloudTrail
    | where TimeGenerated  between (lookback..starttime)
    | where EventName == "AssumeRole" | extend RoleArn = tostring(parse_json(RequestParameters).roleArn)
    | project TimeGenerated, EventSource, EventName, UserIdentityType, UserIdentityInvokedBy , SourceIpAddress, RoleArn
  ) on RoleArn, UserIdentityInvokedBy
  | summarize EventCount = count(), StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by RoleArn, EventSource, EventName, UserIdentityType, UserIdentityInvokedBy, SourceIpAddress
  | extend RoleName = tostring(split(RoleArn, "/")[1])
  | order by StartTimeUtc desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityInvokedBy
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0