id: 70c36558-e6d8-48b4-98b3-185d555cd5af
name: AWS IAM Risky Role Name Created
description: |
  Identifies IAM role creation, which may indicate malicious reconnaissance or attack framework execution/deployment.
severity: High
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1136.003
  - T1078.004
query: |
    let PacuRoleNames = (
    externaldata (RoleName:string)
    [h@'https://raw.githubusercontent.com/RhinoSecurityLabs/pacu/master/pacu/modules/iam__enum_roles/default-word-list.txt']
    );
    AWSCloudTrail
    | where EventName == "CreateRole" and isempty(ErrorCode) and isempty(ErrorMessage)
    | extend roleName = parse_json(tostring((parse_json(RequestParameters)))).roleName
    | where roleName in (PacuRoleNames)
    | distinct TimeGenerated, EventName, SourceIpAddress, UserIdentityArn, UserIdentityUserName, tostring(roleName), UserIdentityAccountId, AWSRegion
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | summarize EventCount = count(), StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), EventNameList=make_set(EventName), IPList=make_set(SourceIpAddress) by UserIdentityAccountId, AWSRegion, UserIdentityUserName, TimeGenerated, SourceIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0