id: 81a8880f-cc20-40ce-98d6-2fc6a1c5b9a4
name: Suspicious EC2 launched without a key pair
description: |
  'An attacker with limited permissions, or a sophisticated attacker disguising his activity, may have launched an EC2 instance without a key pair, allowing him to execute code on the machine using the UserData attribute (for example, by executing a reverse shell).'
severity: High
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Execution
relevantTechniques:
  - T1204
query: |
    AWSCloudTrail
    | where EventName == "RunInstances" and isempty(ErrorCode) and isempty(ErrorMessage)
    | extend items = tostring(parse_json(RequestParameters).instancesSet.items)
    | mv-expand todynamic(items)
    | extend keyName=tostring(todynamic(items.['keyName']))
    | where isempty(keyName) and RequestParameters contains "userData" and SourceIpAddress !contains "amazonaws.com"
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | extend timestamp = TimeGenerated, IPCustomEntity = SourceIpAddress, AccountCustomEntity = UserIdentityUserName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
