id: b9b0fd12-d72d-4f66-a013-c1acdeea2670
name: AWS RDS Master Password Changed
description: |
  Identifies changes to the master password of an RDS DB cluster, which may indicate unauthorized access or account takeover.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1098
  - T1098.001
query: |
    AWSCloudTrail
    | where  EventName == "ModifyDBCluster" and isempty(ErrorCode) and isempty(ErrorMessage)
    | where isnotempty(tostring(parse_json(RequestParameters).masterUserPassword))
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | order by TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0