id: 49bae199-ea04-4a2e-95a6-e3a1f68ab259
name: AWS Network ACL entry deleted
description: |
  Identifies ingress network ACL entry deletions that may indicate attempts to remove firewall rules and expose instances to unrestricted access.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562.007
query: |
    AWSCloudTrail
    | where EventName == 'DeleteNetworkAclEntry' and isempty(ErrorMessage) and isempty(ErrorCode)
    | extend egress=parse_json(RequestParameters)['egress']
    | where egress == false
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | order by TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0