id: 0db42a94-e7c8-4bf1-99a7-1a2fb4158212
name: AWS IAM Privileged Role Attached to Instance
description: |
  Identifies when a privileged IAM role is attached to an existing or new instance, which may indicate privilege escalation to administrative level.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
  - connectorId: AWSS3
    dataTypes:
      - AWSCloudTrail
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1098.001
query: |

  let EventNameList = dynamic(["AttachUserPolicy","AttachRolePolicy","AttachGroupPolicy"]);
  let PolicyArnList = dynamic(["arn:aws:iam::aws:policy/AdministratorAccess","arn:aws:iam::aws:policy/DatabaseAdministrator","arn:aws:iam::aws:policy/NetworkAdministrator","arn:aws:iam::aws:policy/SystemAdministrator","arn:aws:iam::aws:policy/AmazonS3FullAccess"]);
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 14d;
  //Creating a temp table of events creating privileged role or users which can later be correlated with suspicious operations.
  let PrivilegedRoleorUsers = AWSCloudTrail
  | where TimeGenerated >= lookback 
  | where EventName in (EventNameList)
  | extend PolicyArn = tostring(parse_json(RequestParameters).policyArn), RoleName = tostring(parse_json(RequestParameters).roleName)
  | where PolicyArn in (PolicyArnList)
  | distinct PolicyArn, UserIdentityType, UserIdentityUserName,RoleName;
  // Joining the list of identities having Privileged roles with the API call AddRoleToInstanceProfile to indentify the instances which may be used by adversaries as pivot point for privilege escalation.
  PrivilegedRoleorUsers
  | join (
  AWSCloudTrail
  | where TimeGenerated between (starttime..endtime)
  | where EventName in ("AddRoleToInstanceProfile") 
  | extend InstanceProfileName = tostring(parse_json(RequestParameters).InstanceProfileName), RoleName = tostring(parse_json(RequestParameters).roleName)
  | summarize EventCount=count(), StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by EventSource, EventName, UserIdentityType , UserIdentityArn , UserIdentityUserName, SourceIpAddress, RoleName
  ) on RoleName 
  | order by StartTimeUtc desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0