id: 48c49b1d-2aa0-442b-96e3-cae6ad1251cd
name: AWS S3 Bucket Versioning Suspended
description: |
  Detects S3 bucket versioning suspension events that may indicate preparation for destructive actions such as ransomware attack by reducing object recovery options.
severity: Medium
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - Impact
relevantTechniques:
  - T1485
  - T1565.001
query: |
  AWSCloudTrail
  | where EventName == "PutBucketVersioning" and isempty(ErrorCode) and isempty(ErrorMessage)
  | extend status = tostring(parse_json(RequestParameters).VersioningConfiguration.Status)
  | where status == "Suspended"
  | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
  | order by TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0