id: bf130d1d-702b-4af6-9528-8bc4229e59f4
name: AWS Multiple Failed Login Attempts Without MFA
description: |
  Identifies repeated AWS Console login failures for identities without MFA, which may indicate password brute force activity against user accounts.
severity: High
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
tactics:
  - CredentialAccess
relevantTechniques:
  - T1110.001
  - T1110.004
query: |
    AWSCloudTrail
    | where EventName == "ConsoleLogin"
    | where tostring(parse_json(ResponseElements).ConsoleLogin) == "Failure" and tostring(parse_json(AdditionalEventData).MFAUsed) == "No"
    | extend UserIdentityUserName = iff(isnotempty(UserIdentityUserName), UserIdentityUserName, tostring(split(UserIdentityArn,'/')[-1]))
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), failed_attempts = count() by UserIdentityUserName, SourceIpAddress
    | where failed_attempts > 4
    | order by failed_attempts desc, EndTime desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserIdentityUserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIpAddress
version: 1.0.0
