Parser:
  Title: Amazon web services authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Amazon web services cloud trail
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
      This Query Parser maps Amazon Web Service sign in logs (AWSCloudTrail) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAuthAWSCloudTrail
ParserQuery: |
  let AWSLogon=(){
  AWSCloudTrail
   | where EventName == 'ConsoleLogin'
   | extend
    EventVendor = 'Amazon'
    , EventProduct='AWSCloudTrail'
    , EventResult= iff (ResponseElements has_cs 'Success', 'Success', 'Failure')
    // , EventResultDetais
    , EventStartTime=TimeGenerated
    , EventEndTime=TimeGenerated
    , EventType='Logon'
    , AuthMethod=iff(AdditionalEventData has ''MFAUsed': 'No'', 'NoMFA', 'MFA')
    , CloudAppName =tostring(todynamic(AdditionalEventData).LoginTo)
    , TargetUserNameType='Simple'
    , TargetUserIdType='AWSId' // need a new id type, again, assuming this is Actor, not target user
    | project-rename
      EventOriginalUid= AwsEventId
    , EventOriginalResultDetails= ErrorMessage
    , TargetUserName= UserIdentityUserName // This mandatort value is always empty
    , TargetUserType=UserIdentityType
    , TargetUserId=UserIdentityAccountId // Assuming error on IB's mapping. Why is this suddenly 'Target user'
    , SrcIpAddr=SourceIpAddress
    , HttpUserAgent=UserAgent
  // **** Aliases
  | extend
        UserId=TargetUserId
        , UserName=TargetUserName
        , AuthTarget=CloudAppName
    };
    AWSLogon
