Parser:
  Title: Azure active directory authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure SigninLogs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
  This Query Parser maps Azure Active Directory Signin logs (SigninLogs) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAuthSigninLogs
ParserQuery: |
  let AADSigninLogs=(){
  SigninLogs
  | extend
    EventVendor = 'Microsoft'
    , EventProduct = 'Azure Active Directory'
    , EventResult = iff (ResultType ==0, 'Success', 'Failure')
    , EventResultDetails= ResultType
    , EventOriginalResultDetails = ResultDescription
    , EventStartTime = TimeGenerated
    , EventEndTime= TimeGenerated
    , EventType= 'Logon'
    , SrcHostId=tostring(DeviceDetail.deviceId)
    , SrcHostname=tostring(DeviceDetail.displayName)
    , SrcHostOs=tostring(DeviceDetail.operatingSystem)
    , HttpUserAgent=UserAgent
    , SrcBrowser= tostring(DeviceDetail.browser)
    , SrcGeoCity=tostring(LocationDetails.city)
    , SrcGeoCountry=tostring(LocationDetails.countryOrRegion)
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , TargetUserNameType='Upn'
      , TargetUserIdType='AADID'
    , TargetResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
     , TargetResourceName=ResourceDisplayName
   | project-rename
       EventOriginalUid =Id
       , AuthMethod  = AuthenticationRequirement
       , TargetSessionId=CorrelationId
       , SessionDuration= DurationMs
       , TargetUserId = UserId
       , TargetUserName=UserPrincipalName
       , TargetUserType=UserType
       , SrcDvcIp=IPAddress
       , AppName=AppDisplayName
       , AuthTarget=ResourceIdentity
   | project-reorder
       TimeGenerated
       ,EventProduct
       , EventOriginalUid
       , EventResult
       , EventResultDetails
       , EventOriginalResultDetails
       , EventStartTime
       , EventEndTime
       , AuthMethod 
       , TargetSessionId
       , SessionDuration
       , TargetUserId
       , TargetUserName
       , SrcHostId
       , SrcHostname
       , SrcHostOs
       , HttpUserAgent 
       , SrcBrowser
       , SrcGeoCity
       , SrcGeoCountry
       , AppId
       , AppName};
       AADSigninLogs