Parser:
  Title: Azure active directory authentication
  Version: '0.0'
  LastUpdated: June 3, 2021
Product:
  Name: Azure SigninLogs
Normalization:
  Schema: Authentication
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Authentication schema documentation
  Link: https://aka.ms/AzSentinelAuthenticationDoc
Description: |
  This Query Parser maps Azure Active Directory Signin logs (SigninLogs) to the Azure Sentinel Information Model authenticaion schema.
ParserName: vimAuthSigninLogs
ParserQuery: |
  let FailedReason=datatable(ResultType:string, EventResultDetails:string)[
    '0', 'Success',
    '53003', 'Logon violates policy',
    '50034', 'No such user or password',
    '50059', 'No such user or password',
    '50053', 'User locked',
    '50055', 'Password expired',
    '50056', 'Incorrect password',
    '50057', 'User disabled',
    '50058', 'Logon violates policy',
    '50011', 'Logon violates policy', // Application
    '50064', 'No such user or password',
    '50076', 'Logon violates policy',
    '50079', 'Logon violates policy',
    '50105', 'Logon violates policy',
    '50126', 'No such user or password',
    '50126', 'No such user or password',
    '50132', 'Password expired',
    '50133', 'Password expired',
    '50144', 'Password expired',
    '50173', 'Password expired', // Token expired
    '80012', 'Logon violates policy',
    '51004', 'No such user or password',
    '50072', 'Logon violates policy',
    '50005', 'Logon violates policy',
    '50020', 'Logon violates policy',
    '50074', 'Logon violates policy', // Failed MFA
    '70008', 'Password expired',
    '700016',  'No such user or password', // Application was not found in the directory. This can happen if the application has not been insta
    '500011', 'No such user or password' // The resource principal was not found in the tenant. This can happen if the application has not been installed by t
    ];
  let AADSigninLogs=(){
  SigninLogs
  | extend
    EventVendor = 'Microsoft'
    , EventProduct = 'AAD Sign In Logs'
    , EventCount=1
    , EventSchemaVersion='1.0.0'
    , EventResult = iff (ResultType ==0, 'Success', 'Failure')
    //, EventResultDetails= ResultType
    , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)
    , EventStartTime = TimeGenerated
    , EventEndTime= TimeGenerated
    , EventType= 'Logon'
    , SrcHostId=tostring(DeviceDetail.deviceId)
    , SrcHostname=tostring(DeviceDetail.displayName)
    , SrcHostOs=tostring(DeviceDetail.operatingSystem)
    , HttpUserAgent=UserAgent
    , SrcBrowser= tostring(DeviceDetail.browser)
    , SrcGeoCity=tostring(LocationDetails.city)
    , SrcGeoCountry=tostring(LocationDetails.countryOrRegion)
      , SrcGeoLocationLatitude=tostring(todynamic(LocationDetails).geoCoordinates.latitude)
      , SrcGeoLocationLongitude=tostring(todynamic(LocationDetails).geoCoordinates.longitude)
      , TargetUsernameType='Upn'
      , TargetUserIdType='AADID'
    , TargetResourceId = ResourceIdentity // Overriding the tables ResourceId which is not an interesting value
     , TargetResourceName=ResourceDisplayName
   | lookup FailedReason on ResultType
   | project-rename
       EventOriginalUid =Id
       , AuthMethod  = AuthenticationRequirement
       , TargetSessionId=CorrelationId
       , SessionDuration= DurationMs
       , TargetUserId = UserId
       , TargetUsername=UserPrincipalName
       , TargetUserType=UserType
       , SrcDvcIp=IPAddress
       , TargetAppName=AppDisplayName
       , TargetAppId=AppId
   | project-reorder
       TimeGenerated
       ,EventProduct
       , EventOriginalUid
       , EventResult
       // , EventResultDetails
       , EventOriginalResultDetails
       , EventStartTime
       , EventEndTime
       , AuthMethod 
       , TargetSessionId
       , SessionDuration
       , TargetUserId
       , TargetUsername
       , SrcHostId
       , SrcHostname
       , SrcHostOs
       , HttpUserAgent 
       , SrcBrowser
       , SrcGeoCity
       , SrcGeoCountry
       , TargetAppId
       , TargetAppName
       // Aliases
        | extend 
          Username=TargetUsername
       , AuthTarget=ResourceIdentity
       , Dvc=EventVendor};
       AADSigninLogs