Parser:
  Title: Process Terminate Event ASIM parser for Windows Security Events
  Version: '0.2'
  LastUpdated: May 1st 2023
Product:
  Name: Security Events 
Normalization:
  Schema: ProcessEvent
  Version: '0.1.0'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/ASimProcessEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Windows process terminate events (event 4689) collected using the Security Events connectors, utilizing either the Log Analytics agent or the Azure Monitor Agent (AMA) and stored in the SecurityEvent table to the ASIM Process Event normalized schema. 
ParserName: ASimProcessTerminateMicrosoftSecurityEvents
EquivalentBuiltInParser: _ASim_ProcessEvent_TerminateMicrosoftSecurityEvents
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: | 
             let ProcessEvents=(){
              SecurityEvent
              | where not(disabled)
              // -- Filter
              | where EventID == 4689
              // -- Map
              | extend
                // Event
                  EventCount = int(1),
                  EventVendor = "Microsoft",
                  EventProduct = "Security Events",
                  EventSchemaVersion = "0.1.0",
                  EventSchema = 'ProcessEvent',
                  EventStartTime = todatetime(TimeGenerated),
                  EventEndTime = todatetime(TimeGenerated),
                  EventType = "ProcessTerminated",
                  EventResult = 'Success',
                  EventOriginalType = tostring(EventID),
                  EventOriginalUid = EventOriginId,
                  EventResultDetails = Status,
                  EventOriginalResultDetails = Status, 
                // Device
                  DvcId = SourceComputerId,
                  DvcHostname = Computer,
                  DvcOs = "Windows",
                // Users
                  ActorUserIdType = iff (SubjectUserSid <> "S-1-0-0", "SID", ""),
                  ActorUserId = iff (SubjectUserSid <> "S-1-0-0", SubjectUserSid, ""), 
                  ActorUsername = iff (SubjectDomainName == '-', SubjectUserName, SubjectAccount),
                  ActorUsernameType = iff(SubjectDomainName == '-','Simple', 'Windows'),
                  ActorSessionId = SubjectLogonId,
                  ActorDomainName = SubjectDomainName,
                // Processes 
                  TargetProcessId = tostring(toint(ProcessId)),
                  TargetProcessName = ProcessName,
                  TargetProcessCommandLine = CommandLine,
                  TargetProcessTokenElevation = TokenElevationType,
                  Process = ProcessName
                // Aliases
                | extend 
                  User = ActorUsername,
                  Dvc = DvcHostname,
                  Process = TargetProcessName
              }; ProcessEvents


