Parser:
  Title: Process Event ASIM schema function
  Version: '0.1.2'
  LastUpdated: Oct 08, 2023
Product:
  Name: Source Agnostic
Normalization:
  Schema: ProcessEvent
  Version: '0.1.0'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/ASimProcessEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Process Event schema
ParserName: vimProcessEmpty
EquivalentBuiltInParser: _Im_Process_Empty
ParserQuery: |
  let EmptyNewProcessEvents = datatable(
    // ****** Mandatory LA fields ******
    TimeGenerated:datetime, // => EventEndTime
    _ResourceId:string,
    Type:string,
    // ****** Event fields ******
    EventType:string,
    EventProduct:string,
    EventProductVersion:string,
    EventCount:int,
    EventMessage:string,
    EventVendor:string,
    EventSchema:string,
    EventSchemaVersion:string,
    EventSeverity:string,
    EventSubType:string,
    EventOriginalUid:string,
    EventOriginalType:string,
    EventOriginalResultDetails:string,
    EventOriginalSeverity:string,
    EventOriginalSubType:string,
    EventStartTime:datetime,
    EventEndTime:datetime,
    EventReportUrl:string,
    EventResult: string,
    EventResultDetails: string,
    AdditionalFields:dynamic,
    EventOwner:string,
    // ****** Device fields ******
    DvcId:string,
    DvcHostname:string,
    DvcDomain:string,
    DvcDomainType:string,
    DvcFQDN:string,
    DvcIpAddr:string,
    DvcOs:string,
    DvcOsVersion:string,
    DvcMacAddr:string,
    DvcAction:string,
    DvcOriginalAction:string,
    DvcDescription: string,
    DvcIdType: string,
    DvcInterface: string,
    DvcZone: string,
    DvcScopeId:string,
    DvcScope:string,
    // ****** Target fields ******
    TargetUsername:string,
    TargetUsernameType:string,
    TargetOriginalUserType:string,
    TargetUserId:string,
    TargetUserIdType:string,
    TargetUserType:string,
    TargetUserSessionId:string,
    TargetUserUid:string,
    TargetUserScopeId:string,
    TargetUserScope:string,
    TargetProcessName:string,
    TargetProcessFileDescription:string,
    TargetProcessFileProduct:string,
    TargetProcessFileVersion:string,
    TargetProcessFileCompany: string,
    TargetProcessFileInternalName: string,
    TargetProcessFileOriginalName: string,
    TargetProcessFileSize: long,
    TargetProcessCurrentDirectory: string,
    TargetProcessIsHidden:bool,
    TargetProcessInjectedAddress:string,
    TargetProcessMD5:string,
    TargetProcessSHA1:string,
    TargetProcessSHA256:string,
    TargetProcessSHA512:string,
    TargetProcessIMPHASH:string,
    TargetProcessCommandLine:string,
    TargetProcessCreationTime:datetime,
    TargetProcessId:string,
    TargetProcessGuid:string,
    TargetProcessIntegrityLevel:string,
    TargetProcessTokenElevation:string,
    // ****** Process fields ******
    ActorUsername:string,
    ActorUsernameType:string,
    ActorUserId:string,
    ActorUserIdType:string,
    ActorUserType:string,
    ActorOriginalUserType:string,
    ActorSessionId:string,
    ActorUserAadId:string,
    ActorUserSid:string,
    ActorScopeId:string,
    ActorScope:string,
    ActingProcessCommandLine:string,
    ActingProcessName:string,
    ActingProcessFileDescription:string,
    ActingProcessFileProduct:string,
    ActingProcessFileCompany: string,
    ActingProcessFileInternalName: string,
    ActingProcessFileOriginalName: string,
    ActingProcessFileSize: long,
    ActingProcessFileVersion:string,
    ActingProcessIsHidden:bool,
    ActingProcessTokenElevation: string,
    ActingProcessInjectedAddress:string,
    ActingProcessId:string,
    ActingProcessGuid:string,
    ActingProcessIntegrityLevel:string,
    ActingProcessMD5:string,
    ActingProcessSHA1:string,
    ActingProcessSHA256:string,
    ActingProcessSHA512:string,
    ActingProcessIMPHASH:string,
    ActingProcessCreationTime:datetime,
    ParentProcessName:string,
    ParentProcessFileDescription:string,
    ParentProcessFileProduct:string,
    ParentProcessFileVersion:string,
    ParentProcessFileCompany: string,
    ParentProcessTokenElevation:string,
    ParentProcessIsHidden:bool,
    ParentProcessInjectedAddress:string,
    ParentProcessId:string,
    ParentProcessGuid:string,
    ParentProcessIntegrityLevel:string,
    ParentProcessMD5:string,
    ParentProcessSHA1:string,
    ParentProcessSHA256:string,
    ParentProcessSHA512:string,
    ParentProcessIMPHASH:string,
    ParentProcessCreationTime:datetime,
    ParentProcessCommandLine:string,
    ParentProcessFileInternalName: string,
    ParentProcessFileOriginalName: string,
    ParentProcessFileSize: long,
    //****** Inspection fields ******
    RuleName:string,
    RuleNumber:int,
    ThreatId:string,
    ThreatName:string,
    ThreatCategory:string,
    ThreatRiskLevel:int,
    ThreatOriginalRiskLevel:string,
    ThreatConfidence:int,
    ThreatOriginalConfidence:string,
    ThreatIsActive:bool,
    ThreatFirstReportedTime:datetime,
    ThreatLastReportedTime:datetime,
    ThreatField:string,
    //****** aliases ******
    Dvc:string,
    Src:string,
    Dst:string,
    User:string,
    Process:string,
    CommandLine:string,
    Hash:string,
    HashType:string
    )[];
    EmptyNewProcessEvents

