Parser:
  Title: Process Event ASIM schema function
  Version: '0.2.0'
  LastUpdated: Mar 17, 2026
Product:
  Name: Source Agnostic
Normalization:
  Schema: ProcessEvent
  Version: '0.1.4'
References:
- Title: ASIM Process Schema
  Link: https://aka.ms/ASimProcessEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Process Event schema
ParserName: vimProcessEmpty
EquivalentBuiltInParser: _Im_Process_Empty
ParserQuery: |
  let EmptyNewProcessEvents = datatable(
    TimeGenerated:datetime,
    _ResourceId:string,
    Type:string,
    ActingProcessCommandLine:string,
    ActingProcessCreationTime:datetime,
    ActingProcessFileCompany:string,
    ActingProcessFileDescription:string,
    ActingProcessFileInternalName:string,
    ActingProcessFilename:string,
    ActingProcessFileOriginalName:string,
    ActingProcessFileProduct:string,
    ActingProcessFileSize:long,
    ActingProcessFileVersion:string,
    ActingProcessGuid:string,
    ActingProcessIMPHASH:string,
    ActingProcessId:string,
    ActingProcessInjectedAddress:string,
    ActingProcessIntegrityLevel:string,
    ActingProcessIsHidden:bool,
    ActingProcessMD5:string,
    ActingProcessName:string,
    ActingProcessSHA1:string,
    ActingProcessSHA256:string,
    ActingProcessSHA512:string,
    ActingProcessTokenElevation:string,
    ActorDNUsername:string,
    ActorOriginalUserType:string,
    ActorScope:string,
    ActorScopeId:string,
    ActorSessionId:string,
    ActorSimpleUsername:string,
    ActorUserAadId:string,
    ActorUserAWSId:string,
    ActorUserId:string,
    ActorUserIdType:string,
    ActorUsername:string,
    ActorUsernameType:string,
    ActorUserOktaId:string,
    ActorUserPuid:string,
    ActorUserSid:string,
    ActorUserType:string,
    ActorUserUid:string,
    ActorUserUpn:string,
    ActorWindowsUsername:string,
    AdditionalFields:dynamic,
    CommandLine:string,
    Dst:string,
    Dvc:string,
    DvcAction:string,
    DvcDescription:string,
    DvcDomain:string,
    DvcDomainType:string,
    DvcFQDN:string,
    DvcHostname:string,
    DvcId:string,
    DvcIdType:string,
    DvcInterface:string,
    DvcIpAddr:string,
    DvcMacAddr:string,
    DvcOriginalAction:string,
    DvcOs:string,
    DvcOsVersion:string,
    DvcScope:string,
    DvcScopeId:string,
    DvcZone:string,
    EventCount:int,
    EventEndTime:datetime,
    EventMessage:string,
    EventOriginalResultDetails:string,
    EventOriginalSeverity:string,
    EventOriginalSubType:string,
    EventOriginalType:string,
    EventOriginalUid:string,
    EventOwner:string,
    EventProduct:string,
    EventProductVersion:string,
    EventReportUrl:string,
    EventResult:string,
    EventResultDetails:string,
    EventSchema:string,
    EventSchemaVersion:string,
    EventSeverity:string,
    EventStartTime:datetime,
    EventSubType:string,
    EventType:string,
    EventUid:string,
    EventVendor:string,
    Hash:string,
    HashType:string,
    ParentProcessCreationTime:datetime,
    ParentProcessFileCompany:string,
    ParentProcessFileDescription:string,
    ParentProcessFileProduct:string,
    ParentProcessFileVersion:string,
    ParentProcessGuid:string,
    ParentProcessIMPHASH:string,
    ParentProcessId:string,
    ParentProcessInjectedAddress:string,
    ParentProcessIntegrityLevel:string,
    ParentProcessIsHidden:bool,
    ParentProcessMD5:string,
    ParentProcessName:string,
    ParentProcessSHA1:string,
    ParentProcessSHA256:string,
    ParentProcessSHA512:string,
    ParentProcessTokenElevation:string,
    Process:string,
    Rule:string,
    RuleName:string,
    RuleNumber:int,
    Src:string,
    TargetDNUsername:string,
    TargetOriginalUserType:string,
    TargetProcessCommandLine:string,
    TargetProcessCreationTime:datetime,
    TargetProcessCurrentDirectory:string,
    TargetProcessFileCompany:string,
    TargetProcessFileDescription:string,
    TargetProcessFileInternalName:string,
    TargetProcessFilename:string,
    TargetProcessFileOriginalName:string,
    TargetProcessFileProduct:string,
    TargetProcessFileSize:long,
    TargetProcessFileVersion:string,
    TargetProcessGuid:string,
    TargetProcessId:string,
    TargetProcessIMPHASH:string,
    TargetProcessInjectedAddress:string,
    TargetProcessIntegrityLevel:string,
    TargetProcessIsHidden:bool,
    TargetProcessMD5:string,
    TargetProcessName:string,
    TargetProcessSHA1:string,
    TargetProcessSHA256:string,
    TargetProcessSHA512:string,
    TargetProcessStatusCode:string,
    TargetProcessTokenElevation:string,
    TargetSimpleUsername:string,
    TargetUserAadId:string,
    TargetUserAWSId:string,
    TargetUserId:string,
    TargetUserIdType:string,
    TargetUsername:string,
    TargetUsernameType:string,
    TargetUserOktaId:string,
    TargetUserPuid:string,
    TargetUserScope:string,
    TargetUserScopeId:string,
    TargetUserSessionGuid:string,
    TargetUserSessionId:string,
    TargetUserSid:string,
    TargetUserType:string,
    TargetUserUid:string,
    TargetUserUpn:string,
    TargetWindowsUsername:string,
    ThreatCategory:string,
    ThreatConfidence:int,
    ThreatField:string,
    ThreatFirstReportedTime:datetime,
    ThreatId:string,
    ThreatIsActive:bool,
    ThreatLastReportedTime:datetime,
    ThreatName:string,
    ThreatOriginalConfidence:string,
    ThreatOriginalRiskLevel:string,
    ThreatRiskLevel:int,
    User:string
    )[];
    EmptyNewProcessEvents

