id: 1ddee78f-7508-4f4a-9b6b-d2927724217d
name: Scheduled Task Creation
description:
  This query searches for any scheduled task creation event.
description-detailed: |
  This query searches for any scheduled task creation event.
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_susp_schtask_creation.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceEvents
tactics:
  Persistence
query: |
  DeviceEvents 
  | where ActionType == "ScheduledTaskCreated"
    and InitiatingProcessAccountSid != "S-1-5-18"
version: 1.0.0