// Name: Summary of users creating new user accounts
// Description: new user accounts may be an attacker providing themselves with backdoor access for some later date.
// an account creating further accounts for the first time may be an indication of compromise
// Tags: #Persistance
OfficeActivity
| where Operation == "Add user."
| project addedBy=UserId, newUser=OfficeObjectId 
| summarize newUserCount=dcount(newUser) by addedBy
| render barchart
