id: dfca066d-0836-47c4-b85e-4da225633050
name: Bazacall Emails
description: |-
  Bazacall malware uses emails that contain a phone number for the user to call in order to cancel a fake subscription. These emails contain no links or attachments, and use automatic payment lures to trick users into contacting the number included in the email.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailEvents
tactics:
- Initial access
query: |-
  EmailEvents
  | where Subject matches regex @"[A-Z]{1,3}\d{9,15}"
      and Subject has_any('trial', 'free', 'demo', 'membership', 'premium', 'gold', 'notification', 'notice', 'claim', 'order', 'license', 'licenses')
