id: fa2c1c3a-18f8-4c83-8501-ea110873f99f
name: Excel Macro Execution
description: |
  Bazacall uses malicious macro-enabled Excel documents to execute their payload.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
query: |
  DeviceProcessEvents
  | where InitiatingProcessFileName =~ "excel.exe"
      and ProcessCommandLine has_all('mkdir', '&& copy', 'certutil.exe')
