id: 8dc6ffbb-b3d7-4498-9f9f-ec463c5a4829
name: NTDS theft
description: |-
  Microsoft has observed compromises related to Bazacall resulting in theft of the Active Directory database using ntdsutil.exe.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Credential Access
- Exfiltration
query: |-
  DeviceProcessEvents
  | where FileName =~ "ntdsutil.exe"
  | where ProcessCommandLine has_any("full", "fu")
  | where ProcessCommandLine has_any ("temp", "perflogs", "programdata")
  // Exclusion
  | where ProcessCommandLine !contains @"Backup"
