id: 6d0cac10-f160-4437-b946-36e35f887914
name: Renamed Rclone Exfil
description: |-
  Microsoft has observed Bazacall using a renamed version of Rclone for data exfiltration.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Exfiltration
query: |-
  DeviceProcessEvents 
  | where ProcessVersionInfoProductName has "rclone" and not(FileName has "rclone")
