id: 2b2e8b89-ba54-48f9-a24f-b9ae16a7ef6d
name: Renamed Rclone Exfil
description: |
  Microsoft has observed Bazacall using a renamed version of Rclone for data exfiltration.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
- Exfiltration
query: |
  DeviceProcessEvents 
  | where ProcessVersionInfoProductName has "rclone" and not(FileName has "rclone")
