id: 68ee31bd-8ff9-419c-b5e1-901cdb1ac24e
name: RunDLL Suspicious Network Connection
description: |-
  During the chain of events from Bazacall to Bazaloader, RunDLL makes several network connections, including to command and control (C2) infrastructure. The command line for these connections contains a specific process paramter, ",GlobalOut" that can surface potentially malicious activity related to Bazacall and Bazaloader.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceNetworkEvents
tactics:
- Command and control
query: |-
  DeviceNetworkEvents
  | where InitiatingProcessFileName =~ 'rundll32.exe' and InitiatingProcessCommandLine has ",GlobalOut"
