id: 9d59be10-54d9-478b-b669-fb4eb8517cd0
name: Phish detections by detection methods
description: |
  This query helps reviewing Phish detections done by some of the most frequent detection technologies in the last 7 days
description-detailed: |
  This query helps reviewing Phish detections done by some of the most frequent detection technologies in the last 7 days in Defender for Office 365
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where Timestamp > ago(7d)
  | where isnotempty(DetectionMethods)
  | extend MDO_detection = parse_json(DetectionMethods)
  | where MDO_detection.Phish in 
          (
            @'["URL malicious reputation"]',
            @'["URL detonation reputation"]',
            @'["URL detonation"]',
            @'["Advanced filter"]',
            @'["General filter"]',
            @'["Spoof intra-org"]',
            @'["Spoof external domain"]',
            @'["Spoof DMARC"]',
            @'["Impersonation brand"]',
            @'["Mixed analysis detection"]',
            @'["File reputation"]',
            @'["File detonation reputation"]',
            @'["File detonation"]',
            @'["Fingerprint matching"]'
          )
  | extend SenderFromAddress_IPv4 = strcat(SenderFromAddress, ", ", SenderIPv4)
  | project Timestamp, NetworkMessageId, Subject, SenderFromAddress_IPv4, RecipientEmailAddress, DeliveryLocation, MDO_detection.Phish
version: 1.0.0