id: 76c77c8a-bd2a-489a-af52-97291211e4e4
name: Phish Detections (High) by delivery location
description: |
  This query visualises emails with Phish detections (High confidence) summarizing the data by Delivery Location.
description-detailed: |
  This query visualises emails with Phish detections (High confidence) summarizing the data by Delivery Location.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where OrgLevelPolicy != "Phishing simulation" and OrgLevelPolicy != "SecOps Mailbox"
  | where ConfidenceLevel has_any ('Phish":"High')
  | summarize count() by LatestDeliveryLocation
  | sort by count_ desc
  | render piechart
version: 1.0.0