id: b9bc09df-210b-4268-83fa-e0b1404b62fa
Function:
  Title: Parser for ZScalerFW_Parser
  Version: '1.0.0'
  LastUpdated: '2023-08-22'
Category: Microsoft Sentinel Parser
FunctionName: ZScalerFW_Parser
FunctionAlias: ZScalerFW_Parser
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor == "Zscaler" and DeviceProduct == "NSSFWlog"
    | extend deviceTranslatedPort = extract(@"deviceTranslatedPort=(.*?)(;|$)", 1, AdditionalExtensions),
        tunnelType = extract(@"tunnelType=(.*?)(;|$)", 1, AdditionalExtensions),
        dnat = extract(@"dnat=(.*?)(;|$)", 1, AdditionalExtensions),
        stateful = extract(@"stateful=(.*?)(;|$)", 1, AdditionalExtensions),
        reason = coalesce(
                                extract(@"reason=(.*?)(;|$)", 1, AdditionalExtensions),                            
                                column_ifexists("Reason", "")
                            ),
        DeviceCustomString6Label = extract(@"cs6label=(.*?)(;|$)", 1, AdditionalExtensions),
        destCountry = extract(@"destCountry=(.*?)(;|$)", 1, AdditionalExtensions),
        avgduration = extract(@"avgduration=(.*?)(;|$)", 1, AdditionalExtensions)