id: fda3f601-8321-492e-ae77-e2ed6829be60
Function:
  Title: Parser for ZScalerWeb_Parser
  Version: '1.0.0'
  LastUpdated: '2023-08-23'
Category: Microsoft Sentinel Parser
FunctionName: ZScalerWeb_Parser
FunctionAlias: ZScalerWeb_Parser
FunctionQuery: |
    CommonSecurityLog 
    | where DeviceVendor == "Zscaler" and DeviceProduct == "NSSWeblog"
    | extend reason = coalesce(
                                extract(@"reason=(.*?)(;|$)", 1, AdditionalExtensions),                            
                                column_ifexists("Reason", "")
                            ),
        user = extract(@"suser=(.*?);", 1, AdditionalExtensions),
        sourceIP = extract(@"sourceTranslatedAddress=(.*?)(;|$)", 1, AdditionalExtensions),
        outcome = coalesce(
                            extract(@"outcome=(.*?)(;|$)", 1, AdditionalExtensions),                            
                            column_ifexists("EventOutcome", "")
                        ),
        cat = coalesce(
                            extract(@"cat=(.*?)(;|$)", 1, AdditionalExtensions),                            
                            column_ifexists("DeviceEventCategory", "")
                        ),
        rulelabel = extract(@"rulelabel=(.*?)(;|$)", 1, AdditionalExtensions),
        ruletype = extract(@"ruletype=(.*?)(;|$)", 1, AdditionalExtensions),
        urlclass = extract(@"urlclass=(.*?)(;|$)", 1, AdditionalExtensions),
        devicemodel = extract(@"devicemodel=(.*?)(;|$)", 1, AdditionalExtensions)