id: 1217e1fd-ebbb-4fdc-8b18-81be69876b3a
name: check-for-shadowhammer-activity-download-domain
description: |
  This query was originally published in the threat analytics report, ShadowHammer supply chain attack
  Operation ShadowHammer was an attack against ASUS computer hardware, using the company's own update infrastructure to deliver malware to the company's products. The campaign ran from June to November, 2018. ASUS has since responded with updates that protect their Live Update system, and diagnostic tools to check affected systems.
  The following query checks for activity associated with the ShadowHammer download domain over the past 30 days.
  References:
  https://www.vice.com/en_us/article/pan9wn/hackers-hijacked-asus-software-updates-to-install-backdoors-on-thousands-of-computers
  https://www.asus.com/News/hqfgVUyZ6uyAyJe1
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
tactics:
- Command and control
query: |
  DeviceNetworkEvents 
  | where Timestamp > ago(30d)
  | where RemoteUrl == "asushotfix.com" or RemoteIP == "141.105.71.116"
