id: a76bb159-d293-46eb-b544-f1e04b4cf163
name: Detects URLs in regkey RegistryValueData
description: |
  Detects suspicious netowork connections via RegistryValueData.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
query: |
  DeviceNetworkEvents
  | where RegistryValueData contains "http://"
  | where RegistryValueData !contains "PacProxyScript" and RegistryValueData !contains "PrintService"
  | summarize dcount(DeviceName),make_set(DeviceName),make_set(InitiatingProcessFileName) by RegistryValueData
  | where dcount_DeviceName < 2
  | sort by dcount_DeviceName asc 