id: fe4f4336-a2e7-4cae-af43-0987656475be
name: Suspicious network connection to Google APIs with aggregated process commandlines and files created
description: |
  This query will look for connections made to several Google cloud service API endpoints which are not associated with a legitimate browser or application, it then aggregates all the InitiatingProcessCommandline's and file created and presents this to the analyst for review. The query was inspired by the GC2-Sheet project: https://github.com/looCiprian/GC2-sheet. GC2-Sheet is a C2 platform designed to leverage Google Sheets and Google Drive SaaS applications.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkEvents
tactics:
  - Command and control
  - Execution
technique:
  - T1102
  - T1059
query: |
  let excludedProcessFileNames = datatable (browser:string)["teams.exe","GoogleUpdate.exe","outlook.exe","msedge.exe","chrome.exe","iexplorer.exe","brave.exe","firefox.exe"]; //add additional browsers, mail clients, and legitimate google desktop applications where needed for exclusion in your environment
  DeviceNetworkEvents
  | where RemoteUrl has_any ("oauth2.googleapis.com","sheets.googleapis.com","drive.googleapis.com") and isnotempty(InitiatingProcessFileName)
  | where not(InitiatingProcessFileName has_any (excludedProcessFileNames))
  | extend joinkey = strcat(InitiatingProcessFileName, DeviceName, InitiatingProcessAccountName)
  | join kind=leftouter (DeviceProcessEvents 
  | extend joinkey = strcat(InitiatingProcessParentFileName, DeviceName, InitiatingProcessAccountName, InitiatingProcessAccountUpn, InitiatingProcessSHA256) 
  | summarize ProcessesRanByParent = make_set(InitiatingProcessCommandLine,1024) by joinkey) on joinkey
  | join kind=leftouter (DeviceFileEvents 
  | where ActionType == "FileCreated" 
  | extend joinkey = strcat(InitiatingProcessParentFileName, DeviceName, InitiatingProcessAccountName, InitiatingProcessFileName, InitiatingProcessSHA256, InitiatingProcessAccountUpn, InitiatingProcessSHA256) 
  | summarize FilesCreated = make_set(FileName,1024) by joinkey) on joinkey
  | project TimeGenerated, DeviceName, InitiatingProcessAccountName, InitiatingProcessAccountUpn, InitiatingProcessFileName, InitiatingProcessSHA256, InitiatingProcessCommandLine, InitiatingProcessFolderPath, FilesCreated, ProcessesRanByParent, LocalIP, RemoteIP, RemoteUrl
  | extend HashAlgorithm= "SHA256"
  | extend Account_0_Name = InitiatingProcessAccountName
  | extend Host_0_HostName = DeviceName
  | extend IP_0_Address = RemoteIP
  | extend File_0_Name = InitiatingProcessFileName
  | extend FileHash_0_Name = InitiatingProcessSHA256
  | extend FileHash_0_Algorithm = HashAlgorithm
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: InitiatingProcessAccountName
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
version: 1.0.0
