Parser:
  Title: DNS activity ASIM parser for zScaler ZIA
  Version: '0.3'
  LastUpdated: Nov 23 2021
Product:
  Name: zScaler ZIA DNS
Normalization:
  Schema: Dns
  Version: '0.1.3'
References:
- Title: ASIM DNS Schema
  Link: https://aka.ms/ASimDnsDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
    This ASIM parser supports normalizing zScaler ZIA DNS logs to the ASIM DNS activity normalized schema.
ParserName: ASimDnszScalerZIA
EquivalentBuiltInParser: _ASim_Dns_zScalerZIA
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let zScalerDNSevents=(disabled:bool=false){
    CommonSecurityLog 
    | where not(disabled)
    | where DeviceProduct == "NSSDNSlog" 
    | project-rename
        Dvc=Computer , 
        SrcIpAddr = SourceIP, 
        SrcUsername = SourceUserName, 
        DstIpAddr = DestinationIP, 
        DstPortNumber = DestinationPort,  
        EventProductVersion = DeviceVersion, 
        DnsQueryTypeName = DeviceCustomString4,  
        DnsQuery = DeviceCustomString5, 
        DnsNetworkDuration = DeviceCustomNumber1,  
        SrcUserDepartment = DeviceCustomString1, // Not part of the standard schema
        reqaction = DeviceCustomString2, 
        resaction = DeviceCustomString3, 
        DvcUsername = SourceUserID,
        DvcZone = SourceUserPrivileges,
        SrcHostname = DeviceName
    | extend
        EventCount=int(1), 
        EventStartTime=TimeGenerated,  
        EventVendor = "zScaler", 
        EventProduct = "ZIA DNS", 
        EventSchema = "Dns", 
        EventSchemaVersion="0.1.3", 
        EventEndTime=TimeGenerated, 
        SrcUsernameType = "Upn", 
        SrcHostnameType = "Simple",
        EventSubType = iff(resaction == 'None', 'request', 'response'),  
        DvcAction = iff(resaction == 'None', reqaction, resaction), 
        EventResultDetails = iff (DeviceCustomString6 matches regex '^\\d', 'NOERROR', DeviceCustomString6),  
        EventType = 'Query', 
        UrlCategory = extract("cat=(.*)", 1, AdditionalExtensions),  
        DnsRuleName = strcat (FlexString1, " / ", FlexString2) 
      | extend 
        EventResult = case (
          EventSubType == 'request', 'NA', 
          EventResultDetails == 'NOERROR', 'Success',
          'Failure'),
        DnsResponseName = iff (EventResultDetails == 'NOERROR', DeviceCustomString6, '')
    // -- Aliases
    | extend
        DnsResponseCodeName = EventResultDetails,
        Domain = DnsQuery,
        IpAddr = SrcIpAddr,
        Src = SrcIpAddr,
        Dst = DstIpAddr,
        DvcHostname = Dvc,
        Duration = DnsNetworkDuration,
        User = SrcUsername
    // -- Backward Compatibility
    | extend
        Query=DnsQuery, 
        QueryTypeName=DnsQueryTypeName, 
        ResponseName=DnsResponseName, 
        ResponseCodeName=DnsResponseCodeName
    };
  zScalerDNSevents (disabled)