Parser:
  Title: Empty DNS Events Table
  Version: '0.1.1'
  LastUpdated: Sep 9, 2021
Product:
  Name: Microsoft
Normalization:
  Schema: Dns
  Version: '0.1.1'
References:
- Title: ASIM DNS Schema
  Link: https://aka.ms/AzSentinelDnsDoc
- Title: ASIM
  Link: https://aka.ms/AzSentinelNormalization
Description: |
  The purpose of this function is to generate and guarentee the schema columns
ParserName: vimDnsEmpty
ParserQuery: |
  let EmptyNewDnsEvents=datatable(
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // *************************************************************  Event and Dvc Fields
  //  ----------------- Mandatory: 
  , EventCount:int
  , EventStartTime:datetime
  , EventType:string
  , EventResult:string
  , EventResultDetails:string 
  , EventProduct:string
  , EventVendor:string
  , EventSchema: string  
  , EventSchemaVersion:string
  , Dvc:string
  // ----------------- Optional 
  , EventMessage:string
  , EventSeverity:string
  , EventOriginalUid:string
  , EventReportUrl:string
  , TenantId:string
  , DvcHostname:string
  , EventProductVersion:string
  , DvcIpAddr:string
  , DvcAction:string
  , SrcIpAddr:string
  , SrcPortNumber:int
  , DstIpAddr:string
  , DstPortNumber:int
  , EventSubType:string
  , DnsQuery:string
  , DnsQueryType:int
  , DnsQueryTypeName:string
  , DnsQueryClass:int
  , DnsQueryClassName:string
  , DnsResponseCode:int
  , DnsResponseName:string
  , DnsResponseCodeName:string 
  , DnsFlags:string 
  , NetworkProtocol:string
  // * User is still old style
  , SrcUserAadId:string
  , SrcUserDomain:string
  , SrcUsername:string
  , SrcUserSid:string
  , SrcUserUpn:string
  , UrlCategory:string 
  , ThreatCategory:string
  // ****************************************************** Aliases
  , EventEndTime:datetime 
  , DomainCategory:string   
  , IpAddr:string
  , Domain:string
  , TransactionIdHex:string
  , DvcId:string
  , EventOriginalType:string
  , AdditionalFields:dynamic
  , Query:string
  , QueryType:int
  , QueryTypeName:string
  , QueryClass:int
  , QueryClassName:string
  , ResponseCode:int
  , ResponseName:string
  , ResponseCodeName:string 
  , Flags:string
  , DnsFlagsAuthoritative:bool
  , DnsFlagsCheckingDisabled:bool
  , DnsFlagsRecursionAvailable:bool
  , DnsFlagsRecursionDesired:bool
  , DnsFlagsTruncates:bool
  , DnsFlagsZ:bool
  )[];
  EmptyNewDnsEvents 
