// Name: Base64 encoded Windows executables in process commandlines
//
// Id: ca67c83e-7fff-4127-a3e3-1af66d6d4cad
//
// Description: finds instances of base64 encoded PE files header seen in process command line parameter.
//
// Severity: Medium
//
// QueryFrequency: 24
//
// QueryPeriod: 24
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// DataSource: #SecurityEvent
//
// Techniques: #Initial Access, #Execution, #Defense Evasion
//
let ProcessCreationEvents=() {
let processEvents=SecurityEvent
| where EventID==4688
| project  TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName, AccountDomain=SubjectDomainName,
FileName=tostring(split(NewProcessName, '\\')[-1]),
ProcessCommandLine = CommandLine, 
FolderPath = "",
InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
processEvents};
ProcessCreationEvents
| where ProcessCommandLine contains "TVqQAAMAAAAEAAA"
| where TimeGenerated >= ago(24h)
| top 1000 by TimeGenerated