id: ca67c83e-7fff-4127-a3e3-1af66d6d4cad
name: Base64 encoded Windows executables in process commandlines
description: finds instances of base64 encoded PE files header seen in process command line parameter.
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 24h
queryPeriod: 24h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - Execution
  - DefenseEvasion
query: |

  let ProcessCreationEvents=() {
  let processEvents=SecurityEvent
  | where EventID==4688
  | project  TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName, AccountDomain=SubjectDomainName,
  FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine = CommandLine, 
  FolderPath = "",
  InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
  processEvents};
  ProcessCreationEvents
  | where ProcessCommandLine contains "TVqQAAMAAAAEAAA"
  | where TimeGenerated >= ago(24h)
  | top 1000 by TimeGenerated