id: ca67c83e-7fff-4127-a3e3-1af66d6d4cad
name: Base64 encoded Windows process commandlines
description: |
  'Identifies instances of base64 encoded PE file header seen in process command line parameter.'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
  - DefenseEvasion
relevantTechniques:
  - T1059
  - T1027
  - T1140
query: |

  let timeframe = 1d;
  let ProcessCreationEvents=() {
  let processEvents=SecurityEvent
  | where EventID==4688
  | summarize StartTimeUtc = max(TimeGenerated), EndTimeUtc = min(TimeGenerated), count() by ComputerName = Computer, AccountName = SubjectUserName, AccountDomain = SubjectDomainName,
  FileName = tostring(split(NewProcessName, '\\')[-1]), ProcessCommandLine = CommandLine, FolderPath = "",
  InitiatingProcessFileName = ParentProcessName, InitiatingProcessCommandLine = "", InitiatingProcessParentFileName = "";
  processEvents};
  ProcessCreationEvents
  | where ProcessCommandLine contains "TVqQAAMAAAAEAAA"
  | where StartTimeUtc >= ago(timeframe)
  | extend timestamp = StartTimeUtc, AccountCustomEntity = AccountName, HostCustomEntity = ComputerName