id: 4ebbb5c2-8802-11ec-a8a3-0242ac120002
name: Credential Dumping Service Installation
description: |
   'This query detects the installation of a Windows service that contains artifacts from credential dumping tools such as Mimikatz.
   Ref: https://blueteamblog.com/darkside-ransomware-operations-preventions-and-detections'
severity: High
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
relevantTechniques:
  - T1003
query: |
     SecurityEvent
    | where EventID == 4697 and (ServiceName contains_cs "fgexec" or ServiceName contains_cs "cachedump" or ServiceName contains_cs "mimikatz" or ServiceName contains_cs "mimidrv" or ServiceName contains_cs "wceservice" or  ServiceName contains_cs "pwdump" or
     ServiceFileName contains_cs "fgexec" or ServiceFileName contains_cs "cachedump" or ServiceFileName contains_cs "mimikatz" or ServiceFileName contains_cs "mimidrv" or ServiceFileName contains_cs "wceservice" or ServiceFileName contains_cs "pwdump")
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectDomainName, SubjectUserName, SubjectLogonId, ServiceAccount, ServiceName, ServiceFileName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: SubjectAccount
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
version: 1.0.0
kind: Scheduled
