id: 2391ce61-8c8d-41ac-9723-d945b2e90720
name: Excessive Windows logon failures
description: |
  'User has over 50 Windows logon failures today and at least 25% of the count of logon failures previous 7 days.'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
relevantTechniques:
  - T1110
query: |

  let timeframe = 7d;
  let threshold = 0.25;
  let countlimit = 50;
  SecurityEvent
  | where TimeGenerated >= ago(1d)
  | where EventID == 4625 and AccountType =~ "User"
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), CountToday = count() by EventID, Account, LogonTypeName, SubStatus, AccountType, Computer, WorkstationName, IpAddress
  | join (
      SecurityEvent 
      | where TimeGenerated >= ago(timeframe)
      | where EventID == 4625 and AccountType =~ "User"
      | summarize CountLast7day = count() by EventID, Account, LogonTypeName, SubStatus, AccountType, Computer, WorkstationName, IpAddress
  ) on EventID, Account, LogonTypeName, SubStatus, AccountType, Computer, WorkstationName, IpAddress
  | where CountToday >= CountLast7day*threshold and CountToday >= countlimit
  | project StartTimeUtc, EndTimeUtc, EventID, Account, LogonTypeName, SubStatus, AccountType, Computer, WorkstationName, IpAddress, CountToday, CountLast7day, Avg7Day = CountLast7day/7
  | order by CountToday desc nulls last 
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer