id: c1faf5e8-6958-11ec-90d6-0242ac120003
name: Fake computer account created
description: |
   'This query detects domain user accounts creation (event ID 4720) where the username ends with $. 
   Accounts that end with $ are normally domain computer accounts and when they are created the event ID 4741 is generated instead.
   Ref: https://blog.menasec.net/2019/02/threat-hunting-6-hiding-in-plain-sights.html'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1564
query: |
  union isfuzzy=true 
  (SecurityEvent
  | where EventID == 4720 and TargetUserName endswith "$"
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Computer, SubjectUserName, SubjectUserSid, SubjectLogonId, TargetUserName, TargetSid),
  (WindowsEvent
  | where EventID == 4720 
  | extend TargetUserName = tostring(EventData.TargetUserName)
  | where  TargetUserName endswith "$"
  | extend SubjectUserName = tostring(EventData.SubjectUserName)
  | extend SubjectUserSid = tostring(EventData.SubjectUserSid)
  | extend SubjectLogonId = tostring(EventData.SubjectLogonId)
  | extend TargetSid = tostring(EventData.TargetSid)
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Computer, SubjectUserName, SubjectUserSid, SubjectLogonId, TargetUserName, TargetSid)
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: SubjectUserName
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
version: 1.1.0
kind: Scheduled
