id: 0777f138-e5d8-4eab-bec1-e11ddfbc2be2
name: Failed Logon Attempts within 10 mins
description: A low level alert should occur when failed logon attempts are 6 or higher during a 10 minute period.
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 10m
queryPeriod: 20m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - LateralMovement
query: |

  let timeframe = 10m;
  SecurityEvent 
  | where TimeGenerated > ago(2*timeframe) 
  | where EventID == "4625"
  | where AccountType == "User"
  | summarize min(TimeGenerated), max(TimeGenerated), FailedLogonCount = count() by EventID, Activity, WorkstationName, Account, TargetAccount, TargetUserName, TargetDomainName, LogonType, LogonTypeName, LogonProcessName, Status, SubStatus
  | where FailedLogonCount >= 6
  | project StartTimeUtc = min_TimeGenerated, EndTimeUtc = max_TimeGenerated, FailedLogonCount, EventID, Activity, WorkstationName, Account, TargetAccount, TargetUserName, TargetDomainName, LogonType, LogonTypeName, LogonProcessName, Status, SubStatus

