// Name: Failed Logon Attempts within 10 mins
//
// Id: 0777f138-e5d8-4eab-bec1-e11ddfbc2be2
//
// Description: A low level alert should occur when failed logon attempts are 6 or higher during a 10 minute period.
//
// DataSource: #SecurityEvent
//
// Severity: Low
//
// QueryFrequency: 10m
//
// QueryPeriod: 20m
//
// AlertTriggerOperator: gte
//
// AlertTriggerThreshold: 6
//
// Techniques: #InitialAccess, #LateralMovement
let timeframe = 10m;
SecurityEvent 
| where TimeGenerated > ago(2*timeframe) 
| where EventID == "4625"
| where AccountType == "User"
| summarize min(TimeGenerated), max(TimeGenerated), FailedLogonCount = count() by EventID, Activity, WorkstationName, IPAddress, Account, TargetAccount, TargetUserName, TargetDomainName, LogonType, LogonTypeName, LogonProcessName, Status, SubStatus
| where FailedLogonCount >= 6
| project StartTimeUtc = min_TimeGenerated, EndTimeUtc = max_TimeGenerated, FailedLogonCount, EventID, Activity, WorkstationName, IPAddress, Account, TargetAccount, TargetUserName, TargetDomainName, LogonType, LogonTypeName, LogonProcessName, Status, SubStatus