id: 45b903c5-6f56-4969-af10-ae62ac709718
name: Rare RDP Connections
description: |
  'Identifies when an RDP connection is new or rare for a given account today based on comparison with the previous 7 days.
  Threshold is set to 3 by default and should be modified as needed.
  RDP connections are indicated by the logged EventID 4624 with LogonType = 10'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
relevantTechniques:
  - T1076
query: |

  let endtime = 1d;
  let starttime = 8d;
  // The threshold below excludes matching on connection counts higher than 3 for the previous 7 days. Change the threshold as needed.
  let threshold = 3;
  SecurityEvent
  | where TimeGenerated >= ago(endtime) 
  | where EventID == 4624 and LogonType == 10
  // use left anti to exclude anything from the previous 7 days that is not rare
  | join kind=leftanti (
  SecurityEvent
  | where TimeGenerated >= ago(starttime) and TimeGenerated < ago(endtime) 
  | where EventID == 4624 and LogonType == 10
  | summarize ConnectionCount = count() by TimeGenerated, Computer, IpAddress, Account, AccountType, Activity, LogonTypeName, ProcessName
  // Connection count to determine rarity
  | where ConnectionCount > threshold
  ) on Account
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress