id: 45b903c5-6f56-4969-af10-ae62ac709718
name: Rare RDP Connections
description: |
  'Identifies when an RDP connection is new or rare related to any logon type by a given account today based on comparison with the previous 14 days.
  RDP connections are indicated by the EventID 4624 with LogonType = 10'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
relevantTechniques:
  - T1076
query: |

  let starttime = 1d;
  let endtime = 14d;
  SecurityEvent
  | where TimeGenerated >= ago(endtime) 
  | where EventID == 4624 and LogonType == 10
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ConnectinCount = count() 
  by Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName, ProcessName
  // use left anti to exclude anything from the previous 14 days that is not rare
  | join kind=leftanti (
  SecurityEvent
  | where TimeGenerated between (ago(starttime) .. ago(endtime))
  | where EventID == 4624
  | summarize by Computer = toupper(Computer), IpAddress, Account = tolower(Account)
  ) on Account, Computer
  | summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), ConnectinCount = sum(ConnectinCount)  
  by Account, Computer, IpAddress, AccountType, Activity, LogonTypeName, ProcessName
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress