id: 78422ef2-62bf-48ca-9bab-72c69818a425
name: Multiple RDP connections from Single System
description: |
  'Identifies when an RDP connection is made to multiple systems and above the normal for the previous 7 days.  
  Connections from the same system with the same account within the same day.
  RDP connections are indicated by the EventID 4624 with LogonType = 10'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 8d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
relevantTechniques:
  - T1076
query: |

  let endtime = 1d;
  let starttime = 8d;
  let threshold = 2.0;
  SecurityEvent
  | where TimeGenerated >= ago(endtime) 
  | where EventID == 4624 and LogonType == 10
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ComputerCountToday = dcount(Computer), ComputerSet = makeset(Computer), ProcessSet = makeset(ProcessName)  
  by Account, IpAddress, AccountType, Activity, LogonTypeName
  | join kind=inner (
  SecurityEvent
  | where TimeGenerated >= ago(starttime) and TimeGenerated < ago(endtime) 
  | where EventID == 4624 and LogonType == 10
  | summarize ComputerCountPrev7Days = dcount(Computer) by Account, IpAddress
  ) on Account, IpAddress
  | extend Ratio = ComputerCountToday/(ComputerCountPrev7Days*1.0)
  // Where the ratio of today to previous 7 days is more than double.
  | where Ratio > threshold
  | project StartTimeUtc, EndTimeUtc, Account, IpAddress, ComputerSet, ComputerCountToday, ComputerCountPrev7Days, Ratio, AccountType, Activity, LogonTypeName, ProcessSet
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Account, IPCustomEntity = IpAddress
