id: 0cc52c79-5e4a-4cf2-b21a-6be452dd5127
name: Remote Scheduled Task Creation or Update using ATSVC Named Pipe
description: |
  'This query detects whether a scheduled task was created remotely using the ATSVC name pipe. It is using the event ID 5145.
  Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
relevantTechniques:
  - T1053
query: |
  SecurityEvent
  | where EventID == 5145 and ShareName=="\\\\*\\IPC$" and RelativeTargetName == "atsvc"
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, SubjectLogonId, ShareName, RelativeTargetName, IpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: SubjectUserName
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
version: 1.0.4
kind: Scheduled
