id: d9f28fdf-abc8-4f1a-a7e7-1aaec87a2fc5
name: Sdelete deployed via GPO and run recursively
description: |
  'This query looks for the Sdelete process being run recursively after being deployed to a host via GPO. Attackers could use this technique to deploy Sdelete to multiple host and delete data on them.'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvents
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1485
tags:
  -
query: |
    (union isfuzzy=true 
    (SecurityEvent
    | where EventID == 4688
    | where Process =~ "svchost.exe"
    | where CommandLine has "-k GPSvcGroup" or CommandLine has "-s gpsvc"
    | extend timekey = bin(TimeGenerated, 1m)
    | project timekey, NewProcessId, Computer),
     ( WindowsEvent
    | where EventID == 4688
    | where EventData has "svchost.exe" and (EventData has "svchost.exe" or EventData has "svchost.exe") 
    | extend CommandLine = tostring(EventData.CommandLine) 
    | where CommandLine has "-k GPSvcGroup" or CommandLine has "-s gpsvc"
    | extend timekey = bin(TimeGenerated, 1m)
    | extend NewProcessId = tostring(EventData.NewProcessId)
    | project timekey, NewProcessId, Computer))
    | join kind=inner ( union isfuzzy=true (SecurityEvent
    | where EventID == 4688
    | where Process =~ "sdelete.exe" or CommandLine has "sdelete"
    | where ParentProcessName endswith "svchost.exe"
    | where CommandLine has_all ("-s", "-r")
    | extend newProcess = Process
    | extend timekey = bin(TimeGenerated, 1m)
    ),
    (WindowsEvent
    | where EventID == 4688 and EventData has_any ("sdelete.exe","sdelete") and EventData has "svchost.exe" and EventData has_all ("-s", "-r")
    | extend CommandLine = tostring(EventData.CommandLine) 
    | extend NewProcessName = tostring(EventData.NewProcessName)
    | extend Process=tostring(split(NewProcessName, '\\')[-1])
    | where Process =~ "sdelete.exe" or CommandLine has "sdelete"
    | extend ParentProcessName = tostring(EventData.ParentProcessName)
    | where ParentProcessName endswith "svchost.exe"
    | where CommandLine has_all ("-s", "-r")
    | extend newProcess = Process
    | extend timekey = bin(TimeGenerated, 1m))) on $left.NewProcessId == $right.ProcessId, timekey, Computer
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Account
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
version: 1.1.0
kind: scheduled
