id: 80da0a8f-cfe1-4cd0-a895-8bc1771a720e
name: Security Event log cleared
description: |
  'Checks for event id 1102 which indicates the security event log was cleared. 
  Exclude events from "AD FS Auditing" as Event Source Name to avoid generating false positives when detecting this on AD FS servers.'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1107
query: |

let timeframe = 1d;
  SecurityEvent
  | where TimeGenerated >= ago(timeframe)
  | where EventID == 1102
  | where EventSourceName <> "AD FS Auditing" 
  | summarize count() by StartTimeUtc = TimeGenerated, Computer, Account, EventID, Activity
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer
