// Name: Security Event Log Cleared
// Description: Checks for event id 1102 which indicates the security event log was cleared
//
// Id: 80da0a8f-cfe1-4cd0-a895-8bc1771a720e
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// DataSource: #SecurityEvent
//
// Techniques: #Persistence, #DefenseEvasion
//
let timeframe = 1d;
SecurityEvent
| where TimeGenerated >= ago(timeframe)
| where EventID == 1102
| summarize count() by StartTimeUtc = TimeGenerated, Computer, Account, EventID, Activity 