id: 875d0eb1-883a-4191-bd0e-dbfdeb95a464
name: UserPrincipalNameAssignedToUserAccount
description: |
  'This query identifies whether a Active Directory user object was assigned a user principal name which could indicate that an adversary is preparing for performing Kerberoasting. 
  This query checks for event id 5136 that the Object Class field is "user" and the LDAP Display Name is "servicePrincipalName".'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1134
query: |
    SecurityEvent
    | where EventID == 5136 
    | parse EventData with * 'AttributeLDAPDisplayName">' AttributeLDAPDisplayName "<" *
    | parse EventData with * 'ObjectClass">' ObjectClass "<" *
    | parse EventData with * 'ObjectDN">' ObjectDN "<" *
    | parse EventData with * 'AttributeValue">' AttributeValue "<" *
    | where AttributeLDAPDisplayName == "servicePrincipalName" and  ObjectClass == "user"
    | project TimeGenerated, Computer, SubjectAccount, ObjectDN, AttributeValue
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: SubjectAccount
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
version: 1.0.0
kind: Scheduled
