id: 4b93c5af-d20b-4236-b696-a28b8c51407f
name: User Account Created and Deleted within 10mins
description: User account created and then deleted within 10 minutes
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 10m
queryPeriod: 20m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let timeframe = 10m;
  SecurityEvent 
  | where TimeGenerated > ago(2*timeframe) 
  // A user account was created
  | where EventID == "4720"
  | where AccountType == "User"
  | project creationTime = TimeGenerated, CreateEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, AccountUsedToCreate = SubjectUserName, TargetSid, SubjectUserSid 
  | join kind= inner (
    SecurityEvent
    | where TimeGenerated > ago(timeframe) 
    // A user account was deleted 
    | where EventID == "4726" 
  | where AccountType == "User"
  | project deletionTime = TimeGenerated, DeleteEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, AccountUsedToDelete = SubjectUserName, TargetSid, SubjectUserSid 
  ) on Computer, TargetUserName
  | where deletionTime - creationTime < 10m
  | extend TimeDelta = deletionTime - creationTime
  | where tolong(TimeDelta) >= 0
  | project TimeDelta, creationTime, CreateEventID, Computer, TargetUserName, UserPrincipalName, AccountUsedToCreate, deletionTime, DeleteEventID, AccountUsedToDelete

