id: acd4112f-5271-4680-ab2a-f07952d71888
name: Modifying the registry to add a ransom message notification
description: |
  Identify registry modifications that is indicative of a ransom note tied to DEV-0270.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
- Impact
query: |   
  DeviceProcessEvents 
  | where InitiatingProcessCommandLine has_all('"reg"', 'add', @'"HKLM\SOFTWARE\Policies\', '/v','/t', 'REG_DWORD', '/d', '/f', 'RecoveryKeyMessage', 'Your drives are Encrypted!', '@') 
