id: b1a40a5e-3378-4ba9-af74-9c67c6fe704c
name: User Email Submissions (FN) by Submission State
description: |
  This query visualises the total ammount of user false negative submissions by the state of the submission.
description-detailed: |
  This query visualises the total ammount of user false negative submissions by the state of the submission.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents 
  | where ActionType contains "UserSubmission" 
  | extend Record = (parse_json(RawEventData)).RecordType,SubmissionState = parse_json(RawEventData).SubmissionState,SubmissionId=parse_json(RawEventData).SubmissionId,SubmissionType = parse_json(RawEventData).SubmissionType,SubmissionContentType=tostring((parse_json(RawEventData)).SubmissionContentType)
  | where Record == 29 and SubmissionType in ("0","1")
  | summarize count() by tostring(SubmissionState)
  | render piechart
version: 1.0.0
