id: 6fdebfe4-50ff-4a68-81cb-ac736bde851b
name: "[Entra ID] 特權角色分配給新的使用者"
version: 1.0.0
kind: Scheduled
description: |
  偵測當特權角色分配給新的使用者，任何符合角色條件的帳戶，若被授予新的特權存取權限。
  如果分配是非預期的，或被指派到不屬於帳戶持有人職責的角色，請管理員先至Entra ID，
  找到該使用者->指派權限->選擇非預期的角色後->移除角色指派，並針對指派來源帳號及被指派帳號進行調查。
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - PrivilegeEscalation
  - DefenseEvasion
  - InitialAccess
relevantTechniques:
  - T1078.004
query: |
  // Define the start and end times based on input values
  let starttime = now() - 1h;
  let endtime = now();
  // Set a lookback period of 14 days
  let lookback = starttime - 14d;
  // Define a reusable function to query audit logs
  let awsFunc = (start: datetime, end: datetime) {
      AuditLogs
      | where TimeGenerated between (start .. end)
      | where Category =~ "RoleManagement"
      | where AADOperationType in ("Assign", "AssignEligibleRole")
      | where ActivityDisplayName has_any ("Add eligible member to role", "Add member to role")
      | mv-apply TargetResource = TargetResources on
          (
          where TargetResource.type in~ ("User", "ServicePrincipal")
          | extend
              Target = iff(TargetResource.type =~ "ServicePrincipal", tostring(TargetResource.displayName), tostring(TargetResource.userPrincipalName)),
              props = TargetResource.modifiedProperties
          )
      | mv-apply Property = props on
          (
          where Property.displayName =~ "Role.DisplayName"
          | extend RoleName = trim('"', tostring(Property.newValue))
          )
      | where RoleName contains "Admin" and Result == "success"
  };
  // Query for audit events in the current day
  let EventInfo_CurrentDay = awsFunc(starttime, endtime);
  // Query for audit events in the historical period (lookback)
  let EventInfo_historical = awsFunc(lookback, starttime);
  // Find unseen events by performing a left anti-join
  let EventInfo_Unseen = (EventInfo_CurrentDay
      | join kind=leftanti(EventInfo_historical) on Target, RoleName, OperationName
      );
  // Extend and clean up the results
  EventInfo_Unseen
  | extend InitiatingAppName = tostring(InitiatedBy.app.displayName)
  | extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)
  | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
  | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)
  | extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))
  | extend Initiator = iif(isnotempty(InitiatingAppName), InitiatingAppName, InitiatingUserPrincipalName)
  // You can uncomment the lines below to filter out PIM activations
  | where Initiator != "MS-PIM"
  //| summarize StartTime=min(TimeGenerated), EndTime=min(TimeGenerated) by OperationName, RoleName, Target, Initiator, Result
  // Project specific columns and split them for further analysis
  | project
      TimeGenerated,
      OperationName,
      RoleName,
      Target,
      Initiator,
      InitiatingUserPrincipalName,
      InitiatingAadUserId,
      InitiatingAppName,
      InitiatingAppServicePrincipalId,
      InitiatingIpAddress,
      Result,
      AADTenantId
  | extend
      TargetName = tostring(split(Target, '@', 0)[0]),
      TargetUPNSuffix = tostring(split(Target, '@', 1)[0]),
      InitiatorName = tostring(split(InitiatingUserPrincipalName, '@', 0)[0]),
      InitiatorUPNSuffix = tostring(split(InitiatingUserPrincipalName, '@', 1)[0])
  | extend
      Source_Network_IPLocation= geo_info_from_ip_address(InitiatingIpAddress),
      ActivityType=OperationName
  | project
          Alert_Category_zh = "Entra ID",
      Alert_SubCategory_zh = "異常身分權限修改",
      Alert_Name_zh = "特權角色分配給新的使用者",
      Alert_Description_zh = strcat(
                             "於台灣時間:",
                             format_datetime(datetime_utc_to_local(TimeGenerated, "Asia/Taipei"), "yyyy-MM-dd HH:mm:ss"),
                             ",在Entra ID : <TenantId>",
                             "操作者：",
                             iff(isnotempty(Initiator), Initiator, InitiatingAppName),
                             ",由 IP:",
                             InitiatingIpAddress,
                             ",指派特權角色 ",
                             tostring(RoleName),
                             " 給 ",
                             iff(isnotempty(Target), Target, "<NoTargetUser>"),
                             ".該使用者在近期(14天內)未曾出現的權限異動行為。"
                         ),
      Alert_TriageStep_zh = strcat(
                            "1. 確認該特權角色指派是否透過 Entra ID PIM核准的變更流程執行。",
                            "2. 與操作者:",
                            iff(isnotempty(Initiator), Initiator, "<UnknownInitiator>"),
                            " 確認是否為本人操作。",
                            "3. 檢查來源 IP 與地理位置是否異常或非公司Public IP。"
                        ),
      Alert_Containment_zh = strcat(
                             "1. 若判定為未授權角色指派,立即撤銷目標 ",
                             iff(isnotempty(Target), Target, "<NoTargetUser>"),
                             " 的特權角色(",
                             tostring(RoleName),
                             "),並回復至異動前狀態。",
                             "2. 立即限制執行角色指派的來源身分(使用者或應用程式),撤銷登入權杖,必要時強制重設密碼與 MFA。 ",
                             "3. 若來源為應用程式(",
                             iff(isnotempty(InitiatingAppName), InitiatingAppName, "<NoServicePrincipal>"),
                             "）,立即停用該 Service Principal,撤銷高權限 API 同意與憑證/密鑰。 "
                         ),
      Alert_Remediation_zh = strcat(
                             "1. 僅允許透過 Entra ID PIM 進行特權角色存取。",
                             "2. 對角色管理與 PIM 操作強制條件式存取與 MFA 限制僅能從受管理裝置與命名位置執行。",
                             "3. 建立特權角色異動的即時告警與自動化回應(SOAR)即時偵測異常角色指派行為。 "
                         ),
              Alert_Time_TW = datetime_utc_to_local(TimeGenerated, "Asia/Taipei"),
      Alert_Time_UTC0 = TimeGenerated,
      Event_Action = ActivityType,
      Event_Status = Result,
      //Event_Description = ActivityDisplayName,
      Source_Identity_FullName = iff(isnotempty(Initiator), Initiator, InitiatingAppName),
      //Source_Identity_ID = ActorID,
      Source_Identity_Type = iff(isnotempty(Initiator), "User", "Service"),
      Source_Network_IPAddress = InitiatingIpAddress,
      Source_Network_IPLocation = Source_Network_IPLocation,
      //Source_Resource_Name = InitiatingAppName,
      Target_Identity_FullName = Target,
      Target_Identity_DomainType = iff(Target contains "EXT", 'External', 'Internal'),
      Target_Identity_Type = "User",
      Target_Resource_ID = tostring(coalesce(AADTenantId, TenantId)),
      Target_Resource_Type = "Entra ID"
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Source_Identity_FullName
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Target_Identity_FullName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Source_Network_IPAddress
