id: 477c5f61-eec8-4029-9226-aa94ef776cad
name: "[Entra ID] 使用者指派了特權角色"
version: 1.0.0
kind: Scheduled
description: |
  使用者指派了特權角色。
  如果分配是非預期的，或被指派到不屬於帳戶持有人職責的角色，請管理員先至Entra ID，
  找到該使用者->指派權限->選擇非預期的角色後->移除角色指派，並針對指派來源帳號及被指派帳號進行調查。
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 2h
queryPeriod: 2h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - DefenseEvasion
  - PrivilegeEscalation
  - InitialAccess
relevantTechniques:
  - T1078.004
query: |
  AuditLogs
  | where Category =~ "RoleManagement"
  | where AADOperationType in ("Assign", "AssignEligibleRole", "CreateRequestGrantedRole", "CreateRequestPermanentEligibleRole", "CreateRequestPermanentGrantedRole")
  | where ActivityDisplayName has_any ("Add eligible member to role", "Add member to role")
  | mv-apply TargetResourceSubject = TargetResources on 
      (
      where TargetResourceSubject.type in~ ("User", "ServicePrincipal")
      | extend
          Target = iff(TargetResourceSubject.type =~ "ServicePrincipal", tostring(TargetResourceSubject.displayName), tostring(TargetResourceSubject.userPrincipalName)),
          subjectProps = TargetResourceSubject.modifiedProperties
      )
  | mv-apply TargetResourceRole = TargetResources on 
      (
      // mimic modifiedProperties so we can use the same logic to get the role name regardless of where it comes from
      where TargetResourceRole.type in~ ("Role")
      | extend roleProps = pack_array(bag_pack("displayName", "Role.DisplayName", "newValue", TargetResourceRole.displayName))
      )
  | mv-apply Property = iff(array_length(subjectProps) > 0, subjectProps, roleProps) on 
      ( 
      where Property.displayName =~ "Role.DisplayName"
      | extend RoleName = trim('"', tostring(Property.newValue))
      )
  | where RoleName contains "Admin"
  | extend InitiatingAppName = tostring(InitiatedBy.app.displayName)
  | extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)
  | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
  | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)
  | extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))
  | extend Initiator = iif(isnotempty(InitiatingAppName), InitiatingAppName, InitiatingUserPrincipalName)
  // Comment below to alert for PIM activations
  | where Initiator != "MS-PIM"
  | summarize
      by
      bin(TimeGenerated, 1h),
      OperationName,
      RoleName,
      Target,
      Initiator,
      InitiatingUserPrincipalName,
      InitiatingAadUserId,
      InitiatingAppName,
      InitiatingAppServicePrincipalId,
      InitiatingIpAddress,
      Result,
      AADTenantId
  | extend
      TargetName = tostring(split(Target, '@', 0)[0]),
      TargetUPNSuffix = tostring(split(Target, '@', 1)[0]),
      InitiatorName = tostring(split(InitiatingUserPrincipalName, '@', 0)[0]),
      InitiatorUPNSuffix = tostring(split(InitiatingUserPrincipalName, '@', 1)[0])
  | extend
      Source_Network_IPLocation= geo_info_from_ip_address(InitiatingIpAddress),
      ActivityType=OperationName
  | project
          Alert_Category_zh = "Entra ID",
      Alert_SubCategory_zh = "異常身分權限修改",
      Alert_Name_zh = "使用者指派了特權角色",
      Alert_Description_zh = strcat(
                             "於台灣時間：",
                             format_datetime(datetime_utc_to_local(TimeGenerated, "Asia/Taipei"), "yyyy-MM-dd HH:mm:ss"),
                             ",在Entra ID : <TenantId>",
                             ",操作者:",
                             iff(isnotempty(Initiator), Initiator, "<UnknownInitiator>"),
                             ",由 IP:",
                             InitiatingIpAddress,
                             ",指派特權角色 ",
                             tostring(RoleName),
                             " 給使用者 ",
                             iff(isnotempty(Target), Target, "<NoTargetUser>"),
                             ".此行為屬高風險權限異動,需立即確認其合法性。"
                         ),
      Alert_TriageStep_zh = strcat(
                            "1. 確認該特權角色指派是否透過 Entra ID PIM 核准的變更流程執行。",
                            "2. 與操作者:",
                            iff(isnotempty(Initiator), Initiator, "<UnknownInitiator>"),
                            " 確認是否為本人操作。",
                            "3. 檢查來源 IP 與地理位置是否異常或非公司Public IP。"
                        ),
      Alert_Containment_zh = strcat(
                             "1. 若判定為未授權角色指派,立即撤銷目標使用者 ",
                             iff(isnotempty(Target), Target, "<NoTargetUser>"),
                             " 的特權角色(",
                             tostring(RoleName),
                             "),並回復至異動前狀態。",
                             "2. 立即限制或暫停執行角色指派的操作者(使用者或應用程式),撤銷其登入權杖並視需要強制重設 MFA/密碼。 ",
                             "3. 若來源為應用程式(",
                             iff(isnotempty(InitiatingAppName), InitiatingAppName, "<NoServicePrincipal>"),
                             "),立即停用該 Service Principal,撤銷高權限 API 同意與憑證/密鑰。"
                         ),
      Alert_Remediation_zh = strcat(
                             "1. 僅允許透過 Entra ID PIM 進行特權角色存取。",
                             "2. 對角色管理與 PIM 操作強制條件式存取與 MFA 限制僅能從受管理裝置與命名位置執行。",
                             "3. 建立特權角色異動的即時告警與自動化回應(SOAR)即時偵測異常角色指派行為。 "
                         ),
              Alert_Time_TW = datetime_utc_to_local(TimeGenerated, "Asia/Taipei"),
      Alert_Time_UTC0 = TimeGenerated,
      Event_Action = ActivityType,
      Event_Status = Result,
      //Event_Description = ActivityDisplayName,
      Source_Identity_FullName = iff(isnotempty(Initiator), Initiator, InitiatingAppName),
      //Source_Identity_ID = ActorID,
      Source_Identity_Type = iff(isnotempty(InitiatingUserPrincipalName), "User", "Service"),
      Source_Network_IPAddress = InitiatingIpAddress,
      Source_Network_IPLocation = Source_Network_IPLocation,
      //Source_Resource_Name = InitiatingAppName,
      Target_Identity_FullName = Target,
      Target_Identity_DomainType = iff(Target contains "EXT", 'External', 'Internal'),
      Target_Identity_Type = "User",
      Target_Resource_ID = tostring(coalesce(AADTenantId, TenantId)),
      Target_Resource_Type = "Entra ID"
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Source_Identity_FullName
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Target_Identity_FullName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Source_Network_IPAddress
