id: a937905e-ee5c-406c-ab86-8e2581240112
name: Top 10 Users clicking on Malicious URLs (Phish)
description: |
  Visualises the top 10 users with click attempts on URLs in emails detected as phishing, helping analysts identify risky user behaviour and potential targets.
  Based on Defender for Office 365 workbook: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  UrlClickEvents
  | where ThreatTypes == "Phish"
  | summarize count() by AccountUpn
  | top 10 by count_
  | render piechart
version: 1.0.0