id: e7642e6e-cf27-46ec-a4b9-e4475228fead
name: AD Account Lockout
description: |
  'Detects Active Directory account lockouts'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - InitialAccess
  - CredentialAccess
relevantTechniques:
  - T1531
query: |
  let timeframe = 7d;
  SecurityEvent
  | where TimeGenerated >= ago(timeframe)
  | where EventID == 4740
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Account
  | extend Timestamp = StartTimeUtc
