id: e7642e6e-cf27-46ec-a4b9-e4475228fead
name: AD Account Lockout
description: |
  'Detects Active Directory account lockouts'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - InitialAccess
  - CredentialAccess
relevantTechniques:
  - T1531
query: |
let timeframe = 7d;
SecurityEvent
| where TimeGenerated >= ago(timeframe)
| where EventID == 4740
| extend AccountCustomEntity = tostring(split(Account, '\\', 1)), SourceDomainController = Computer, HostCustomEntity = TargetDomainName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), LockoutsCount = count() by AccountCustomEntity, HostCustomEntity, SourceDomainController
| extend timestamp = StartTime