id: 5a3615af-21c9-427e-8bf1-ed2350992bb4
name: Crash dump disabled on host
description: |
  'This detection looks the prevention of crash dumps being created. This can be used to limit reporting by malware, look for suspicious processes setting this registry key.'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvents
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1070
query: |
  SecurityEvent
    | where EventID == 4657
    | parse ObjectName with "\\REGISTRY\\" KeyPrefix "\\" RegistryKey
    | project-reorder RegistryKey
    | where RegistryKey has "SYSTEM\\CurrentControlSet\\Control\\CrashControl"
    | where ObjectValueName =~ "CrashDumpEnabled"
    | extend  RegistryValueData = iff (OperationType == "%%1906", OldValue, NewValue)
    | where RegistryValueData == 0
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Account
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
