id: a344e28e-095d-47fb-84a8-d06edd31d2cb
name: Invoke-PowerShellTcpOneLine Usage.
description: |
  'Invoke-PowerShellTcpOneLine is a PowerShell script to create a simple and small reverse shell. It can be abused by attackers to exfiltrate data. This query looks for command line activity similar to Invoke-PowerShellTcpOneLine.'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
tactics:
  - Exfiltration
relevantTechniques:
  - T1011
query: |
 union isfuzzy=true 
  (SecurityEvent
  | where EventID == 4688
  | where Process has_any ("powershell.exe", "PowerShell_ISE.exe", "cmd.exe")
  | where CommandLine has "$client = New-Object System.Net.Sockets.TCPClient"
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress),
  (WindowsEvent
  | where EventID == 4688 and EventData has_any ("powershell.exe", "PowerShell_ISE.exe", "cmd.exe") and EventData has "$client = New-Object System.Net.Sockets.TCPClient"
  | extend NewProcessName = tostring(EventData.NewProcessName)
  | extend Process=tostring(split(NewProcessName, '\\')[-1])
  | where Process has_any ("powershell.exe", "PowerShell_ISE.exe", "cmd.exe")
  | extend CommandLine = tostring(EventData.CommandLine) 
  | where CommandLine has "$client = New-Object System.Net.Sockets.TCPClient"
  | extend Account = iff((isempty(EventData.SubjectDomainName) or EventData.SubjectDomainName == "-"),"", strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName)))
  | extend IpAddress = tostring(EventData.IpAddress)
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress
  )
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity