id: 6d04a1ef-1b4d-4ff8-a76c-ad7d1a396136
name: Least Common Processes Including Folder Depth
description: |
  'Looks across your environment for least common Process Command Lines, may be noisy and require whitelisting.  By ZanCo'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Execution
query: |

  let Whitelist = dynamic (['foo.exe', 'baz.exe']);
  let Sensitivity = 15;
  let StartDate = ago(7d);
  let Duration = 7d;
  SecurityEvent
  | where EventID == 4688 and TimeGenerated > StartDate and TimeGenerated < (StartDate + Duration)
  | extend ProcArray = split(NewProcessName, '\\')
  // ProcArrayLength is Folder Depth
  | extend ProcArrayLength = arraylength(ProcArray)
  | extend LastIndex = ProcArrayLength - 1
  | extend Proc = ProcArray[LastIndex]
  | where Proc !in (Whitelist)
  // ProcArray[0] is the proc's Drive
  | extend DriveDepthProc = strcat(ProcArray[0], '-', ProcArrayLength, '-', Proc)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), TimesSeen = count(), HostCount = dcount(Computer), Hosts = makeset(Computer), UserCount = dcount(SubjectUserName), Users = makeset(SubjectUserName) by DriveDepthProc
  | where TimesSeen < Sensitivity
  | extend timestamp = StartTimeUtc
