id: 3712595d-6f47-416b-963a-605201ed2764
name: Least Common Parent And Child Process Pairs
description: |
  'Looks across your environment for least common Parent/Child process combinations.
  Will possibly find some malicious activity disguised as well known process names.
  By ZanCo'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes: 
      - SecurityEvents  
tactics:
  - Execution
query: |

  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 7d;
  let Allowlist = dynamic (['foo.exe', 'baz.exe']);
  let Sensitivity = 5;
  union isfuzzy=true
  (
  SecurityEvent
  | where TimeGenerated between(lookback..endtime)
  | where EventID == 4688 and isnotnull(ParentProcessName)
  | extend Proc=tostring(split(NewProcessName, '\\')[-1])
  | extend ParentProc=tostring(split(ParentProcessName, '\\')[-1])
  | where Proc !in (Allowlist)
  | extend ParentChildPair = strcat(ParentProc , ' > ', Proc)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), TimesSeen = count(), HostCount = dcount(Computer), Hosts = makeset(Computer), UserCount = dcount(SubjectUserName), Users = makeset(SubjectUserName) by ParentChildPair
  | where TimesSeen < Sensitivity
  | extend timestamp = StartTimeUtc),
  (WindowsEvent
  | where TimeGenerated between(lookback..endtime)
  | where EventID == 4688 
  | extend ParentProcessName = tostring(EventData.ParentProcessName)
  | where isnotnull(ParentProcessName)
  | extend NewProcessName = tostring(EventData.NewProcessName)
  | extend Proc=tostring(split(NewProcessName, '\\')[-1])
  | extend ParentProc=tostring(split(ParentProcessName, '\\')[-1])
  | where Proc !in (Allowlist)
  | extend ParentChildPair = strcat(ParentProc , ' > ', Proc)
  | extend SubjectUserName = tostring(EventData.SubjectUserName)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), TimesSeen = count(), HostCount = dcount(Computer), Hosts = makeset(Computer), UserCount = dcount(SubjectUserName), Users = makeset(SubjectUserName) by ParentChildPair
  | where TimesSeen < Sensitivity
  | extend timestamp = StartTimeUtc
  )
