// Name: New processes observed in last 24 hours
//
// Id: 513e3a11-e1bb-4cfc-8af9-451da0407e6b
//
// Description: These new processes could be benign new programs installed on hosts; however, especially in normally stable environments, 
//   these new processes could provide an indication of an unauthorized/malicious binary that has been installed and run. 
//   Reviewing the wider context of the logon sessions in which these binaries ran can provide a good starting point for identifying possible attacks.
//
// DataSource: #SecurityEvent
//
// Tactics: #Execution
//
let ProcessCreationEvents=() {
let processEvents=SecurityEvent
| where EventID==4688
| project TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName, AccountDomain=SubjectDomainName, FileName=split(NewProcessName, @'')[(-1)], ProcessCommandLine = CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine='',InitiatingProcessParentFileName=''
| where TimeGenerated >= ago(30d); 
processEvents
| where TimeGenerated < ago(1d)
| summarize HostCount=dcount(ComputerName) by tostring(FileName)
| join kind=rightanti (
processEvents
| where TimeGenerated >= ago(1d)
| summarize HostCount=dcount(ComputerName) by tostring(FileName)
) on FileName
| project HostCount, FileName
