id: 513e3a11-e1bb-4cfc-8af9-451da0407e6b
name: New processes observed in last 24 hours
description: |
  'These new processes could be benign new programs installed on hosts; however, especially in normally stable environments,
  these new processes could provide an indication of an unauthorized/malicious binary that has been installed and run.
  Reviewing the wider context of the logon sessions in which these binaries ran can provide a good starting point for identifying possible attacks.'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Execution
query: |

  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 14d;
  let ProcessCreationEvents=() {
  let processEvents=SecurityEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID==4688
  | project TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName, AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, @'')[(-1)]), ProcessCommandLine = CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine='',InitiatingProcessParentFileName='';
  processEvents};
  ProcessCreationEvents
  | where TimeGenerated between(starttime..endtime)
  | summarize HostCount=dcount(ComputerName) by tostring(FileName)
  | join kind=rightanti (
      ProcessCreationEvents
      | where TimeGenerated between(starttime..endtime)
      | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), Computers = makeset(ComputerName) , HostCount=dcount(ComputerName) by tostring(FileName)
  ) on FileName
  | project StartTimeUtc, Computers, HostCount, FileName
  | extend timestamp = StartTimeUtc