id: f885fb16-dfd3-4c90-83d9-7a66b9d9b654
name: New Child Process of W3WP.exe
description: |
  'This Hunting Query looks for child processes of w3wp.exe that have not been seen as a child process on that host within the last 14 days.
  w3wp.exe running suspicious processes such as 'cmd.exe /c echo', 'certutil.exe', or 'powershell.exe' that result in the creation of script files in web -accessible folders is a rare event and is, thus, typically a strong sign of web server compromise and web shell installation.
  Ref: https://www.microsoft.com/security/blog/2021/02/11/web-shell-attacks-continue-to-rise/'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
tactics:
  - Execution
relevantTechniques:
  - T1203
query: |

  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 14d;
  let known_procs = ( union isfuzzy=true 
  (SecurityEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID == 4688
  | where ParentProcessName hassuffix "w3wp.exe"
  | extend ProcessHost = strcat(Process, "-", Computer)
  | summarize by ProcessHost),
  (WindowsEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID == 4688 and EventData has "w3wp.exe"
  | extend ParentProcessName = tostring(EventData.ParentProcessName)
  | where ParentProcessName hassuffix "w3wp.exe"
  | extend NewProcessName = tostring(EventData.NewProcessName)
  | extend Process=tostring(split(NewProcessName, '\\')[-1])
  | extend ProcessHost = strcat(Process, "-", Computer)
  | summarize by ProcessHost
  ));
  ( union isfuzzy=true 
  ( SecurityEvent
  | where TimeGenerated between(starttime..endtime)
  | where EventID == 4688
  | where ParentProcessName hassuffix "w3wp.exe"
  | extend ProcessHost = strcat(Process, "-", Computer)
  | where ProcessHost !in (known_procs)
  | project-reorder TimeGenerated, Computer, NewProcessName, ParentProcessName, Account, NewProcessId
  | extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account ),
  ( WindowsEvent
  | where TimeGenerated between(starttime..endtime)
  | where EventID == 4688 and EventData has "w3wp.exe"
  | extend ParentProcessName = tostring(EventData.ParentProcessName)
  | where ParentProcessName hassuffix "w3wp.exe"
  | extend NewProcessName = tostring(EventData.NewProcessName)
  | extend Process=tostring(split(NewProcessName, '\\')[-1])
  | extend ProcessHost = strcat(Process, "-", Computer)
  | where ProcessHost !in (known_procs)
  | extend Account = iff((isempty(EventData.SubjectDomainName) or EventData.SubjectDomainName == "-"),"", strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName)))
  | extend NewProcessId = tostring(EventData.NewProcessId)
  | project-reorder TimeGenerated, Computer, NewProcessName, ParentProcessName, Account, NewProcessId
  | extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account ))
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
