id: 58fe8fc8-54fa-48cd-bac3-197f8d862429
name: Procdump of LSASS memory
description: |
  'Look for evidence of Procdump being used to dump LSASS process. Often used by attackers to access credentials stored on a system.'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - CredentialAccess
relevantTechniques:
  - T1003
query: |
  SecurityEvent 
  | where (Process has_any ("procdump.exe", "procdump64.exe") and CommandLine has "lsass")
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity