id: 82e04ff9-a289-4005-9fcd-f1deec72e3fc
name: Hosts running a rare process
description: |
  Looking for hosts running a rare process. Less than 1% of the average for 30 days and less than a count of 100 on a given host or less than a 14 count on a given host from the last 7 days

requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Execution
  - Persistence
  - Discovery
  - LateralMovement
  - Collection

query: |
  let v_StartTime = ago(1d);
  let v_EndTime = ago(1m);
  let basic=materialize(
    SecurityEvent
      | where TimeGenerated >= ago(30d)
      | where EventID == 4688
      | summarize FullCount = count()
                  , Count= countif(TimeGenerated between (v_StartTime .. v_EndTime))
                  , min_TimeGenerated=min(TimeGenerated)
                  , max_TimeGenerated=max(TimeGenerated) 
                        by Computer, NewProcessName
      | where Count > 0 and Count < 100);
  let basic_avg = basic
      | summarize Avg = avg(FullCount) by  NewProcessName;
  basic | project-away FullCount
    | join kind=inner 
  basic_avg 
    on NewProcessName | project-away NewProcessName1
    | where Count < 14 or (Count <= Avg*0.01 and Count < 100) 
    | extend HostCustomEntity=Computer