id: 0cc52c79-5e4a-4cf2-b21a-6be452dd5127
name: Remote Scheduled Task Creation or Update using ATSVC Named Pipe
description: |
  'This query detects a scheduled task, created/updated remotely, using the ATSVC name pipe. 
  Threat actors are using scheduled tasks for establishing persistence and moving laterally through the network.
  Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Persistence
relevantTechniques:
  - T1053
query: |
  SecurityEvent
  | where EventID == 5145 and ShareName=="\\\\*\\IPC$" and RelativeTargetName == "atsvc"
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, ShareName, RelativeTargetName, IpAddress
