id: 8f658a80-7fa9-4524-a95b-d9ab608e8850
name: Remote Login Performed with WMI
description: |
   'This query detects authentication attempts performed with WMI.
   Ref: https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Execution
relevantTechniques:
  - T1047
query: |
 SecurityEvent
    | where EventID in (4624,4625) and ProcessName endswith_cs "WmiPrvSE.exe"
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, TargetUserName, TargetLogonId, LogonTypeName, IpAddress, ProcessName
