id: 9a5f5afa-8d85-11ec-b909-0242ac120002
name: Remote Task Creation/Update using Schtasks Process
description: |
   'The query detects a scheduled task, created/updated remotely, using the Schtasks process. 
   Threat actors are using scheduled tasks for establishing persistence and moving laterally through the network.
   Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'
severity: Low
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes: 
      - SecurityEvents 
tactics:
  - Persistence
relevantTechniques:
  - T1053
query: |
   union isfuzzy=true 
   (SecurityEvent
   | where EventID == 4688 and NewProcessName == "C:\\Windows\\System32\\schtasks.exe" and CommandLine has " /s "
   | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, CommandLine
   ),
   (WindowsEvent
   | where EventID == 4688 and EventData has "C:\\Windows\\System32\\schtasks.exe"
   | extend NewProcessName = tostring(EventData.NewProcessName)
   | where NewProcessName == "C:\\Windows\\System32\\schtasks.exe"
   | extend CommandLine = tostring(EventData.CommandLine) 
   | where CommandLine has " /s "
   | extend SubjectUserName = tostring(EventData.SubjectUserName)
   | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, CommandLine
   )
