id: 0b827a49-427e-4721-b05e-b151a8af524e
name: Scheduled Task Creation or Update from User Writable Directory
description: |
   'This query triggers when a scheduled task is created or updated and it is going to run programs from writable user paths.
   Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
tactics:
  - Execution
relevantTechniques:
  - T1053.005
query: |
  // Enter a reference list for writable user paths"
  let WritableUserPaths = dynamic (["\"C:\\Users\\","\"C:\\ProgramData\\"]);
  union isfuzzy=true 
  (SecurityEvent
  | where EventID in (4698,4702) and EventData has_any (WritableUserPaths)
  | parse EventData with * 'Command&gt;' Command "&lt" *
  | parse EventData with * 'Arguments&gt;' Arguments "&lt" *
  | where Command has_any (WritableUserPaths) or Arguments has_any (WritableUserPaths)
  | parse EventData with * 'SubjectUserName">' SubjectUserName "<" * 'SubjectDomainName">' SubjectDomainName "<" * 'TaskName">' TaskName "<" *
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Activity, Computer, SubjectUserName, SubjectDomainName, TaskName, Command, Arguments),
  (WindowsEvent
  | where EventID in (4698,4702) and EventData has_any (WritableUserPaths)
  | extend Command = tostring(EventData.Command)
  | extend Arguments = tostring(EventData.Arguments)
  | where Command has_any (WritableUserPaths) or Arguments has_any (WritableUserPaths)
  | extend Activity=case(EventID=="4698", "4698 - A scheduled task was created.",EventID=="4702", "4702 - A scheduled task was updated.", tostring(EventID) )
  | extend SubjectUserName = tostring(EventData.SubjectUserName)
  | extend SubjectDomainName = tostring(EventData.SubjectDomainName)
  | extend TaskName = tostring(EventData.TaskName)
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Activity, Computer, SubjectUserName, SubjectDomainName, TaskName, Command, Arguments)
entityMappings:
- entityType: Account
  fieldMappings:
    - identifier: FullName
      columnName: SubjectUserName
- entityType: Host
  fieldMappings:
    - identifier: FullName
      columnName: Computer
- entityType: Process
  fieldMappings:
    - identifier: CommandLine
      columnName: CommandLine
version: 1.0.0
kind: Scheduled
