id: e9764ecd-d9e3-4f9b-b231-daaa261a3d67
name: Testing Generate YAML feature
description: Testing Generate YAML feature
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
query: "SecurityEvent\n| summarize dcount(Process) by Account"
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Account
