// Name: Summary of user logons by logon type
// Description: Comparing succesful and nonsuccessful logon attempts can be used to identify attempts to move laterally within the environment with the intention of discovering credentials and sensitive data.
//
// Id: d0f13bb9-e713-4f89-b610-1806326a1dea
//
// Tactics: #InitialAccess, #LateralMovement, #Persistence
//
SecurityEvent
| where EventID in (4624, 4625)
| where AccountType == 'User' 
| summarize Amount = count() by  LogonTypeName"