// Name: VIP account more than 6 failed logons in 10
// Description: VIP Account with more than 6 failed logon attempts in 10 minutes, include your own VIP list in the table below
//
// Id: 42ae9690-89ce-4063-9a90-465badad5395
//
// DataSource: #SecurityEvent
//
// Techniques: #Discovery, #LateralMovement
//
// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(VIPUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
let timeframe = 10m;
SecurityEvent 
| where TimeGenerated > ago(timeframe) 
| where EventID == "4625"
| where AccountType == "User"
| where LogonType == "2" or LogonType == "3"
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), FailedVIPLogons = count() by LogonType, Account
| where FailedVIPLogons >= 6