// Name: VIP account more than 6 failed logons in 10
// Description: VIP Account with more than 6 failed logon attempts in 10 minutes, include your own VIP list in the table below
//
// Id: e8d36582-c403-4466-bd44-ebede5b6fa6e
//
// DataSource: #SecurityEvent
//
// Tactics: #Discovery, #LateralMovement
//
// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(VIPUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
let timeframe = 10m;
List | extend Account = strcat(Domain,"\\",VIPUser) | join kind= inner (
SecurityEvent 
| where TimeGenerated > ago(timeframe) 
| where EventID == "4625"
| where AccountType == "User"
| where LogonType == "2" or LogonType == "3"
) on Account 
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), FailedVIPLogons = count() by LogonType, Account
| where FailedVIPLogons >= 6
| extend AccountCustomEntity = Account
