id: D66DD819-F2E6-43F7-8BC1-70BDE8011B39
name: Several deny actions registered (AsimWebSession)
description: |
  'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source was denied more than 5 times.
  To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/AdvancedSentinelInformationModel)'
tags:
  - Id: f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e
    version: 1.0.0
  - Schema: ASimWebSession
    SchemaVersion: 0.2.1
severity: Medium
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 1
tactics:
  - Discovery
  - LateralMovement
  - CommandAndControl
relevantTechniques:
  - T1046
  - T1041
  - T1071
query: |
  let threshold = 5;
  imWebSession(eventresult='Failure')
  | summarize StartTime = min(TimeGenerated), Count=count() by SrcIpAddr, DstIpAddr, Url, NetworkApplicationProtocol
  | extend NetworkApplicationProtocol=iff(isempty(NetworkApplicationProtocol),"an unknown", NetworkApplicationProtocol)
  | where Count >= ["threshold"]
  | extend timestamp = StartTime, URLCustomEntity = Url, IPCustomEntity = SrcIpAddr
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: URLCustomEntity

alertDetailsOverride:
  alertDisplayNameFormat: Several deny actions registered for source {{SrcIpAddr}} accessing {{Url}} (ASimWebSession) # Up to 256 chars

customDetails:
  DstIpAddr: DstIpAddr
  NetworkApplicationProtocol: NetworkApplicationProtocol  
version: 1.0.0
kind: Scheduled