id: 3f0c20d5-6228-48ef-92f3-9ff7822c1954
name: A host is potentially running a hacking tool (ASIM Web Session schema)
description: |
  'This rule identifies a web request with a user agent header known to belong to a hacking tool. This indicates a hacking tool is used on the host.This rule uses the [Advanced SIEM Information Model (ASIM)](https://aka.ms/AboutASIM) and supports any web session source that complies with ASIM. To use this Analytics Rule, [deploy the Advanced SIEM information Model (ASIM)](https://aka.ms/DeployASIM).'
severity: Medium
tags:
  - Id: 8d537f3c-094f-430c-a588-8a87da36ee3a
    version: 1.0.0
  - Schema: ASimWebSession
    SchemaVersion: 0.2.1
requiredDataConnectors: []
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandandControl
query: |
  let timeframe = 15m;
  let user_agents=dynamic([
     '(hydra)',
     ' arachni/',
     ' BFAC ',
     ' brutus ',
     ' cgichk ',
     'core-project/1.0',
     ' crimscanner/',
     'datacha0s',
     'dirbuster',
     'domino hunter',
     'dotdotpwn',
     'FHScan Core',
     'floodgate',
     'get-minimal',
     'gootkit auto-rooter scanner',
     'grendel-scan',
     ' inspath ',
     'internet ninja',
     'jaascois',
     ' zmeu ',
     'masscan',
     ' metis ',
     'morfeus fucking scanner',
     'n-stealth',
     'nsauditor',
     'pmafind',
     'security scan',
     'springenwerk',
     'teh forest lobster',
     'toata dragostea',
     ' vega/',
     'voideye',
     'webshag',
     'webvulnscan',
     ' whcc/',
     ' Havij',
     'absinthe',
     'bsqlbf',
     'mysqloit',
     'pangolin',
     'sql power injector',
     'sqlmap',
     'sqlninja',
     'uil2pn',
     'ruler',
     'Mozilla/5.0 (Windows; U; Windows NT 5.1; pt-PT; rv:1.9.1.2) Gecko/20090729 Firefox/3.5.2 (.NET CLR 3.5.30729)'
     ]);
  imWebSession(httpuseragent_has_any=user_agents)
  | project SrcIpAddr, DstIpAddr, Url, TimeGenerated,HttpUserAgent
  | extend IpCustomEntity = SrcIpAddr, UrlCustomEntity = Url
entityMappings:
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: UrlCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity

alertDetailsOverride:
  alertDisplayNameFormat: 'Host {{SrcIpAddr}} is potentially running a hacking tool'
  alertDescriptionFormat: 'The host at address {{SrcIpAddr}} sent an HTTP request to the URL {{Url}} with the HTTP user agent header {{HttpUserAgent}}. This user agent is known to be used by a hacking tool and indicates suspicious activity on the host.'
customDetails:
  UserAgent: UserAgent

eventGroupingSettings:
  aggregationKind: AlertPerResult
  Username: SrcUsername

version: 1.0.0
kind: Scheduled