id: ac738108-451b-4341-ba38-021a00665415
name: Blocked Clicks Trend
description: |
  Visualizes the daily trend of URL clicks that were blocked by Safe Links or policy controls.
description-detailed: |
  This query visualizes the number of URL clicks blocked by Safe Links or tenant policy controls over time, helping security teams monitor the effectiveness of click protection and user exposure to malicious links.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
    - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  UrlClickEvents
  | where Timestamp >= TimeStart and Timestamp <= TimeEnd
  | where ActionType == "ClickBlocked"
  | summarize BlockedClicks = count() by bin(Timestamp, 1d)
  | order by Timestamp asc
  //| render timechart // Uncomment to display as a timechart
  //| render columnchart // Uncomment to display as a column chart
version: 1.0.0