id: 3a2fdf32-ebe7-4f65-a1c3-fc7faf23ae90
name: Top 10 Users clicking on Malicious URLs (Spam)
description: |
  Identifies the top 10 users who have clicked on URLs classified as spam, helping prioritize user awareness and policy reviews.
description-detailed: |
  This query identifies the top 10 users who have clicked on URLs detected as spam by Safe Links or other Defender for Office 365 protections.
  By default, results are limited to the top 10 users with the highest click counts for spam URLs; you can remove or adjust this limit to see all users.
  Recommended visualization: columnchart for comparing users, or piechart for proportional breakdown if there are few users.
  Part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
    - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  UrlClickEvents
  | where Timestamp between (TimeStart .. TimeEnd)
  | where ThreatTypes has "Spam"
  | summarize SpamClicks = count() by User = AccountUpn
  | sort by SpamClicks desc
  | top 10 by SpamClicks  // Uncomment to limit to top 10 users; remove to see all results
  //| render columnchart // Recommended for comparing top users
  //| render piechart // Use for proportional breakdown if user count is small
version: 1.0.0
