id: ab006655-d723-4844-9d5d-91cb3b020555
name: URLs by location
description: |
  Visualizes URLs found in emails by their location (body, QR code, etc.).
description-detailed: |
  This query summarizes the distribution of URLs in emails by their detected location, helping analysts identify trends in how malicious links are delivered.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailUrlInfo
tactics:
- InitialAccess
relevantTechniques:
- T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  EmailUrlInfo
  | where TimeGenerated >= TimeStart and TimeGenerated <= TimeEnd
  | summarize count() by UrlLocation, bin(TimeGenerated, 1d)
version: 1.0.0
