id: b140b19a-0fcf-40f2-9284-5e0f58e1efd8
name: Acronis - Agent failed updating more than twice in a day
description: The following devices have failed agent updates more than two times.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID == "AgentAutoUpdateStalled"
  | summarize FailureCount = count() by DeviceName, bin(TimeGenerated, 1d)
  | where FailureCount > 2
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
