id: 51ac84a9-5e82-456a-b398-f2e7b9ea8611
name: "Acronis - Endpoints with Backup issues"
description: "Endpoints experiencing various backup-related issues."
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in
  ("BackupNotResponding",
  "BackupRecoveryFailed",
  "BackupFailed",
  "ArchiveCorrupted")
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
