id: 39310cb8-53bc-47c1-86c4-2ff9f0d3cc5f
name: "Acronis - ASZ defence: Unauthorized operation is detected and blocked"
description: "An attempt to modify the protected Acronis Secure Zone partition was blocked."
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in ("ActiveProtectionDetectedAszPartitionAccessed")
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
