id: 1de4a0c7-4e72-45f3-b335-ab25f99ace3f
name: Acronis - Inboxes with Malicious Content
description: Many inboxes containing malicious content could indicate a potential ongoing phishing attack.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in
  ("MaliciousURLDetectedInM365MailboxBackup",
  "MalwareDetectedInM365MailboxBackup",
  "MaliciousEmailDetectedPerceptionPointWarning")
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
