id: 9657f70c-d7df-4232-937c-6045fffe4e3d
name: Acronis - Endpoints with high failed login attempts
description: 'Multiple endpoints with a high number of failed login attempts could indicate a password spraying attack, where an attacker tries different credentials across several machines.'
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID == "MiMonitoringFailedLoginAttemptsOverThreshold"
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
