id: 98d1abaf-6be8-4d20-8ff3-16b19bc616af
name: Acronis - Cloud Connection Errors
description: Various errors related to S3 or Azure cloud connections.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in
  ("CloudConnectionS3CloudAccessExpired",
  "CloudConnectionAzureCloudAccessExpired",
  "CloudConnectionAzureApplianceUpdateFailed",
  "CloudConnectionAzureApplianceFailed",
  "CloudConnectionAzureApplianceEOL",
  "CloudConnectionAzureApplianceDeletionFailed",
  "CloudConnectionAzureApplianceDeallocationFailed",
  "CloudConnectionAzureApplianceConfigurationFailed")
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
