id: 7a981151-a648-4ff4-a827-fc98337a95ed
name: Acronis - Agents offline for 2 days or more
description: Query to find agents that have been offline for two days or longer.
query: |
    CommonSecurityLog
    | where DeviceVendor == "Acronis"
    | where DeviceEventClassID == "MiniPlanAgentOffline"
    | summarize DaysSeen = dcount(startofday(TimeGenerated)) by DeviceName
    | where DaysSeen >= 2
    | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
