id: aaf57371-02c0-4bf5-8c03-dfeb6536e397
name: Acronis - Protection Service Errors
description: Various errors related to Active Protection or CPS malfunctions.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in
  ("ProtectionServiceNotWorking",
  "ActiveProtectionDriverRemediated",
  "ActiveProtectionServiceNotRunning",
  "ActiveProtectionServiceNotAvailable",
  "ActiveProtectionServiceFailureToApplyPolicy",
  "ActiveProtectionServiceConflict",
  "ActiveProtectionInvalidNetworkRecoveryPath",
  "CPSProtectionFailureDetected")
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
