id: 29c1b194-50d1-418d-82a9-3db5e3dfc3bf
name: Acronis - Multiple Endpoints Accessing Malicious URLs
description: 'Multiple endpoints accessing malicious URLs could indicate an ongoing phishing attack, with several employees interacting with those URLs.'
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID == "MaliciousUrlDetected"
  | extend EventDate = startofday(TimeGenerated)
  | summarize MachineCount = dcount(DeviceExternalID) by EventDate
  | where MachineCount >= 3
requiredDataConnectors: []
tactics:
  - Execution
relevantTechniques:
  - T1204
entityMappings: []
version: 1.0.0
