id: 55b6da0d-08c1-4af0-af2d-c4d14a1f6c3c
name: "Acronis - Multiple Endpoints with 3 Incidents or More"
description: "A high number of endpoints with multiple incidents could indicate an ongoing attack."
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in ("EDRIncidentDetected", "EDRIOCDetected")
  | extend EventDate = startofday(TimeGenerated)
  | summarize IncidentCount = count() by DeviceExternalID, EventDate
  | where IncidentCount >= 3
  | summarize EndpointsWith3OrMore = dcount(DeviceExternalID) by EventDate
  | where EndpointsWith3OrMore >= 3
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings: []
version: 1.0.0
