id: cc3a2ea1-2dbb-4e5e-acb1-866b9bffb85c
name: Acronis - Multiple Endpoints Infected by Ransomware
description: Detects when three or more distinct endpoints report ransomware detections within a single day.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID == "ActiveProtectionBlocksSuspiciousActivity"
  | extend EventDate = startofday(TimeGenerated)
  | summarize MachineCount = dcount(DeviceExternalID) by EventDate
  | where MachineCount >= 3
requiredDataConnectors: []
tactics:
  - Impact
relevantTechniques:
  - T1486
entityMappings: []
version: 1.0.0
