id: 362666d6-5e4f-4f84-958b-6237e766eb6d
name: Acronis - Login from Abnormal IP - Low Occurrence
description: Suspicious login from an IP address observed up to two times.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis audit"
  | extend initiator_ip = tostring(parse_json(DeviceCustomString1).initiator_ip)
  | summarize LoginCount = count() by initiator_ip
  | where LoginCount <= 2
  | order by LoginCount asc
  | extend IP_0_Address = initiator_ip
requiredDataConnectors: []
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: initiator_ip
version: 1.0.0
