id: 1de4a0c7-4e72-45f3-b335-ab25f99ace3f
name: Acronis - Multiple Inboxes with Malicious Content Detected
description: Many inboxes containing malicious content could indicate a potential ongoing phishing attack.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in
  ("MaliciousURLDetectedInM365MailboxBackup",
  "MalwareDetectedInM365MailboxBackup",
  "MaliciousEmailDetectedPerceptionPointWarning")
  | extend EventDate = startofday(TimeGenerated)
  | summarize MachineCount = dcount(DeviceExternalID) by EventDate
  | where MachineCount >= 3
requiredDataConnectors: []
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
entityMappings: []
version: 1.0.0
