id: 55b6da0d-08c1-4af0-af2d-c4d14a1f6c3c
name: "Acronis - Endpoints with EDR Incidents"
description: "A high number of endpoints with multiple incidents could indicate an ongoing attack."
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID in ("EDRIncidentDetected", "EDRIOCDetected")
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
