id: cc3a2ea1-2dbb-4e5e-acb1-866b9bffb85c
name: Acronis - Endpoints Infected by Ransomware
description: Detected and blocked ransomware.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis"
  | where DeviceEventClassID == "ActiveProtectionBlocksSuspiciousActivity"
  | extend Host_0_HostName = DeviceName
requiredDataConnectors: []
tactics:
  - Impact
relevantTechniques:
  - T1486
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 1.0.0
