id: ce88b396-db24-44b6-babd-c431ee7a527f
name: Acronis - Audit Log
description: Records user and system operations in the management portal and Cyber Protect console, including scripting, quota, and email archiving events.
query: |
  CommonSecurityLog
  | where DeviceVendor == "Acronis audit"
  | extend EventDetails = parse_json(DeviceCustomString1)
  | extend initiator_ip = tostring(EventDetails.initiator_ip)
  | extend created_at = todatetime(EventDetails.created_at)
  | extend IP_0_Address = initiator_ip
requiredDataConnectors: []
tactics: []
relevantTechniques: []
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: initiator_ip
version: 1.0.0
