id: 1850a459-b009-43d0-a575-8284b737eef8
name: Malicious Use of MSBuild as LOLBin
description: |
  Prior to deploying Macaw ransomware in an organization, the adversary frequently uses MSBuild.exe as a LOLBin to communicate with the C2.
description-detailed: |
  Prior to deploying Macaw ransomware in an organization, the adversary frequently uses MSBuild.exe as a LOLBin to communicate with the C2. This query will return Events where the initiating process is wmiprvse.exe and the process command line contains "programdata" and the file name is msbuild.exe.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - CommandAndControl
query: |
  DeviceProcessEvents 
  | where InitiatingProcessFileName =~ "wmiprvse.exe" 
  | where FileName =~ "msbuild.exe" and ProcessCommandLine has "programdata"
version: 1.0.0
