{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/vimUserManagementAWSCloudTrail')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "User Management ASIM filtering parser for AWS Cloud Trail",
        "category": "ASIM",
        "FunctionAlias": "vimUserManagementAWSCloudTrail",
        "query": "let ParseIAMEvents = (T: (EventSource: string, EventName: string, RequestParameters: dynamic, ResponseElements: dynamic)) {\n  let IAMEventNameLookup = datatable(EventName: string, EventType: string)\n  [\n      \"AddUserToGroup\", \"UserAddedToGroup\",\n      \"AttachGroupPolicy\", \"GroupModified\",\n      \"AttachUserPolicy\", \"UserModified\",\n      \"ChangePassword\", \"PasswordChanged\",\n      \"CreateGroup\", \"GroupCreated\",\n      \"CreateLoginProfile\", \"UserModified\",\n      \"CreateUser\", \"UserCreated\",\n      \"DeleteGroup\", \"GroupDeleted\",\n      \"DeleteGroupPolicy\", \"GroupModified\",\n      \"DeleteLoginProfile\", \"UserModified\",\n      \"DeleteRole\", \"UserDeleted\",\n      \"DeleteUser\", \"UserDeleted\",\n      \"DeleteUserPolicy\", \"UserModified\",\n      \"DetachGroupPolicy\", \"GroupModified\",\n      \"DetachRolePolicy\", \"UserModified\",\n      \"DetachUserPolicy\", \"UserModified\",\n      \"EnableMFADevice\", \"UserModified\",\n      \"GetGroup\", \"GroupRead\",\n      \"GetGroupPolicy\", \"GroupRead\",\n      \"GetLoginProfile\", \"UserRead\",\n      \"GetMFADevice\", \"UserRead\",\n      \"GetRole\", \"UserRead\",\n      \"GetUser\", \"UserRead\",\n      \"ListAttachedGroupPolicies\", \"GroupRead\",\n      \"ListAttachedRolePolicies\", \"UserRead\",\n      \"ListAttachedUserPolicies\", \"UserRead\",\n      \"ListGroups\", \"GroupEnumerated\",\n      \"ListGroupsForUser\", \"UserRead\",\n      \"ListMFADevices\", \"UserRead\",\n      \"ListRoles\", \"UserRead\",\n      \"ListUsers\", \"UserRead\",\n      \"PutGroupPolicy\", \"GroupModified\",\n      \"PutRolePolicy\", \"UserModified\",\n      \"PutUserPolicy\", \"UserModified\",\n      \"RemoveUserFromGroup\", \"UserRemovedFromGroup\",\n      \"TagRole\", \"UserModified\",\n      \"TagUser\", \"UserModified\",\n      \"UntagUser\", \"UserModified\",\n      \"UntagUser\", \"UserModified\",\n      \"UpdateGroup\", \"GroupModified\",\n      \"UpdateLoginProfile\", \"PasswordChanged\",\n      \"UpdateRole\", \"UserModified\",\n      \"UpdateRoleDescription\", \"UserModified\",\n      \"UpdateSigningCertificate\", \"PasswordChanged\",\n      \"UpdateSSHPublicKey\", \"PasswordChanged\",\n      \"UpdateUser\", \"UserModified\",\n      \"UploadSigningCertificate\", \"UserModified\",\n      \"UploadSSHPublicKey\", \"UserModified\"\n  ];\n  T\n  | where EventSource == \"iam.amazonaws.com\"\n  | lookup IAMEventNameLookup on EventName\n  | extend EventType = coalesce(EventType, \"Other\")\n  // Filter on EventType\n  | where (array_length(eventtype_in) == 0 or EventType in~ (eventtype_in))\n  | extend\n      TargetUserId = coalesce(tostring(ResponseElements.user.userId), tostring(ResponseElements.role.roleId)),\n      TargetUsername = coalesce(tostring(RequestParameters.userName), tostring(RequestParameters.roleName)),\n      GroupId = tostring(ResponseElements.group.groupName),\n      GroupName = tostring(RequestParameters.groupName)\n  | extend    \n      TargetUserIdType = case(\n          TargetUserId startswith \"AROA\", \"AWSIAMRoleId\",\n          TargetUserId startswith \"AIDA\", \"AWSIAMUserId\",\n          \"\"\n      ),\n      GroupOriginalType = iff(isempty(GroupName), \"\", \"IAM Group\")\n  | extend AdditionalData = iff(pack, bag_pack(\n      \"TargetUserARN\", coalesce(tostring(ResponseElements.user.arn), tostring(ResponseElements.role.arn)),\n      \"GroupARN\", tostring(ResponseElements.group.arn)\n  ), dynamic([]))\n  };\n  let ParseCognitoEvents = (T: (EventSource: string, EventName: string, RequestParameters: dynamic)) {\n      let CognitoIDPEventNameLookup = datatable(EventName: string, EventType: string)\n      [\n          \"AddCustomAttributes\", \"GroupModified\",\n          \"AdminAddUserToGroup\", \"UserAddedToGroup\",\n          \"AdminConfirmSignUp\", \"UserEnabled\",\n          \"AdminCreateUser\", \"UserCreated\",\n          \"AdminDeleteUser\", \"UserDeleted\",\n          \"AdminDeleteUserAttributes\", \"UserModified\",\n          \"AdminDisableProviderForUser\", \"UserDisabled\",\n          \"AdminDisableUser\", \"UserDisabled\",\n          \"AdminEnableUser\", \"UserEnabled\",\n          \"AdminForgetDevice\", \"UserModified\",\n          \"AdminGetDevice\", \"UserRead\",\n          \"AdminGetUser\", \"UserRead\",\n          \"AdminLinkUserAuthEvents\", \"UserModified\",\n          \"AdminListDevices\", \"UserRead\",\n          \"AdminListGroupsForUser\", \"UserRead\",\n          \"AdminListUserAuthEvents\", \"UserRead\",\n          \"AdminRemoveUserFromGroup\", \"UserRemovedFromGroup\",\n          \"AdminResetUserPassword\", \"PasswordReset\",\n          \"AdminSetUserMFAPreference\", \"UserModified\",\n          \"AdminSetUserPassword\", \"PasswordChanged\",\n          \"AdminSetUserSettings\", \"UserModified\",\n          \"AdminUpdateDeviceStatus\", \"UserModified\",\n          \"AdminUpdateUserAttributes\", \"UserModified\",\n          \"ChangePassword\", \"PasswordChanged\",\n          \"CompleteWebAuthnRegistration\", \"UserModified\",\n          \"ConfirmSignUp\", \"UserCreated\",\n          \"CreateGroup\", \"GroupCreated\",\n          \"CreateUserPool\", \"GroupCreated\",\n          \"DeleteGroup\", \"GroupDeleted\",\n          \"DeleteUser\", \"UserDeleted\",\n          \"DeleteUserAttributes\", \"UserModified\",\n          \"DeleteUserPool\", \"GroupDeleted\",\n          \"DeleteWebAuthnCredential\", \"UserModified\",\n          \"DescribeUserPool\", \"GroupRead\",\n          \"GetGroup\", \"GroupRead\",\n          \"GetUser\", \"UserRead\",\n          \"GetUserPoolMfaConfig\", \"GroupRead\",\n          \"ListGroups\", \"GroupRead\",\n          \"ListIdentityProviders\", \"GroupRead\",\n          \"ListResourceServers\", \"GroupRead\",\n          \"ListTerms\", \"GroupRead\",\n          \"ListUserPools\", \"GroupEnumerated\",\n          \"ListUsers\", \"GroupEnumerated\",\n          \"ListUsersInGroup\", \"GroupEnumerated\",\n          \"SetUserPoolMfaConfig\", \"GroupModified\",\n          \"SignUp\", \"UserCreated\",\n          \"UpdateGroup\", \"GroupModified\",\n          \"UpdateUserAttributes\", \"UserModified\",\n          \"UpdateUserPool\", \"GroupModified\"\n      ];\n      T\n      | where EventSource == \"cognito-idp.amazonaws.com\"\n      | lookup CognitoIDPEventNameLookup on EventName\n      | extend EventType = coalesce(EventType, \"Other\")\n      // Filter on EventType\n      | where (array_length(eventtype_in) == 0 or EventType in~ (eventtype_in))\n      | extend\n          TargetUsername = tostring(RequestParameters.username),\n          GroupName = coalesce(tostring(RequestParameters.poolName), tostring(RequestParameters.groupName)),\n          GroupId = tostring(RequestParameters.userPoolId)\n      | extend GroupOriginalType = case(\n          isnotempty(tostring(RequestParameters.groupName)), \"UserPool Group\",\n          isnotempty(GroupId), \"UserPool\",\n          \"\")\n      | extend AdditionalData = iff(pack, bag_pack(\n          \"UserPoolId\", tostring(RequestParameters.UserPoolId)\n      ), dynamic([]))\n  };\n  let parser = (\n      starttime:datetime = datetime(null),\n      endtime:datetime = datetime(null), srcipaddr_has_any_prefix:dynamic  = dynamic([]),\n      targetusername_has_any:dynamic = dynamic([]),\n      actorusername_has_any:dynamic = dynamic([]),\n      eventtype_in:dynamic = dynamic([]),\n      disabled:bool= false,\n      pack: bool= false\n  ) {\n  let SupportedEventSources = dynamic([\n      \"cognito-idp.amazonaws.com\",\n      \"iam.amazonaws.com\"\n  ]);\n  let EventSourceNameLookup = datatable(EventSource: string, TargetUserScope: string)\n  [\n      \"cognito-idp.amazonaws.com\", \"Cognito User Pools\",\n      \"iam.amazonaws.com\", \"IAM\"\n  ];\n  let SupportedEvents = AWSCloudTrail\n      | where not(disabled)\n      | where EventSource in (SupportedEventSources)\n      | where (isnull(starttime) or TimeGenerated >= starttime)\n          and (isnull(endtime) or TimeGenerated <= endtime)\n      | where (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(SourceIpAddress, srcipaddr_has_any_prefix))\n          and (array_length(actorusername_has_any) == 0 or UserIdentityUserName has_any (actorusername_has_any))\n      // Filter on EventType done later in parser\n      | where (array_length(targetusername_has_any) == 0 or RequestParameters has_any (targetusername_has_any))\n      | extend RequestParameters = todynamic(RequestParameters), ResponseElements = todynamic(ResponseElements);\n  union isfuzzy=false\n  ParseIAMEvents(SupportedEvents),\n  ParseCognitoEvents(SupportedEvents)\n  | extend\n      Type = \"AWSCloudTrail\",\n      EventCount = int(1),\n      EventStartTime = TimeGenerated,\n      EventEndTime = TimeGenerated,\n      EventSeverity = \"Informational\",\n      EventSchema = \"UserManagement\",\n      EventSchemaVersion = \"0.1.2\",\n      EventVendor = \"AWS\",\n      EventProduct = \"CloudTrail\",\n      Dvc = \"CloudTrail\",\n      EventResult = iff(isempty(ErrorCode) and isempty(ErrorMessage), \"Success\", \"Failure\"),\n      EventMessage = ErrorMessage\n  | lookup EventSourceNameLookup on EventSource\n  | project-rename\n      EventOriginalSubType = EventTypeName,\n      EventOriginalType = EventName,\n      EventUid = AwsEventId,\n      EventOriginalResultDetails = ErrorMessage,\n      EventProductVersion = EventVersion\n  | project-rename\n      ActorUserId = UserIdentityAccountId,\n      ActorUsername = UserIdentityUserName,\n      ActorOriginalUserType = UserIdentityType,\n      HttpUserAgent = UserAgent\n  | extend\n      ActorUserIdType = iff(isempty(ActorUserId), \"\", \"AWSId\"),\n      ActorUsernameType = iff(isempty(ActorUsername), \"\", \"Simple\"),\n      SrcIpAddr = iff(ipv4_is_in_range(SourceIpAddress, \"0.0.0.0/0\"), SourceIpAddress, \"\")\n  | extend\n      TargetUsernameType = iff(isempty(TargetUsername), \"\", \"Simple\"),\n      GroupIdType = iff(isempty(GroupId), \"\", \"Simple\"),\n      GroupNameType = iff(isempty(GroupName), \"\", \"Simple\")\n  | extend AdditionalFields = iff(pack, bag_pack(\n      \"ActorAccessKeyId\", UserIdentityAccessKeyId,\n      \"AWSRegion\", AWSRegion,\n      \"APIVersion\", APIVersion,\n      \"ManagementEvent\", ManagementEvent,\n      \"ReadOnly\", ReadOnly,\n      \"RequestParameters\", RequestParameters,\n      \"ResponseElements\", ResponseElements\n  ), dynamic([]))\n  | extend AdditionalFields = iff(pack, bag_merge(AdditionalFields, AdditionalData), dynamic([]))\n  // Alias\n  | extend\n      User = ActorUsername,\n      IpAddr = SrcIpAddr\n  | project\n      TimeGenerated,\n      Type,\n      EventCount,\n      EventStartTime,\n      EventEndTime,\n      EventSeverity,\n      EventSchema,\n      EventSchemaVersion,\n      EventVendor,\n      EventProduct,\n      TargetUserScope,\n      Dvc,\n      EventResult,\n      EventMessage,\n      EventType,\n      EventOriginalSubType,\n      EventOriginalType,\n      EventUid,\n      EventOriginalResultDetails,\n      EventProductVersion,\n      ActorUserId,\n      ActorUsername,\n      ActorOriginalUserType,\n      HttpUserAgent,\n      ActorUserIdType,\n      ActorUsernameType,\n      SrcIpAddr,\n      TargetUserId,\n      TargetUsername,\n      TargetUserIdType,\n      GroupId,\n      GroupName,\n      TargetUsernameType,\n      GroupIdType,\n      GroupNameType,\n      GroupOriginalType,\n      User,\n      IpAddr,\n      AdditionalFields\n};\nparser (\n  starttime                = starttime,\n  endtime                  = endtime,\n  srcipaddr_has_any_prefix = srcipaddr_has_any_prefix,\n  targetusername_has_any   = targetusername_has_any,\n  actorusername_has_any    = actorusername_has_any,\n  eventtype_in             = eventtype_in,\n  disabled                 = disabled,\n  pack                     = pack\n)\n",
        "version": 1,
        "functionParameters": "starttime:datetime=datetime(null),endtime:datetime=datetime(null),srcipaddr_has_any_prefix:dynamic=dynamic([]),actorusername_has_any:dynamic=dynamic([]),targetusername_has_any:dynamic=dynamic([]),eventtype_in:dynamic=dynamic([]),disabled:bool=False,pack:bool=False"
      }
    }
  ]
}