id: 1f5bcabf-ecb1-4d9e-b0ef-f3e83df8963b
name: Device Count by DNS Suffix
description: |-
  This query will count the number of devices in Defender ATP based
  on their DNS suffix.  For a full list of devices with the DNS
  suffix, comment out or remove the last line.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceInfo
query: |-
  DeviceInfo
  | where isnotempty(OSPlatform)
  | summarize arg_max(Timestamp, DeviceName) by DeviceId
  | extend DeviceMachineName = split(DeviceName, '.')[0]
  | extend DeviceDomain = substring(DeviceName, strlen(DeviceMachineName) + 1, strlen(DeviceName) - strlen(DeviceMachineName) - 1)
  | summarize count() by DeviceDomain
