id: 64c0f54f-9a8d-4630-95c8-aa2751e5da0c
name: Endpoint Agent Health Status Report
description: |
  This query will provide a report of many of the best practice configurations for Defender ATP deployment. Special Thanks to Gilad Mittelman for the initial inspiration and concept.
  Any tests which are reporting "BAD" as a result imply that the associated capability is not configured per best practice recommendation.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmSecureConfigurationAssessment
tactics:
- Misconfiguration
query: |
  DeviceTvmSecureConfigurationAssessment
  | where ConfigurationId in ('scid-91', 'scid-2000', 'scid-2001', 'scid-2002', 'scid-2003', 'scid-2010', 'scid-2011', 'scid-2012', 'scid-2013', 'scid-2014', 'scid-2016')
  | extend Test = case(
      ConfigurationId == "scid-2000", "SensorEnabled",
      ConfigurationId == "scid-2001", "SensorDataCollection",
      ConfigurationId == "scid-2002", "ImpairedCommunications",
      ConfigurationId == "scid-2003", "TamperProtection",
      ConfigurationId == "scid-2010", "AntivirusEnabled",
      ConfigurationId == "scid-2011", "AntivirusSignatureVersion",
      ConfigurationId == "scid-2012", "RealtimeProtection",
      ConfigurationId == "scid-91", "BehaviorMonitoring",
      ConfigurationId == "scid-2013", "PUAProtection",
      ConfigurationId == "scid-2014", "AntivirusReporting",
      ConfigurationId == "scid-2016", "CloudProtection",
      "N/A"),
      Result = case(IsApplicable == 0, "N/A", IsCompliant == 1, "GOOD", "BAD")
  | extend packed = pack(Test, Result)
  | summarize Tests = make_bag(packed), DeviceName = any(DeviceName) by DeviceId
  | evaluate bag_unpack(Tests)
