id: 255b7323-409d-4b83-a215-34eb11b7c162
name: Endpoint Linux AV Signature and Platform Versions
description: |
  This query will identify the Microsoft Defender Antivirus Engine version and Microsoft Defender Antivirus Security Intelligence version for Linux Servers.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmSecureConfigurationAssessment
tactics: []
relevantTechniques: []
query: |
 DeviceTvmSecureConfigurationAssessment
| where ConfigurationId == "scid-6095" and isnotnull(Context)
| where OSPlatform =="Linux"
| extend avdata=parsejson(Context)
| extend AVSigVersion = tostring(avdata[0][0])
| extend AVEngineVersion = tostring(avdata[0][1])
| extend AVSigLastUpdateTime = tostring(avdata[0][2])
| extend AVProductVersion = tostring(avdata[0][3])
| project DeviceId, DeviceName, OSPlatform, AVSigVersion, AVEngineVersion, AVSigLastUpdateTime, AVProductVersion, IsCompliant, IsApplicable
entityMappings:
  - entityType: IoT device
    fieldMappings:
      - identifier: DeviceId
        columnName: DeviceId
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: DeviceName        
  
