id: 5e19506f-df44-420b-a21b-a259d5e6262f
name: Failed Logon Attempt (0)
description: |-
  Sample query to detect If there are more then 3 failed logon authentications on high value assets.
  Update DeviceName to reflect your high value assets.
  For questions @MiladMSFT on Twitter or milad.aslaner@microsoft.com.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceLogonEvents
query: |-
  DeviceLogonEvents
  | where DeviceName in ("DeviceName1","DeviceName2")
  | where ActionType == "LogonFailed"
  | summarize LogonFailures=count() by DeviceName, LogonType, InitiatingProcessCommandLine
  | where LogonFailures > 3
  | project LogonFailures, DeviceName, LogonType, InitiatingProcessCommandLine
  | sort by LogonFailures desc
