id: 659e686d-850e-4240-a339-b24928f95e90
name: insider-threat-detection-queries (15)
description: |
  Intent:
  - Use MTP capability to look for insider threat potential risk indicators
  - Indicators would then serve as the building block for insider threat risk modeling in subsequent tools
  Definition of Insider Threat:
  "The potential for an individual who has or had authorized access to an organization's assets to use their access, either maliciously or unintentionally, to act in a way that could negatively affect the organization."
  This collection of queries describes the different indicators that could be used to model and look for patterns suggesting an increased risk of an individual becoming a potential insider threat.
  Note: no single indicator should be used as a lone determinant of insider threat activity, but should be part of an overall program to understand the increased risk to your organization's critical assets. This in turn is used to feed an investigation by a formal insider threat program to look at the context associated with the whole person to understand the implication of a set of indicators.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceLogonEvents
tactics:
- Initial access
- Persistence
- Exfiltration
query: |
  // --------------------------------------------------------------------------------------------------------------------------- //
  //
  //After-Hours Login
  //
  //Change the StartTime and EndTime to reflect typical working hours
  //This query needs some adjustments, as the default for a datetime object with no date is to only query "today"
  let StartTime = datetime("8:00:00 AM");
  let EndTime = datetime("5:00:00 PM");
  DeviceLogonEvents
  | where InitiatingProcessAccountName != "system"
  | where Timestamp between ((EndTime) .. StartTime)
