id: 59b614a6-20df-472d-b12a-1eee405effe6
name: Network footprint (3)
description: |-
  Query 1 shows you any network communication happened from endpoints to a specific Remote IP or Remote URL.
  Ensure to update RemoteIP and RemoteURL variable.
  For questions @MiladMSFT on Twitter or milad.aslaner@microsoft.com by email.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceFileEvents
query: |-
  // Query 4 Search for specific network communication of a Remote IP or URL that also discovers related file creation events
  // Ensure to update RemoteIP and RemoteURL variable.
  DeviceFileEvents
  | where FileOriginUrl == "IP ADDRESS GOES HERE" or FileOriginUrl contains "URL GOES HERE" or FileOriginReferrerUrl contains "URL GOES HERE"
  | project DeviceName, Timestamp, FileName, FileOriginUrl, FileOriginIP, FileOriginReferrerUrl, SHA1
