id: cc8c4944-fa1b-4451-bfda-8d53a2821bf4
name: Network footprint (0)
description: |-
  Query 1 shows you any network communication happened from endpoints to a specific Remote IP or Remote URL.
  Ensure to update RemoteIP and RemoteURL variable.
  For questions @MiladMSFT on Twitter or milad.aslaner@microsoft.com by email.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceNetworkEvents
query: |-
  DeviceNetworkEvents
  | where RemoteIP == "IP ADDRESS GOES HERE"
  or RemoteUrl endswith "DNS ENTRY GOES HERE"
  | project Timestamp, DeviceName, ActionType, RemoteIP, RemoteUrl, InitiatingProcessFileName, InitiatingProcessCommandLine
