id: 738fd309-566a-49f7-b7ff-178f285201d6
name: Services (0)
description: |-
  Gets the service name from the registry key.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceRegistryEvents
query: "DeviceRegistryEvents  \r\n| where RegistryKey has @\"SYSTEM\\CurrentControlSet\\Services\"\r\n| extend ServiceName=tostring(split(RegistryKey, @\"\\\")[4])\r\n| project Timestamp, DeviceName, ServiceName, ActionType, InitiatingProcessAccountName, InitiatingProcessFileName, InitiatingProcessFolderPath, InitiatingProcessCommandLine, InitiatingProcessMD5, InitiatingProcessParentFileName\r\n| top 100 by Timestamp desc "
