id: c69cb86a-1d61-4249-881a-bf9e94dcfa12
name: System Guard Security Level Baseline (0)
description: |-
  Establishes a baseline SystemGuardSecurityLevel and show the devices that are below that baseline.
  See https://techcommunity.microsoft.com/t5/Microsoft-Defender-ATP/How-insights-from-system-attestation-and-advanced-hunting-can/ba-p/969252 for full details on this query.
  And Device Boot Attestation Info and feel free to ping @DepletionMode or @flyingbluemonki on twitter.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceEvents
query: |-
  let TargetSecurityLevel = 700;
  DeviceEvents
  | where Timestamp >= ago(7d)
  | where ActionType == "DeviceBootAttestationInfo"
  | extend AdditionalFieldData = parse_json(AdditionalFields)
  | project DeviceName, ReportTime = todatetime(AdditionalFieldData.ReportValidityStartTime), CurrentSecurityLevel = toint(AdditionalFieldData.SystemGuardSecurityLevel), AdditionalFieldData.ReportValidityStartTime
  | where CurrentSecurityLevel < TargetSecurityLevel
  | summarize arg_max(ReportTime, CurrentSecurityLevel) by DeviceName
