id: 7f7a796d-1511-4930-b9da-5971db4352ec
name: Web Content Filtering Events
description: |
  This query identifies web content filtering events in Advanced Hunting.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceEvents
query: |
  DeviceEvents
  | where ActionType in ("ExploitGuardNetworkProtectionAudited", "ExploitGuardNetworkProtectionBlocked") or ActionType startswith_cs "SmartScreenUrl"
  | extend AdditionalFields = todynamic(AdditionalFields)
  | where AdditionalFields.Experience == 'CustomPolicy' or AdditionalFields.ResponseCategory == 'CustomBlockList'
  | project-reorder Timestamp, DeviceName, RemoteUrl
