id: b7186f3c-3c99-4410-b382-fa92834ae35b
name: wifikeys (0)
description: |-
  List commands the exposed WIFI Keys.
  @mattiasborg82.
  Blog.sec-labs.com.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where ProcessCommandLine startswith "netsh.exe"
  | where ProcessCommandLine has "key=clear"
  | project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine
  | top 100 by Timestamp
