id: 1da9853f-3dea-4ea9-b7e5-26730da3d537
name: Port Scan Detected
description: |
  'This alert creates an incident when a source IP addresses attempt to communicate with a large amount of distinct ports within a short period.'
alertDetailsOverride:
  alertDisplayNameFormat: Potential port scan from {{SrcIpAddr}}  {{DstPortNumber}}
  alertDescriptionFormat: Potential port scan performed from address {{SrcIpAddr}} over {{AttemptedPortsCount}} within 5min. 

severity: Medium
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Discovery
relevantTechniques:
  - T1046
tags:
  - ParentAlert: https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SophosXGFirewall/PortScanDetected.yaml
    version: 1.0.0
  - Schema: ASimNetworkSessions
    SchemaVersion: 0.2.1
query: |
  let port_scan_threshold = 50;
  _Im_NetworkSession
  | where ipv4_is_private(SrcIpAddr) == False
  | summarize AttemptedPortsCount=dcount(DstPortNumber) by SrcIpAddr, bin(TimeGenerated, 5m)
  | where AttemptedPortsCount > PortScanThreshold

entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr

customDetails:
  AttemptedPortsCount: AttemptedPortsCount

version: 1.0.0
kind: Scheduled