id: f9df500a-e2a4-4104-a517-dc1d85bb654f
name: Insecure Programmable Logic Controller (Microsoft Defender for IoT)
description: |
  'The new mode may indicate that the PLC is not secure. Leaving the PLC in an insecure operating mode may allow adversaries to perform malicious activities on it, such as a program download. If the PLC is compromised, devices and processes that interact with it may be impacted. This may affect overall system security and safety.'
severity: Medium
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 6h
queryPeriod: 6h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
relevantTechniques:
  - T858
query: |
  SecurityAlert
  | where ProductName == "Azure Security Center for IoT"
  | where AlertName contains "PLC Operating Mode Changed"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend IPAddress = tostring(parse_json(tostring(parse_json(Entities)[0].IpAddress)).Address)
  | extend Protocol = tostring(parse_json(tostring(parse_json(Entities)[0].Protocols))[0])
  | extend DeviceType = tostring(parse_json(Entities)[0].DeviceName)
  | extend IoTSecurityAgentId = tostring(parse_json(Entities)[0].IoTSecurityAgentId)
  | extend Vendor = tostring(parse_json(Entities)[0].Vendor)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | project AlertName, ResourceId, DeviceId, IPAddress, Protocol, DeviceType, Vendor, IoTSecurityAgentId, Tactics, TimeGenerated, RemediationSteps
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled