id: 70be4a31-9d2b-433b-bdc7-da8928988069
name: Illegal Function Codes (Microsoft Defender for IoT)
description: |
  'This alert leverages Microsoft Defender for IoT to detect Illegal function codes in SCADA equipment indicating improper application configuration or malicious activity such using illegal values within a protocol to exploit a PLC vulnerability.'
severity: Medium
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 6h
queryPeriod: 6h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
query: |
  SecurityAlert
  | where AlertName == "Function Code Not Supported by Outstation"
  or AlertName == "Illegal BACNet message"
  or AlertName == "Illegal Connection Attempt on Port 0"
  or AlertName == "Illegal DNP3 Operation"
  or AlertName == "Illegal MODBUS Operation (Exception Raised by Master)"
  or AlertName == "Illegal MODBUS Operation (Function Code Zero)"
  or AlertName == "Incorrect Parameter Sent to Outstation"
  or AlertName == "Initiation of an Obsolete Function Code (Initialize Data)"
  or AlertName == "Initiation of an Obsolete Function Code (Save Config)"
  or AlertName == "Modbus Exception"
  or AlertName == "Unknown Object Sent to Outstation"
  or AlertName == "Usage of a Reserved Function Code"
  or AlertName == "Usage of Improper Formatting by Outstation"
  or AlertName == "Usage of Reserved Status Flags (IIN)"
  or AlertName == "Unauthorized communication was detected by a User Defined Protocol Rule"
  or AlertName == "Unauthorized Operation was detected by a User Defined whitelist Alert"
  or AlertName == "Illegal Protocol Version"
  or AlertName contains "Slave Device Received"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend IPAddress = tostring(parse_json(tostring(parse_json(Entities)[0].IpAddress)).Address)
  | extend Protocol = tostring(parse_json(tostring(parse_json(Entities)[0].Protocols))[0])
  | extend DeviceType = tostring(parse_json(Entities)[0].DeviceName)
  | extend IoTSecurityAgentId = tostring(parse_json(Entities)[0].IoTSecurityAgentId)
  | extend Vendor = tostring(parse_json(Entities)[0].Vendor)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | project AlertName, ResourceId, DeviceId, IPAddress, Protocol, DeviceType, Vendor, IoTSecurityAgentId, Tactics, TimeGenerated, RemediationSteps
  | extend IPCustomEntity = IPAddress
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled