id: 9ff3b13b-287a-4ed0-8f6b-7e7b66cbbcbd
name: Internet Access (Microsoft Defender for IoT)
description: |
  'This alert leverages Defender for IoT to detect an OT device communicating with Internet which is possibly an indication of improper configuration of an application or malicious activity on the network.'
severity: High
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T0883
query: |
  SecurityAlert
  | where ProductName == "Azure Security Center for IoT"
  | where AlertName contains "Internet"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)
  | extend DestDeviceAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)
  | project
    TimeGenerated,
    DeviceId,
    ProductName,
    ProductComponentName,
    AlertSeverity,
    AlertName,
    Description,
    Protocol,
    SourceDeviceAddress,
    DestDeviceAddress,
    RemediationSteps,
    Tactics,
    AlertLink
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceDeviceAddress
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DestDeviceAddress
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  Sensor: DeviceId
  Protocol: Protocol
alertDetailsOverride:
  alertDisplayNameFormat: (MDIoT) {{AlertName}}
  alertDescriptionFormat: (MDIoT) {{Description}}
  alertTacticsColumnName: Tactics
  alertSeverityColumnName: AlertSeverity
version: 1.0.0
kind: Scheduled
