id: f9df500a-e2a4-4104-a517-dc1d85bb654f
name: PLC unsecure key state (Defender for IoT)
description: |
  'This alert leverages Defender for IoT to detect PLC operating mode changes indicating the PLC is potentially insecure. If the PLC is compromised, devices that interact with it may be impacted. This may affect overall system security and safety.'
severity: Medium
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
query: |
  SecurityAlert
  | where ProductName == "Azure Security Center for IoT"
  | where AlertName contains "PLC Operating Mode Changed"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)
  | extend DestDevcieAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)
  | project
    TimeGenerated,
    DeviceId,
    ProductComponentName,
    AlertSeverity,
    AlertName,
    Description,
    Protocol,
    SourceDeviceAddress,
    DestDevcieAddress,
    RemediationSteps,
    Tactics,
    AlertLink
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceDeviceAddress
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DestDevcieAddress
eventGroupingSettings:
  aggregationKind: SingleAlert
customDetails:
  Sensor: DeviceId
  Protocol: Protocol
  RemidationSteps: RemidationSteps
alertDetailsOverride:
  alertDisplayNameFormat: (Defender for IoT) {{AlertName}}
  alertDescriptionFormat: (Defender for IoT) {{Description}}
  alertTacticsColumnName: Tactics
  alertSeverityColumnName: AlertSeverity
version: 1.0.0
kind: Scheduled
