id: 70be4a31-9d2b-433b-bdc7-da8928988069
name: Illegal Function Codes for ICS traffic (Microsoft Defender for IoT)
description: |
  'This alert leverages Defender for IoT to detect Illegal function codes in SCADA equipment indicating improper application configuration or malicious activity such using illegal values within a protocol to exploit a PLC vulnerability.'
severity: Medium
status: Available
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
query: |
  SecurityAlert
  | where ProductName == "Azure Security Center for IoT"
  | where AlertName == "Function Code Not Supported by Outstation"
  or AlertName == "Illegal BACNet message"
  or AlertName == "Illegal Connection Attempt on Port 0"
  or AlertName == "Illegal DNP3 Operation"
  or AlertName == "Illegal MODBUS Operation (Exception Raised by Master)"
  or AlertName == "Illegal MODBUS Operation (Function Code Zero)"
  or AlertName == "Incorrect Parameter Sent to Outstation"
  or AlertName == "Initiation of an Obsolete Function Code (Initialize Data)"
  or AlertName == "Initiation of an Obsolete Function Code (Save Config)"
  or AlertName == "Modbus Exception"
  or AlertName == "Unknown Object Sent to Outstation"
  or AlertName == "Usage of a Reserved Function Code"
  or AlertName == "Usage of Improper Formatting by Outstation"
  or AlertName == "Usage of Reserved Status Flags (IIN)"
  or AlertName == "Unauthorized communication was detected by a User Defined Protocol Rule"
  or AlertName == "Unauthorized Operation was detected by a User Defined whitelist Alert"
  or AlertName == "Illegal Protocol Version"
  or AlertName contains "Slave Device Received Illegal"
  | where TimeGenerated <= ProcessingEndTime + 60m
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)
  | extend DestDeviceAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)
  | extend AlertManagementUri = tostring(parse_json(ExtendedProperties).AlertManagementUri)
  | project
    TimeGenerated,
    DeviceId,
    ProductName,
    ProductComponentName,
    AlertSeverity,
    AlertName,
    Description,
    Protocol,
    SourceDeviceAddress,
    DestDeviceAddress,
    RemediationSteps,
    Tactics,
    Entities,
    VendorOriginalId,
    AlertLink,
    AlertManagementUri
entityMappings:
sentinelEntitiesMappings:
  - columnName: Entities
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  Sensor: DeviceId
  Protocol: Protocol
  AlertLink: AlertLink
  VendorOriginalId: VendorOriginalId
  AlertManagementUri: AlertManagementUri
alertDetailsOverride:
  alertDisplayNameFormat: (MDIoT) {{AlertName}}
  alertDescriptionFormat: (MDIoT) {{Description}}
  alertTacticsColumnName: Tactics
  alertSeverityColumnName: AlertSeverity
version: 1.0.0
kind: Scheduled
