id: c2fb27c7-5f67-49c4-aaf3-d82934234a69
name: Unauthorized Programmable Logic Controller Modifications (Microsoft Defender for IoT)
description: |
  'Unauthorized changes to PLC ladder logic code can be either an indication of new functionality in the PLC, improper configuration of an application (e.g., due to a firmware update or reinstallation), or malicious activity on the network; a cyber threat that attempts to manipulate PLC programming to compromise PLC function.'
severity: Medium
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 6h
queryPeriod: 6h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T0839
query: |
  SecurityAlert
  | where AlertName contains "Unpermitted" or AlertName contains "unauthorized" or AlertName contains "type settings" or AlertName contains "New Activity Detected" 
  | where AlertName <> "Unauthorized Internet Connectivity Detected"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend IPAddress = tostring(parse_json(tostring(parse_json(Entities)[0].IpAddress)).Address)
  | extend Protocol = tostring(parse_json(tostring(parse_json(Entities)[0].Protocols))[0])
  | extend DeviceType = tostring(parse_json(Entities)[0].DeviceName)
  | extend IoTSecurityAgentId = tostring(parse_json(Entities)[0].IoTSecurityAgentId)
  | extend Vendor = tostring(parse_json(Entities)[0].Vendor)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | project AlertName, ResourceId, DeviceId, IPAddress, Protocol, DeviceType, Vendor, IoTSecurityAgentId, Tactics, TimeGenerated, RemediationSteps
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled