id: c2fb27c7-5f67-49c4-aaf3-d82934234a69
name: Unauthorized PLC changes (Microsoft Defender for IoT)
description: |
  'This alert leverages Defender for IoT to detect unauthorized changes to PLC ladder logic code indicating new functionality in the PLC, improper configuration of an application, or malicious activity on the network.'
severity: Medium
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T0839
query: |
  SecurityAlert
  | where AlertName == "Unpermitted Usage of Internal Indication (IIN)"
  or where AlertName == "Modbus Address Range Violation"
  or where AlertName == "Function Code Raised Unauthorized Exception"
  or where AlertName == "Unauthorized Access to Siemens S7 Data Block"
  or where AlertName == "Unauthorized Access to Wonderware Tag"
  or where AlertName == "Unauthorized MMS Program Access"
  or where AlertName == "GOOSE Message Type Settings"
  or where AlertName == "Sampled Values Message Type Settings"
  or where AlertName == "Foxboro I/A Unauthorized Operation"
  or where AlertName == "New Activity Detected - CIP Class"
  or where AlertName == "New Activity Detected - CIP Class Service"
  or where AlertName == "New Activity Detected - CIP PCCC Command"
  or where AlertName == "New Activity Detected - CIP Symbol"
  or where AlertName == "New Activity Detected - EtherNet/IP I/O Connection"
  or where AlertName == "New Activity Detected - EtherNet/IP Protocol Command"
  or where AlertName == "New Activity Detected - GSM Message Code"
  or where AlertName == "New Activity Detected - LonTalk Command Codes"
  or where AlertName == "New Activity Detected - LonTalk Network Variable"
  or where AlertName == "New Activity Detected - Ovation Data Request"
  or where AlertName == "New Activity Detected - Read/Write Command (AMS Index Group)"
  or where AlertName == "New Activity Detected - Read/Write Command (AMS Index Offset)"
  or where AlertName == "New Activity Detected - Unauthorized DeltaV Message Type"
  or where AlertName == "New Activity Detected - Unauthorized DeltaV ROC Operation"
  or where AlertName == "New Activity Detected - Using AMS Protocol Command"
  or where AlertName == "New Activity Detected - Using Siemens SICAM Command"
  or where AlertName == "New Activity Detected - Using Suitelink Protocol command"
  or where AlertName == "New Activity Detected - Using Suitelink Protocol sessions"
  or where AlertName == "New Activity Detected - Using Yokogawa VNetIP Command"
  or where AlertName == "Omron FINS Unauthorized Command"
  or where AlertName == "Toshiba Computer Link Unauthorized Command"
  or where AlertName == "Unauthorized ABB Totalflow File Operation"
  or where AlertName == "Unauthorized ABB Totalflow Register Operation"
  or where AlertName == "Unauthorized Access to Siemens S7 Plus Object"
  or where AlertName == "Unauthorized BACNet Object Access"
  or where AlertName == "Unauthorized BACNet Route"
  or where AlertName == "Unauthorized Emerson ROC Operation"
  or where AlertName == "Unauthorized GE SRTP File Access"
  or where AlertName == "Unauthorized GE SRTP Protocol Command"
  or where AlertName == "Unauthorized GE SRTP System Memory Operation"
  or where AlertName == "Unauthorized Mitsubishi MELSEC Command"
  or where AlertName == "Unauthorized MMS Service"
  or where AlertName == "Unauthorized OPC UA Activity"
  or where AlertName == "Unauthorized OPC UA Request/Response"
  or where AlertName == "Unauthorized Profinet Frame Type"
  or where AlertName == "Unauthorized SAIA S-Bus Command"
  or where AlertName == "Unauthorized Siemens S7 Execution of Control Function"
  or where AlertName == "Unauthorized Siemens S7 Execution of User Defined Function"
  or where AlertName == "Unauthorized Siemens S7 Plus Block Access"
  or where AlertName == "Unauthorized Siemens S7 Plus Operation"
  or where AlertName == "Unauthorized SNMP Operation"
  or where AlertName == "Unpermitted Modbus Schneider Electric Extension"
  or where AlertName == "Unpermitted Usage of ASDU Types"
  or where AlertName == "Unpermitted Usage of DNP3 Function Code"
  or where AlertName == "Unpermitted Usage of Modbus Function Code"
  or where AlertName == "Unauthorized Operation was detected by a User Defined Rule"
  or where AlertName == "Unauthorized PLC Configuration Read"
  or where AlertName == "Unauthorized PLC Programming"
  or where AlertName == "Unauthorized PLC Configuration Write"
  or where AlertName == "Unauthorized PLC Program Upload"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)
  | extend DestDevcieAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)
  | project
    TimeGenerated,
    DeviceId,
    ProductComponentName,
    AlertSeverity,
    AlertName,
    Description,
    Protocol,
    SourceDeviceAddress,
    DestDevcieAddress,
    RemediationSteps,
    Tactics,
    AlertLink
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceDeviceAddress
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DestDevcieAddress
eventGroupingSettings:
  aggregationKind: SingleAlert
customDetails:
  Sensor: DeviceId
  Protocol: Protocol
  RemidationSteps: RemidationSteps
alertDetailsOverride:
  alertDisplayNameFormat: (MDIoT) {{AlertName}}
  alertDescriptionFormat: (MDIoT) {{Description}}
  alertTacticsColumnName: Tactics
  alertSeverityColumnName: AlertSeverity
version: 1.0.0
kind: Scheduled
