id: 1ff4fa3d-150b-4c87-b733-26c289af0d49
name: IoT/OT Unauthorized Remote Access - Microsoft Defender for IoT
description: |
  'Unauthorized remote access to the network can compromise the target device. That is, if another device on the network is compromised, the target devices can be accessed remotely, increasing the attack surface.'
severity: Medium
requiredDataConnectors:
  - connectorId: IoT
    dataTypes:
      - SecurityAlert (ASC for IoT)
queryFrequency: 6h
queryPeriod: 6h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T886
query: |
  SecurityAlert
  | where AlertName == "Unauthorized SSH Access"
  | extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)
  | extend IPAddress = tostring(parse_json(tostring(parse_json(Entities)[0].IpAddress)).Address)
  | extend Protocol = tostring(parse_json(tostring(parse_json(Entities)[0].Protocols))[0])
  | extend DeviceType = tostring(parse_json(Entities)[0].DeviceName)
  | extend IoTSecurityAgentId = tostring(parse_json(Entities)[0].IoTSecurityAgentId)
  | extend Vendor = tostring(parse_json(Entities)[0].Vendor)
  | extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])
  | project AlertName, ResourceId, DeviceId, IPAddress, Protocol, DeviceType, Vendor, IoTSecurityAgentId, Tactics, TimeGenerated, RemediationSteps
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
