id: 767b8f6d-8029-4c92-afe1-282167d9d49a
name: Connection from external IP to OMI related Ports
description: |
  'This query identifies connection attempts from the external IP addresses to the management ports(5985,5986,1270) related to Open Management Infrastructure(OMI). 
   OMI is the Linux equivalent of Windows WMI and helps users manage configurations across remote and local environments. 
   The query aims to find attacks targeting OMI vulnerability (CVE-2021-38647). The query primarily leverages the Network Session normalization schema(imNetworkSession) 
   as well as a few other logs to look for this activity. The Network normalizing parsers can be deployed in a click using an ARM Template shared in the link below:
   Reference: https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-for-omi-vulnerability-exploitation-with-azure-sentinel/ba-p/2764093
   Reference: https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
   Reference: https://github.com/Azure/Azure-Sentinel/tree/master/Parsers/ASimNetworkSession
requiredDataConnectors:
  - connectorId: AzureNetworkWatcher
    dataTypes:
      - AzureNetworkAnalytics_CL
  - connectorId: AzureMonitor(VMInsights)
    dataTypes:
      - VMConnection
  - connectorId: AzureFirewall
    dataTypes: 
      - AzureDiagnostics
tactics:
  - Reconnaissance
  - InitialAccess
relevantTechniques:
  - T1595
  - T1190
tags:
  - OMIGOD
  - CVE-2021-38647
query: |
  let Port = dynamic(["5985","5986","1270"]); 
  (union isfuzzy=true
  (imNetworkSession
  | extend result = ipv4_is_private(SrcIpAddr)
  | where result == 0  and SrcIpAddr != "127.0.0.1"
  | where DstPortNumber in (Port)
  | where EventResult != 'Failure'
  | project TimeGenerated, EventProduct, EventResult, SourceIp = SrcIpAddr, DestinationIp = DstIpAddr,Type, Dvc, DestinationPort= DstPortNumber, SrcPortNumber, Protocol = NetworkProtocol, RemoteCountry = SrcGeoCountry, SrcGeoCity, RemoteLatitude = SrcGeoLatitude, RemoteLongitude = SrcGeoLongitude
  | extend Timestamp = TimeGenerated, IPCustomEntity = SourceIp, HostCustomEntity = Dvc 
  ),
  (VMConnection
  | where Direction == "inbound"
  | extend result = ipv4_is_private(SourceIp)
  | where result == 0  and SourceIp != "127.0.0.1"
  | where ProcessName == 'omiengine'
  | where DestinationPort in (Port)
  | project TimeGenerated, Computer, Direction, ProcessName, SourceIp, DestinationIp, DestinationPort, Protocol, RemoteCountry, RemoteLatitude, RemoteLongitude, Type
  | extend Timestamp = TimeGenerated, HostCustomEntity = Computer, IPCustomEntity = SourceIp
  ),
  (AzureNetworkAnalytics_CL
  | extend result = ipv4_is_private(SrcIP_s) 
  | where result == 0 and SrcIP_s != "127.0.0.1"
  | where L7Protocol_s has 'wsman'
  | where DestPort_d in (Port)
  | parse VM_s with * '/' VM 
  | project TimeGenerated, SourceIp = SrcIP_s, DestinationIp = DestIP_s, DestinationPort = DestPort_d, Protocol = L7Protocol_s, NSGRule_s, VM, Type
  | extend Timestamp = TimeGenerated, HostCustomEntity = VM, IPCustomEntity = SourceIp
  ),
  AzureDiagnostics
  | where Category == "AzureFirewallNetworkRule" and OperationName == "AzureFirewallNatRuleLog"
  | parse msg_s with Protocol ' request from ' SourceIp ':' SourcePort ' to ' DestinationIp ':' DestinationPort " was " Action " to " InternalIP ':' InternalPort
  | where DestinationPort in (Port)
  | project TimeGenerated, SourceIp, DestinationIp, DestinationPort, Protocol, Action, Resource
  | extend Timestamp = TimeGenerated, IPCustomEntity = SourceIp
  )
version: 1.0.1
