id: 9862489b-230a-4b70-b45a-8a2771360a86
displayName: Fortinet Fortigate WebSession IP Summary
description: |
  'This summary rule aggregates web session logs from Fortinet Fortigate devices, providing hourly insights into session count, data sent and data received by device actions, destination hostname, source and destination IP addresses.'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: FortinetFortigateWebSessionSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor  == "Fortinet"
          and DeviceProduct startswith "Fortigate"
          and Activity has_all ('webfilter', 'utm')
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count(), SentBytes = sum(SentBytes), ReceivedBytes = sum(ReceivedBytes) by SourceIP, DestinationIP, DestinationPort, DestinationHostName, DeviceAction, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - Network" ]