id: 1ccf0f4e-4f5d-4a46-819b-5ba857394f2a
displayName: Palo Alto PAN-OS WebSession IPSummary
description: |
  'This summary rule aggregates web session logs from Palo Alto PAN-OS devices, providing hourly insights into session count, data sent, data received by device actions, sourceUserName, destination hostname, source and destination IP addresses.'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: PaloAltoPANOSWebSessionSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor == "Palo Alto Networks"
            and DeviceProduct == "PAN-OS"
            and Activity == "THREAT"
            and DeviceEventClassID == "url"
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count(), SentBytes = sum(SentBytes), ReceivedBytes = sum(ReceivedBytes) by SourceIP, SourceUserName, DestinationIP, DestinationHostName, DeviceAction, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - Network" ]