id: b45e1d40-58c0-4f6c-83f0-1019c9237cb4
displayName: Zscaler Internet Access WebSession IP Summary
description: |
  'This summary rule aggregates web session logs from Zscaler Internet Access devices, providing hourly insights into session count, data sent and data received by device action, destination hostname, source and destination IP addresses .'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: ZscalerWebSessionSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor == "Zscaler"
  | where DeviceProduct == "NSSWeblog"
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count(), SentBytes = sum(SentBytes), ReceivedBytes = sum(ReceivedBytes) by SourceIP, DestinationIP, DestinationHostName, DeviceAction, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - Network" ]