id: 321b61f0-5741-47ff-9cbf-2817dba8a652
name: Attacked more than x times average
description: |
  This query helps reviewing count of users attacked more than x times average. Update the value of x in the query to get desired results.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
- Initial access
query: |
 let AverageThreatPerRecipient = toscalar(EmailEvents
  | where DetectionMethods != ""
  | summarize total=count() by RecipientEmailAddress
  | summarize avg(total));
  EmailEvents
  | where DetectionMethods != ""
  | summarize total=count() by RecipientEmailAddress
  | where tolong(total) >= 1*AverageThreatPerRecipient // update "1"
