id: a3df4a32-4805-4c6d-8699-f3c888af2f67
name: Correlate Unfamiliar sign-in properties and atypical travel alerts
description: |
  'The combination of an Unfamiliar sign-in properties alert and an Atypical travel alert about the same user within a +10m or -10m window is considered a high severity incident.'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AzureActiveDirectoryIdentityProtection
    dataTypes:
      - SecurityAlert (IPC)
  - connectorId: BehaviorAnalytics
    dataTypes:
      - IdentityInfo
queryFrequency: 1d
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
query: |
    // We can use this configuration TimeDeltaInMinutes if you want to chnage the time window that we try to match the alerts
    let TimeDeltaInMinutes = 10;
    let Alert1 = 
    SecurityAlert
    | where TimeGenerated > ago(1d)
    | where ProductName == "Azure Active Directory Identity Protection"
    | where AlertName == "Unfamiliar sign-in properties"
    | mv-expand Entity = todynamic(Entities)
    | where Entity.Type == "account"
    | extend AadTenantId = tostring(Entity.AadTenantId)
    | extend AadUserId = tostring(Entity.AadUserId)
    | join kind=inner (
    IdentityInfo
    | distinct AccountTenantId, AccountObjectId, AccountUPN, AccountDisplayName
    | extend UserName = AccountDisplayName
    | extend UserAccount = AccountUPN
    | where isnotempty(AccountDisplayName) and isnotempty(UserAccount)
    | project AccountTenantId, AccountObjectId, UserAccount, UserName
    )
    on
    $left.AadTenantId == $right.AccountTenantId,
    $left.AadUserId == $right.AccountObjectId
    | extend CompromisedEntity = iff(CompromisedEntity == "N/A" or isempty(CompromisedEntity), UserAccount, CompromisedEntity)
    | extend Alert1Time = TimeGenerated
    | extend Alert1 = AlertName
    | extend Alert1Severity = AlertSeverity
    | project AadTenantId, AadUserId, AccountTenantId, AccountObjectId, Alert1, Alert1Severity, Alert1Time, UserAccount, UserName
    ;
    let Alert2 = 
    SecurityAlert
    | where TimeGenerated > ago(1d)
    | where ProductName == "Azure Active Directory Identity Protection"
    | where AlertName == "Atypical travel"
    | mv-expand Entity = todynamic(Entities)
    | where Entity.Type == "account"
    | extend AadTenantId = tostring(Entity.AadTenantId)
    | extend AadUserId = tostring(Entity.AadUserId)
    | join kind=inner (
    IdentityInfo
    | distinct AccountTenantId, AccountObjectId, AccountUPN, AccountDisplayName
    | extend UserName = AccountDisplayName
    | extend UserAccount = AccountUPN
    | where isnotempty(AccountDisplayName) and isnotempty(UserAccount)
    | project AccountTenantId, AccountObjectId, UserAccount, UserName
    )
    on
    $left.AadTenantId == $right.AccountTenantId,
    $left.AadUserId == $right.AccountObjectId
    | extend CompromisedEntity = iff(CompromisedEntity == "N/A" or isempty(CompromisedEntity), UserAccount, CompromisedEntity)
    | extend Alert2Time = TimeGenerated
    | extend Alert2 = AlertName
    | extend Alert2Severity = AlertSeverity
    | extend CurrentLocation = tostring(parse_json(ExtendedProperties).["Current Location"])
    | extend PreviousLocation = tostring(parse_json(ExtendedProperties).["Previous Location"])
    | extend CurrentIPAddress = tostring(parse_json(ExtendedProperties).["Current IP Address"])
    | extend PreviousIPAddress = tostring(parse_json(ExtendedProperties).["Previous IP Address"])
    | project AadTenantId, AadUserId, AccountTenantId, AccountObjectId, Alert2, Alert2Severity, Alert2Time, CurrentIPAddress, PreviousIPAddress, CurrentLocation, PreviousLocation, UserAccount, UserName
    ;
    Alert1
    | join kind=inner Alert2 on UserAccount
    | where abs(datetime_diff('minute', Alert1Time, Alert2Time)) <= TimeDeltaInMinutes
    | extend TimeDelta = Alert1Time - Alert2Time
    | project UserAccount, Alert1, Alert1Time, Alert1Severity, Alert2, Alert2Time, Alert2Severity, TimeDelta, CurrentLocation, PreviousLocation, CurrentIPAddress, PreviousIPAddress, UserName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: UPNSuffix
        columnName: UserAccount
      - identifier: Name
        columnName: UserName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CurrentIPAddress
customDetails:
    Alert1: Alert1
    Alert1Time: Alert1Time
    Alert1Severity: Alert1Severity
    Alert2: Alert2
    Alert2Time: Alert2Time
    Alert2Severity: Alert2Severity
    TimeDelta: TimeDelta
    CurrentLocation: CurrentLocation
    PreviousLocation: PreviousLocation
    CurrentIPAddress: CurrentIPAddress
    PreviousIPAddress: PreviousIPAddress
version: 1.0.4
kind: Scheduled