
id:{9FDDF2F5-88AC-4186-BA48-7A4187A4F755
name: Microsoft Defender AV mode device count
description: |
  // Author: Sonali Meshram
  // @someshram
  // ------------------------
  // Provides the Anti virus mode and device count falling under that mode
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmInfoGathering
query: |
    DeviceTvmInfoGathering
    | extend AvMode = iif(tostring(AdditionalFields.AvMode) == '0', 'Active', iif(tostring(AdditionalFields.AvMode) == '1', 'Passive',iif(tostring(AdditionalFields.AvMode) == '2', 'Disabled', iif(tostring(AdditionalFields.AvMode) == '5', 'PassiveAudit',iif(tostring(AdditionalFields.AvMode) == '4', 'EDR Blocked' ,'Unknown')))))  
    | summarize DeviceCount = count() by AvMode
