id: FEE07B7B-E704-4216-BBFC-3B1344136E07
name: Microsoft Defender AV details
description: |
  // Author: Sonali Meshram
  // @someshram
  // ------------------------
  // 1.	A list of all devices with below AV information
  // 2.	This query will identify the Microsoft Defender Antivirus Security Intelligence version, Security Intelligence up to date value, Engine version, Engine up to date value,  Product version (aka Platform version),Product (aka Platform) up to date value, Security Intelligence publish/build timestamp, Security intel refresh timestamp
 requiredDataConnectors:
 - connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmInfoGathering
query: |
  let expiringPublishdate = ago(7d);
  DeviceTvmInfoGathering  
  | extend AvIsSignatureUpToDateTemp = tostring(AdditionalFields.AvIsSignatureUptoDate),
  AvIsPlatformUptodateTemp=tostring(AdditionalFields.AvIsPlatformUptodate),
  AvIsEngineUptodateTemp = tostring(AdditionalFields.AvIsEngineUptodate), 
  AvSignatureDataRefreshTime = todatetime(AdditionalFields.AvSignatureDataRefreshTime), 
  AvSignaturePublishTime = todatetime(AdditionalFields.AvSignaturePublishTime),
  AvSignatureVersion =  tostring(AdditionalFields.AvSignatureVersion),
  AvEngineVersion =  tostring(AdditionalFields.AvEngineVersion),
  AvPlatformVersion =  tostring(AdditionalFields.AvPlatformVersion)
  | extend AvIsSignatureUpToDate = iif(((((isnull(AvIsSignatureUpToDateTemp)
  or (isnull(AvSignatureDataRefreshTime)))
  or (isnull(AvSignaturePublishTime))))
  or (AvIsSignatureUpToDateTemp == "true"
  and AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsSignatureUpToDateTemp))
  | extend AvIsEngineUpToDate = iif(((((isnull(AvIsEngineUptodateTemp)
  or (isnull(AvSignatureDataRefreshTime)))
  or (isnull(AvSignaturePublishTime)))
  or (AvSignatureDataRefreshTime < expiringPublishdate))
  or (AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsEngineUptodateTemp))
  | extend AvIsPlatformUpToDate = iif(((((isnull(AvIsPlatformUptodateTemp)
  or (isnull(AvSignatureDataRefreshTime)))
  or (isnull(AvSignaturePublishTime)))
  or (AvSignatureDataRefreshTime < expiringPublishdate))
  or (AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsPlatformUptodateTemp))
  | project DeviceName, OSPlatform, AvSignatureVersion, AvIsSignatureUpToDate, AvEngineVersion, AvIsEngineUpToDate, AvPlatformVersion , AvIsPlatformUpToDate, AvSignaturePublishTime, AvSignatureDataRefreshTime
  | order by DeviceName asc
  | take 10000
