id: 089FD0AD-A381-405A-8D76-5DC85E4A84A2
name: Microsoft Defender AV mode device count
description: |
  // Author: Sonali Meshram
  // @someshram
  // ------------------------
  // This query will fetch the device count based on Anti virus mode and OS platform.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceTvmInfoGathering
query: |
DeviceTvmInfoGathering
| extend AvMode = iif(tostring(AdditionalFields.AvMode) == '0', 'Active' , iif(tostring(AdditionalFields.AvMode) == '1', 'Passive' ,iif(tostring(AdditionalFields.AvMode) == '4', 'EDR Blocked' ,'Unknown')))
| project OSPlatform, AvMode, Timestamp
| summarize DeviceCount = count() by  AvMode, OSPlatform
| order by AvMode asc
