CommonSecurityLog
| where DeviceProduct == "UnityOne"
| extend DeviceVendor = iff(DeviceVendor == "TippingPoint", "Trend Micro", DeviceVendor)
| extend DeviceProduct = iff(DeviceProduct == "UnityOne", "TippingPoint", DeviceProduct)
| extend TippingPointVLAN = DeviceCustomNumber1
| extend TippingPointTaxonomy = DeviceCustomNumber2
| extend TippingPointPacketTrace = DeviceCustomNumber3
| extend TippingPointProfileName = DeviceCustomString1
| extend TippingPointPolicyUUID = DeviceCustomString2
| extend TippingPointSignatureUUID = DeviceCustomString3
| extend TippingPointZoneNames = DeviceCustomString4
| extend TippingPointSMSName = DeviceCustomString5
| extend TippingPointFilterMessageParms = DeviceCustomString6
| parse AdditionalExtensions with "cat=" cat
| project-away DeviceCustomIPv6Address1Label, DeviceCustomIPv6Address2Label, DeviceCustomIPv6Address3Label, DeviceCustomNumber1, DeviceCustomNumber1Label, DeviceCustomNumber2, DeviceCustomNumber2Label, DeviceCustomNumber3, DeviceCustomNumber3Label, DeviceCustomString1, DeviceCustomString1Label, DeviceCustomString2, DeviceCustomString2Label, DeviceCustomString3, DeviceCustomString3Label, DeviceCustomString4, DeviceCustomString4Label, DeviceCustomString5, DeviceCustomString5Label, DeviceCustomString6, DeviceCustomString6Label
