Id: 588f5d9f-3380-4eff-9983-e61d62fdd172
DisplayName: Office activity accounts with this IP
Description: Summary of accounts for a given ClientIP on Office Activity data (set time range to +-12h when running the query)
InputEntityType: Ip
InputFields:
  - Address
OutputEntityTypes:
  - Account
QueryPeriodBefore: 12h
QueryPeriodAfter: 12h
DataSources:
  - OfficeActivity
Tactics:
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let GetAllAccountByIP = (v_IP_Address:string){
  OfficeActivity 
  | where ClientIP =~ v_IP_Address
  | extend info = pack('ClientIP', ClientIP, 'UserType', UserType, 'Operation', Operation, 'OfficeWorkload', OfficeWorkload, 'ResultStatus', ResultStatus)
  | summarize min(TimeGenerated), max(TimeGenerated), Account_Aux_Count=count(), Account_Aux_info = makeset(info) by UserId
  | project Account_Aux_StartTime = min_TimeGenerated, Account_Aux_EndTime = max_TimeGenerated, UserId, Account_Aux_Count, Account_Aux_info
  | project-rename Account_UnstructuredName=UserId
  | top 10 by Account_Aux_Count desc nulls last
  };
  // change <Address> value below
  GetAllAccountByIP('<Address>')
