Id: 801bacb0-612a-4195-a84f-7939cca63b92
DisplayName: Least prevalent client IPs with DNS name lookup query for this IP
Description: Summary of Bottom 10 Client IP and Domain Names for a given remote IPAddress from DnsEvent Lookup Query data (set time range to +-3h when running the query)
InputEntityType: Ip
InputFields:
  - Address
OutputEntityTypes:
  - Ip
QueryPeriodBefore: 3h
QueryPeriodAfter: 3h
DataSources:
  - DnsEvents
Tactics:
  - CommandAndControl
  - Exfiltration
query: |
  let GetAllIPByClientIP = (v_IP_Address:string){
      _Im_Dns(response_has_ipv4=v_IP_Address)
      | extend IP_Address=SrcIpAddr
      | summarize IP_Aux_StartTime=min(TimeGenerated), IP_Aux_EndTime=max(TimeGenerated), IP_Aux_DomainNames=make_set(DnsQuery), IP_Aux_Count= count() by IP_Address
      | top 10 by IP_Aux_Count asc nulls last
      };
    GetAllIPByClientIP('<Address>')



