// Name: Messages with the provided IPAddress
// Description: Messages with the provided IPAddress in range of +-10m
//
// Id: 899cab5e-799e-49c6-a564-f72178d38531
//
// Entity: IPAddress
// Input: IPAddress
// Output: Account, Domain
//
// QueryPeriod: +-10m, change as needed
//
// Data Source: CommonSecurityLog
//
// Tactics: #Discovery, #Lateral Movement, #Collection
//
let GetCSLogEventsByIP = (suspiciousEventTime:datetime, v_IPAddress:string){
let v_StartTime = suspiciousEventTime-1h;
let v_EndTime = suspiciousEventTime+1h;
CommonSecurityLog
| where TimeGenerated between (v_StartTime .. v_EndTime)
| where Message has v_IPAddress
| summarize min(TimeGenerated), max(TimeGenerated) by DeviceVendor, DeviceProduct, DeviceEventClassID, Computer, Message
| project min_TimeGenerated, max_TimeGenerated, DeviceVendor, DeviceProduct, DeviceEventClassID, Computer, Message
};
// change datetime value and <processname> value below
GetCSLogEventsByIP(datetime('2019-01-30T10:36:07Z'), "<ipaddress>")