Id: 0cb64e03-8534-47b6-9094-7de2d018fd7a
DisplayName: Most prevalent client IPs with DNS name lookup query for this IP
Description: Summary of Top 10 Client IP and Domain Names for a given remote IPAddress from DnsEvent Lookup Query data (set time range to +-3h when running the query)
InputEntityType: Ip
InputFields:
  - Address
OutputEntityTypes:
  - Ip
QueryPeriodBefore: 3h
QueryPeriodAfter: 3h
DataSources:
  - DnsEvents
Tactics:
  - CommandAndControl
  - Exfiltration
query: |
  let GetAllIPByClientIP = (v_IP_Address:string){
      _Im_Dns(response_has_ipv4=v_IP_Address)
      | extend IP_Address=SrcIpAddr
      | summarize IP_Aux_StartTime=min(TimeGenerated), IP_Aux_EndTime=max(TimeGenerated), IP_Aux_DomainNames=make_set(DnsQuery), IP_Aux_Count= count() by IP_Address
      | top 10 by IP_Aux_Count desc nulls last
      };
    GetAllIPByClientIP('<Address>')
