id: f82c89fa-c969-4d12-832f-04d55d14522c
name: Persisting via IFEO Registry Key 
description: |
    'This query detects frequent creation and deletion of IFEO registry keys in a short time, a technique used by adversaries for system persistence.'
description-detailed: |
   'This query detects instances where IFEO registry keys were created and deleted frequently within a short period of time.
   This technique is used by adversaries to persist on a system by creating a registry key under the Image File Execution Options registry key.
   https://goayxh.medium.com/malware-persistence-image-file-execution-options-injection-ifeo-5aa0e81086f0'
severity: Medium
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
  - connectorId: WindowsSecurityEvents
    dataTypes: 
      - SecurityEvents  
  - connectorId: WindowsForwardedEvents
    dataTypes:
      - WindowsEvent
tactics:
  - Persistence
relevantTechniques:
  - T1546.012
tags:
  - Solorigate
  - NOBELIUM
query: |
  (union isfuzzy=true
  (
  SecurityEvent
  | where EventID == 4657
  | where ObjectName has_all ("\\REGISTRY\\MACHINE", "Image File Execution Options")
  | where ObjectName !endswith "Image File Execution Options"
  | summarize Count=count() by Computer, Account, ObjectName
  | top 10 by Count desc 
  | extend AccountCustomEntity = Account, HostCustomEntity = Computer
  ),
  (
  WindowsEvent
  | where EventID == 4657 and EventData has_all ("\\REGISTRY\\MACHINE", "Image File Execution Options")
  | extend ObjectName = tostring(EventData.ObjectName)
  | where ObjectName has_all ("\\REGISTRY\\MACHINE", "Image File Execution Options")
  | where ObjectName !endswith "Image File Execution Options"
  | extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
  | summarize Count=count() by Computer, Account, ObjectName
  | top 10 by Count desc 
  | extend AccountCustomEntity = Account, HostCustomEntity = Computer
  ),
  (
  Event
  | where Source =~ "Microsoft-Windows-Sysmon"
  | where EventID in (12, 13)
  | extend EventData = parse_xml(EventData).DataItem.EventData.Data
  | mv-expand bagexpansion=array EventData
  | evaluate bag_unpack(EventData)
  | extend Key = tostring(column_ifexists('@Name', "")), Value = column_ifexists('#text', "")
  | evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
  | where TargetObject has_all ("HKLM", "Image File Execution Options")
  | summarize Count=count() by Computer, UserName, tostring(TargetObject)
  | top 10 by Count desc
  | extend AccountCustomEntity = UserName, HostCustomEntity = Computer
  ),
  (
  imRegistry
  | where RegistryKey has_all ("HKEY_LOCAL_MACHINE", "Image File Execution Options")
  | summarize Count=count() by Dvc, Username, RegistryKey
  | top 10 by Count desc
  | extend AccountCustomEntity = Username, HostCustomEntity = Dvc
  )
  )
  | extend NTDomain = tostring(split(AccountCustomEntity, '\\', 0)[0]), Name = tostring(split(AccountCustomEntity, '\\', 1)[0])
  | extend HostName = tostring(split(HostCustomEntity, '.', 0)[0]), DnsDomain = tostring(strcat_array(array_slice(split(HostCustomEntity, '.'), 1, -1), '.'))
  | extend Account_0_Name = Name
  | extend Account_0_NTDomain = NTDomain
  | extend Host_0_HostName = HostName
  | extend Host_0_DnsDomain = DnsDomain
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: NTDomain
        columnName: NTDomain
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: HostName
      - identifier: DnsDomain
        columnName: DnsDomain
version: 1.0.1