id: 7aad876a-a6fe-4c11-879e-8b29d35ff739
name: Remote Scheduled Task Creation or Update using ATSVC Named Pipe
description: |
  'This query detects a scheduled task, created/updated remotely, using the ATSVC name pipe. 
  Threat actors are using scheduled tasks for establishing persistence and moving laterally through the network.
  Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Persistence
relevantTechniques:
  - T1053.002
query: |
  SecurityEvent
  | where EventID == 5145 and ShareName=="\\\\*\\IPC$" and RelativeTargetName == "atsvc"
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, ShareName, RelativeTargetName, IpAddress
entityMappings:
- entityType: Account
  fieldMappings:
    - identifier: FullName
      columnName: SubjectUserName
- entityType: Host
  fieldMappings:
    - identifier: FullName
      columnName: Computer
- entityType: IP
  fieldMappings:
    - identifier: Address
      columnName: IpAddress
version: 1.0.0
kind: Scheduled
