id: 7aad876a-a6fe-4c11-879e-8b29d35ff739
name: Remote Scheduled Task Creation or Update using ATSVC Named Pipe
description: |
    'This query detects a scheduled task, created/updated remotely, using the ATSVC name pipe. 
     Threat actors are using scheduled tasks for establishing persistence and moving laterally through the network.'
description-detailed: |
  'This query detects a scheduled task, created/updated remotely, using the ATSVC name pipe. 
  Threat actors are using scheduled tasks for establishing persistence and moving laterally through the network.
  Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Persistence
relevantTechniques:
  - T1053.002
query: |
  SecurityEvent
    | where EventID == 5145 and ShareName=="\\\\*\\IPC$" and RelativeTargetName == "atsvc"
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, SubjectUserName, ShareName, RelativeTargetName, IpAddress
    | extend HostName = tostring(split(Computer, '.', 0)[0]), DnsDomain = tostring(strcat_array(array_slice(split(Computer, '.'), 1, -1), '.'))
    | extend UserName = tostring(split(SubjectUserName, '@', 0)[0]), UPNSuffix = tostring(split(SubjectUserName, '@', 1)[0])
    | extend Account_0_Name = UserName
    | extend Account_0_UPNSuffix = UPNSuffix
    | extend Host_0_HostName = HostName
    | extend Host_0_DnsDomain = DnsDomain
    | extend IP_0_Address = IpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: UserName
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: HostName
      - identifier: DnsDomain
        columnName: DnsDomain
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IpAddress
version: 1.1.0
