id: 99e1246e-c1a9-4794-8e96-eb906c73c529
name: Spam Detections (Normal) by delivery location
description: |
  This query visualises emails with Spam detections (Normal confidence) summarizing the data by Delivery Location.
description-detailed: |
  This query visualises emails with Spam detections (Normal confidence) summarizing the data by Delivery Location which are subject to User/Admin overrides and Policy actions.
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where OrgLevelPolicy != "Phishing simulation" and OrgLevelPolicy != "SecOps Mailbox"
  | where ConfidenceLevel has_any ('Spam":"Normal')
  | summarize count() by LatestDeliveryLocation
  | sort by count_ desc
  | render piechart
version: 1.0.0