id: 78c2dfdf-9d3e-4d4b-b69f-e9b39df5e7f2
name: Insider Risk - First Time Device Observed
description: |
  'The User Threshold for First Time Device is Exceeded'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078
query: |
  let UncommonActionVolume = BehaviorAnalytics
  | extend UncommonActionVolume = tostring(ActivityInsights.UncommonHighVolumeOfActions)
  | where UncommonActionVolume == "True"
  | summarize count() by UserPrincipalName
  | project-rename UncommonActionVolume = count_;
  let UncommonAction = BehaviorAnalytics
  | extend UncommonAction = tostring(ActivityInsights.ActionUncommonlyPerformedByUser)
  | where UncommonAction == "True"
  | summarize count() by UserPrincipalName
  | project-rename UncommonAction = count_;
  let Uncommon = UncommonActionVolume | join(UncommonAction) on UserPrincipalName;
  let FirstTimeDeviceLogon = BehaviorAnalytics
  | extend FirstTimeDeviceLogon = tostring(ActivityInsights.FirstTimeUserLoggedOnToDevice)
  | where FirstTimeDeviceLogon == "True"
  | summarize count() by UserPrincipalName
  | project-rename FirstTimeDeviceLogon = count_;
  let FirstTimeUserAction = BehaviorAnalytics
  | extend FirstTimeUserAction = tostring(ActivityInsights.FirstTimeUserPerformedAction)
  | where FirstTimeUserAction == "True"
  | summarize count() by UserPrincipalName
  | project-rename FirstTimeUserAction = count_;
  let FirstTime = FirstTimeUserAction | join(FirstTimeDeviceLogon) on UserPrincipalName;
  Uncommon | join kind=fullouter(FirstTime) on UserPrincipalName
  | where UserPrincipalName <> ""
  | where FirstTimeDeviceLogon > 3 // Adjust & Tune Thresholds within Organizational Requirements
  | project UserPrincipalName, UncommonActionVolume, UncommonAction, FirstTimeUserAction, FirstTimeDeviceLogon
  | sort by UncommonActionVolume desc 
  | limit 250
  | extend AccountCustomEntity = UserPrincipalName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: UserPrincipalName
