id: 8138863e-e55f-4f02-ac94-72796e203d27
name: Defender Alert Evidence
version: 1.0.0
type: Microsoft.OperationalInsights/workspaces/providers/alertRules
kind: Scheduled
status: Available
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - AlertEvidence
severity: High
description: This analytic rule is looking for new alert evidence from Microsoft Defender for Endpoint. The intent is to create entries in the SecurityAlert table for every new alert evidence attached to an entity of type Device or User monitored by Defender for Endpoint.
tactics: 
  - Persistence
relevantTechniques:
  - T1546
query: |
  AlertEvidence
  | where EntityType in ("Device", "User")
queryFrequency: 60m
queryPeriod: 60m
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
incidentConfiguration:
  createIncident: false
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: Name
    columnName: AccountName
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: LocalIP
- entityType: Host
  fieldMappings:
  - identifier: HostName
    columnName: DeviceName