id: e7791695-c103-4d20-a75a-53e90788616b
name: Alerts Related to Log4j Vulnerability
description: |
  Microsoft has observed attackers exploiting vulnerabilities associated with Log4J.
description-detailed: |
  Microsoft has observed attackers exploiting vulnerabilities associated with Log4J. This query will return alerts related to Log4j vulnerability exploitation.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - AlertInfo
tactics:
  - InitialAccess
query: |
  AlertInfo
  | where Title in~('Suspicious script launched',
  'Exploitation attempt against Log4j (CVE-2021-44228)',
  'Suspicious process executed by a network service',
  'Possible target of Log4j exploitation (CVE-2021-44228)',
  'Possible target of Log4j exploitation',
  'Possible Log4j exploitation',
  'Network connection seen in CVE-2021-44228 exploitation',
  'Log4j exploitation detected',
  'Possible exploitation of CVE-2021-44228',
  'Possible target of Log4j vulnerability (CVE-2021-44228) scanning',
  'Possible source of Log4j exploitation',
  'Log4j exploitation attempt via cloud application', // Previously titled Exploitation attempt against Log4j
  'Log4j exploitation attempt via email' // Previously titled Log4j Exploitation Attempt
  )
version: 1.0.0