{
  "Name": "InsiderRiskManagement",
  "Author": "Nikhil Tripathi - v-ntripathi@microsoft.com",
  "Logo": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Workbooks/Images/Logos/Azure_Sentinel.svg\" width=\"75px\" height=\"75px\">",
  "Description": "The Azure Sentinel: Insider Risk Management Solution (https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/InsiderRiskManagement/readme.md) demonstrates the “better together” story between Microsoft 365 Insider Risk Management and Azure Sentinel. This workbook integrates telemetry from 25+ Microsoft security products to provide actionable insights into insider risk management. Reporting tools provide “Go to Alert” links to provide deeper integration between products and a simplified user experience for exploring alerts. A filter set provides custom reporting for Guide, Subscription, Workspace, and Time. The workbook can be exported as a PDF or print report via the Print Workbooks feature. Content sections include Overviews, Insider Risk Management, Watchlist, and User Forensics. The Overview tab provides recommendations for building insider risk program architectures. The Insider Risk tab provides alert reporting by both insider risk scenarios such as Sensitive Data Leaks, Security Violations, and MITRE ATT&CK tactics. The Watchlist tab provides filtering by Azure Sentinel Watchlists and the User Forensics tab collects logging telemetry by user. The user experience includes designing insider risk management architectures and streamlining telemetry from all users > watchlist > specific users while transitioning to M365 Insider Risk Management to investigate/resolve activity of interest.",
  "WorkbookDescription": "Insider risk management helps minimize internal risks by enabling you to detect, investigate, and act on malicious and inadvertent activities in your organization.",
  "Workbooks": [
    "Workbooks/InsiderRiskManagement.json"
  ],
  "Analytic Rules": [
  "Analytic Rules/InsiderRiskHighUserAlertsCorrelation.yaml",
  "Analytic Rules/InsiderRiskHighUserIncidentsCorrelation.yaml",
  "Analytic Rules/InsiderRiskM365IRMAlertObserved.yaml",
  "Analytic Rules/InsiderRiskSensitiveDataAccessOutsideOrgGeo.yaml",
  "Analytic Rules/InsiderRiskyAccessByApplication.yaml"
  ],
  "Hunting Queries": [
  "Hunting Queries/InsiderEntityAnomalyFollowedByIRMAlert.yaml",
  "Hunting Queries/InsiderISPAnomalyCorrelatedToExfiltrationAlert.yaml",
  "Hunting Queries/InsiderMultipleEntityAnomalies.yaml",
  "Hunting Queries/InsiderPossibleSabotage.yaml",
  "Hunting Queries/InsiderSignInRiskFollowedBySensitiveDataAccessyaml.yaml"
  ],
  "Metadata": "SolutionMetadata.json",
  "BasePath": "C:\\GitHub\\azure\\Solutions\\MicrosoftInsiderRiskManagement",
  "Version": "1.0.2"
}
