{
    "Name": "Vectra XDR",
    "Author": "TME - tme@vetcra.ai",
    "Logo": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/AIVectraDetect.svg\" width=\"75px\" height=\"75px\">",
    "Description": "Vectra AI is the leader in AI-driven threat detection and response for hybrid and multi-cloud enterprises. Vectra AI's cloud-native platform - powered by our patented Attack Signal Intelligence- provide security teams with unified threat visibility, context and control across public cloud, SaaS, identity and data center networks in a prioritized feed. Vectra AI-driven Attack Signal IntelligenceTM, empowers SOC analysts to rapidly prioritize, investigate and respond to the most urgent cyber-attacks in their hybrid cloud environment. Organizations worldwide rely on Vectra AI's cloud-native platform and MDR services to see and stop attacks from becoming breaches. The Vectra AI App enables the security operations team to consume the industry's richest threat signals spanning public cloud, SaaS, identity and data center networks inside of Microsoft Sentinel. For more information, visit www.vectra.ai.\n\n The Vectra XDR App for Microsoft Sentinel contains:\n Data Connector to ingest events generated by Vectra XDR (through OMS agent).\n Workbook: Dynamic dashboard view of Entities, Detections, Lockdown, Audit and, Health",
    "Data Connectors": [
        "Data Connectors/VectraDataConnector/VectraXDR_API_FunctionApp.json"
    ],
    "Parsers":[
        "Parsers/VectraDetections.yaml",
        "Parsers/VectraAudits.yaml",
        "Parsers/VectraEntityScoring.yaml",
        "Parsers/VectraHealth.yaml",
        "Parsers/VectraLockdown.yaml"
    ],
    "Analytic Rules": [
        "Analytic Rules/DetectXDR_detections.yaml",
        "Analytic Rules/DetectXDR_Prioritized_Entities.yaml"
    ],
    "Workbooks": [
        "Workbooks/VectraXDR.json"
    ],
    "BasePath": "C:\\Users\\xxx\\Documents\\GitHub\\Azure-Sentinel\\Solutions\\Vectra XDR",
    "Version": "3.1.0",
    "Metadata": "SolutionMetadata.json",
    "TemplateSpec": true,
    "Is1PConnector": false
}