// Usage Instruction : 
// Paste below query in log analytics, click on Save button and select as Function from drop down by specifying function name and alias as Morphisec
// Function usually takes 10-15 minutes to activate. You can then use function alias from any other queries (e.g. Morphisec | take 10).
// Reference : Using functions in Azure monitor log queries : https://docs.microsoft.com/azure/azure-monitor/log-query/functions

CommonSecurityLog
| where DeviceVendor == 'Morphisec'
| extend Start = extract("start=([^;]+)",1,AdditionalExtensions)
, AttackedModule = extract("AttackedModule=([^;]+)",1,AdditionalExtensions)
, MorphisecVersion = extract("MorphisecVersion=([^;]+)",1,AdditionalExtensions)
, AttackName = extract("AttackName=([^;]+)",1,AdditionalExtensions)
, AttackCategory = extract("AttackCategory=([^;]+)",1,AdditionalExtensions)
, Attackdescription = extract("Attackdescription=([^;]+)",1,AdditionalExtensions)
, ProcessSignature = extract("ProcessSignature=([^;]+)",1,AdditionalExtensions)
, ParentSignature = extract("ParentSignature=([^;]+)",1,AdditionalExtensions)
, LastStackFunctionCall = extract("LastStackFunctionCall=([^;]+)",1,AdditionalExtensions)
, LastModuleLoaded = extract("LastModuleLoaded=([^;]+)",1,AdditionalExtensions)
, CommandLine = extract("CommandLine=([^;]+)",1,AdditionalExtensions)
, ParentProcessCommandLine = extract("ParentProcessCommandLine=([^;]+)",1,AdditionalExtensions)
, CodeProcessed = extract("CodeProcessed=([^;]+)",1,AdditionalExtensions)