id: dd2c4f48-b732-4a75-b2c4-b44bacc66d00
name: LocalAdminGroupChanges
description: |
  Author: alex verboon @alexverboon.
  Blogpost: https://www.verboon.info/2020/09/hunting-for-local-group-membership-changes.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - IdentityInfo
  - DeviceEvents
query: "let ADAZUsers =  IdentityInfo \r\n| extend DirectoryDomain = AccountDomain \r\n| extend DirectoryAccount = AccountName \r\n| distinct DirectoryDomain , DirectoryAccount , OnPremSid , CloudSid, AccountUpn, GivenName, Surname;\r\n // check for any new created or modified local accounts \r\nlet NewUsers =  DeviceEvents\r\n| where ActionType contains \"UserAccountCreated\"  // or ActionType contains \"UserAccountModified\"\r\n| extend lUserAdded = AccountName\r\n| extend NewUserSID = AccountSid\r\n| extend laccountdomain = AccountDomain\r\n| distinct NewUserSID, lUserAdded,laccountdomain;\r\n// Check for any local group changes and enrich the data with the account name obtained from the previous query\r\nDeviceEvents \r\n| where ActionType == 'UserAccountAddedToLocalGroup' \r\n| extend AddedAccountSID = tostring(parse_json(AdditionalFields).MemberSid)\r\n| extend LocalGroup = AccountName\r\n| extend LocalGroupSID = AccountSid\r\n| extend Actor = trim(@\"[^\\w]+\",InitiatingProcessAccountName)\r\n// limit to local administrators group\r\n//  | where LocalGroupSID contains \"S-1-5-32-544\"\r\n| join kind= leftouter    (NewUsers)\r\non $left.AddedAccountSID == $right.NewUserSID\r\n| project Timestamp, DeviceName, LocalGroup,LocalGroupSID, AddedAccountSID, lUserAdded , Actor, ActionType , laccountdomain \r\n| join kind= leftouter        (ADAZUsers)\r\non $left.AddedAccountSID == $right.OnPremSid\r\n| extend UserAdded = iff(isnotempty(lUserAdded),strcat(laccountdomain,\"\\\\\", lUserAdded), strcat(DirectoryDomain,\"\\\\\", DirectoryAccount))\r\n| project Timestamp, DeviceName, LocalGroup,LocalGroupSID, AddedAccountSID, UserAdded , Actor, ActionType  \r\n| where DeviceName !contains Actor \r\n// Provide details on actors that added users\r\n// | summarize count()  by Actor \r\n// | join ADAZUsers\r\n// on $left.Actor == $right.DirectoryAccount \r\n// | render piechart "
