id: 52e7504f-8d17-4435-8215-196e7b3b6a3c
name: localAdminAccountLogon (0)
description: |-
  This query looks for local admin account used to logon into the computer.
  This can help to detect malicious insiders that were able to add a local account to the local admin group offline.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceLogonEvents
query: |-
  DeviceLogonEvents
  | where IsLocalAdmin == 1
   and AccountDomain == DeviceName
