id: 2211b57b-7d13-435d-89a9-40f333249605
name: localAdminAccountLogon
description: |
  This query looks for local admin account used to logon into the computer.
  This can help to detect malicious insiders that were able to add a local account to the local admin group offline.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceLogonEvents
query: |
  DeviceLogonEvents
  | where IsLocalAdmin == 1
   and AccountDomain == DeviceName
