id: 34208765-264e-4abe-805b-f645925fbadb
name: scheduled task creation
description: |
  Original Sigma Rule: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_creation.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceEvents
query: |
  DeviceEvents 
  | where ActionType == "ScheduledTaskCreated"
    and InitiatingProcessAccountSid != "S-1-5-18"
