id: 82385294-5923-4246-85ca-19a52b699bdd
name: Suspicious JScript staging comment
description: |-
  Microsoft has observed attackers who have gained entry to an environment via the Log4J vulnerability utilizing identifiable strings in PowerShell commands.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
- Vulnerability
query: |-
  DeviceProcessEvents
  | where FileName =~ "powershell.exe"
  | where ProcessCommandLine has "VMBlastSG"
