id: 14d5fa7a-4cd4-4132-90fd-c86e841c6168
name: Suspicious PowerShell curl flags
description: |-
  Microsoft has observed attackers who have gained entry to an environment via the Log4J vulnerability utilizing uncommon PowerShell flags to communicate to command-and-control infrastructure.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
- Vulnerability
query: |-
  DeviceProcessEvents
  | where FileName =~ "powershell.exe"
  | where ProcessCommandLine has_all("-met", "POST", "-Body")
