id: de01ace1-23eb-494c-8bdf-555c80d9bb61
name: Suspicious process event creation from VMWare Horizon TomcatService
description: |-
  Microsoft has observed attackers who have gained entry to an environment via the Log4J vulnerability utilizing the ws_TomcatService.exe process to launch malicious processes.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
- Vulnerability
query: |-
  DeviceProcessEvents
  | where InitiatingProcessFileName has "ws_TomcatService.exe"
  | where FileName != "repadmin.exe"
