id: 712fab52-2a7d-401e-a08c-ff939cc7c25e
name: TI Map URL Entity to AuditLogs
description: |
  'This query identifies any URL indicators of compromise (IOCs) from threat intelligence (TI) by searching for matches in AuditLogs.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
  - connectorId: ThreatIntelligenceTaxii
    dataTypes:
      - ThreatIntelligenceIndicator
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
query: |
  let dt_lookBack = 1h;
  let ioc_lookBack = 14d;
  ThreatIntelligenceIndicator
  | where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
  | where Active == true
  // Picking up only IOC's that contain the entities we want
  | where isnotempty(Url)
  // using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated
  | join kind=innerunique (
    AuditLogs
    | where TimeGenerated >= ago(dt_lookBack)
    // Extract the URL that is contained within the JSON data
    | extend Url = extract("(http[s]?://(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+);", 1,tostring(TargetResources))
    | where isnotempty(Url)
    | extend userPrincipalName = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | extend servicePrincipalId = tostring(parse_json(tostring(InitiatedBy.app)).servicePrincipalId)
    | mv-expand TargetResources
    | extend TargetResourceDisplayName = tostring(TargetResources.displayName)
    | extend Audit_TimeGenerated = TimeGenerated
  ) on Url
  | where Audit_TimeGenerated < ExpirationDateTime
  | summarize Audit_TimeGenerated = arg_max(Audit_TimeGenerated, *) by IndicatorId, Url
  | project Audit_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore,
  OperationName, Identity, userPrincipalName, servicePrincipalId, TargetResourceDisplayName, Url
  | extend timestamp = Audit_TimeGenerated
  | extend Name = iif(userPrincipalName has '@', tostring(split(userPrincipalName,'@',0)[0]), "")
  | extend UPNSuffix = iif(userPrincipalName has '@', tostring(split(userPrincipalName,'@',1)[0]), "")
  | extend AadUserId = iif(isnotempty(servicePrincipalId), servicePrincipalId, "")
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
      - identifier: AadUserId
        columnName: AadUserId
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: TargetResourceDisplayName
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: Url
version: 1.2.3
kind: Scheduled