id: 6fce5baf-bfc2-4c56-a6b7-9c4733fc5a45
name: GSA Enriched Office 365 - External user from a new organisation added to Teams
description: |
  'This query identifies external users added to Teams where the user's domain is not one previously seen in Teams data.'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - EnrichedMicrosoft365AuditLogs
tactics:
  - Persistence
relevantTechniques:
  - T1136
query: |
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = totimespan((endtime - starttime) * 7);
  // OfficeActivity Known Organizations
  let known_orgs_office = (
      OfficeActivity
      | where TimeGenerated between(ago(lookback)..starttime)
      | where OfficeWorkload =~ "MicrosoftTeams"
      | where Operation =~ "MemberAdded" or Operation =~ "TeamsSessionStarted"
      | extend UPN = iif(Operation == "MemberAdded", tostring(Members[0].UPN), UserId)
      | extend Organization = tostring(split(split(UPN, "_")[1], "#")[0])
      | where isnotempty(Organization)
      | summarize by Organization
  );
  // OfficeActivity Query for New Organizations
  let OfficeEvents = OfficeActivity
      | where TimeGenerated between(starttime..endtime)
      | where OfficeWorkload =~ "MicrosoftTeams"
      | where Operation =~ "MemberAdded"
      | extend UPN = tostring(parse_json(Members)[0].UPN)
      | extend Organization = tostring(split(split(UPN, "_")[1], "#")[0])
      | where isnotempty(Organization)
      | where Organization !in (known_orgs_office)
      | extend AccountName = tostring(split(UPN, "@")[0]), AccountUPNSuffix = tostring(split(UPN, "@")[1])
      | extend Account_0_Name = AccountName, Account_0_UPNSuffix = AccountUPNSuffix;
  // EnrichedMicrosoft365AuditLogs Known Organizations
  let known_orgs_enriched = (
      EnrichedMicrosoft365AuditLogs
      | where TimeGenerated between(ago(lookback)..starttime)
      | where Workload == "MicrosoftTeams"
      | where Operation in ("MemberAdded", "TeamsSessionStarted")
      | extend Members = parse_json(tostring(AdditionalProperties.Members))
      | extend UPN = iif(Operation == "MemberAdded", tostring(Members[0].UPN), UserId)
      | extend Organization = tostring(split(split(UPN, "_")[1], "#")[0])
      | where isnotempty(Organization)
      | summarize by Organization
  );
  // EnrichedMicrosoft365AuditLogs Query for New Organizations
  let EnrichedEvents = EnrichedMicrosoft365AuditLogs
      | where TimeGenerated between(starttime..endtime)
      | where Workload == "MicrosoftTeams"
      | where Operation == "MemberAdded"
      | extend Members = parse_json(tostring(AdditionalProperties.Members))
      | extend UPN = tostring(Members[0].UPN)
      | extend Organization = tostring(split(split(UPN, "_")[1], "#")[0])
      | where isnotempty(Organization)
      | where Organization !in (known_orgs_enriched)
      | extend AccountName = tostring(split(UPN, "@")[0]), AccountUPNSuffix = tostring(split(UPN, "@")[1])
      | extend Account_0_Name = AccountName, Account_0_UPNSuffix = AccountUPNSuffix;
  // Combine Office and Enriched Logs
  let CombinedEvents = OfficeEvents
      | union EnrichedEvents
      | summarize arg_min(TimeGenerated, *) by Organization, UPN;
  // Final Output
  CombinedEvents
      | project Organization, UPN, AccountName, AccountUPNSuffix
      | order by Organization asc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: AccountName
      - identifier: UPNSuffix
        columnName: AccountUPNSuffix
version: 2.0.2
