{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "author": "Visa Inc.",
    "comments": "Solution template for Visa Threat Intelligence (VTI)"
  },
  "parameters": {
    "location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
      }
    },
    "workspace-location": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "[concat('Region to deploy solution resources -- separate from location selection',parameters('location'))]"
      }
    },
    "workspace": {
      "defaultValue": "",
      "type": "string",
      "metadata": {
        "description": "Workspace name for Log Analytics where Microsoft Sentinel is setup"
      }
    },
    "workbook1-name": {
      "type": "string",
      "defaultValue": "Visa Threat Intelligence Feed Overview",
      "minLength": 1,
      "metadata": {
        "description": "Name for the workbook"
      }
    }
  },
  "variables": {   
    "_solutionName": "Visa Threat Intelligence (VTI)",
    "_solutionVersion": "3.0.5",
    "solutionId": "visa-cyber.azure-sentinel-solution-visathreatintel",
    "_solutionId": "[variables('solutionId')]",
    "analyticRuleObject1": {
      "analyticRuleVersion1": "1.0.0",
      "_analyticRulecontentId1": "7be47078-657a-43cf-9c93-b4705a9f6134",
      "analyticRuleId1": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', '7be47078-657a-43cf-9c93-b4705a9f6134')]",
      "analyticRuleTemplateSpecName1": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('7be47078-657a-43cf-9c93-b4705a9f6134')))]",
      "_analyticRulecontentProductId1": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','7be47078-657a-43cf-9c93-b4705a9f6134','-', '1.0.0')))]"
    },
    "analyticRuleObject2": {
      "analyticRuleVersion2": "1.0.0",
      "_analyticRulecontentId2": "dbd9e28f-973d-47f3-a8c3-9e18da846870",
      "analyticRuleId2": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', 'dbd9e28f-973d-47f3-a8c3-9e18da846870')]",
      "analyticRuleTemplateSpecName2": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-ar-',uniquestring('dbd9e28f-973d-47f3-a8c3-9e18da846870')))]",
      "_analyticRulecontentProductId2": "[concat(take(variables('_solutionId'),50),'-','ar','-', uniqueString(concat(variables('_solutionId'),'-','AnalyticsRule','-','dbd9e28f-973d-47f3-a8c3-9e18da846870','-', '1.0.0')))]"
    },
    "workbookVersion1": "1.0",
    "workbookContentId1": "VTIFeedDashboard",
    "workbookId1": "[resourceId('Microsoft.Insights/workbooks', variables('workbookContentId1'))]",
    "workbookTemplateSpecName1": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-wb-',uniquestring(variables('_workbookContentId1'))))]",
    "_workbookContentId1": "[variables('workbookContentId1')]",
    "workspaceResourceId": "[resourceId('microsoft.OperationalInsights/Workspaces', parameters('workspace'))]",
    "_workbookcontentProductId1": "[concat(take(variables('_solutionId'),50),'-','wb','-', uniqueString(concat(variables('_solutionId'),'-','Workbook','-',variables('_workbookContentId1'),'-', variables('workbookVersion1'))))]",
    "_solutioncontentProductId": "[concat(take(variables('_solutionId'),50),'-','sl','-', uniqueString(concat(variables('_solutionId'),'-','Solution','-',variables('_solutionId'),'-', variables('_solutionVersion'))))]",
    "dataConnectorVersionConnectorDefinition": "1.0.0",
    "dataConnectorVersionConnections": "1.0.0",
    "_dataConnectorContentIdConnectorDefinition": "VisaThreatIntelligenceConnectorTemplateConnectorDefinition",
    "dataConnectorTemplateNameConnectorDefinition": "[concat(parameters('workspace'),'-dc-',uniquestring(variables('_dataConnectorContentIdConnectorDefinition')))]",
    "_dataConnectorContentIdConnections": "VisaThreatIntelligenceConnectorTemplateConnections",
    "dataConnectorTemplateNameConnections": "[concat(parameters('workspace'),'-dc-',uniquestring(variables('_dataConnectorContentIdConnections')))]",
    "_logAnalyticsTableId1": "VisaThreatIntelligenceIOC_CL",
    "_vtiScrollUrl": "[[uri(parameters('visaApiUrl'), '/vti/v1/iocs/search/scroll')]",
    "_vtiSearchlUrl": "[[uri(parameters('visaApiUrl'), '/vti/v1/iocs/search?aggType=true&pageSize=500&scroll=true&sortBy=value')]"
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject1').analyticRuleTemplateSpecName1]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "VTIP_high_severity_domain_AnalyticalRules Analytics Rule with template version 3.0.5",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject1').analyticRuleVersion1]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This will alert when a collision is detected for EmailUrlInfo events with VTI high severity domain IoCs",
                "displayName": "VTI - High Severity Domain Collision Detection",
                "enabled": false,
                "query": "EmailUrlInfo\n| join kind=inner (VisaThreatIntelligenceIOC_CL  | where IOCType == \"domain\" and SourceSeverity == \"High\")\non $left.UrlDomain == $right.Value",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "severity": "High",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "connectorId": "VisaThreatIntelligence",
                    "dataTypes": [
                      "VisaThreatIntelligenceIOC_CL",
                      "EmailUrlInfo"
                    ]
                  }
                ],
                "tactics": [
                  "InitialAccess"
                ],
                "techniques": [
                  "T1566"
                ],
                "entityMappings": [
                  {
                    "entityType": "URL",
                    "fieldMappings": [
                      {
                        "columnName": "Url",
                        "identifier": "Url"
                      }
                    ]
                  },
                  {
                    "entityType": "DNS",
                    "fieldMappings": [
                      {
                        "columnName": "UrlDomain",
                        "identifier": "DomainName"
                      }
                    ]
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "reopenClosedIncident": false,
                    "lookbackDuration": "1h",
                    "matchingMethod": "AllEntities",
                    "enabled": true
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2023-04-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject1').analyticRuleId1,'/'))))]",
              "properties": {
                "description": "Visa Threat Intelligence (VTI) Analytics Rule 1",
                "parentId": "[variables('analyticRuleObject1').analyticRuleId1]",
                "contentId": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject1').analyticRuleVersion1]",
                "source": {
                  "kind": "Solution",
                  "name": "Visa Threat Intelligence (VTI)",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name":  "Visa Inc.",
                  "email": "GDLVTIPSupport@visa.com"
                },
                "support": {
                  "name": "Visa Inc.",
                  "tier": "Partner",
                  "email": "GDLVTIPSupport@visa.com",
                  "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
        "contentKind": "AnalyticsRule",
        "displayName": "VTI - High Severity Domain Collision Detection",
        "contentProductId": "[variables('analyticRuleObject1')._analyticRulecontentProductId1]",
        "id": "[variables('analyticRuleObject1')._analyticRulecontentProductId1]",
        "version": "[variables('analyticRuleObject1').analyticRuleVersion1]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('analyticRuleObject2').analyticRuleTemplateSpecName2]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "VTIP_high_severity_sha1_AnalyticalRules Analytics Rule with template version 3.0.5",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('analyticRuleObject2').analyticRuleVersion2]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.SecurityInsights/AlertRuleTemplates",
              "name": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
              "apiVersion": "2023-02-01-preview",
              "kind": "Scheduled",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "description": "This will alert when a collision is detected for DeviceFileEvents events with VTI high severity SHA1 IoCs",
                "displayName": "VTI - High Severity SHA1 Collision Detection",
                "enabled": false,
                "query": "DeviceFileEvents\n| join kind=inner (VisaThreatIntelligenceIOC_CL  | where IOCType == \"sha1\" and SourceSeverity == \"High\")\non $left.InitiatingProcessSHA1 == $right.Value",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "severity": "High",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "status": "Available",
                "requiredDataConnectors": [
                  {
                    "connectorId": "VisaThreatIntelligence",
                    "dataTypes": [
                      "VisaThreatIntelligenceIOC_CL",
                      "DeviceFileEvents"
                    ]
                  }
                ],
                "tactics": [
                  "Execution"
                ],
                "techniques": [
                  "T1204"
                ],
                "entityMappings": [
                  {
                    "entityType": "Host",
                    "fieldMappings": [
                      {
                        "columnName": "DeviceName",
                        "identifier": "HostName"
                      }
                    ]
                  },
                  {
                    "entityType": "FileHash",
                    "fieldMappings": [
                      {
                        "columnName": "SHA1",
                        "identifier": "Algorithm"
                      },
                      {
                        "columnName": "InitiatingProcessSHA1",
                        "identifier": "Value"
                      }
                    ]
                  }
                ],
                "eventGroupingSettings": {
                  "aggregationKind": "SingleAlert"
                },
                "incidentConfiguration": {
                  "createIncident": true,
                  "groupingConfiguration": {
                    "reopenClosedIncident": false,
                    "lookbackDuration": "1h",
                    "matchingMethod": "AllEntities",
                    "enabled": true
                  }
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2023-04-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('AnalyticsRule-', last(split(variables('analyticRuleObject2').analyticRuleId2,'/'))))]",
              "properties": {
                "description": "Visa Threat Intelligence (VTI) Analytics Rule 2",
                "parentId": "[variables('analyticRuleObject2').analyticRuleId2]",
                "contentId": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
                "kind": "AnalyticsRule",
                "version": "[variables('analyticRuleObject2').analyticRuleVersion2]",
                "source": {
                  "kind": "Solution",
                  "name": "Visa Threat Intelligence (VTI)",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "Visa Inc.",
                  "email": "GDLVTIPSupport@visa.com"
                },
                "support": {
                  "name": "Visa Inc.",
                  "tier": "Partner",
                  "email": "GDLVTIPSupport@visa.com",
                  "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
        "contentKind": "AnalyticsRule",
        "displayName": "VTI - High Severity SHA1 Collision Detection",
        "contentProductId": "[variables('analyticRuleObject2')._analyticRulecontentProductId2]",
        "id": "[variables('analyticRuleObject2')._analyticRulecontentProductId2]",
        "version": "[variables('analyticRuleObject2').analyticRuleVersion2]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('workbookTemplateSpecName1')]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "VTI_IOC_Feed Workbook with template version 3.0.5",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('workbookVersion1')]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "type": "Microsoft.Insights/workbooks",
              "name": "[variables('workbookContentId1')]",
              "location": "[parameters('workspace-location')]",
              "kind": "shared",
              "apiVersion": "2021-08-01",
              "metadata": {
                "description": "Visa Threat Intelligence Feed Dashboard"
              },
              "properties": {
                "displayName": "[parameters('workbook1-name')]",
                "serializedData": "{\"version\":\"Notebook/1.0\",\"items\":[{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"VisaThreatIntelligenceIOC_CL \\n| summarize Count=count() by IOCType\\n| render barchart\",\"size\":0,\"title\":\"IOC by Type\",\"timeContext\":{\"durationMs\":86400000},\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"IOC by Type\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"VisaThreatIntelligenceIOC_CL \\n| summarize Count=count() by SourceSeverity\\n| render barchart\",\"size\":0,\"title\":\"IOC by Severity\",\"timeContext\":{\"durationMs\":86400000},\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"IOC by Severity\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"VisaThreatIntelligenceIOC_CL \\n| summarize Count=count() by Classification\\n| render barchart\",\"size\":0,\"title\":\"IOC Classification\",\"timeContext\":{\"durationMs\":86400000},\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"IOC Classification\"}],\"$schema\":\"https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json\",\"fromTemplateId\":\"sentinel-VisaThreatIntelligence\"}\n",
                "version": "1.0",
                "sourceId": "[variables('workspaceResourceId')]",
                "category": "sentinel"
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2023-04-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('Workbook-', last(split(variables('workbookId1'),'/'))))]",
              "properties": {
                "description": "@{workbookKey=VTIFeedDashboard; logoFileName=Visa_VTI_Logo.svg; description=Visa Threat Intelligence Feed Dashboard; dataTypesDependencies=System.Object[]; dataConnectorsDependencies=System.Object[]; previewImagesFileNames=System.Object[]; version=1.0; title=Visa Threat Intelligence Feed Overview; templateRelativePath=VTI_IOC_Feed.json; subtitle=; provider=Visa}.description",
                "parentId": "[variables('workbookId1')]",
                "contentId": "[variables('_workbookContentId1')]",
                "kind": "Workbook",
                "version": "[variables('workbookVersion1')]",
                "source": {
                  "kind": "Solution",
                  "name": "Visa Threat Intelligence (VTI)",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "Visa Inc.",
                  "email": "GDLVTIPSupport@visa.com"
                },
                "support": {
                  "name": "Visa Inc.",
                  "tier": "Partner",
                  "email": "GDLVTIPSupport@visa.com",
                  "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
                },
                "dependencies": {
                  "operator": "AND",
                  "criteria": [
                    {
                      "contentId": "VisaThreatIntelligenceIOC_CL",
                      "kind": "DataType"
                    },
                    {
                      "contentId": "VisaThreatIntelligence",
                      "kind": "DataConnector"
                    }
                  ]
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('_workbookContentId1')]",
        "contentKind": "Workbook",
        "displayName": "[parameters('workbook1-name')]",
        "contentProductId": "[variables('_workbookcontentProductId1')]",
        "id": "[variables('_workbookcontentProductId1')]",
        "version": "[variables('workbookVersion1')]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('dataConnectorTemplateNameConnectorDefinition'), variables('dataConnectorVersionConnectorDefinition'))]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "contentId": "[variables('_dataConnectorContentIdConnectorDefinition')]",
        "displayName": "[concat(variables('_solutionName'), variables('dataConnectorTemplateNameConnectorDefinition'))]",
        "contentKind": "DataConnector",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('dataConnectorVersionConnectorDefinition')]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('DataConnector-', variables('_dataConnectorContentIdConnectorDefinition')))]",
              "apiVersion": "2022-01-01-preview",
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "properties": {
                "parentId": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectorDefinitions', variables('_dataConnectorContentIdConnectorDefinition'))]",
                "contentId": "[variables('_dataConnectorContentIdConnectorDefinition')]",
                "kind": "DataConnector",
                "version": "[variables('dataConnectorVersionConnectorDefinition')]",
                "source": {
                  "sourceId": "[variables('_solutionId')]",
                  "name": "[variables('_solutionName')]",
                  "kind": "Solution"
                },
                "author": {
                  "name": "Visa Inc."
                },
                "support": {
                  "name": "Visa Inc.",
                  "tier": "Partner",
                  "email": "GDLVTIPSupport@visa.com",
                  "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
                },
                "dependencies": {
                  "criteria": [
                    {
                      "version": "[variables('dataConnectorVersionConnections')]",
                      "contentId": "[variables('_dataConnectorContentIdConnections')]",
                      "kind": "ResourcesDataConnector"
                    }
                  ]
                }
              }
            },
            {
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',variables('_dataConnectorContentIdConnectorDefinition'))]",
              "apiVersion": "2022-09-01-preview",
              "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectorDefinitions",
              "location": "[parameters('workspace-location')]",
              "kind": "Customizable",
              "properties": {
                "connectorUiConfig": {
                  "id": "VisaThreatIntelligenceCCP",
                  "title": "Visa Threat Intelligence",
                  "publisher": "Microsoft",
                  "descriptionMarkdown": "# Visa Threat Intelligence Connector\r\nThis connector collects Indicators of Compromise (IOC) from the Visa Threat Intelligence Platform (VTIP) using HTTP polling and API Key-Shared Secret Authentication (X-Pay Token).",
                  "graphQueriesTableName": "VisaThreatIntelligenceIOC_CL",
                  "graphQueries": [
                    {
                      "metricName": "Total IOCs",
                      "legend": "Visa Threat Intelligence IOCs",
                      "baseQuery": "{{graphQueriesTableName}}"
                    }
                  ],
                  "sampleQueries": [
                    {
                      "description": "All Visa Threat Intelligence IOCs",
                      "query": "{{graphQueriesTableName}}\n| sort by TimeGenerated desc"
                    },
                    {
                      "description": "Sample Visa IOCs",
                      "query": "{{graphQueriesTableName}}\n| take 10"
                    },
                    {
                      "description": "IOC distribution by type",
                      "query": "{{graphQueriesTableName}}\n| summarize count() by IOCType"
                    }
                  ],
                  "dataTypes": [
                    {
                      "name": "VisaThreatIntelligenceIOC_CL",
                      "lastDataReceivedQuery": "VisaThreatIntelligenceIOC_CL\n| where TimeGenerated > ago(12h)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    }
                  ],
                  "connectivityCriteria": [
                    {
                      "type": "HasDataConnectors"
                    }
                  ],
                  "availability": {
                    "isPreview": true,
                    "status": 1
                  },
                  "permissions": {
                    "resourceProvider": [
                      {
                        "provider": "Microsoft.OperationalInsights/workspaces",
                        "permissionsDisplayText": "Read and Write permissions are required.",
                        "providerDisplayName": "Workspace",
                        "scope": "Workspace",
                        "requiredPermissions": {
                          "write": true,
                          "read": true,
                          "delete": true,
                          "action": false
                        }
                      }
                    ],
                    "customs": [
                      {
                        "name": "Visa API access",
                        "description": "Access to Visa Threat Intelligence API: API Key-Shared Secret Authentication (X-Pay Token)"
                      }
                    ]
                  },
                  "instructionSteps": [
                    {
                      "title": "1. Base Configuration",
                      "description": "Configure your Visa API connection",
                      "instructions": [
                        {
                          "type": "Markdown",
                          "parameters": {
                            "content": "## Base Configuration\n\nProvide the base URL for your VTIP API endpoints."
                          }
                        },
                        {
                          "type": "Textbox",
                          "parameters": {
                            "label": "VTIP API endpoints Base URL",
                            "placeholder": "https://api.visa.com",
                            "type": "url",
                            "name": "visaApiUrl",
                            "validations": {
                              "required": true
                            }
                          }
                        },
                        {
                          "type": "InfoMessage",
                          "parameters": {
                            "text": "Enter the base URL of your VTIP API endpoints without trailing slash (e.g., https://api.visa.com)",
                            "visible": true,
                            "inline": true
                          }
                        }
                      ]
                    },
                    {
                      "title": "2. Authentication Configuration",
                      "description": "Provide credentials for X-Pay Token.",
                      "instructions": [
                        {
                          "type": "Markdown",
                          "parameters": {
                            "content": "> Follow Visa Developer Tutorials [API Key and Shared Secret (X-Pay Token)](https://developer.visa.com/pages/working-with-the-visa-api#decrypting-shared-secrets) to get api key and decrypted shared secret"
                          }
                        },
                        {
                          "type": "Textbox",
                          "parameters": {
                            "label": "API Key",
                            "placeholder": "Visa API Key",
                            "type": "password",
                            "name": "apiKey",
                            "validations": {
                              "required": true
                            }
                          }
                        },
                        {
                          "type": "Textbox",
                          "parameters": {
                            "label": "API Secret",
                            "placeholder": "Visa Decrypted Shared Secret",
                            "type": "password",
                            "name": "apiSecret",
                            "validations": {
                              "required": true
                            }
                          }
                        }
                      ]
                    },
                    {
                      "title": "3. Connect",
                      "description": "Enable data ingestion.",
                      "instructions": [
                        {
                          "type": "ConnectionToggleButton",
                          "parameters": {
                            "connectLabel": "Connect",
                            "disconnectLabel": "Disconnect",
                            "name": "toggle"
                          }
                        }
                      ]
                    }
                  ]
                }
              }
            },
            {
              "name": "VisaThreatIntelligenceDCR",
              "apiVersion": "2021-09-01-preview",
              "type": "Microsoft.Insights/dataCollectionRules",
              "location": "[parameters('workspace-location')]",
              "kind": null,
              "properties": {
                "dataCollectionEndpointId": "{{DataCollectionEndpointId}}",
                "streamDeclarations": {
                  "Custom-VisaThreatIntelligenceIOC_CL": {
                    "columns": [
                      {
                        "name": "classification",
                        "type": "string"
                      },
                      {
                        "name": "srcSeverity",
                        "type": "string"
                      },
                      {
                        "name": "srcConfidence",
                        "type": "string"
                      },
                      {
                        "name": "killChain",
                        "type": "string"
                      },
                      {
                        "name": "offense",
                        "type": "string"
                      },
                      {
                        "name": "apt",
                        "type": "boolean"
                      },
                      {
                        "name": "threatActor",
                        "type": "string"
                      },
                      {
                        "name": "expiresOn",
                        "type": "datetime"
                      },
                      {
                        "name": "lastIngestedOn",
                        "type": "datetime"
                      },
                      {
                        "name": "entity",
                        "type": "dynamic"
                      },
                      {
                        "name": "audit",
                        "type": "dynamic"
                      }
                    ]
                  }
                },
                "destinations": {
                  "logAnalytics": [
                    {
                      "workspaceResourceId": "[variables('workspaceResourceId')]",
                      "name": "clv2ws1"
                    }
                  ]
                },
                "dataFlows": [
                  {
                    "streams": [
                      "Custom-VisaThreatIntelligenceIOC_CL"
                    ],
                    "destinations": [
                      "clv2ws1"
                    ],
                    "outputStream": "Custom-VisaThreatIntelligenceIOC_CL",
                    "transformKql": "source | extend TimeGenerated = iff(isempty(audit.createdOn), now(), todatetime(audit.createdOn)) , IOCType = tostring(entity.type) , Value = tostring(entity.value) , Classification = ['classification'] , SourceSeverity = ['srcSeverity'] , SourceConfidence = ['srcConfidence'] , KillChain = ['killChain'] , Offense = ['offense'] , IsApt = ['apt'] , ThreatActor = ['threatActor'] , ExpiresOn = ['expiresOn'] , CreatedOn = todatetime(audit.createdOn) , UpdatedOn = todatetime(audit.updatedOn) , LastIngestedOn = ['lastIngestedOn'] | project TimeGenerated , IOCType , Value , Classification , SourceSeverity , SourceConfidence , KillChain , Offense , IsApt , ThreatActor , ExpiresOn , CreatedOn , UpdatedOn , LastIngestedOn"
                  }
                ]
              }
            },
            {
              "name": "[variables('_logAnalyticsTableId1')]",
              "apiVersion": "2021-03-01-privatepreview",
              "type": "Microsoft.OperationalInsights/workspaces/tables",
              "location": "[parameters('workspace-location')]",
              "kind": null,
              "properties": {
                "retentionInDays": 90,
                "schema": {
                  "name": "[variables('_logAnalyticsTableId1')]",
                  "description": "Visa Threat Intelligence IOC data (prototype schema)",
                  "columns": [
                    {
                      "name": "TimeGenerated",
                      "type": "datetime",
                      "isDefaultDisplay": true
                    },
                    {
                      "name": "IOCType",
                      "type": "string",
                      "description": "Type of the IOC"
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "IOC Value"
                    },
                    {
                      "name": "Classification",
                      "type": "string",
                      "description": "Classification of the IOC"
                    },
                    {
                      "name": "SourceSeverity",
                      "type": "string",
                      "description": "Severity level of the IOC"
                    },
                    {
                      "name": "SourceConfidence",
                      "type": "string",
                      "description": "Confidence level of the IOC"
                    },
                    {
                      "name": "KillChain",
                      "type": "string",
                      "description": "KillChain of the IOC"
                    },
                    {
                      "name": "Offense",
                      "type": "string",
                      "description": "Offense associated with the IOC"
                    },
                    {
                      "name": "IsApt",
                      "type": "boolean",
                      "description": "Indicates if the IOC is associated with a known APT"
                    },
                    {
                      "name": "ThreatActor",
                      "type": "string",
                      "description": "Threat actor associated with the IOC"
                    },
                    {
                      "name": "ExpiresOn",
                      "type": "datetime",
                      "description": "Specifies when the IOC will expire"
                    },
                    {
                      "name": "CreatedOn",
                      "type": "datetime",
                      "description": "Specifies when the IOC was created"
                    },
                    {
                      "name": "UpdatedOn",
                      "type": "datetime",
                      "description": "Specifies when the IOC was last updated"
                    },
                    {
                      "name": "LastIngestedOn",
                      "type": "datetime",
                      "description": "Specifies when the IOC was ingested"
                    }
                  ]
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "contentProductId": "[concat(substring(variables('_solutionId'), 0, 50),'-','dc','-', uniqueString(concat(variables('_solutionId'),'-','DataConnector','-',variables('_dataConnectorContentIdConnectorDefinition'),'-', variables('dataConnectorVersionConnectorDefinition'))))]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "version": "[variables('_solutionVersion')]"
      }
    },
    {
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',variables('_dataConnectorContentIdConnectorDefinition'))]",
      "apiVersion": "2022-09-01-preview",
      "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectorDefinitions",
      "location": "[parameters('workspace-location')]",
      "kind": "Customizable",
      "properties": {
        "connectorUiConfig": {
          "id": "VisaThreatIntelligenceCCP",
          "title": "Visa Threat Intelligence",
          "publisher": "Microsoft",
          "descriptionMarkdown": "# Visa Threat Intelligence Connector\r\nThis connector collects Indicators of Compromise (IOC) from the Visa Threat Intelligence Platform (VTIP) using HTTP polling and API Key-Shared Secret Authentication (X-Pay Token).",
          "graphQueriesTableName": "VisaThreatIntelligenceIOC_CL",
          "graphQueries": [
            {
              "metricName": "Total IOCs",
              "legend": "Visa Threat Intelligence IOCs",
              "baseQuery": "{{graphQueriesTableName}}"
            }
          ],
          "sampleQueries": [
            {
              "description": "All Visa Threat Intelligence IOCs",
              "query": "{{graphQueriesTableName}}\n| sort by TimeGenerated desc"
            },
            {
              "description": "Sample Visa IOCs",
              "query": "{{graphQueriesTableName}}\n| take 10"
            },
            {
              "description": "IOC distribution by type",
              "query": "{{graphQueriesTableName}}\n| summarize count() by IOCType"
            }
          ],
          "dataTypes": [
            {
              "name": "VisaThreatIntelligenceIOC_CL",
              "lastDataReceivedQuery": "VisaThreatIntelligenceIOC_CL\n| where TimeGenerated > ago(12h)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            }
          ],
          "connectivityCriteria": [
            {
              "type": "HasDataConnectors"
            }
          ],
          "availability": {
            "isPreview": true,
            "status": 1
          },
          "permissions": {
            "resourceProvider": [
              {
                "provider": "Microsoft.OperationalInsights/workspaces",
                "permissionsDisplayText": "Read and Write permissions are required.",
                "providerDisplayName": "Workspace",
                "scope": "Workspace",
                "requiredPermissions": {
                  "write": true,
                  "read": true,
                  "delete": true,
                  "action": false
                }
              }
            ],
            "customs": [
              {
                "name": "Visa API access",
                "description": "Access to Visa Threat Intelligence API: API Key-Shared Secret Authentication (X-Pay Token)"
              }
            ]
          },
          "instructionSteps": [
            {
              "title": "1. Base Configuration",
              "description": "Configure your Visa API connection",
              "instructions": [
                {
                  "type": "Markdown",
                  "parameters": {
                    "content": "## Base Configuration\n\nProvide the base URL for your VTIP API endpoints."
                  }
                },
                {
                  "type": "Textbox",
                  "parameters": {
                    "label": "VTIP API endpoints Base URL",
                    "placeholder": "https://api.visa.com",
                    "type": "url",
                    "name": "visaApiUrl",
                    "validations": {
                      "required": true
                    }
                  }
                },
                {
                  "type": "InfoMessage",
                  "parameters": {
                    "text": "Enter the base URL of your VTIP API endpoints without trailing slash (e.g., https://api.visa.com)",
                    "visible": true,
                    "inline": true
                  }
                }
              ]
            },
            {
              "title": "2. Authentication Configuration",
              "description": "Provide credentials for X-Pay Token.",
              "instructions": [
                {
                  "type": "Markdown",
                  "parameters": {
                    "content": "> Follow Visa Developer Tutorials [API Key and Shared Secret (X-Pay Token)](https://developer.visa.com/pages/working-with-the-visa-api#decrypting-shared-secrets) to get api key and decrypted shared secret"
                  }
                },
                {
                  "type": "Textbox",
                  "parameters": {
                    "label": "API Key",
                    "placeholder": "Visa API Key",
                    "type": "password",
                    "name": "apiKey",
                    "validations": {
                      "required": true
                    }
                  }
                },
                {
                  "type": "Textbox",
                  "parameters": {
                    "label": "API Secret",
                    "placeholder": "Visa Decrypted Shared Secret",
                    "type": "password",
                    "name": "apiSecret",
                    "validations": {
                      "required": true
                    }
                  }
                }
              ]
            },
            {
              "title": "3. Connect",
              "description": "Enable data ingestion.",
              "instructions": [
                {
                  "type": "ConnectionToggleButton",
                  "parameters": {
                    "connectLabel": "Connect",
                    "disconnectLabel": "Disconnect",
                    "name": "toggle"
                  }
                }
              ]
            }
          ]
        }
      }
    },
    {
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('DataConnector-', variables('_dataConnectorContentIdConnectorDefinition')))]",
      "apiVersion": "2022-01-01-preview",
      "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
      "properties": {
        "parentId": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectorDefinitions', variables('_dataConnectorContentIdConnectorDefinition'))]",
        "contentId": "[variables('_dataConnectorContentIdConnectorDefinition')]",
        "kind": "DataConnector",
        "version": "[variables('dataConnectorVersionConnectorDefinition')]",
        "source": {
          "sourceId": "[variables('_solutionId')]",
          "name": "[variables('_solutionName')]",
          "kind": "Solution"
        },
        "author": {
          "name": "Visa Inc."
        },
        "support": {
          "name": "Visa Inc.",
          "tier": "Partner",
          "email": "GDLVTIPSupport@visa.com",
          "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
        },
        "dependencies": {
          "criteria": [
            {
              "version": "[variables('dataConnectorVersionConnections')]",
              "contentId": "[variables('_dataConnectorContentIdConnections')]",
              "kind": "ResourcesDataConnector"
            }
          ]
        }
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('dataConnectorTemplateNameConnections'), variables('dataConnectorVersionConnections'))]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "contentId": "[variables('_dataConnectorContentIdConnections')]",
        "displayName": "[concat(variables('_solutionName'), variables('dataConnectorTemplateNameConnections'))]",
        "contentKind": "ResourcesDataConnector",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('dataConnectorVersionConnections')]",
          "parameters": {
            "connectorDefinitionName": {
              "defaultValue": "connectorDefinitionName",
              "type": "string",
              "minLength": 1
            },
            "workspace": {
              "defaultValue": "[parameters('workspace')]",
              "type": "string"
            },
            "dcrConfig": {
              "defaultValue": {
                "dataCollectionEndpoint": "data collection Endpoint",
                "dataCollectionRuleImmutableId": "data collection rule immutableId"
              },
              "type": "object"
            },
            "visaApiUrl": {
              "defaultValue": "visaApiUrl",
              "type": "string"
            },
            "apiKey": {
              "defaultValue": "apiKey",
              "type": "securestring"
            },
            "apiSecret": {
              "defaultValue": "apiSecret",
              "type": "securestring"
            }
          },
          "variables": {
            "_dataConnectorContentIdConnections": "[variables('_dataConnectorContentIdConnections')]"
          },
          "resources": [
            {
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('DataConnector-', variables('_dataConnectorContentIdConnections')))]",
              "apiVersion": "2022-01-01-preview",
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "properties": {
                "parentId": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectors', variables('_dataConnectorContentIdConnections'))]",
                "contentId": "[variables('_dataConnectorContentIdConnections')]",
                "kind": "ResourcesDataConnector",
                "version": "[variables('dataConnectorVersionConnections')]",
                "source": {
                  "sourceId": "[variables('_solutionId')]",
                  "name": "[variables('_solutionName')]",
                  "kind": "Solution"
                },
                "author": {
                  "name": "Visa Inc."
                },
                "support": {
                  "name": "Visa Inc.",
                  "tier": "Partner",
                  "email": "GDLVTIPSupport@visa.com",
                  "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
                }
              }
            },
            {
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', 'dataPoller')]",
              "apiVersion": "2022-12-01-preview",
              "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectors",
              "location": "[parameters('workspace-location')]",
              "kind": "RestApiPoller",
              "properties": {
                "auth": {
                  "type": "VisaXpayToken",
                  "ApiKey": "[[parameters('apiKey')]",
                  "ApiKeyName": "apikey",
                  "ApiKeyIdentifier": "apikey",
                  "ApiSecret": "[[parameters('apiSecret')]",
                  "ApiSecretName": "shared_secret",
                  "IsApiKeyInPostPayload": false
                },
                "request": {
                  "apiEndpoint": "[variables('_vtiSearchlUrl')]",
                  "httpMethod": "POST",
                  "queryWindowInMin": 5,
                  "retryCount": 4,
                  "timeoutInSeconds": 60,
                  "isPostPayloadJson": true,
                  "headers": {
                    "Content-Type": "application/json",
                    "Accept": "application/json"
                  },
                  "queryParameters": {
                    "valueWildcard": "*",
                    "updatedSince": "{_QueryWindowStartTime}"
                  }
                },
                "response": {
                  "eventsJsonPaths": [
                    "$.results"
                  ],
                  "format": "json"
                },
                "paging": {
                  "pagingType": "NextPageUrl",
                  "nextPageUrl": "[variables('_vtiScrollUrl')]",
                  "NextPageParaName": "scrollId",
                  "nextPageTokenJsonPath": "$.scrollId",
                  "nextPageHttpMethod": "GET"
                },
                "connectorDefinitionName": "[[parameters('connectorDefinitionName')]",
                "dataType": "Custom-VisaThreatIntelligenceIOC_CL",
                "dcrConfig": {
                  "streamName": "Custom-VisaThreatIntelligenceIOC_CL",
                  "dataCollectionEndpoint": "[[parameters('dcrConfig').dataCollectionEndpoint]",
                  "dataCollectionRuleImmutableId": "[[parameters('dcrConfig').dataCollectionRuleImmutableId]"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "contentProductId": "[concat(substring(variables('_solutionId'), 0, 50),'-','rdc','-', uniqueString(concat(variables('_solutionId'),'-','ResourcesDataConnector','-',variables('_dataConnectorContentIdConnections'),'-', variables('dataConnectorVersionConnections'))))]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "version": "[variables('_solutionVersion')]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentPackages",
      "apiVersion": "2023-04-01-preview",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "version": "3.0.5",
        "kind": "Solution",
        "contentSchemaVersion": "3.0.0",
        "displayName": "Visa Threat Intelligence (VTI)",
        "publisherDisplayName": "Visa Inc.",
        "descriptionHtml": "<p><strong>Note:</strong> Please refer to the following before installing the solution:</p>\n<p>\u2022 Review the solution <a href=\"https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/Visa%20Threat%20Intelligence%20%28VTI%29/ReleaseNotes.md\">Release Notes</a></p>\n<p>\u2022 There may be <a href=\"https://aka.ms/sentinelsolutionsknownissues\">known issues</a> pertaining to this Solution, please refer to them before installing.</p>\n<p>Visa Threat Intelligence (VTI) is a Microsoft Sentinel solution that provides insights into global cyber threats, leveraging Visa's extensive threat intelligence data. This solution enables security teams to proactively identify and respond to emerging threats, enhancing their overall security posture. By integrating VTI with Microsoft Sentinel, organizations can benefit from real-time threat intelligence, advanced analytics, and automated response capabilities to protect their digital assets effectively.</p>\n<p><strong>Data Connectors:</strong> 1, <strong>Workbooks:</strong> 1, <strong>Analytic Rules:</strong> 2</p>\n<p><a href=\"https://aka.ms/azuresentinel\">Learn more about Microsoft Sentinel</a> | <a href=\"https://aka.ms/azuresentinelsolutionsdoc\">Learn more about Solutions</a></p>\n",
        "contentKind": "Solution",
        "contentProductId": "[variables('_solutioncontentProductId')]",
        "id": "[variables('_solutioncontentProductId')]",
        "icon": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/Visa_VTI_Logo.svg\" width=\"75px\" height=\"75px\">",
        "contentId": "[variables('_solutionId')]",
        "parentId": "[variables('_solutionId')]",
        "source": {
          "kind": "Solution",
          "name": "Visa Threat Intelligence (VTI)",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "Visa Inc.",
          "email": "GDLVTIPSupport@visa.com"
        },
        "support": {
          "name": "Visa Inc.",
          "tier": "Partner",
          "email": "GDLVTIPSupport@visa.com",
          "link": "https://developer.visa.com/capabilities/visa_threat_intelligence"
        },
        "dependencies": {
          "operator": "AND",
          "criteria": [
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject1')._analyticRulecontentId1]",
              "version": "[variables('analyticRuleObject1').analyticRuleVersion1]"
            },
            {
              "kind": "AnalyticsRule",
              "contentId": "[variables('analyticRuleObject2')._analyticRulecontentId2]",
              "version": "[variables('analyticRuleObject2').analyticRuleVersion2]"
            },
            {
              "kind": "Workbook",
              "contentId": "[variables('_workbookContentId1')]",
              "version": "[variables('workbookVersion1')]"
            },
            {
              "kind": "DataConnector",
              "contentId": "[variables('_dataConnectorContentIdConnectorDefinition')]",
              "version": "[variables('dataConnectorVersionConnectorDefinition')]"
            }
          ]
        },
        "firstPublishDate": "2026-02-20",
        "lastPublishDate": "2026-02-20",
        "providers": [
          "Visa Inc."
        ],
        "categories": {
          "domains": [
            "Security - Threat Intelligence"
          ]
        }
      },
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_solutionId'))]"
    }
  ],
  "outputs": {}
}
