Parser:
  Title: Cisco ASA Network Sessions
  Version: '0.0'
  LastUpdated: June 20, 2021
Product:
  Name: Cisco
Normalization:
  Schema: NetworkSessions
  Version: '0.1.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com/azure/azure-monitor/log-query/function
- Title: Network Sessions schema documentation
  Link: https://aka.ms/AzSentinelNetworkSessionsDoc
Description: |
  This is a Query Parser that is used to map Cisco ASA Events (CommonSecurityLogs) to the Azure Sentinel Information Model Network Sessions schema.
ParserName: vimNwSCiscoASA
ParserQuery: |
  let CiscoASA_Network_NormalizedParser=(){CommonSecurityLog 
  | where DeviceVendor == "Cisco" 
  | where DeviceProduct =="ASA"
  | where isnotempty(DeviceAction)
  | extend EventSchemaVersion="1.0.0"
    , EventCount=toint(1) 
    , EventVendor = "Cisco"
    , EventProduct = "ASA"
    , EventTimeIngested = ingestion_time()
    | project-rename 
    DvcAction=DeviceAction,
      NetworkProtocol = Protocol, 
      EventMessage = Message, 
    SrcIpAddr=SourceIP,
      DstIpAddr=DestinationIP,
      DstPortNumber=DestinationPort,
      SrcPortNumber=SourcePort
  };
  CiscoASA_Network_NormalizedParser