id: a12cac64-ea6d-46d4-91a6-262b165fb9ad
name: Group quarantine release
description: |
  This query helps in reviewing group released messages by detection type. Useful to see what is leading to the largest number of messages being released.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
      - CloudAppEvents
tactics:
  - Initial access
query: |
  CloudAppEvents 
  | where ActionType == "QuarantineReleaseMessage"
  | extend parsed=parse_json(RawEventData)
  | extend NetworkMessageId = tostring(parsed.NetworkMessageId)
  | join EmailEvents on NetworkMessageId
  | summarize count() by DetectionMethods
  | order by count_ desc
