id: 9f135aef-ad25-4df2-bdab-8399978a36a2
name: Quarantine release trend
description: |
  This query helps reviewing quarantine release trend
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - Initial access
query: |
  CloudAppEvents
  | where ActionType == "QuarantineReleaseMessage"
  | summarize count() by bin(Timestamp, 1d)
  | project-rename Releases = count_
  | render timechart with (title="Qurantine Releases by Day")
