Id: 98b2ce21-167d-43bd-a496-9f2c85c5f95b
DisplayName: Accounts With Several Failed Logins Immediately Followed By A Successful Login
Description: Accounts With Several Failed Logins immediately Followed By A Successful Login during the range of -1w and +1w
InputEntityType: Host
InputFields:
  - HostName + NTDomain
  - HostName + DnsDomain
OutputEntityTypes:
  - Account
QueryPeriodBefore: 1w
QueryPeriodAfter: 1w
DataSource: SecurityEvent
Tactics:
  - LateralMovement
  - CredentialAccess
query: | 

  let BRUTEFORCE_THRESHOLD = 10;
  let SuccessfulLoginEventId = 4624;
  let FailedLoginEventId = 4625;
  let AccountsPossibleSuccessfulBruteForce = (v_Host_HostName:string, v_Host_NTDomain:string, v_Host_DnsDomain:string){
  SecurityEvent
  | where AccountType == 'User'
    and tolower(Computer) startswith tolower(v_Host_HostName) 
    and (
         (isnotempty(v_Host_NTDomain) and tolower(Computer) contains tolower(v_Host_NTDomain)) or
         (isnotempty(v_Host_DnsDomain) and tolower(Computer) endswith tolower(v_Host_DnsDomain))
        )
  | extend Fails = (EventID == FailedLoginEventId), Success = (EventID == SuccessfulLoginEventId)
  | extend Account = tolower(Account)
  | summarize Account_Aux_SuccessPerMin = sum(Success), Account_Aux_FailPerMin = sum(Fails) by Account, bin(TimeGenerated, 1m)
  | where Account_Aux_FailPerMin	> BRUTEFORCE_THRESHOLD and Account_Aux_SuccessPerMin	> 0
  | extend EventData = pack('FailPerMin',Account_Aux_FailPerMin, 'SuccessPerMin', Account_Aux_SuccessPerMin, 'Time', TimeGenerated )
  | summarize Max = max(Account_Aux_FailPerMin), Account_Aux_EventsData=makeset(EventData) by Account
  | top 10 by Max
  | parse Account with Account_NTDomain '\\' *
  | extend Account_Name = extract(@'^([^\\]*\\)?([^@]+)(@.*)?$',2,Account),  
   Account_UPNSuffix = extract(@'^([^\\]*\\)?([^@]+)(@(.*))?$',4,Account)
  | project Account_Name, Account_NTDomain, Account_UPNSuffix, Account_Aux_EventsData
  };
  AccountsPossibleSuccessfulBruteForce('<HostName>','<NTDomain>','<DnsDomain>')