Id: bb6100ee-ae38-41b5-8457-88d503a3bf8f
DisplayName: Least Prevalent Inbound Network Connection Sources
Description: Bottom 10 (least prevalent) inbound network connection sources for a given host (set time range to +-30m when running the query)
InputEntityType: Host
InputFields:
  - HostName
OutputEntityTypes:
  - Ip
QueryPeriodBefore: 30m
QueryPeriodAfter: 30m
DataSources:
  - _Im_NetworkSession
Tactics:
  - Discovery
  - LateralMovement
  - Collection
query: |
  let GetWireDataInboundWithHost = (v_Host_HostName:string){
  _Im_NetworkSession(hostname_has_any=v_Host_HostName)
  | where EventResult =~ "success"
  | where NetworkDirection =~ "Inbound"
  | extend LocalAppName = column_ifexists("LocalAppName", "")
  | extend info = pack('Computer', DvcHostname, 'LocalPortNumber', DstPortNumber, 'DstIpAddr', Dst, 'SrcIpAddr', Src,'Direction', NetworkDirection, 'NetworkProtocol', NetworkProtocol, "LocalAppName", LocalAppName)
  | summarize Process_Aux_Min_SessionStartTime=min(TimeGenerated), Process_Aux_Max_SessionStartTime=max(TimeGenerated), count(), IP_Aux_info = make_set(info, maxSize=1000) by Src, Dvc
  | top 10 by count_ asc
  | project-rename IP_Address=Src
  };
  // change <HostName> value below
  GetWireDataInboundWithHost('<HostName>')
