Id: 07da3cc8-c8ad-4710-a44e-334cdcb7882b
DisplayName: Parent processes running on host
Description: Any 4688 event that contains parent process running on a given host during the time of or recently after compromise (set time range to +-10m when running the query)
InputEntityType: Host
InputFields:
  - HostName
OutputEntityTypes:
  - Process
QueryPeriodBefore: 10m
QueryPeriodAfter: 10m
DataSources:
  - SecurityEvent
Tactics:
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let GetParentProcessesOnHost = (v_Host_HostName:string){
  SecurityEvent 
  | where EventID == 4688 
  | where isnotempty(ParentProcessName)
  // excluding well known processes, feel free to add more specific to the environment
  | where NewProcessName !contains ':\\Windows\\System32\\conhost.exe' and ParentProcessName !contains ':\\Windows\\System32\\conhost.exe'
    and NewProcessName !contains ':\\Windows\\Microsoft.NET\\Framework64\\v2.0.50727\\csc.exe' and ParentProcessName !contains ':\\Windows\\Microsoft.NET\\Framework64\\v2.0.50727\\csc.exe'
    and NewProcessName !contains ':\\Windows\\Microsoft.NET\\Framework64\\v2.0.50727\\cvtres.exe' and ParentProcessName !contains ':\\Windows\\Microsoft.NET\\Framework64\\v2.0.50727\\cvtres.exe'
    and NewProcessName!contains ':\\Program Files\\Microsoft Monitoring Agent\\Agent\\MonitoringHost.exe' and ParentProcessName !contains ':\\Program Files\\Microsoft Monitoring Agent\\Agent\\MonitoringHost.exe'
    and ParentProcessName !contains ':\\Windows\\CCM\\CcmExec.exe'
  // excluding well known parent process, child process combinations, feel free to add more specific to the environment
  | where(ParentProcessName !contains ':\\Windows\\System32\\svchost.exe' and (NewProcessName !contains ':\\Windows\\System32\\wbem\\WmiPrvSE.exe' or NewProcessName !contains ':\\Windows\\SysWOW64\\wbem\\WmiPrvSE.exe'))
  | where(ParentProcessName !contains ':\\Windows\\System32\\services.exe' and NewProcessName !contains ':\\Windows\\servicing\\TrustedInstaller.exe')
  | where toupper(Computer) contains v_Host_HostName or toupper(WorkstationName) contains v_Host_HostName
  | extend info = pack('EventID', EventID, 'TargetAccount', TargetAccount)
  | summarize min(TimeGenerated), max(TimeGenerated), Process_Aux_info = makeset(info) by Account, Computer, ParentProcessName, NewProcessName, CommandLine, ProcessId
  | project min_TimeGenerated, max_TimeGenerated, Account, Computer, ParentProcessName, NewProcessName, CommandLine, ProcessId, Process_Aux_info
  | project-rename Process_Host_UnstructuredName=Computer, Process_Account_UnstructuredName=Account, Process_CommandLine=CommandLine, Process_ProcessId=ProcessId, Process_ImageFile_FullPath=NewProcessName, Process_ParentProcess_ImageFile_FullPath=ParentProcessName, Process_Aux_StartTime = min_TimeGenerated, Process_Aux_EndTime= max_TimeGenerated
  | top 10 by Process_Aux_StartTime asc
  };
  // change <HostName> value below
  GetParentProcessesOnHost(toupper('<HostName>'))
