id: 274a2fc6-eda0-430d-9e02-7a7c0850eb0e
Function:
  Title: Parser for ASimDnsMicrosoftNXLog
  Version: '1.0.0'
  LastUpdated: '2023-08-23'
Category: Microsoft Sentinel Parser
FunctionName: ASimDnsMicrosoftNXLog
FunctionAlias: ASimDnsMicrosoftNXLog
FunctionQuery: |
  _Im_Dns
  | where EventVendor == "Microsoft" and EventProduct == "DNS Server"