id: 378781a9-aef0-446a-9822-a8beb70835e7
Function:
  Title: Parser for Exchange events
  Version: '1.0.0'
  LastUpdated: '2026-01-01'
Category: Microsoft Sentinel Parser
FunctionName: imExchangeEventFilewallM365
FunctionAlias: imExchangeEventFilewallM365
FunctionQuery: |
  FilewallExchange_CL
  | extend EventStartTime = TimeGenerated, EventEndTime = TimeGenerated,
          EventOriginalType = tostring(event_type),
          EventType = case(status =~ "blocked" or status =~ "failed", "ThreatInfo", status =~ "succeed", "Informational", "Informational"),
          EventResult = case(status =~ "blocked", 'Blocked', status =~ "failed", "Failure", status =~ "succeed", "Success", "NA"),
          EventOriginalResultDetails = coalesce(state, summary),
          EventSeverity = case(status =~ "blocked", "High", status =~ "failed", "Medium", "Informational"),
          EventVendor = "ODI-X",
          EventProduct = "Filewall for Microsoft 365",
          EventUid = tostring(event_id),
          EmailSubject = subject,
          EmailSenderFrom = sender,
          EmailRecipientTo = recipient,
          EmailNetworkMessageId = mail_id,
          AlertPolicyId = policy_id,
          AlertPolicyName = policy_name,
          User = recipient,
          ActorUsername = sender,
          Dvc = application,
          DvcHostname = application,
          EventSchema = "Alert",
          EventSchemaVersion = "0.1.0",
          EventCount = int(1)
  | project TimeGenerated, EventStartTime, EventEndTime, EventUid, EventType, EventOriginalType, EventResult, EventOriginalResultDetails, EventSeverity, EventVendor, EventProduct, EventSchema, EventSchemaVersion, EventCount, Dvc, DvcHostname, User, ActorUsername, EmailSubject, EmailSenderFrom, EmailRecipientTo, EmailNetworkMessageId, AlertPolicyId, AlertPolicyName, application, event_id, timestamp, status, state, summary, attachments, release_timestamp, release_by_admin, release_reason