id: d890d753-96fe-4439-9103-b75040758924
Function:
  Title: Parser for File events
  Version: '1.0.0'
  LastUpdated: '2026-01-01'
Category: Microsoft Sentinel Parser
FunctionName: imFileEventFilewallM365
FunctionAlias: imFileEventFilewallM365
FunctionQuery: |
  FilewallFile_CL
  | extend EventStartTime = TimeGenerated, EventEndTime = TimeGenerated,
          EventOriginalType = tostring(event_type),
          EventType = case(status =~ "blocked", "FileBlocked", status =~ "succeed", "FileModified", status =~ "failed", "FileError", "FileEvent"),
          EventResult = case(status =~ "blocked", 'Blocked', status =~ "failed", "Failure", status =~ "succeed", "Success", "NA"),
          EventOriginalResultDetails = coalesce(block_reason, state, summary),
          EventSeverity = case(status =~ "blocked", "High", status =~ "failed", "Medium", "Informational"),
          EventVendor = "ODI-X",
          EventProduct = "Filewall for Microsoft 365",
          TargetFileName = name,
          TargetFilePath = path,
          TargetFilePathType = application,
          TargetFileExtension = file_type,
          TargetFileSize = tolong(size),
          TargetFileHashSha1 = coalesce(new_sha1, original_sha1),
          TargetFileHashSha256 = coalesce(new_sha256, original_sha256),
          ActorUsername = owner,
          ActorUserType = "Regular",
          User = owner,
          DvcHostname = coalesce(site_name, drive_name),
          Dvc = coalesce(site_name, drive_name),
          EventSchema = "FileEvent",
          EventSchemaVersion = "0.2.2",
          EventCount = int(1)
  | project TimeGenerated, EventStartTime, EventEndTime, EventType, EventOriginalType, EventResult, EventOriginalResultDetails, EventSeverity, EventVendor, EventProduct, EventSchema, EventSchemaVersion, EventCount, Dvc, DvcHostname, ActorUsername, ActorUserType, User, TargetFileName, TargetFilePath, TargetFilePathType, TargetFileExtension, TargetFileSize, TargetFileHashSha1, TargetFileHashSha256, application, event_id, timestamp, status, state, policy_id, policy_name, block_reason, summary, drive_name, site_name, new_sha1, original_sha1, new_sha256, original_sha256, version
