id: c07d24d5-7c97-4ac4-873e-b364695df045
name: qakbot-campaign-process-injection
description: |
  This query was originally published in the threat analytics report, Qakbot blight lingers, seeds ransomware
  Qakbot is malware that steals login credentials from banking and financial services. It has been deployed against small businesses as well as major corporations. Some outbreaks have involved targeted ransomware campaigns that use a similar set of techniques. Links to related queries are listed under See also.
  The following query detects if Qakbot has injected code into the ping.exe process, to evade security and access credentials.
  Reference - https://www.microsoft.com/security/blog/2017/11/06/mitigating-and-eliminating-info-stealing-qakbot-and-emotet-in-corporate-networks/
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
- Defense evasion
- Credential Access
query: |
  DeviceProcessEvents
  | where FileName == "esentutl.exe"
  | where ProcessCommandLine has "WebCache"
  | where ProcessCommandLine has_any ("V01", "/s", "/d")
  | project ProcessCommandLine, InitiatingProcessParentFileName, 
  DeviceId, Timestamp
