id: 7e6731b8-bbed-4846-b934-6702fb8b5b71
name: Azure RBAC AKS role assignment
description: |
  'Identifies Azure RBAC AKS role assignment.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureKubernetes
    dataTypes:
      - AzureActivity
queryFrequency: 20m
queryPeriod: 20m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1098
  - T1548
query: |
    AzureActivity
    | where OperationName == "Create role assignment"
    | extend RoleDef = tostring(parse_json(tostring(parse_json(tostring(parse_json(Properties).requestbody)).Properties)).RoleDefinitionId)
    | extend  Caller = tostring(parse_json(tostring(parse_json(tostring(parse_json(Properties).requestbody)).Properties)).Caller)
    | where RoleDef contains "8e3af657-a8ff-443c-a75c-2fe8c4bcb635" or RoleDef contains "b24988ac-6180-42a0-ab88-20f7382dd24c"
    | project Caller, CallerIpAddress, HTTPRequest, ResourceId
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Caller
   - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: ResourceId
   - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
   - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: HTTPRequest
version: 1.0.0
kind: Scheduled
