{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "variables": {
        "analyticsRuleId": "3855767f-ac67-4979-9db7-da6f70144ae9",
        "automationRuleId": "a78f9a1e-7c47-4ce4-8214-c3fdace2fc62"
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/', variables('analyticsRuleId'))]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('analyticsRuleId'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "NRT",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "Halcyon - New Alert Detected",
                "description": "Creates one Sentinel incident per new Halcyon alert. Deduplicates using a self-join on Halcyon_Commands_CL and an anti-join on SecurityAlert to skip already-processed alerts.",
                "severity": "High",
                "enabled": true,
                "query": "Halcyon_Commands_CL\n| where TimeGenerated > ago(1m)\n| summarize arg_max(TimeGenerated, *) by HalcyonAlertId\n| join kind=leftanti (\n    Halcyon_Commands_CL\n    | where TimeGenerated between (ago(20m) .. ago(1m))\n    | summarize by HalcyonAlertId\n) on HalcyonAlertId\n| join kind=leftanti (\n    SecurityAlert\n    | where TimeGenerated > ago(14d)\n    | where AlertName has \"Halcyon\"\n    | extend HalcyonAlertId = tostring(ExtendedProperties[\"HalcyonAlertId\"])\n    | where isnotempty(HalcyonAlertId)\n    | project HalcyonAlertId\n) on HalcyonAlertId\n| extend DeviceName = tostring(device.hostname)\n| extend AlertKind = tostring(finding_info.title)",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "Execution",
                    "Impact"
                ],
                "techniques": [
                    "T1486"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "requiredDataConnectors": [
                    {
                        "dataTypes": [
                            "Halcyon_Commands_CL"
                        ],
                        "connectorId": "HalcyonPush"
                    }
                ],
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT1H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": ["HalcyonAlertId"]
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "customDetails": {
                    "HalcyonAlertId": "HalcyonAlertId",
                    "AlertKind": "AlertKind"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "Halcyon Alert: {{HalcyonAlertId}}",
                    "alertDynamicProperties": []
                },
                "entityMappings": [
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "columnName": "DeviceName",
                                "identifier": "HostName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        },
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/automationRules/', variables('automationRuleId'))]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('automationRuleId'))]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/automationRules",
            "apiVersion": "2023-12-01-preview",
            "dependsOn": [
                "[resourceId('Microsoft.OperationalInsights/workspaces/providers/alertRules', parameters('workspace'), 'Microsoft.SecurityInsights', variables('analyticsRuleId'))]"
            ],
            "properties": {
                "displayName": "Halcyon - Tag Incidents",
                "order": 1,
                "triggeringLogic": {
                    "isEnabled": true,
                    "triggersOn": "Incidents",
                    "triggersWhen": "Created",
                    "conditions": [
                        {
                            "conditionType": "Property",
                            "conditionProperties": {
                                "propertyName": "IncidentRelatedAnalyticRuleIds",
                                "operator": "Contains",
                                "propertyValues": [
                                    "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/', variables('analyticsRuleId'))]"
                                ]
                            }
                        }
                    ]
                },
                "actions": [
                    {
                        "order": 1,
                        "actionType": "AddLabels",
                        "actionConfiguration": {
                            "labels": [
                                {
                                    "labelName": "Halcyon"
                                }
                            ]
                        }
                    }
                ]
            }
        }
    ]
}