[
  {
    "properties": {
      "displayName": "My bookmark",
      "notes": "Found a suspicious activity",
      "labels": [
        "Tag1",
        "Tag2"
      ],
      "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
      "queryResult": "Security Event query result"
    }
  },
  {
    "properties": {
      "displayName": "My bookmark2",
      "notes": "Found a suspicious activity",
      "labels": [
        "Tag1",
        "Tag2"
      ],
      "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
      "queryResult": "Security Event query result"
    }
  }
]
