id: dbd9e28f-973d-47f3-a8c3-9e18da846870
name: VTI - High Severity SHA1 Collision Detection
version: 1.0.0
kind: Scheduled
description: |-
  This will alert when a collision is detected for DeviceFileEvents events with VTI high severity SHA1 IoCs
severity: High
requiredDataConnectors:
  - connectorId: VisaThreatIntelligence
    dataTypes:
      - VisaThreatIntelligenceIOC_CL
      - DeviceFileEvents
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
- Execution
relevantTechniques:
- T1204
query: |-
  DeviceFileEvents
  | join kind=inner (VisaThreatIntelligenceIOC_CL  | where IOCType == "sha1" and SourceSeverity == "High")
  on $left.InitiatingProcessSHA1 == $right.Value
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 1h
    matchingMethod: AllEntities
suppressionDuration: 1h
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: Host
  fieldMappings:
  - identifier: HostName
    columnName: DeviceName
- entityType: FileHash
  fieldMappings:
  - identifier: Algorithm
    columnName: SHA1
  - identifier: Value
    columnName: InitiatingProcessSHA1

