// Name: Files identified on Host
// Description: Any file referenced on a given host during the time of or recently after compromise and in the range of +-30m
//
// Id: 62527635-bc5a-4233-bb93-e4eb4e60bb70
//
// Entity: #File
// Input: FileName
// Output: Host
//
// QueryPeriod: +-30m default, change as needed
//
// DataSource: #SecurityEvent
//
// Tactics: #Persistence, #Discovery, #LateralMovement, #Collection
//
let GetFilesHost = (suspiciousEventTime:datetime, v_File:string){
let v_StartTime = suspiciousEventTime-30m;
let v_EndTime = suspiciousEventTime+30m;
SecurityEvent 
| where TimeGenerated between (v_StartTime .. v_EndTime)
| where CommandLine contains v_File or ServiceFileName contains v_File or ServiceName contains v_File
};
// change datetime value and <filename> value below
GetFilesHost(datetime('2019-02-01T10:02:51.000'), "<filename>")