// Name: Service Created on Host
// Description: Any Service Created on a given host during the time of or recently after compromise and in the range of +-6h
// Entity: #Host
// Input: Computername, Hostname, HostId
// Output: Services
//
// QueryPeriod: +-6h default, change as needed
//
// Data Source: #SecurityEvent
//
// Tactics: #Persistence, #Discovery, #LateralMovement, #Collection
//
let GetServiceCreationsOnHost = (suspiciousEventTime:datetime, v_Host:string){
let v_StartTime = suspiciousEventTime-6h;
let v_EndTime = suspiciousEventTime+6h;
SecurityEvent 
| where TimeGenerated between (v_StartTime .. v_EndTime)
| where toupper(Computer) contains v_Host or toupper(WorkstationName) contains v_Host
// 7045: A service was installed in the system
| where EventID == "7045"
| sort by TimeGenerated asc
};
// change datetime value and <hostname> value below
GetServiceCreationsOnHost(datetime('2019-01-20T10:02:51.000'), toupper("<hostname>"))