// Name: Service Created by Account
// Description: Any Service Created on any system by the given account during the time of or recently after compromise and in the range of +-6h
// Entity: #User
// Input: Compromised Entity, UserName, UserAccount
// Output: Services
//
// QueryPeriod: +-6h default, change as needed
//
// Data Source: #SecurityEvent
//
// Tactics: #Persistence, #Discovery, #LateralMovement, #Collection
//
let GetServiceCreationsOnHost = (suspiciousEventTime:datetime, v_User:string){
let v_StartTime = suspiciousEventTime-6h;
let v_EndTime = suspiciousEventTime+6h;
SecurityEvent 
| where TimeGenerated between (v_StartTime .. v_EndTime)
| where tolower(Account) contains v_User
// 7045: A service was installed in the system
| where EventID == "7045"
| top 10 by TimeGenerated desc nulls last
};
// change datetime value and <username> value below
GetServiceCreationsOnHost(datetime('2019-01-20T10:02:51.000'), tolower("<username>"))