// Name: Service Created on Host
// Description: Any Service Created on a given host during the time of or recently after compromise and in the range of +-2d
// Entity: #Host
// Input: Computername, Hostname, HostId
// Output: Services
//
// QueryPeriod: +-2d default, change as needed
//
// Data Source: #SecurityEvent
//
// Techniques: #Persistence, #Discovery, #LateralMovement, #Collection
//
let GetServiceCreationsOnHost = (suspiciousEventTime:datetime, Host:string){
let StartTime = suspiciousEventTime-6h;
let EndTime = suspiciousEventTime+30m;
SecurityEvent 
| where TimeGenerated between (StartTime .. EndTime)
| where toupper(Computer) contains Host or toupper(WorkstationName) contains Host
// 7045: A service was installed in the system
| where EventID == "7045"
| sort by TimeGenerated asc
};
GetServiceCreationsOnHost(datetime('2019-01-20T10:02:51.000'), toupper("<hostname>"))