// Id: dd8f30e4-8171-452e-84a0-99bcd570bd08
// DisplayName: Service Created by Account
// Description: Any Service Created on any system by the given account during the time of or recently after compromise (set time range to +-6h when running the query)
// InputEntityType: Account
// InputFields: [Name]
// OutputEntityTypes: [Process]
// QueryPeriodBefore: 6h
// QueryPeriodAfter: 6h
// DataSources: #SecurityEvent
// Tactics: #Persistence, #Discovery, #LateralMovement, #Collection

let GetServiceCreationsOnHost = (v_Account_Name:string){
SecurityEvent 
| where EventID == 7045
| where tolower(Account) contains v_Account_Name
| project-rename Process_Host_UnstructuredName=Computer, Process_Account_UnstructuredName=Account, Process_CommandLine=CommandLine, Process_ProcessId=ProcessId, Process_ImageFile_FullPath=NewProcessName
| top 10 by TimeGenerated desc nulls last
};
// change <Name> value below
GetServiceCreationsOnHost(tolower('<Name>'))