// Id: 84375346-c3f0-4926-ae48-a156010c67e3
// DisplayName: User Account Failed logons
// Description: Failed logons by a given user during the time of or recently after compromise (set time range to +-1h when running the query)
// InputEntityType: Account
// InputFields: [Name]
// OutputEntityTypes: [Host]
// QueryPeriodBefore: 1h
// QueryPeriodAfter: 1h
// DataSources: #SecurityEvent
// Tactics: #Discovery, #LateralMovement

let GetAllLogonsForUser = (v_Account_Name:string){
SecurityEvent 
| where EventID == 4625
| where AccountType == 'User'
| where tolower(Account) contains tolower(v_Account_Name)
| summarize min(TimeGenerated), max(TimeGenerated) by Computer
| project min_TimeGenerated, max_TimeGenerated, Computer
| project-rename Host_UnstructuredName=Computer
| top 10 by min_TimeGenerated asc nulls last
};
// change <Name> value below
GetAllLogonsForUser(tolower('<Name>'))