// Name: User Account Created or Deleted
// Description: User account creations and deletions on a given host during the time of or recently after compromise and in the range of +-12h
// Entity: #Host
// Input: Computername, Hostname, HostId
// Output: Accounts
//
// QueryPeriod: +-12h default, change as needed
//
// Data Source: #SecurityEvent
//
// Techniques: #Persistence, #Discovery, #LateralMovement, #Collection
//
let GetLocalAccountChangesOnHost = (suspiciousEventTime:datetime, Host:string){
let StartTime = suspiciousEventTime-12h;
let EndTime = suspiciousEventTime+12h;
SecurityEvent 
| where TimeGenerated between (StartTime .. EndTime)
| where toupper(Computer) contains Host or toupper(WorkstationName) contains Host
// 4720: A user account was created, 4726: A user account was deleted
| where EventID == "4720" or EventID == "4726"
| where AccountType == "User"
| summarize AcctCreated = count() by TimeGenerated, Computer, WorkstationName, Account, TargetAccount, Activity
| sort by TimeGenerated
};
GetAccountChangesOnHost(datetime('2019-01-20T10:02:51.000'), toupper("<hostname>"))