id: "1d2c3da7-60ec-40be-9c14-bade6eaf3c49"
name: "Data Alert"
description: |
  'Data Compromised'
severity: Medium
status: Available
requiredDataConnectors: []
queryFrequency: "5m"
queryPeriod: "5m"
triggerOperator: "gt"
triggerThreshold: 0
tactics: []
query: |
  "SecurityIncident \r\n| where Title has \"Cvlt Alert\" \r\n    and Description
    has \"Client\" and Description has \"Compromised\"\r\n    and Status has \"New\"\r\n|
    extend extracted_word = extract(\"Client\\\\s(.*?)\\\\sCompromised\", 1, Description)\r\n|
    project TimeGenerated,\r\n          Title,\r\n          Description,\r\n          Status,\r\n
    \         CustomDetails = extracted_word"
entityMappings: []
version: "1.0.0.0"
kind: Scheduled
