id: "c982bcc1-ef73-485b-80d5-2a637ce4ab2b"
name: "IDP Alert"
description: |
  'IDP Compromised'
severity: Medium
status: Available
requiredDataConnectors: []
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics: Impact
relevantTechniques:
  - T1578
  - T1531
tags:
  - Commvault
  - Metallic
  - Threat Intelligence
  - Ransomware
query: |
    SecurityIncident
    | where Title has "Cvlt Alert" and Description == "IDP Compromised" and Status has "New"
entityMappings: []
version: 1.0.0
kind: Scheduled
