id: "c982bcc1-ef73-485b-80d5-2a637ce4ab2b"
name: "IDP Alert"
description: |
  'IDP Compromised'
severity: Medium
status: Available
requiredDataConnectors: []
queryFrequency: "5m"
queryPeriod: "5m"
triggerOperator: "gt"
triggerThreshold: 0
tactics: Impact
relevantTechniques:
  - T1578
  - T1531
tags:
  - Commvault
  - Metallic
  - Threat Intelligence
  - Ransomware
query: |
  "SecurityIncident \r\n\r\n| where Title has \"Cvlt Alert\"  \r\n\r\n    and
    Description == \"IDP Compromised\"  \r\n\r\n    and Status has \"New\" "
entityMappings: []
version: "1.0.0.0"
kind: Scheduled
