id: d6991ef1-b225-4780-b6a6-cfe9b5278f5e
name: Qakbot Reconnaissance Activities
description: |
  This query searches for reconnaissance and beaconing activities after code injection occurs in Qakbot infections.
description-detailed: |
  This query can be used to find reconnaissance and beaconing activities after code injection occurs. Reconnaissance commands are consistent with the current version of Qakbot and occur automatically to exfiltrate system information. This data, once exfiltrated, will be used to prioritize human operated actions.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - Discovery
query: |
  DeviceProcessEvents
  | where InitiatingProcessFileName == InitiatingProcessCommandLine
  | where ProcessCommandLine has_any (
  "whoami /all","cmd /c set","arp -a","ipconfig /all","net view /all","nslookup -querytype=ALL -timeout=10",
  "net share","route print","netstat -nao","net localgroup")
  | summarize dcount(FileName), make_set(ProcessCommandLine, 10000) by DeviceId,bin(TimeGenerated, 1d), InitiatingProcessFileName, InitiatingProcessCommandLine
  | where dcount_FileName >= 8
version: 1.0.0