OfficeActivity
| where RecordType in ("AzureActiveDirectoryAccountLogon", "AzureActiveDirectoryStsLogon")
| where Operation startswith "UserLoggedIn"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| project Operation, UserId, TimeGenerated , UserAgent, ClientIP 
| summarize userAgentCount=count() by UserAgent, ClientIP
| sort by userAgentCount desc