{
    "name": "Processes executed from binaries hidden in Base64 encoded files",
    "description": "Process executed from binary hidden in Base64 encoded file.  Encoding malicious software is a technique to obfuscate files from detection.  The first ProcessCommandLine component is looking for Python decoding base64.  The second ProcesssCommandLine component is looking for the Bash/sh commandline base64 decoding tool.  The third one is looking for Ruby decoding base64.",
    "techniques": ["Execution", "InitialAccess", "DefenseEvasion"],
    "query": "let ProcessCreationEvents=() {\n    let processEvents=SecurityEvent\n    | where EventID==4688\n    | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName, AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\\\')[-1]), ProcessCommandLine = CommandLine, FolderPath = '', InitiatingProcessFileName=ParentProcessName;\n    processEvents\n};\nProcessCreationEvents \n| where ProcessCommandLine contains '.decode(\\'base64\\')' or ProcessCommandLine contains 'base64 --decode' or ProcessCommandLine contains '.decode64('\n| project TimeGenerated, ComputerName, FileName, ProcessCommandLine"
}