let ProcessCreationEvents=() {
    let processEvents=SecurityEvent
    | where EventID==4688
    | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName, AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\\\')[-1]), ProcessCommandLine = CommandLine, FolderPath = "", InitiatingProcessFileName=ParentProcessName;
    processEvents
};
ProcessCreationEvents 
| where ProcessCommandLine contains ".decode('base64')" or ProcessCommandLine contains "base64 --decode" or ProcessCommandLine contains ".decode64(" 
| project TimeGenerated, ComputerName, FileName, ProcessCommandLine