{
    "id": "ca67c83e-7fff-4127-a3e3-1af66d6d4cad",
    "name": "Processes executed from base-encoded PE files",
    "description": "Finding base64 encoded PE files header seen in the command line parameters.",
    "techniques": ["Execution", "InitialAccess", "DefenseEvasion"],
    "query": "let ProcessCreationEvents=() {\n    let processEvents=SecurityEvent\n    | where EventID==4688\n    | project  TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName, AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\\\')[-1]), ProcessCommandLine = CommandLine, InitiatingProcessFileName=ParentProcessName;\n    processEvents\n};\nProcessCreationEvents\n| where ProcessCommandLine contains 'TVqQAAMAAAAEAAA'"
}

