{
    "name": "Summary of users creating new user accounts",
    "description": "new user accounts may be an attacker providing themselves with backdoor access for some later date. an account creating further accounts for the first time may be an indication of compromise",
    "techniques": ["Persistance"],
    "query": "OfficeActivity \n | where Operation == 'Add user.'' \n | project addedBy=UserId, newUser=OfficeObjectId  \n| summarize newUserCount=dcount(newUser) by addedBy"
}