{
    "name": "Summary of failed user logons by reason of failure",
    "description": "A summary of failed logons can be used to infer lateral movement with the intention of discovering credentials and sensitive data",
    "techniques": ["InitialAccess", "LateralMovement", "Persistence"],
    "query": "SecurityEvent\n| where AccountType == 'User' and EventID == 4625\n| extend Reason = case(\n    SubStatus == '0xc000005e', 'No logon servers available to service the logon request',\n    SubStatus == '0xc0000062', 'Account name is not properly formatted',\n    SubStatus == '0xc0000064', 'Account name does not exist',\n    SubStatus == '0xc000006a', 'Incorrect password',\n    SubStatus == '0xc000006d', 'Bad user name or password',\n    SubStatus == '0xc000006f', 'User logon blocked by account restriction',\n    SubStatus == '0xc000006f', 'User logon outside of restricted logon hours',\n    SubStatus == '0xc0000070', 'User logon blocked by workstation restriction',\n    SubStatus == '0xc0000071', 'Password has expired',\n    SubStatus == '0xc0000072', 'Account is disabled',\n    SubStatus == '0xc0000133', 'Clocks between DC and other computer too far out of sync',\n    SubStatus == '0xc000015b', 'The user has not been granted the requested logon right at this machine',\n    SubStatus == '0xc0000193', 'Account has expirated',\n    SubStatus == '0xc0000224', 'User is required to change password at next logon',\n    SubStatus == '0xc0000234', 'Account is currently locked out',\n    strcat('Unknown reason substatus: ', SubStatus))\n| summarize count() by Reason"
}