let LogonEvents=() { 
    let logonSuccess=SecurityEvent 
    | where EventID==4624 
    | project  TimeGenerated, ComputerName=Computer, AccountName=TargetUserName, AccountDomain=TargetDomainName, IpAddress, ActionType="Logon";
    let logonFail=SecurityEvent 
    | where EventID==4625 
    | project TimeGenerated, ComputerName=Computer, AccountName=TargetUserName, AccountDomain=TargetDomainName, IpAddress, ActionType="LogonFailure";
    logonFail 
    | union logonSuccess
};
LogonEvents 
| where TimeGenerated >= ago(30d) 
| where ActionType == "Logon" 
| summarize count() by ComputerName, AccountName 
| join kind=leftouter ( 
    LogonEvents 
    | where TimeGenerated >= ago(1d) 
    | where ActionType == "Logon" 
    | summarize count() by ComputerName, AccountName 
) on ComputerName 
| where AccountName != AccountName1 
| summarize HostCount=dcount(ComputerName) by AccountName1 
| extend Name = AccountName1 
| project Name , HostCount