SecurityEvent
| where ProcessName contains "svchost.exe"
| where SubjectUserSid != "S-1-5-18"
| where SubjectUserSid != "S-1-5-19"
| where SubjectUserSid != "S-1-5-20"
| where ProcessName !contains "C:\\\\Windows\\\\System32"
| where ProcessName !contains "C:\\\\Windows\\\\Syswow64"