{
    "name": "Masquerading files",
    "description": "Malware writers often use windows system process names for their malicious process names to make them blend in with other legitimate commands that the Windows system executes.  An analyst can create a simple query looking for a process named Svchost.exe. It is recommended to filter out well-known security identifiers (SIDs) that are used to launch the legitimate svchost.exe process. The query also filters out the legitimate locations from which svchost.exe is launched.",
    "techniques": ["Execution", "DefenseEvasion"],
    "query": "SecurityEvent\n| where ProcessName contains \"svchost.exe\"\n| where SubjectUserSid != \"S-1-5-18\"\n| where SubjectUserSid != \"S-1-5-19\"\n| where SubjectUserSid != \"S-1-5-20\"\n| where ProcessName !contains \"C:\\\\Windows\\\\System32\"\n| where ProcessName !contains \"C:\\\\Windows\\\\Syswow64\""
}