{
    "id": "513e3a11-e1bb-4cfc-8af9-451da0407e6b",
    "name": "New processes observed in last 24 hours",
    "description": "Shows new processes observed in the last 24 hours versus the previous 30 days.   These new processes could be benign new programs installed on hosts; however, especially in normally stable environments, these new processes could provide an indication of an unauthorized/malicious binary that has been installed and run. Reviewing the wider context of the logon sessions in which these binaries ran can provide a good starting point for identifying possible attacks.",
    "techniques": ["Execution"],
    "query": "let processEvents=SecurityEvent\n| where EventID==4688\n| project TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName, AccountDomain=SubjectDomainName, FileName=split(NewProcessName, @'')[(-1)], ProcessCommandLine = CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine='',InitiatingProcessParentFileName=''\n| where TimeGenerated >= ago(30d); \nprocessEvents\n| where TimeGenerated < ago(1d)\n| summarize HostCount=dcount(ComputerName) by tostring(FileName)\n| join kind=rightanti (\nprocessEvents\n| where TimeGenerated >= ago(1d)\n| summarize HostCount=dcount(ComputerName) by tostring(FileName)\n) on FileName\n| project HostCount, FileName"
}

