{
  "id": "41fa6e2d-afe9-4398-9356-cec3a927e44e",
  "name": "Azure AD signins from new locations",
  "description": "New AzureAD signin locations today versus historical Azure AD signin data.  In the case of password spraying or brute force attacks, one might see authentication attempts for many accounts from a new location.",
  "techniques": [ "InitialAccess" ],
  "query": "SigninLogs\n| where TimeGenerated >= ago(1d)\n| summarize perIdentityAuthCount=count() by Identity,  locationString= strcat(tostring(LocationDetails[\"countryOrRegion\"]), \"/\", tostring(LocationDetails[\"state\"]), \"/\", tostring(LocationDetails[\"city\"]), \";\" , tostring(LocationDetails[\"geoCoordinates\"]))\n| summarize distinctAccountCount = count(), identityList=makeset(Identity)  by locationString\n| extend identityList = iff(distinctAccountCount<10, identityList, \"multiple (>10)\")\n| join kind= anti (\n    SigninLogs\n    | where TimeGenerated < ago(1d)\n    | project   locationString= strcat(tostring(LocationDetails[\"countryOrRegion\"]), \"/\", tostring(LocationDetails[\"state\"]), \"/\", \ntostring(LocationDetails[\"city\"]), \";\" , tostring(LocationDetails[\"geoCoordinates\"]))\n    | summarize priorCount = count() by locationString) on locationString\n| where distinctAccountCount > 1 // select threshold above which #new accounts from a new location is deemed suspicious\n// Could extend this query to show previous signin locations for the users in result set"
}