{
    "name": "Office365 authentications",
    "description": "Shows authentication volume by user agent and IP address.  Tracking via user agent is one way to differentiate between types of connecting device. In homogeneous enterprise environments the user agent associated with an attacker device may stand out as unusual. Examining authentications by new devices or originating from new IPs is a potential avenue to discover unauthorized access. Similarly new device types (user agents) on a known IP address is potentially suspect.",
    "techniques": [],
    "query": "OfficeActivity\n| where RecordType in ('AzureActiveDirectoryAccountLogon', 'AzureActiveDirectoryStsLogon')\n| where Operation startswith 'UserLoggedIn'\n| extend UserAgent = extractjson('$[0].Value', ExtendedProperties, typeof(string))\n| project Operation, UserId, TimeGenerated , UserAgent, ClientIP \n| summarize userAgentCount=count() by UserAgent, ClientIP\n| sort by userAgentCount desc"
}