id: f6354c94-3a95-4235-8530-414f016a7bf6
name: Inbound emails with QR code URLs
description: |
  In this query, we summarize volume of inbound emails with QR code URLs in last 30 days
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
  - EmailUrlInfo
tactics:
- Initial access
query: |
  EmailEvents
  | where Timestamp > ago(30d)
  | where EmailDirection == "Inbound"
  | join EmailUrlInfo on NetworkMessageId
  | where UrlLocation == "QRCode"
  | summarize dcount(NetworkMessageId) by bin(Timestamp, 1d)
  | render timechart