id: 5ea4c8c2-a6e9-4321-8402-39635ffcfbe4
Function:
  Title: Parser for dsp_parser
  Version: '1.0.0'
  LastUpdated: '2024-12-25'
Category: Microsoft Sentinel Parser
FunctionName: dsp_parser
FunctionAlias: dsp_parser
FunctionQuery: |
    SecurityEvent
    | where EventSourceName == "Semperis-DSP-Security"
    | where EventID in ("9211", "9212", "9208")
    | parse EventData with 
        '<EventData ' * '>' DSPData '</EventData>'
    | parse DSPData with 
        *
        '<Data Name="firstFound">' FirstFound '</Data>'
        * 
    | parse DSPData with 
        *
        '<Data Name="generationTime">' GenerationTime '</Data>'	*
        '<Data Name="securityIndicatorName">' SecurityIndicatorName '</Data>' *
        '<Data Name="result">' Result '</Data>' *
        '<Data Name="score">' Score '</Data>' *
        '<Data Name="forestName">' ForestName '</Data>' *
        '<Data Name="domains">' Domains '</Data>' *
        '<Data Name="severity">' Severity '</Data>' *
        '<Data Name="weight">' Weight '</Data>' *
        '<Data Name="securityFrameworkTags">' SecurityFrameworkTags '</Data>' *
        '<Data Name="securityIndicatorDescription">' SecurityIndicatorDescription '</Data>'	*
        '<Data Name="likelihoodOfCompromise">' LikelihoodOfCompromise '</Data>'	*
        '<Data Name="resultMessage">' ResultMessage '</Data>' *
        '<Data Name="numberOfResults">' NumberOfResults '</Data>' *
        '<Data Name="remediation">' Remediation '</Data>' *
        '<Data Name="schedule">' Schedule '</Data>'
        *
    | parse DSPData with 
        *
        '<Data Name="targets">' Targets '</Data>'
        * 
    | extend SecurityFrameworkTagsCsv = replace(@' Mitre:', @'', tostring(SecurityFrameworkTags))
    | extend SecurityFrameworkTagsCsv = replace(@'Mitre:', @'', tostring(SecurityFrameworkTagsCsv))
    | extend SecurityFrameworkTags = replace(@'Mitre:', @'', tostring(SecurityFrameworkTags))
    | extend GenerationTimeTags = tostring(DSPData)