id: 9f9c1e51-4fb1-4510-a675-c7c2fb32f47e
name: "[Deprecated] - Denim Tsunami AV Detection"
description: |
    'This query has been deprecated as the associated IoCs (Indicators of Compromise) are outdated and no longer relevant. To ensure effective threat detection, it is recommended to implement Microsoft's Threat Intelligence solution, which enables matching your log data with the most up-to-date IoCs generated by Microsoft. This solution can be installed from the Microsoft Sentinel Content Hub if not currently deployed. More details on the Content Hub can be found here: https://learn.microsoft.com/azure/sentinel/sentinel-solutions-deploy'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceInfo
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
relevantTechniques:
  - T1203
tags:
  - Denim Tsunami
query: |
  let knotweed_sigs = dynamic(["JumplumpDropper", "Jumplump", "Corelump", "Medcerc", "SuspModuleLoad", "Mexlib"]);
    let mde_data = (DeviceInfo
      | extend DeviceName = tolower(DeviceName)
      | join kind=rightouter ( SecurityAlert
      | where ProviderName =~ "MDATP"
      | extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
      | extend ThreatFamilyName = tostring(parse_json(ExtendedProperties).ThreatFamilyName)
      | where ThreatFamilyName in~ (knotweed_sigs)
      | extend CompromisedEntity = tolower(CompromisedEntity)
      ) on $left.DeviceName == $right.CompromisedEntity);
    let event_data = ( Event
      | where EventID in (1006, 1009, 1116, 1119)
      | extend ThreatData = parse_json(tostring(parse_json(tostring(parse_json(tostring(parse_xml(EventData).DataItem)).EventData)).Data))
      | mv-expand ThreatData
      | where tostring(ThreatData.["@Name"]) == "Threat Name"
      | extend EventData = parse_xml(EventData)
      | where tostring(ThreatData.["#text"]) has_any (knotweed_sigs));
    union mde_data, event_data
    | extend ThreatName = iif(isnotempty(ThreatName), ThreatName, tostring(ThreatData.["#text"]))
    | extend ThreatFamilyName = iif(isnotempty(ThreatFamilyName), ThreatFamilyName, split(tostring(ThreatData.["#text"]), "/")[-1])
    | extend TimeGenerated = iif(isnotempty(TimeGenerated), TimeGenerated, TimeGenerated1)
    | extend DeviceName = iif(isnotempty(DeviceName), DeviceName, Computer)
    | project-reorder TimeGenerated, CompromisedEntity, ThreatName, ThreatFamilyName
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: DeviceName
version: 2.0.0
kind: Scheduled
