{
    "id": "MicrosoftDefenderThreatIntelligence",
    "title": "Microsoft Defender Threat Intelligence (Preview)",
    "publisher": "Microsoft",
    "logo": {
        "type": 258,
        "options": null
    },
    "descriptionMarkdown": "Microsoft Sentinel provides you the capability to import threat intelligence generated by Microsoft to enable monitoring, alerting and hunting. Use this data connector to import Indicators of Compromise (IOCs) from Microsoft Defender Threat Intelligence (MDTI) into Microsoft Sentinel. Threat indicators can include IP addresses, domains, URLs, and file hashes, etc.",
    "graphQueries": [
        {
            "metricName": "Total data received",
            "legend": "ThreatIntelligenceIndicator",
            "baseQuery": "ThreatIntelligenceIndicator\n                      | where SourceSystem in (\"Microsoft Defender Threat Intelligence\", \"Microsoft Emerging Threat Feed\")"
        }
    ],
    "sampleQueries": [
        {
            "description": "Summarize by threat type",
            "query": "ThreatIntelligenceIndicator\n| where ExpirationDateTime > now()\n| where SourceSystem in (\"Microsoft Defender Threat Intelligence\", \"Microsoft Emerging Threat Feed\")\n| where ExpirationDateTime > now()\n| join ( SigninLogs ) on $left.NetworkIP == $right.IPAddress | summarize count() by ThreatType"
        },
        {
            "description": "Summarize by 1 hour bins",
            "query": "ThreatIntelligenceIndicator\n| where SourceSystem in (\"Microsoft Defender Threat Intelligence\", \"Microsoft Emerging Threat Feed\")\n| where TimeGenerated >= ago(1d) | summarize count()​​"
        }
    ],
    "connectivityCriterias": [
        {
            "type": "SentinelKinds",
            "value": [
                "MicrosoftThreatIntelligence"
            ]
        }
    ],
    "dataTypes": [
        {
            "name": "ThreatIntelligenceIndicator",
            "lastDataReceivedQuery": "ThreatIntelligenceIndicator \n                | where SourceSystem in (\"Microsoft Defender Threat Intelligence\", \"Microsoft Emerging Threat Feed\")\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
    ],
    "availability": {
        "status": 2,
        "isPreview": true,
        "featureFlag": {
            "feature": "msticonnector",
            "featureStates": {
                "1": 1,
                "2": 1,
                "3": 1,
                "4": 1
            }
        }
    },
    "permissions": {
        "resourceProvider": [
            {
                "provider": "Microsoft.OperationalInsights/workspaces",
                "permissionsDisplayText": "read and write permissions.",
                "providerDisplayName": "Workspace",
                "scope": "Workspace",
                "requiredPermissions": {
                    "read": true,
                    "write": true,
                    "delete": true
                }
            }
        ]
    },
    "instructionSteps": [
        {
            "title": "Use this data connector to import Indicators of Compromise (IOCs) from Microsoft Defender Threat Intelligence (MDTI) into Microsoft Sentinel."
        },
        {
            "instructions": [
                {
                    "type": "MicrosoftThreatIntelligence",
                    "parameters": {
                        "connectorKind": "MicrosoftThreatIntelligence"
                    }
                }
            ]
        }
    ]
}