{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('Workspace')]",
      "location": "[parameters('WorkspaceRegion')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "ASimAuthenticationAADServicePrincipalSignInLogs",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('Workspace'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "Authentication ASIM parser for AAD service principal sign-in logs",
            "category": "ASIM",
            "FunctionAlias": "ASimAuthenticationAADServicePrincipalSignInLogs",
            "query": "let AADResultTypes = (T:(ResultType:string)) {\n    let AADResultTypesLookup = datatable (ResultType:string, EventResultDetails:string, EventType:string, EventResult:string, EventOriginalResultDetails:string, EventSeverity:string)\n    [\n        \"0\"     ,\"\"                         ,\"Logon\"    ,\"Success\"  ,\"\", \"Informational\",\n        \"53003\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"53003 - BlockedByConditionalAccess\", \"Low\",\n        \"50034\" ,\"No such user\"             ,\"Logon\"    ,\"Failure\"  ,\"50034 - UserAccountNotFound\", \"Low\",\n        \"50059\" ,\"No such user\"             ,\"Logon\"    ,\"Failure\"  ,\"50059 - MissingTenantRealmAndNoUserInformationProvided\", \"Low\",\n        \"50053\" ,\"User locked\"              ,\"Logon\"    ,\"Failure\"  ,\"50053 - IdsLocked or IP address with malicious activity\", \"Low\",\n        \"50055\" ,\"Password expired\"         ,\"Logon\"    ,\"Failure\"  ,\"50055 - InvalidPasswordExpiredPassword\", \"Low\",\n        \"50056\" ,\"Incorrect password\"       ,\"Logon\"    ,\"Failure\"  ,\"50056 - Invalid or null password\", \"Low\",\n        \"50057\" ,\"User disabled\"            ,\"Logon\"    ,\"Failure\"  ,\"50057 - UserDisabled\", \"Low\",\n        \"50058\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50058 - UserInformationNotProvided\", \"Low\",\n        \"50011\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50011 - The redirect URI specified in the request does not match\", \"Low\",\n        \"50064\" ,\"No such user or password\" ,\"Logon\"    ,\"Failure\"  ,\"50064 - CredentialAuthenticationError\", \"Low\",\n        \"50076\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50076 - UserStrongAuthClientAuthNRequired\", \"Low\",\n        \"50079\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50079 - UserStrongAuthEnrollmentRequired\", \"Low\",\n        \"50105\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50105 - EntitlementGrantsNotFound\", \"Low\",\n        \"50126\" ,\"No such user or password\" ,\"Logon\"    ,\"Failure\"  ,\"50126 - InvalidUserNameOrPassword\", \"Low\",\n        \"50132\" ,\"Password expired\"         ,\"Logon\"    ,\"Failure\"  ,\"50132 - SsoArtifactInvalidOrExpired\", \"Low\",\n        \"50133\" ,\"Password expired\"         ,\"Logon\"    ,\"Failure\"  ,\"50133 - SsoArtifactRevoked\", \"Low\",\n        \"50144\" ,\"Password expired\"         ,\"Logon\"    ,\"Failure\"  ,\"50144 - InvalidPasswordExpiredOnPremPassword\", \"Low\",\n        \"50173\" ,\"Session expired\"          ,\"Logon\"    ,\"Failure\"  ,\"50173 -FreshTokenNeeded\", \"Low\",\n        \"80012\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"80012 - OnPremisePasswordValidationAccountLogonInvalidHours\", \"Low\",\n        \"51004\" ,\"No such user\"             ,\"Logon\"    ,\"Failure\"  ,\"51004 - UserAccountNotInDirectory\", \"Low\",\n        \"50072\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50072 - UserStrongAuthEnrollmentRequiredInterrupt\", \"Low\",\n        \"50005\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50005 - DevicePolicyError\", \"Low\",\n        \"50020\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50020 - UserUnauthorized\", \"Low\",\n        \"50074\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50074 - UserStrongAuthClientAuthNRequiredInterrupt\", \"Low\",\n        \"70008\" ,\"Session expired\"          ,\"Logon\"    ,\"Failure\"  ,\"70008 - ExpiredOrRevokedGrant\", \"Low\",\n        \"700016\",\"No such user\"             ,\"Logon\"    ,\"Failure\"  ,\"700016 - UnauthorizedClient_DoesNotMatchRequest\", \"Low\",\n        \"500011\",\"No such user\"             ,\"Logon\"    ,\"Failure\"  ,\"500011 - InvalidResourceServicePrincipalNotFound\", \"Low\",\n        \"700027\",\"Incorrect key\"            ,\"Logon\"    ,\"Failure\"  ,\"700027 - The certificate with identifier used to sign the client assertion is not registered on application\", \"Low\",\n        \"100003\",\"Other\"                    ,\"Logon\"    ,\"Failure\"  ,\"100003\", \"Low\",\n        \"700082\",\"Session expired\"          ,\"Logon\"    ,\"Failure\"  ,\"700082 - ExpiredOrRevokedGrantInactiveToken\", \"Low\",\n        \"530034\",\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"530034 - DelegatedAdminBlockedDueToSuspiciousActivity\", \"Low\",\n        \"530032\",\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"530032 - BlockedByConditionalAccessOnSecurityPolicy\", \"Low\",\n        \"50061\" ,\"\"                         ,\"Logoff\"   ,\"Failure\"  ,\"50061 - SignoutInvalidRequest\", \"Low\",\n        \"50068\" ,\"\"                         ,\"Logoff\"   ,\"Failure\"  ,\"50068 - SignoutInitiatorNotParticipant\", \"Low\",\n        \"50078\" ,\"Logon violates policy\"    ,\"Logon\"    ,\"Failure\"  ,\"50078 - UserStrongAuthExpired\", \"Low\",\n        \"7000222\", \"Session expired\"        ,\"Logon\"    ,\"Failure\"  ,\"7000222 - The provided client secret keys are expired\", \"Low\",\n        \"70021\", \"No such user\"             ,\"Logon\"    ,\"Failure\"  ,\"70021 - No matching federated identity record found for presented assertion\", \"Low\",\n        \"500341\", \"User disabled\"           ,\"Logon\"    ,\"Failure\"  ,\"500341 - The user account has been deleted from the directory\", \"Low\",\n        \"1002016\", \"Logon violates policy\"  ,\"Logon\"    ,\"Failure\"  ,\"1002016 - You are using TLS version 1.0, 1.1 and/or 3DES cipher\", \"Low\",\n        \"7000215\", \"Incorrect password\"     ,\"Logon\"    ,\"Failure\"  ,\"7000215 - Invalid client secret is provided\", \"Low\",\n        \"90033\",   \"Transient error\"       ,\"Logon\"    ,\"Failure\"  ,\"90033 - A transient error has occurred\", \"Informational\",\n        \"90024\",   \"Transient error\"       ,\"Logon\"    ,\"Failure\"  ,\"90024 - RequestBudgetExceededError - A transient error has occurred\", \"Informational\"\n    ];\n    T \n    | lookup AADResultTypesLookup on ResultType\n    | extend\n          EventType                   = iff(isempty(EventType), \"Logon\", EventType)\n        , EventResult                 = iff(isempty(EventResult), \"Failure\", EventResult)\n        , EventOriginalResultDetails  = iff(isempty(EventOriginalResultDetails), EventType, EventOriginalResultDetails)\n        , EventSeverity               = iff(isempty(EventSeverity), \"Low\", EventSeverity)\n};\nlet parser = (\n    disabled:bool=false\n  ) {\n  AADServicePrincipalSignInLogs\n  | where \n      not(disabled)\n  | invoke AADResultTypes()\n  | project-rename\n        ActingAppId               = AppId\n      , TargetAppId               = ResourceIdentity \n      , TargetAppName             = ResourceDisplayName\n      , TargetUsername            = ServicePrincipalName\n      , TargetUserId              = ServicePrincipalId\n      , EventOriginalUid          = Id\n      , TargetSessionId           = CorrelationId\n      , SrcIpAddr                 = IPAddress\n      , EventUid                  = _ItemId\n      , EventProductVersion       = OperationVersion\n  | extend \n        EventVendor                = 'Microsoft'\n      , EventProduct               = 'AAD'\n      , EventSchema                = 'Authentication'\n      , EventSchemaVersion         = '0.1.3'\n      , Dvc                        = 'Microsft/AAD'\n      , LogonMethod                = \"Service Principal\"\n      , TargetAppType              = \"Resource\"\n      , EventCount                 = int(1)\n      , TargetUserType             = 'Service'\n      , TargetUsernameType         = 'Simple'\n      , TargetUserIdType           = 'AADID'\n  | extend\n        LocationDetails = todynamic(LocationDetails)\n  | extend\n      SrcGeoCity                   = tostring(LocationDetails.city)\n      , SrcGeoCountry              = Location\n      , SrcGeoLatitude             = toreal(LocationDetails.geoCoordinates.latitude)\n      , SrcGeoLongitude            = toreal(LocationDetails.geoCoordinates.longitude)\n      , SrcGeoRegion               = tostring(LocationDetails.state)\n  | project-away OperationName, Category, Result*, ServicePrincipal*,SourceSystem, DurationMs, Resource*, Location*, UniqueTokenIdentifier, FederatedCredentialId, Conditional*, Authentication*, Identity, Level, TenantId\n  // \n  // -- Aliases\n  | extend \n      User                         = TargetUsername\n      , LogonTarget                = TargetAppName\n      , EventStartTime             = TimeGenerated\n      , EventEndTime               = TimeGenerated\n      , Application                = TargetAppName\n      , Dst                        = TargetAppName\n      , Src                        = SrcIpAddr\n      , IpAddr                     = SrcIpAddr\n      , TargetSimpleUsername       = TargetUsername\n      , TargetUserAadId            = TargetUserId\n};\nparser  \n(\n    disabled = disabled\n)",
            "version": 1,
            "functionParameters": "disabled:bool=False"
          }
        }
      ]
    }
  ]
}