id: 7e2b89d5-1c48-4758-9e3a-bc1c2c52e0f4
name: Lumen TI IPAddress in DeviceNetworkEvents
displayName: Lumen TI IPAddress in DeviceNetworkEvents
description: |
  This query searches for matches between Lumen threat intelligence IPAddress indicators and DeviceNetworkEvents.
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelIndicators
    dataTypes:
      - ThreatIntelIndicators
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceNetworkEvents
queryFrequency: PT4H
queryPeriod: P14D
triggerOperator: gt
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
query: |
  let dt_lookBack = 1d;  // Data lookback for DeviceNetworkEvents
  let ioc_lookBack = 14d; // TI lookback
  let IP_Indicators = ThreatIntelIndicators
    | where TimeGenerated >= ago(ioc_lookBack)
    | where IsActive == true and ValidUntil > now()
    | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
    | where SourceSystem == 'Lumen'
    | where ObservableKey == 'ipv4-addr:value'
    | extend TI_ipEntity = ObservableValue
    | where ipv4_is_private(TI_ipEntity) == false and TI_ipEntity !startswith 'fe80' and TI_ipEntity !startswith '::' and TI_ipEntity !startswith '127.';
  IP_Indicators
  | join kind=innerunique (
      DeviceNetworkEvents
      | where TimeGenerated >= ago(dt_lookBack)
      | extend DNE_ipEntity = coalesce(RemoteIP, LocalIP)
      | extend DeviceNetworkEvents_TimeGenerated = TimeGenerated
    ) on $left.TI_ipEntity == $right.DNE_ipEntity
  | where DeviceNetworkEvents_TimeGenerated < ValidUntil
  | summarize arg_max(DeviceNetworkEvents_TimeGenerated, *), StartTime = min(DeviceNetworkEvents_TimeGenerated), EndTime = max(DeviceNetworkEvents_TimeGenerated) by Id, DNE_ipEntity
  | project timestamp = EndTime, StartTime, EndTime, DeviceName, RemoteIP, LocalIP, ActionType, ReportId, Id, Tags, ValidUntil, Confidence, TI_ipEntity, DNE_ipEntity, Type
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: DNE_ipEntity
version: 1.0.0
kind: Scheduled
