id: a7cd18cd-1503-47ec-8dca-65d750540637
displayName: Lumen TI Map IP Entity to IdentityLogonEvents
description: |
  This query maps Lumen IP indicators of compromise (IOCs) from threat intelligence (TI), by searching for matches in IdentityLogonEvents.
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelIndicators
    dataTypes:
      - ThreatIntelIndicators
  - connectorId: AzureActiveDirectory
    dataTypes:
      - IdentityLogonEvents
queryFrequency: PT4H
queryPeriod: P14D
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
query: |
  let dt_lookBack = 1h;
  let ioc_lookBack = 14d;
  let IP_Indicators = ThreatIntelIndicators
    | where TimeGenerated >= ago(ioc_lookBack)
    | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
    | where IsActive == true and ValidUntil > now()
    | where SourceSystem == 'Lumen'
    | where ObservableKey == "ipv4-addr:value"
    | extend TI_ipEntity = ObservableValue
    | where ipv4_is_private(TI_ipEntity) == false and  TI_ipEntity !startswith "fe80" and TI_ipEntity !startswith "::" and TI_ipEntity !startswith "127.";
  IP_Indicators
    | join kind=innerunique (
        IdentityLogonEvents
        | where TimeGenerated >= ago(dt_lookBack)
        | extend ILE_ipEntity = IPAddress
        | extend IdentityLogonEvents_TimeGenerated = TimeGenerated
    )
    on $left.TI_ipEntity == $right.ILE_ipEntity
    | where IdentityLogonEvents_TimeGenerated < ValidUntil
    | summarize IdentityLogonEvents_TimeGenerated = arg_max(IdentityLogonEvents_TimeGenerated, *) by Id, ILE_ipEntity
    | project timestamp = IdentityLogonEvents_TimeGenerated, AccountDisplayName, IPAddress, Application, LogonType, Id, Tags, ValidUntil, Confidence, TI_ipEntity, ILE_ipEntity, Type
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ILE_ipEntity
version: 1.0.0
kind: Scheduled
