id: 0e96c419-68eb-4235-947e-7e86e136cda0
displayName: Lumen TI Map IP Entity to OfficeActivity
description: |
  This query maps Lumen IP indicators of compromise (IOCs) from threat intelligence (TI), by searching for matches in OfficeActivity.
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelIndicators
    dataTypes:
      - ThreatIntelIndicators
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: PT4H
queryPeriod: P14D
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
query: |
  let dt_lookBack = 1h;
  let ioc_lookBack = 14d;
  let IP_Indicators = ThreatIntelIndicators
    | where TimeGenerated >= ago(ioc_lookBack)
    | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
    | where IsActive == true and ValidUntil > now()
    | where SourceSystem == 'Lumen'
    | where ObservableKey == "ipv4-addr:value"
    | extend TI_ipEntity = ObservableValue
    | where ipv4_is_private(TI_ipEntity) == false and  TI_ipEntity !startswith "fe80" and TI_ipEntity !startswith "::" and TI_ipEntity !startswith "127.";
  IP_Indicators
    | join kind=innerunique (
        OfficeActivity
        | where TimeGenerated >= ago(dt_lookBack)
        | extend OA_ipEntity = ClientIP
        | extend OfficeActivity_TimeGenerated = TimeGenerated
    )
    on $left.TI_ipEntity == $right.OA_ipEntity
    | where OfficeActivity_TimeGenerated < ValidUntil
    | summarize OfficeActivity_TimeGenerated = arg_max(OfficeActivity_TimeGenerated, *) by Id, OA_ipEntity
    | project timestamp = OfficeActivity_TimeGenerated, UserId, ClientIP, Operation, Id, Tags, ValidUntil, Confidence, TI_ipEntity, OA_ipEntity, Type
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: OA_ipEntity
version: 1.0.0
kind: Scheduled
