id: 4776281c-6c49-46ac-8444-4dd8ba2f4565
displayName: Lumen TI Map IP Entity to WindowsEvents
description: |
  This query maps Lumen IP indicators of compromise (IOCs) from threat intelligence (TI), by searching for matches in WindowsEvents.
severity: Medium
requiredDataConnectors:
  - connectorId: ThreatIntelIndicators
    dataTypes:
      - ThreatIntelIndicators
  - connectorId: WindowsEvents
    dataTypes:
      - WindowsEvent
queryFrequency: PT4H
queryPeriod: P14D
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071
query: |
  let dt_lookBack = 1h;
  let ioc_lookBack = 14d;
  let IP_Indicators = ThreatIntelIndicators
    | where TimeGenerated >= ago(ioc_lookBack)
    | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id
    | where IsActive == true and ValidUntil > now()
    | where SourceSystem == 'Lumen'
    | where ObservableKey == "ipv4-addr:value"
    | extend TI_ipEntity = ObservableValue
    | where ipv4_is_private(TI_ipEntity) == false and  TI_ipEntity !startswith "fe80" and TI_ipEntity !startswith "::" and TI_ipEntity !startswith "127.";
  IP_Indicators
    | join kind=innerunique (
        WindowsEvent
        | where TimeGenerated >= ago(dt_lookBack)
        | extend WE_ipEntity = tostring(EventData.IpAddress)
        | extend WindowsEvent_TimeGenerated = TimeGenerated
    )
    on $left.TI_ipEntity == $right.WE_ipEntity
    | where WindowsEvent_TimeGenerated < ValidUntil
    | summarize WindowsEvent_TimeGenerated = arg_max(WindowsEvent_TimeGenerated, *) by Id, WE_ipEntity
    | project timestamp = WindowsEvent_TimeGenerated, Computer, EventID, Channel, Id, Tags, ValidUntil, Confidence, TI_ipEntity, WE_ipEntity, Type
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: WE_ipEntity
version: 1.0.0
kind: Scheduled
