id: 9fdc4a21-11e5-48e1-b9f4-c1653da4b896
name: backup-deletion
description: |-
  This query was originally published in the threat analytics report, Ransomware continues to hit healthcare, critical services. There is also a related blog.
  In April of 2020, security researchers observed multiple ransomware campaigns using the same set of techniques.
  The following query returns alerts raised when backup files were deleted.
  The See also section below lists more queries related to techniques shared by these campaigns.
  Reference - https://www.microsoft.com/security/blog/2020/04/28/ransomware-groups-continue-to-target-healthcare-critical-services-heres-how-to-reduce-risk/
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - AlertInfo
tactics:
- Defense evasion
- Impact
query: "AlertInfo\r\n| where Timestamp > ago(7d) \r\n| where Title == \"File backups were deleted\" "
