id: 249f510c-d47a-4144-98a7-090b85dd6a74
name: ransom-note-creation-macos
description: |-
  This query was originally published in the threat analytics report, EvilQuest signals the rise of Mac ransomware.
  As of the time of this writing (October 2020), ransomware designed to target macOS is relatively rare. EvilQuest is one of the few examples of this kind of malware on the platform.
  The query below can detect the creation of a ransom note according to the typical methods of EvilQuest operators. The command the query searches for is associated with, but not definitely indicative of, EvilQuest infections.
  Other queries related to EvilQuest ransomware can be found under the See also section below.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceFileEvents
  - DeviceProcessEvents
tactics:
- Impact
query: |-
  union DeviceFileEvents, DeviceProcessEvents  
  | where Timestamp >= ago(7d)  
  | where ProcessCommandLine has "say \\\"Your files are encrypted\\\" waiting until completion false"
