id: 1242ae7b-3384-49be-94b9-0ef8e169e9a7
name: Volume Shadow Copies Deleted
description: |
  'This query checks DeviceProcessEvents for execution of vssadmin.exe or WMIC.exe with command line options to delete volume shadow copies.'
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
tactics:
  - Impact
relevantTechniques:
  - T1490
query: |
DeviceProcessEvents
| where ActionType == "ProcessCreated"
| where FileName in~ ("vssadmin.exe", "WMIC.exe")
| where ProcessCommandLine contains "delete shadows" or 
    ProcessCommandLine contains "shadowcopy delete"
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: Hostname
        columnName: DeviceName
  - entityType: Process
    fieldMappings:
      - identifier: CommandLine
        columnName: ProcessCommandLine
      - identifier: ProcessId
        columnName: ProcessId