id: d0eae0da-69d1-42d5-8b01-59fc7b7fee3f
name: CIS Benchmark 5.2.7 Ensure that Activity Log Alert exists for Create or Update Security Solution
description: |
  'This query identifies creating an activity log alert for the Create or Update Security Solution event.
  Monitoring for Create or Update Security Solution events gives insight into changes to the active security solutions and may reduce the time it takes to detect suspicious activity.
  For more information - https://www.cisecurity.org/benchmark/azure'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tags:
  - AzureCISBenchmark
query: |
  AzureActivity
  | where CategoryValue =~ "Security"
  | where OperationNameValue =~ "Microsoft.Security/securitySolutions/write"
  | project TimeGenerated, Caller, CallerIpAddress, _ResourceId, ResourceGroup, SubscriptionId
  | extend AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress, AzCustomEntity = _ResourceId
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
  - entityType: AzureResource
    fieldMappings:
      - identifier: ResourceId
        columnName: AzCustomEntity
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    lookbackDuration: PT1H
    matchingMethod: Selected
    groupByEntities:
      - Account
    groupByAlertDetails:
      - DisplayName
version: 1.0.0
kind: Scheduled
