id: c9caa6f2-e9ef-4705-9f81-f06d880906ac
name: CIS Benchmark 5.2.2 Ensure that Activity Log Alert exists for Delete Policy Assignment
description: |
  'This query identifies creating an activity log alert for the Delete Policy Assignment event.
  Monitoring for delete policy assignment events gives insight into changes done in "azure policy - assignments" and can reduce the time it takes to detect unsolicited changes.
  For more information - https://www.cisecurity.org/benchmark/azure'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tags:
  - AzureCISBenchmark
query: |
  AzureActivity
  | where CategoryValue =~ "Administrative"
  | where OperationNameValue =~ "microsoft.authorization/policyassignments/delete"
  | project TimeGenerated, Caller, CallerIpAddress, _ResourceId, ResourceGroup, SubscriptionId
  | extend AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress, AzCustomEntity = _ResourceId
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
  - entityType: AzureResource
    fieldMappings:
      - identifier: ResourceId
        columnName: AzCustomEntity
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    lookbackDuration: PT1H
    matchingMethod: Selected
    groupByEntities:
      - Account
    groupByAlertDetails:
      - DisplayName
version: 1.0.0
kind: Scheduled
