id: b2c15736-b9eb-4dae-8b02-3016b6a45a32
name: Granting permissions to account - detection variant
description: |
  looks for IPs from which users grant access to others on azure resources. A new 
  source IP address for such activity results in an alert being generated.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 24h
queryPeriod: 24h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - PrivilegeEscalation
query: |

  let createRoleAssignmentActivity = AzureActivity
  | where OperationName == "Create role assignment"
  | where ActivityStatus == "Succeeded"
  | project TimeGenerated, EventSubmissionTimestamp, Caller, CallerIpAddress, SubscriptionId, ResourceId;
  // The number of operations below which an IP address is considered an unusual source of role assignment operations
  let alertOperationThreshold = 5;
  createRoleAssignmentActivity 
  | where TimeGenerated >= ago(30d)
  | summarize count() by CallerIpAddress
  | where count_ <= alertOperationThreshold
  | join kind = rightsemi ( createRoleAssignmentActivity
  | where TimeGenerated >= ago(1d)
  ) on CallerIpAddress
