id: 9fb57e58-3ed8-4b89-afcf-c8e786508b1c
name: Common deployed resources
description: |
  this query looks for common deployed resources (resource name and resource groups). Alerts is
  generated for new ResourceGroups first seen associated with deployment operations.
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 24h
queryPeriod: 24h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Exe cution
query: |

  AzureActivity
  | where TimeGenerated between (ago(7d).. ago(1d))
  | where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
  | where ActivityStatus == "Succeeded" 
  | project Resource, ResourceGroup 
  | evaluate basket()
  | join kind=rightantisemi (
  AzureActivity
  | where TimeGenerated >ago(1d)
  | where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
  | where ActivityStatus == "Succeeded" 
  | project Resource, ResourceGroup 
  ) on ResourceGroup 

