id: 9fb57e58-3ed8-4b89-afcf-c8e786508b1c
name: Suspicious Resource deployment
description: |
  'Identifies when a rare Resource and ResourceGroup deployment occurs by a previously unseen Caller.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |

  AzureActivity
  | where TimeGenerated between (ago(7d) .. ago(1d))
  | where OperationName =~ "Create or Update Virtual Machine" or OperationName =~ "Create Deployment" 
  | where ActivityStatus =~ "Succeeded" 
  | project Resource, ResourceGroup, Caller, OperationName, CallerIpAddress
  | evaluate basket()
  | join kind=rightantisemi (
  AzureActivity
  | where TimeGenerated >ago(1d)
  | where OperationName =~ "Create or Update Virtual Machine" or OperationName =~ "Create Deployment" 
  | where ActivityStatus =~ "Succeeded" 
  | project TimeGenerated, Resource, ResourceGroup, Caller, OperationName, CallerIpAddress 
  ) on ResourceGroup 
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), CreateCount = count() by Caller, CallerIpAddress, Resource, ResourceGroup, OperationName
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress
  | sort by CreateCount desc nulls last 
