id: 9fb57e58-3ed8-4b89-afcf-c8e786508b1c
name: Suspicious Resource deployment
description: |
  'Identifies when a rare Resource and ResourceGroup deployment occurs by a previously unseen Caller.'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |

  let szOperationNames = dynamic(["Create or Update Virtual Machine", "Create Deployment"]);
  let starttime = 14d;
  let endtime = 1d;
  let RareCaller = AzureActivity
  | where TimeGenerated between (ago(starttime) .. ago(endtime))
  | where OperationName in~ (szOperationNames)
  | project ResourceGroup, Caller, OperationName, CallerIpAddress
  | join kind=rightantisemi (
  AzureActivity
  | where TimeGenerated > ago(endtime)
  | where OperationName in~ (szOperationNames)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ActivityStatus = makeset(ActivityStatus), OperationIds = makeset(OperationId), CallerIpAddress = makeset(CallerIpAddress) 
  by ResourceId, Caller, OperationName, Resource, ResourceGroup
  ) on Caller, ResourceGroup 
  | mvexpand CallerIpAddress
  | where isnotempty(CallerIpAddress);
  let Counts = RareCaller | summarize ActivityCountByCaller = count() by Caller;
  RareCaller | join kind= inner (Counts) on Caller | project-away Caller1
  | extend timestamp = StartTimeUtc, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress
  | sort by ActivityCountByCaller desc nulls last 
