// Name: Common deployed resources
//
// Id: 9fb57e58-3ed8-4b89-afcf-c8e786508b1c
//
// Description: this query looks for common deployed resources (resource name and resource groups). Alerts is
// generated for new ResourceGroups first seen associated with deployment operations.
//
// Data source: AzureActivity
//
// Severity: Low
//
// QueryFrequency: 24
//
// QueryPeriod: 24
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// Techniques: #Execution
//
AzureActivity
| where TimeGenerated between (ago(7d).. ago(1d))
| where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
| where ActivityStatus == "Succeeded" 
| project Resource, ResourceGroup 
| evaluate basket()
| join kind=rightantisemi (
AzureActivity
| where TimeGenerated >ago(1d)
| where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
| where ActivityStatus == "Succeeded" 
| project Resource, ResourceGroup 
) on ResourceGroup 
