Parser:
  Title: File Activity ASIM parser for Azure File Storage
  Version: "0.1.1"
  LastUpdated: Nov 01, 2023
Product:
  Name: Microsoft Azure File Storage
Normalization:
  Schema: FileEvent
  Version: "0.2.1"
References:
  - Title: ASIM File Schema
    Link: https://aka.ms/ASimFileEventDoc
  - Title: ASIM
    Link: https://aka.ms/AboutASIM
  - Title: Storage Analytics log format
    Link: https://docs.microsoft.comrest/api/storageservices/storage-analytics-log-format
Description: This ASIM parser supports normalizing Azure File Storage events, stored in the StorageFileLogs table, to the ASIM file activity schema.
ParserName: ASimFileEventAzureFileStorage
EquivalentBuiltInParser: _ASim_FileEvent_AzureFileStorage
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  // https://docs.microsoft.comrest/api/storageservices/storage-analytics-logged-operations-and-status-messages
  let parser=(disabled:bool=false){
  let fileoperations=datatable(OperationName:string, EventType:string)[
  "DeleteFile", "FileDeleted"
  , "DeleteDirectory", "FolderDeleted"
  , "GetFile", "FileAccessed"
  , "CopyFile", "FileCopied"
  , "CreateFileSnapshot", "FileCreated"
  , "CreateDirectory", "FolderCreated"
  , "CreateFile", "FileCreated"
  , "CreateShare", "FolderCreated"
  , "DeleteShare", "FileDeleted"
  , "PutRange", "FileModified"
  , "CopyFileDestination", "FileCopied"
  , "CopyFileSource", "FileCopied"
  ];
  StorageFileLogs
  | where not(disabled)
  // **** relevant data filtering;
  | where OperationName in (fileoperations)
  //
  | extend 
        EventCount=int(1)
      , EventStartTime=TimeGenerated
      , EventEndTime=TimeGenerated
  //	, EventType :string  ---> see lookup below
      , EventResult=iff(StatusText == 'Success', 'Success', 'Failure') 
    	, EventOriginalUid = CorrelationId
      , EventOriginalType=OperationName
      , EventProduct='Azure File Storage' 
      , EventVendor='Microsoft'
      , EventSchemaVersion='0.1.0'
  	, TargetFilePath=tostring(split(Uri,'?')[0]) 
  	, TargetFilePathType='URL'
    	, TargetUrl=Uri
      ,  SrcIpAddr=tostring(split(CallerIpAddress,':')[0])
      ,  SrcPortNumber=tostring(split(CallerIpAddress,':')[0])
    	, HttpUserAgent=UserAgentHeader
  | extend TargetFileName=tostring(split(TargetFilePath,'/')[-1])
  | lookup fileoperations on OperationName
  // Aliases
  | extend 
     FilePath=TargetFilePath
     };
  parser (disabled = disabled)
