Parser:
  Title: File Event ASIM filtering parser for Microsoft Windows Events
  Version: '0.2.1'
  LastUpdated: May 31, 2023
Product:
  Name: Microsoft Windows Events
Normalization:
  Schema: FileEvent
  Version: '0.1'
References:
- Title: ASIM File Event Schema
  Link: https://aka.ms/ASimFileEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports normalizing Microsoft Windows Events (WindowsEvent and SecurityEvent tables) to the ASIM File Event normalized schema. Event IDs which are parsed as part of this parser: 4663, 5140
ParserName: vimFileEventMicrosoftWindowsEvents
ParserQuery: |
let Parser=()
{  
  let EventType5140Lookup = datatable (AccessMask:string,EventType:string)
  [
      "0x1", "FileAccessed"
      , "0x2", "FileModified"
      , "0x4", "FileModified"
      , "0x8", "FileAccessed"
      , "0x10", "FileModified"
      , "0x20", "FileAccessed"
      , "0x40", "FileDeleted"
      , "0x80", "FileAccessed"
      , "0x100", "FileModified"
      , "0x10000", "FileDeleted"
      , "0x20000", "FileAccessed"
      , "0x40000", "FileModified"
      , "0x80000", "FileModified"
      , "0x100000", "FileAccessed"
      , "0x1000000", "FileAccessed"
  ];
  let EventSubType5140Lookup = datatable (AccessList:string,EventSubType:string)
  [
      "%%4416", "Preview"
      , "%%4417", "Checkin"
      , "%%4418", "Extended"
      , "%%4419", "N/A"
      , "%%4420", "N/A"
      , "%%4421", "N/A"
      , "%%4422", "N/A"
      , "%%4423", "N/A"
      , "%%4424", "N/A"
      , "%%1537", "N/A"
      , "%%1538", "N/A"
      , "%%1539", "N/A"
      , "%%1540", "N/A"
      , "%%1541", "N/A"
      , "%%1542", "N/A"
  ];
  let EventType4663Lookup = datatable (AccessMask:string,EventType:string)
  [
      "0x1", "ObjectAccessed"
      , "0x10", "MetadataModified"
      , "0x100", "MetadataModified"
      , "0x10000", "ObjectDeleted"
      , "0x2", "ObjectModified"
      , "0x20000", "MetadataAccessed"
      , "0x4", "ObjectModified"
      , "0x40", "ObjectDeleted"
      , "0x40000", "MetadataModified"
      , "0x6", "ObjectModified"
      , "0x8", "MetadataAccessed"
      , "0x80", "MetadataAccessed"
      , "0x80000", "MetadataModified"
  ];
  let ActorUserTypeLookup = datatable (AccountType:string, ActorUserType:string)
  [
    'User', 'Regular',
    'Machine', 'Machine'
  ];    
  let SIDCommonLookup = datatable (sid:string, username:string, type:string)
  [
    'S-1-5-18', 'Local System', 'Simple',
    'S-1-0-0', 'Nobody', 'Simple'
  ];
  let 4663events =
    union isfuzzy=false (
    WindowsEvent
        | where EventID == 4663 
            and EventData.ObjectType == "File"
            and EventData.ObjectName !startswith @"\Device\"
        | project TimeGenerated
            , EventID
            , AccessMask = tostring(EventData.AccessMask)
            , ProcessName = tostring(EventData.ProcessName)
            , SubjectUserSid = tostring(EventData.SubjectUserSid)
            , AccountType = tostring(EventData.AccountType)
            , Computer = tostring(EventData.Computer)
            , ObjectName = tostring(EventData.ObjectName)
            , ProcessId = tostring(EventData.ProcessId)
            , SubjectUserName = tostring(EventData.SubjectUserName)
            , SubjectAccount = tostring(EventData.SubjectAccount)
            , SubjectLogonId = tostring(EventData.SubjectLogonId)
            , HandleId = tostring(EventData.HandleId)
    )
  , ( 
    SecurityEvent
        | where EventID == 4663 
            and ObjectType == "File"
            and ObjectName !startswith @"\Device\"
        | project TimeGenerated
            , EventID
            , AccessMask
            , ProcessName
            , SubjectUserSid
            , AccountType
            , Computer
            , ObjectName
            , ProcessId
            , SubjectUserName
            , SubjectAccount
            , SubjectLogonId
            , HandleId
    )
        | lookup EventType4663Lookup on AccessMask
        | extend ActingProcessName = ProcessName
            , ActingProcessId = tostring(toint(ProcessId))
            , TargetFilePath = ObjectName
        | project-away ProcessId
        | project-rename Process = ProcessName
            , FilePath = ObjectName
            , FileSessionId = HandleId
  ;
  let 5140events = 
    SecurityEvent
        | where EventID == 5140
            and ObjectType == "File"
        | project TimeGenerated, EventID, AccessMask, AccessList, SubjectUserSid, AccountType, Computer, SubjectUserName, SubjectAccount, SubjectLogonId, ShareName
        | lookup EventType5140Lookup on AccessMask
        | lookup EventSubType5140Lookup on AccessList
        | extend TargetFilePath = ShareName
        | project-rename FilePath = ShareName
    ;
  union isfuzzy=false
    4663events
    , 5140events
        | lookup ActorUserTypeLookup on AccountType
        | lookup SIDCommonLookup on $left.SubjectUserSid == $right.sid
        | extend ActorUsername = iff (SubjectUserName == "-", username, SubjectAccount)
            , ActorUsernameType = iff(SubjectUserName == '-',type, 'Windows')
            , EventStartTime = TimeGenerated
            , EventEndTime = TimeGenerated
            , TargetFilePathFormat = "Windows Local"
            , EventOriginalType = tostring(EventID)
        | project-away EventID, AccountType, type, username
        | project-rename ActorUserId = SubjectUserSid
            , DvcHostname = Computer
            , ActorSessionId = SubjectLogonId
        | extend EventSchema = "FileEvent"
            , EventSchemaVersion = "0.1.1"
            , EventResult = "Success"
            , EventCount = int(1)
            , EventVendor = 'Microsoft'
            , EventProduct = 'Security Events'
            , Dvc = DvcHostname
            , ActorWindowsUsername = ActorUsername
            , User = ActorUsername
            , ActorUserSid = ActorUserId
};
Parser
