Parser:
  Title: FileEvent ASIM filtersiltering parser for AWS Cloud Trail
  Version: '0.1.0'
  LastUpdated: Feb 04, 2026
Product:
  Name: AWS Cloud Trail
Normalization:
  Schema: FileEvent
  Version: "0.1.0"
References:
- Title: ASIM User Management Schema
  Link: https://aka.ms/ASimFileEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
- Title: File Event (S3) Documentation in AWS CloudTrail logs 
  Link: https://docs.aws.amazon.com/AmazonS3/latest/API/API_Operations_Amazon_Simple_Storage_Service.html
Description: |
  This ASIM parser supports normalizing file activity in AWS Cloud Trail for the following event sources: (s3.amazonaws.com)
ParserName: vimFileEventAWSCloudTrail
EquivalentBuiltInParser: _vim_FileEvent_AWSCloudTrail
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: eventtype_in
    Type: dynamic
    Default: dynamic([])
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: actorusername_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: targetfilepath_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: srcfilepath_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: hashes_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: dvchostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: disabled
    Type: bool
    Default: false
  - Name: pack
    Type: bool
    Default: false
ParserQuery: |
  let ParseS3Events = (T: (EventSource: string, EventName: string, RequestParameters: dynamic, ResponseElements: dynamic, Resources: dynamic)) {
      let S3EventNameLookup = datatable(EventName: string, EventType: string, EventSubType: string)
      [  
          "CompleteMultipartUpload", "FileCreated", "Checkin",
          "CopyObject", "FileCopied", "",
          "CreateBucket", "FolderCreated", "",
          "CreateBucketMetadataConfiguration", "FolderModified", "",
          "CreateBucketMetadataTableConfiguration", "FolderModified", "",
          "CreateMultipartUpload", "FileCreated", "Checkin",
          "DeleteBucket", "FolderDeleted", "",
          "DeleteBucketAnalyticsConfiguration", "FolderModified", "",
          "DeleteBucketCors", "FolderModified", "",
          "DeleteBucketEncryption", "FolderModified", "",
          "DeleteBucketIntelligentTieringConfiguration", "FolderModified", "",
          "DeleteBucketInventoryConfiguration", "FolderModified", "",
          "DeleteBucketLifecycle", "FolderModified", "",
          "DeleteBucketMetadataConfiguration", "FolderModified", "",
          "DeleteBucketMetadataTableConfiguration", "FolderModified", "",
          "DeleteBucketMetricsConfiguration", "FolderModified", "",
          "DeleteBucketOwnershipControls", "FolderModified", "",
          "DeleteBucketPolicy", "FolderModified", "",
          "DeleteBucketReplication", "FolderModified", "",
          "DeleteBucketTagging", "FolderModified", "",
          "DeleteBucketWebsite", "FolderModified", "",
          "DeleteObject", "FileDeleted", "",
          "DeleteObjects", "FileDeleted", "",
          "DeleteObjectTagging", "FileAttributesUpdated", "",
          "DeletePublicAccessBlock", "FileAttributesUpdated", "",
          "GetBucketAbac", "FolderAttributesAccessed", "",
          "GetBucketAccelerateConfiguration", "FolderAttributesAccessed", "",
          "GetBucketAcl", "FolderAttributesAccessed", "",
          "GetBucketAnalyticsConfiguration", "FolderAttributesAccessed", "",
          "GetBucketCors", "FolderAttributesAccessed", "",
          "GetBucketEncryption", "FolderAttributesAccessed", "",
          "GetBucketIntelligentTieringConfiguration", "FolderAttributesAccessed", "",
          "GetBucketInventoryConfiguration", "FolderAttributesAccessed", "",
          "GetBucketLifecycle", "FolderAttributesAccessed", "",
          "GetBucketLifecycleConfiguration", "FolderAttributesAccessed", "",
          "GetBucketLocation", "FolderAttributesAccessed", "",
          "GetBucketLogging", "FolderAttributesAccessed", "",
          "GetBucketMetadataConfiguration", "FolderAttributesAccessed", "",
          "GetBucketMetadataTableConfiguration", "FolderAttributesAccessed", "",
          "GetBucketMetricsConfiguration", "FolderAttributesAccessed", "",
          "GetBucketNotification", "FolderAttributesAccessed", "",
          "GetBucketNotificationConfiguration", "FolderAttributesAccessed", "",
          "GetBucketOwnershipControls", "FolderAttributesAccessed", "",
          "GetBucketPolicy", "FolderAttributesAccessed", "",
          "GetBucketPolicyStatus", "FolderAttributesAccessed", "",
          "GetBucketReplication", "FolderAttributesAccessed", "",
          "GetBucketRequestPayment", "FolderAttributesAccessed", "",
          "GetBucketTagging", "FolderAttributesAccessed", "",
          "GetBucketVersioning", "FolderAttributesAccessed", "",
          "GetBucketWebsite", "FolderAttributesAccessed", "",
          "GetObject", "FileAccessed", "Download",
          "GetObjectAcl", "FileAccessed", "",
          "GetObjectAttributes", "FileAccessed", "",
          "GetObjectLegalHold", "FileAccessed", "",
          "GetObjectLockConfiguration", "FileAccessed", "",
          "GetObjectRetention", "FileAccessed", "",
          "GetObjectTagging", "FileAccessed", "",
          "GetObjectTorrent", "FileAccessed", "",
          "GetPublicAccessBlock", "FolderAttributesAccessed", "",
          "HeadBucket", "FolderAttributesAccessed", "",
          "HeadObject", "FileAccessed", "",
          "ListBucketAnalyticsConfigurations", "FolderAttributesAccessed", "",
          "ListBucketIntelligentTieringConfigurations", "FolderAttributesAccessed", "",
          "ListBucketMetricsConfigurations", "FolderAttributesAccessed", "",
          "ListBuckets", "FolderAttributesAccessed", "",
          "ListDirectoryBuckets", "FolderAttributesAccessed", "",
          "ListObjects", "FileAccessed", "",
          "ListObjectsV2", "FileAccessed", "",
          "ListObjectVersions", "FileAccessed", "",
          "ListParts", "FileAccessed", "",
          "PutBucketAbac", "FolderModified", "",
          "PutBucketAccelerateConfiguration", "FolderModified", "",
          "PutBucketAcl", "FolderModified", "",
          "PutBucketAnalyticsConfiguration", "FolderModified", "",
          "PutBucketCors", "FolderModified", "",
          "PutBucketEncryption", "FolderModified", "",
          "PutBucketIntelligentTieringConfiguration", "FolderModified", "",
          "PutBucketInventoryConfiguration", "FolderModified", "",
          "PutBucketLifecycle", "FolderModified", "",
          "PutBucketLifecycleConfiguration", "FolderModified", "",
          "PutBucketLogging", "FolderModified", "",
          "PutBucketMetricsConfiguration", "FolderModified", "",
          "PutBucketNotification", "FolderModified", "",
          "PutBucketNotificationConfiguration", "FolderModified", "",
          "PutBucketOwnershipControls", "FolderModified", "",
          "PutBucketPolicy", "FolderModified", "",
          "PutBucketReplication", "FolderModified", "",
          "PutBucketRequestPayment", "FolderModified", "",
          "PutBucketTagging", "FolderModified", "",
          "PutBucketVersioning", "FolderModified", "",
          "PutBucketWebsite", "FolderModified", "",
          "PutObject", "FileCreated", "Upload",
          "PutObjectAcl", "FileAttributesUpdated", "",
          "PutObjectLegalHold", "FileAttributesUpdated", "",
          "PutObjectLockConfiguration", "FileAttributesUpdated", "",
          "PutObjectRetention", "FileAttributesUpdated", "",
          "PutObjectTagging", "FileAttributesUpdated", "",
          "PutPublicAccessBlock", "FolderModified", "",
          "RenameObject", "FileRenamed", "",
          "RestoreObject", "FileCreated", "",
          "SelectObjectContent", "FileAccessed", "",
          "UpdateBucketMetadataInventoryTableConfiguration", "FolderModified", "",
          "UpdateBucketMetadataJournalTableConfiguration", "FolderModified", "",
          "UpdateObjectEncryption", "FileAttributesUpdated", "",
          "UploadPart", "FileCreated", "Upload",
          "UploadPartCopy", "FileCreated", "Upload"
          // Omitted Actions
          // AbortMultipartUpload
          // CreateSession
          // ListMultipartUploads
          // WriteGetObjectResponse
      ];
      T
      | where EventSource == "s3.amazonaws.com"
      | lookup S3EventNameLookup on EventName
      | where isnotempty(EventType)
      | where ((array_length(eventtype_in) == 0 or EventType in~ (eventtype_in)))
      | extend EventSubType = case(
          EventType == "FileDeleted" and ResponseElements["x-amz-delete-marker"] == true, "Versions",
          EventSubType
      )
      | extend
          TargetFileDirectory = tostring(RequestParameters.bucketName),
          TargetFileName = coalesce(tostring(RequestParameters.key), tostring(RequestParameters.prefix))
      | extend
          TargetFilePathType = "Unix",
          TargetFilePath = strcat(TargetFileDirectory, "/", TargetFileName),
          TargetAppType = "Service"
      | where (array_length(targetfilepath_has_any) == 0) or (TargetFilePath has_any (targetfilepath_has_any))
      | extend
          SrcFilePath = tostring(RequestParameters["x-amz-copy-source"])
      // Post-filtering
      | where (array_length(srcfilepath_has_any) == 0) or (SrcFilePath has_any (srcfilepath_has_any))
      // Avoids using mv-apply as it filters insteads of assigning null
      // At most, the Resources array contains two objects: Bucket and Object
      // Resources may contain no objects, or just one of Bucket or Object
      | extend AdditionalData = iff(pack, bag_pack(
          "BucketARN", coalesce(
              iff(Resources[0].type == "AWS::S3::Bucket", tostring(Resources[0].ARN), ""),
              iff(Resources[1].type == "AWS::S3::Bucket", tostring(Resources[1].ARN), "")),
          "ObjectARN", coalesce(
              iff(Resources[0].type == "AWS::S3::Object", tostring(Resources[0].ARN), ""),
              iff(Resources[1].type == "AWS::S3::Object", tostring(Resources[1].ARN), ""))
      ), dynamic([]))
  };
  let parser = (
      starttime: datetime=datetime(null),
      endtime: datetime=datetime(null),
      eventtype_in: dynamic=dynamic([]),
      srcipaddr_has_any_prefix: dynamic=dynamic([]),
      actorusername_has_any: dynamic=dynamic([]),
      targetfilepath_has_any: dynamic=dynamic([]),
      srcfilepath_has_any: dynamic=dynamic([]),
      hashes_has_any: dynamic=dynamic([]),
      dvchostname_has_any: dynamic=dynamic([]),
      disabled: bool=false,
      pack: bool=false) {
  let SupportedEventSources = dynamic([
      "s3.amazonaws.com"
  ]);
  let EventSourceNameLookup = datatable(EventSource: string, TargetAppName: string)
  [
      "s3.amazonaws.com", "Amazon S3"
  ];
  let SupportedEvents = AWSCloudTrail
      | where not(disabled)
      | where EventSource in (SupportedEventSources)
      | where (isnull(starttime) or TimeGenerated >= starttime) 
          and (isnull(endtime) or TimeGenerated <= endtime)
      | where (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(SourceIpAddress, srcipaddr_has_any_prefix))
          and (array_length(actorusername_has_any) == 0 or UserIdentityUserName has_any (actorusername_has_any))
      | where (array_length(srcfilepath_has_any) == 0) or (RequestParameters has_any (srcfilepath_has_any))
          and (array_length(hashes_has_any) == 0) // Hash information is not stored
          and (array_length(dvchostname_has_any) == 0) // DvcHostname information is not stored
      // targetfilepath and eventtype filtering done later in parser
      | extend RequestParameters = todynamic(RequestParameters), ResponseElements = todynamic(ResponseElements), Resources = todynamic(Resources);
  ParseS3Events(SupportedEvents)
  | extend
      Type = "AWSCloudTrail",
      EventCount = int(1),
      EventStartTime = TimeGenerated,
      EventEndTime = TimeGenerated,
      EventSeverity = "Informational",
      EventSchema = "FileEvent",
      EventSchemaVersion = "0.1.2",
      EventVendor = "AWS",
      EventProduct = "CloudTrail",
      Dvc = "CloudTrail",
      EventResult = iff(isempty(ErrorCode) and isempty(ErrorMessage), "Success", "Failure"),
      EventMessage = ErrorMessage
  | lookup EventSourceNameLookup on EventSource
  | project-rename
      EventOriginalSubType = EventTypeName,
      EventOriginalType = EventName,
      EventUid = AwsEventId,
      EventOriginalResultDetails = ErrorMessage,
      EventProductVersion = EventVersion
  | project-rename
      ActorUserId = UserIdentityAccountId,
      ActorUsername = UserIdentityUserName,
      ActorOriginalUserType = UserIdentityType,
      HttpUserAgent = UserAgent
  | extend
      ActorUserIdType = iff(isempty(ActorUserId), "", "AWSId"),
      ActorUsernameType = iff(isempty(ActorUsername), "", "Simple"),
      SrcIpAddr = iff(ipv4_is_in_range(SourceIpAddress, "0.0.0.0/0"), SourceIpAddress, "")
  | extend AdditionalFields = iff(pack, bag_pack(
      "ActorAccessKeyId", UserIdentityAccessKeyId,
      "AWSRegion", AWSRegion,
      "APIVersion", APIVersion,
      "ManagementEvent", ManagementEvent,
      "ReadOnly", ReadOnly,
      "RequestParameters", RequestParameters,
      "ResponseElements", ResponseElements
  ), dynamic([]))
  | extend AdditionalFields = iff(pack, bag_merge(AdditionalFields, AdditionalData), dynamic([]))
  // Alias
  | extend
      User = ActorUsername,
      IpAddr = SrcIpAddr,
      FileName = TargetFileName,
      FilePath = TargetFilePath,
      Application = TargetAppName
  | project
      TimeGenerated,
      Type,
      EventCount,
      EventStartTime,
      EventEndTime,
      EventSeverity,
      EventSchema,
      EventSchemaVersion,
      EventVendor,
      EventProduct,
      Dvc,
      EventResult,
      EventMessage,
      TargetAppName,
      EventOriginalSubType,
      EventOriginalType,
      EventUid,
      EventOriginalResultDetails,
      EventProductVersion,
      ActorUserId,
      ActorUsername,
      ActorOriginalUserType,
      HttpUserAgent,
      ActorUserIdType,
      ActorUsernameType,
      SrcIpAddr,
      AdditionalFields,
      User,
      IpAddr,
      FileName,
      FilePath,
      Application,
      TargetAppType,
      EventType,
      EventSubType,
      TargetFileDirectory,
      TargetFileName,
      TargetFilePathType,
      TargetFilePath,
      SrcFilePath
  };
  parser(
      starttime=starttime, 
      endtime=endtime, 
      eventtype_in=eventtype_in,
      srcipaddr_has_any_prefix=srcipaddr_has_any_prefix,
      actorusername_has_any=actorusername_has_any,
      targetfilepath_has_any=targetfilepath_has_any,
      srcfilepath_has_any=srcfilepath_has_any,
      hashes_has_any=hashes_has_any,
      dvchostname_has_any=dvchostname_has_any,
      disabled=disabled,
      pack=pack
  )