{
  "Name": "NISTSP80053",
  "Author": "Microsoft - support@microsoft.com",
  "Logo": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Workbooks/Images/Logos/Azure_Sentinel.svg\"width=\"75px\"height=\"75px\">",
  "Description": "This solution enables Compliance Teams, Architects, SecOps Analysts, and Consultants to gain situational awareness for cloud workload security posture. This workbook is designed to augment staffing through automation, visibility, assessment, monitoring and remediation. The Microsoft Sentinel: NIST SP 800-53 R4 solution demonstrates best practice guidance, but Microsoft does not guarantee nor imply compliance. All requirements, validations, and controls are governed by the 💡[National Institute of Standards and Technology (NIST)](https://csrc.nist.gov/publications/detail/sp/800-53/rev-4/archive/2015-01-22). This workbook provides visibility and situational awareness for security capabilities delivered with Microsoft technologies in predominantly cloud-based environments. Customer experience will vary by user and some panels may require additional configurations for operation. Recommendations do not imply coverage of respective controls as they are often one of several courses of action for approaching requirements which is unique to each customer. Recommendations should be considered a starting point for planning full or partial coverage of respective requirements. This workbook does not address all controls within the framework. It should be considered a supplemental tool to gain visibility of technical controls within cloud, multi-cloud, and hybrid networks. For the full listing of respective controls, see the💡[Microsoft Cloud Service Trust Portal](https://servicetrust.microsoft.com/)",
  "Analytic Rules": [
    "Analytic Rules/NISTSP80053PostureChanged.yaml"
  ],
  "Playbooks": [
    "Playbooks/Notify_GovernanceComplianceTeam-NISTSP80053/Notify_GovernanceComplianceTeam.json",
    "Playbooks/DevOpsTask/Open_DevOpsTaskRecommendation.json",
    "Playbooks/JiraTicket/Open_JIRATicketRecommendation.json"
  ],
  "Workbooks": [
    "Workbooks/NISTSP80053.json"
  ],
  "Metadata": "SolutionMetadata.json",
  "BasePath": "C:\\Github\\Azure-Sentinel\\Solutions\\NISTSP80053",
  "Version": "2.0.4",
  "TemplateSpec": true,
  "Is1Pconnector": true
}