id: cc0077f2-a9cc-467d-8e35-7042a54f49d6
name: Antivirus detections (0)
description: |-
  Query for Microsoft Defender Antivirus detections.
  Query #1: Query for Antivirus detection events.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceEvents
query: |-
  DeviceEvents
  | where ActionType == "AntivirusDetection"
  | extend ParsedFields=parse_json(AdditionalFields)
  | project ThreatName=tostring(ParsedFields.ThreatName),
            WasRemediated=tobool(ParsedFields.WasRemediated),
            WasExecutingWhileDetected=tobool(ParsedFields.WasExecutingWhileDetected),
            FileName, SHA1, InitiatingProcessFileName, InitiatingProcessCommandLine,
            DeviceName, Timestamp
  | limit 100
