id: 394140d5-1fd7-4cbe-8135-da6bcde4909b
name: PUA ThreatName per Computer (0)
description: |-
  Today MDE Alerts do not show PUA/WDAV ThreatName. This is a demonstration of how to get, for example, PUA Threat Names.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceEvents
query: "DeviceEvents\r\n| where ActionType == \"AntivirusDetection\"\r\n| extend ParsedFields=parse_json(AdditionalFields)\r\n| where ParsedFields.ThreatName contains \"PUA\"\r\n| project DeviceName, FileName, SHA1 , ThreatName=tostring(ParsedFields.ThreatName),\r\n          WasRemediated=tobool(ParsedFields.WasRemediated),\r\n          WasExecutingWhileDetected=tobool(ParsedFields.WasExecutingWhileDetected), Timestamp "
