id: 1a954599-aa03-421d-a35f-dbe18859bdd5
name: PUA ThreatName per Computer
description: |-
  Today MDE Alerts do not show PUA/WDAV ThreatName. This is a demonstration of how to get, for example, PUA Threat Names.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceEvents
query: "DeviceEvents\r\n| where ActionType == \"AntivirusDetection\"\r\n| extend ParsedFields=parse_json(AdditionalFields)\r\n| where ParsedFields.ThreatName contains \"PUA\"\r\n| project DeviceName, FileName, SHA1 , ThreatName=tostring(ParsedFields.ThreatName),\r\n          WasRemediated=tobool(ParsedFields.WasRemediated),\r\n          WasExecutingWhileDetected=tobool(ParsedFields.WasExecutingWhileDetected), Timestamp "
