Parser:
  Title: Audit Event ASIM filtering parser for AWS CloudTrail activity
  Version: '0.1'
  LastUpdated: Jan 12, 2026
Product:
  Name: AWS CloudTrail
Normalization:
  Schema: AuditEvent
  Version: '0.1.2'
References:
- Title: ASIM Audit Event Schema
  Link: https://aka.ms/ASimAuditEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports filtering and normalizing  AWS CloudTrail activity logs to the ASIM Audit Event schema.
ParserName: vimAuditEventAWSCloudTrail
EquivalentBuiltInParser: _Im_AuditEvent_AWSCloudTrail
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: actorusername_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: operation_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: eventtype_in
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: object_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: newvalue_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: disabled
    Type: bool
    Default: false

ParserQuery: |
  let parser = (
        starttime:datetime=datetime(null), 
        endtime:datetime=datetime(null),
        srcipaddr_has_any_prefix:dynamic=dynamic([]), 
        eventresult:string='*',
        actorusername_has_any:dynamic=dynamic([]),
        eventtype_in:dynamic=dynamic([]),
        operation_has_any:dynamic=dynamic([]),
        object_has_any:dynamic=dynamic([]),
        newvalue_has_any:dynamic=dynamic([]),
        disabled:bool = false
  ) {
  AWSCloudTrail
  | where not(disabled)
  | where
      (isnull(starttime) or TimeGenerated >= starttime) 
      and (isnull(endtime) or TimeGenerated <= endtime)
  | where (array_length(newvalue_has_any) == 0)
  | where (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(SourceIpAddress,srcipaddr_has_any_prefix))
  | where (array_length(actorusername_has_any) == 0 or UserIdentityUserName has_any (actorusername_has_any))
  | where (array_length(operation_has_any) == 0 or EventTypeName has_any (operation_has_any))
  | extend
      EventSchema = 'AuditEvent',
      EventSchemaVersion = '0.1.2',
      EventSubType = EventName,
      EventCount = int(1),
      EventStartTime = TimeGenerated,
      EventEndTime = TimeGenerated,
      EventProduct = "CloudTrail",
      EventVendor = "AWS",
      Dvc = "CloudTrail",
      Type = "AWSCloudTrail",
      EventUid = AwsEventId,
      EventMessage = ErrorMessage,
      EventOriginalType = EventTypeName,
      EventProductVersion = EventVersion,
      EventResult = iff(isempty(ErrorMessage) == True and isempty(ErrorCode) == True, 'Success', 'Failure')
      | where eventresult == "*" or (EventResult == eventresult)
      | extend EventType = case (
          EventName startswith "Access", "Read",
          EventName startswith "Abort", "Stop",
          EventName startswith "Accept", "Enable",
          EventName startswith "Activate", "Initialize",
          EventName startswith "Add", "Create",
          EventName startswith "Allocate", "Enable",
          EventName startswith "Allow", "Enable",
          EventName startswith "Alter", "Set",
          EventName startswith "Analyze", "Read",
          EventName startswith "Apply", "Set",
          EventName startswith "Approve", "Enable",
          EventName startswith "Archive", "Set",
          EventName startswith "Assign", "Set",
          EventName startswith "Associate", "Set",
          EventName startswith "Assume", "Execute",
          EventName startswith "Attach", "Set",
          EventName startswith "Authenticate", "Execute",
          EventName startswith "Authorize", "Execute",
          EventName startswith "BackupDatabase", "Create",
          EventName startswith "Build", "Initialize",
          EventName startswith "Calculate", "Execute",
          EventName startswith "Cancel", "Stop",
          EventName startswith "Chat", "Execute",
          EventName startswith "Check", "Read",
          EventName startswith "Claim", "Execute",
          EventName startswith "Classify", "Set",
          EventName startswith "Clone", "Execute",
          EventName startswith "Close", "Disable",
          EventName startswith "Compare", "Execute",
          EventName startswith "Configure", "Set",
          EventName startswith "Confirm", "Execute",
          EventName startswith "Continue", "Execute",
          EventName startswith "Console", "Execute",
          EventName startswith "Converse", "Execute",
          EventName startswith "Copy", "Create",
          EventName startswith "Create", "Create",
          EventName startswith "Credential", "Execute",
          EventName startswith "Deactivate", "Disable",
          EventName startswith "Decrease", "Execute",
          EventName startswith "Delete", "Delete",
          EventName startswith "Decode", "Execute",
          EventName startswith "Deliver", "Execute",
          EventName startswith "Describe", "Read",
          EventName startswith "Disable", "Disable",
          EventName startswith "Disconnect", "Disable",
          EventName startswith "Download", "Read",
          EventName startswith "Enable", "Enable",
          EventName startswith "End", "Stop",
          EventName startswith "Export", "Execute",
          EventName startswith "Change", "Set",
          EventName startswith "Complete", "Execute",
          EventName startswith "Convert", "Set",
          EventName startswith "Decrypt", "Execute",
          EventName startswith "Deregister", "Disable",
          EventName startswith "Detect", "Execute",
          EventName startswith "Detach", "Delete",
          EventName startswith "Disassociate", "Disable",
          EventName startswith "Discover", "Execute",
          EventName startswith "Dispose", "Clear",
          EventName startswith "Drop", "Delete",
          EventName startswith "Encrypt", "Execute",
          EventName startswith "Enter", "Initialize",
          EventName startswith "Evaluate", "Execute",
          EventName startswith "Execute", "Execute",
          EventName startswith "Exit", "Stop",
          EventName startswith "Expire", "Disable",
          EventName startswith "Federate", "Execute",
          EventName startswith "Git", "Execute",
          EventName startswith "Group", "Set",
          EventName startswith "Failover", "Other",
          EventName startswith "Finalize", "Other",
          EventName startswith "Find", "Read",
          EventName startswith "Filter", "Read",
          EventName startswith "Flush", "Execute",
          EventName startswith "Forgot", "Execute",
          EventName startswith "Generate", "Create",
          EventName startswith "Get", "Read",
          EventName startswith "Grant", "Enable",
          EventName startswith "Head", "Read",
          EventName startswith "Import", "Create",
          EventName startswith "Increase", "Set",
          EventName startswith "Index", "Execute",
          EventName startswith "Infer", "Execute",
          EventName startswith "Ingest", "Set",
          EventName startswith "Initia", "Initialize",
          EventName startswith "Invite", "Execute",
          EventName startswith "Invoke", "Execute",
          EventName startswith "IsMember", "Read",
          EventName startswith "Issue", "Execute",
          EventName startswith "JobStatus", "Other",
          EventName startswith "Label", "Set",
          EventName startswith "Leave", "Execute",
          EventName startswith "List", "Read",
          EventName startswith "Lock", "Execute",
          EventName startswith "Log", "Execute",
          EventName startswith "Lookup", "Read",
          EventName startswith "Manage", "Execute",
          EventName startswith "Mark", "Set",
          EventName startswith "Merge", "Set",
          EventName startswith "Meter", "Read",
          EventName startswith "Migrate", "Execute",
          EventName startswith "Modify", "Set",
          EventName startswith "Monitor", "Execute",
          EventName startswith "Move", "Set",
          EventName startswith "New", "Initialize",
          EventName startswith "Notify", "Execute",
          EventName startswith "Open", "Execute",
          EventName startswith "OptIn", "Execute",
          EventName startswith "Override", "Execute",
          EventName startswith "Patch", "Set",
          EventName startswith "Pause", "Stop",
          EventName startswith "Persist", "Execute",
          EventName startswith "Poll", "Read",
          EventName startswith "Predict", "Execute",
          EventName startswith "Prepare", "Execute",
          EventName startswith "Preview", "Read",
          EventName startswith "Probe", "Execute",
          EventName startswith "Process", "Execute",
          EventName startswith "Promote", "Set",
          EventName startswith "Provision", "Execute",
          EventName startswith "Publish", "Create",
          EventName startswith "Purchase", "Execute",
          EventName startswith "Purge", "Delete",
          EventName startswith "Put", "Set",
          EventName startswith "Query", "Read",
          EventName startswith "Read", "Read",
          EventName startswith "Rebuild", "Execute",
          EventName startswith "Reboot", "Start",
          EventName startswith "Receive", "Execute",
          EventName startswith "Record", "Record",
          EventName startswith "ReEncrypt", "Execute",
          EventName startswith "Redeem", "Execute",
          EventName startswith "Redrive", "Other",
          EventName startswith "Register", "Install",
          EventName startswith "Reimport", "Set",
          EventName startswith "Reject", "Disable",
          EventName startswith "Release", "Execute",
          EventName startswith "Reload", "Execute",
          EventName startswith "Render", "Execute",
          EventName startswith "Renew", "Execute",
          EventName startswith "Replace", "Set",
          EventName startswith "Report", "Execute",
          EventName startswith "Request", "Initialize",
          EventName startswith "Refresh", "Execute",
          EventName startswith "Respond", "Execute",
          EventName startswith "Resend", "Execute",
          EventName startswith "Remove", "Clear",
          EventName startswith "Replicate", "Create",
          EventName startswith "Resize", "Set",
          EventName startswith "Resolve", "Enable",
          EventName startswith "Restart", "Initialize",
          EventName startswith "Restore", "Enable",
          EventName startswith "Resume", "Start",
          EventName startswith "Retire", "Disable",
          EventName startswith "Retrieve", "Read",
          EventName startswith "Retry", "Execute",
          EventName startswith "Revoke", "Disable",
          EventName startswith "Rollback", "Execute",
          EventName startswith "Rotate", "Set",
          EventName startswith "Run", "Initialize",
          EventName startswith "Save", "Set",
          EventName startswith "Scan", "Read",
          EventName startswith "Scheduled", "Other",
          EventName startswith "Search", "Execute",
          EventName startswith "Select", "Read",
          EventName startswith "Send", "Execute",
          EventName startswith "ServiceQuotas", "Other",
          EventName startswith "Set", "Set",
          EventName startswith "Sign", "Execute",
          EventName startswith "Simulate", "Execute",
          EventName startswith "Split", "Execute",
          EventName startswith "Subscribe", "Execute",
          EventName startswith "Start", "Start",
          EventName startswith "Stream", "Execute",
          EventName startswith "Stop", "Stop",
          EventName startswith "Submit", "Execute",
          EventName startswith "Suspend", "Stop",
          EventName startswith "Swap", "Set",
          EventName startswith "Switch", "Execute",
          EventName startswith "Sync", "Execute",
          EventName startswith "Synchronize", "Execute",
          EventName startswith "TablesMaintenance", "Other",
          EventName startswith "Tag", "Set",
          EventName startswith "Terminate", "Stop",
          EventName startswith "Test", "Execute",
          EventName startswith "Transfer", "Execute",
          EventName startswith "Translate", "Execute",
          EventName startswith "Trigger", "Execute",
          EventName startswith "Subscribe", "Execute",
          EventName startswith "Synthesize", "Execute",
          EventName startswith "Unassign", "Clear",
          EventName startswith "Unauthorize", "Disable",
          EventName startswith "Unlock", "Enable",
          EventName startswith "Unsubscribe", "Disable",
          EventName startswith "Untag", "Clear",
          EventName startswith "Update", "Set",
          EventName startswith "Upgrade", "Execute",
          EventName startswith "Upload", "Create",
          EventName startswith "UseConnection", "Execute",
          EventName startswith "Validate", "Execute",
          EventName startswith "Verify", "Execute",
          EventName startswith "Wipe", "Delete",
          EventName contains_cs "Add", "Create",
          EventName contains_cs "Authentication", "Execute",
          EventName contains_cs "Check", "Execute",
          EventName contains_cs "Confirm", "Execute",
          EventName contains_cs "Create", "Create",
          EventName contains_cs "Describe", "Read",
          EventName contains_cs "Delet", "Delete",
          EventName contains_cs "Detect", "Execute",
          EventName contains_cs "Disable", "Disable",
          EventName contains_cs "Enable", "Enable",
          EventName contains_cs "Execute", "Execute",
          EventName contains "Get", "Read",
          EventName contains_cs "GlobalSign", "Execute",
          EventName contains_cs "Grant", "Execute",
          EventName contains_cs "Import", "Create",
          EventName contains_cs "Initiate", "Initialize",
          EventName contains_cs "Link", "Set",
          EventName contains_cs "List", "Read",
          EventName contains_cs "Login", "Execute",
          EventName contains "Post", "Set",
          EventName contains_cs "Put", "Set",
          EventName contains_cs "Remove", "Delete", 
          EventName contains_cs "Resend", "Execute",
          EventName contains_cs "Reset", "Execute",
          EventName contains_cs "Respond", "Execute",
          EventName contains_cs "Set", "Set",
          EventName contains_cs "Stop", "Stop",
          EventName contains_cs "Usage", "Read",
          EventName contains_cs "Validate", "Execute",
          EventName contains_cs "Write", "Create",
          EventName contains_cs "Update", "Set",
          EventName == "action", "Other",
          EventName == "BidEvictedEvent", "Other",
          EventName startswith "Backup", "Other",
          EventName startswith "Password", "Other",
          EventName startswith "Rotation", "Other",
          EventName startswith "PassRequest", "Other",
          EventName startswith "PolicyExecution", "Other",
          EventName startswith "Preflight", "Other",
          EventName startswith "Replication", "Other",
          "Other"
      )
  | where array_length(eventtype_in) == 0 or EventType in (eventtype_in)
  | extend OriginalObject = todynamic(todynamic(Resources)[0])
  | where (array_length(object_has_any) == 0 or tostring(OriginalObject['ARN']) has_any (object_has_any))
  | extend 
      Operation = EventName,
      ObjectType = "Cloud Resource",
      Object = tostring(OriginalObject['ARN']),
      ObjectId = tostring(OriginalObject['ARN']),
      OriginalObjectType = tostring(OriginalObject['type'])
  | extend
      ActorUserId = UserIdentityArn,
      ActorUserIdType = iff(isempty(UserIdentityArn), "", "AWSId"),
      ActorScopeId = UserIdentityAccountId,
      ActorUsername = UserIdentityUserName,
      ActorUsernameType = iff(isempty(UserIdentityUserName), "", "Simple"),
      ActorOriginalUserType = UserIdentityType,
      HttpUserAgent = UserAgent,
      SrcIpAddr = iff(ipv4_is_in_range(SourceIpAddress, "0.0.0.0/0"), SourceIpAddress, ""),
      TargetDomain = tostring(todynamic(RequestParameters).Host)
  | extend TargetDomainType = iff(isempty(TargetDomain), "", "FQDN")
  | invoke _ASIM_ResolveSrcFQDN('EventSource')
  // Aliases
  | extend
      IpAddr = SrcIpAddr,
      Src = coalesce(SrcIpAddr, SrcHostname),
      User = ActorUsername
  | extend AdditionalFields = bag_pack(
      "RequestParameters", RequestParameters,
      "ResponseElements", ResponseElements
  )
  | project
      TimeGenerated,
      EventSchema,
      EventSchemaVersion,
      EventType,
      EventSubType,
      EventCount,
      EventStartTime,
      EventEndTime,
      EventProduct,
      EventVendor,
      EventResult,
      Operation,
      Object,
      ObjectType,
      ObjectId,
      OriginalObjectType,
      Dvc,
      Type,
      EventUid,
      EventMessage,
      EventOriginalType,
      EventProductVersion,
      ActorUserId,
      ActorUserIdType,
      ActorUsername,
      ActorUsernameType,
      ActorScopeId,
      ActorOriginalUserType,
      HttpUserAgent,
      SrcIpAddr,
      SrcFQDN,
      IpAddr,
      TargetDomain,
      TargetDomainType,
      Src,
      User,
      SrcHostname,
      SrcDomainType,
      SrcDomain,
      AdditionalFields
  };
  parser
  (
    starttime = starttime,
    endtime = endtime,
    srcipaddr_has_any_prefix = srcipaddr_has_any_prefix,
    actorusername_has_any = actorusername_has_any,
    eventtype_in = eventtype_in,
    eventresult = eventresult,
    operation_has_any = operation_has_any,
    object_has_any=object_has_any,
    newvalue_has_any=newvalue_has_any,
    disabled=disabled
  )