Parser:
  Title: Audit event ASIM schema function
  Version: '0.2'
  LastUpdated: Dec 19 2022
Product:
  Name: Microsoft
Normalization:
  Schema: AuditEvent
  Version: '0.1'
References:
- Title: ASIM Audit Event Schema
  Link: https://aka.ms/ASimAuditEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Audit Event schema.
ParserName: vimAuditEventEmpty
EquivalentBuiltInParser: _Im_AuditEvent_Empty
ParserQuery: |
  let EmptyAuditEvents =datatable (
    TimeGenerated:datetime,
    _ResourceId:string,
    Type:string,
    ActingAppId:string,
    ActingAppName:string,
    ActingAppType:string,
    ActingOriginalAppType:string,
    ActorDNUsername:string,
    ActorOriginalUserType:string,
    ActorScope:string,
    ActorScopeId:string,
    ActorSessionId:string,
    ActorSimpleUsername:string,
    ActorUserAadId:string,
    ActorUserAWSId:string,
    ActorUserId:string,
    ActorUserIdType:string,
    ActorUsername:string,
    ActorUsernameType:string,
    ActorUserOktaId:string,
    ActorUserPuid:string,
    ActorUserSid:string,
    ActorUserType:string,
    ActorUserUid:string,
    ActorUserUpn:string,
    ActorWindowsUsername:string,
    AdditionalFields:dynamic,
    Application:string,
    Dst:string,
    Dvc:string,
    DvcAction:string,
    DvcDescription:string,
    DvcDomain:string,
    DvcDomainType:string,
    DvcFQDN:string,
    DvcHostname:string,
    DvcId:string,
    DvcIdType:string,
    DvcInterface:string,
    DvcIpAddr:string,
    DvcMacAddr:string,
    DvcOriginalAction:string,
    DvcOs:string,
    DvcOsVersion:string,
    DvcScope:string,
    DvcScopeId:string,
    DvcZone:string,
    EventCount:int,
    EventEndTime:datetime,
    EventMessage:string,
    EventOriginalResultDetails:string,
    EventOriginalSeverity:string,
    EventOriginalSubType:string,
    EventOriginalType:string,
    EventOriginalUid:string,
    EventOwner:string,
    EventProduct:string,
    EventProductVersion:string,
    EventReportUrl:string,
    EventResult:string,
    EventResultDetails:string,
    EventSchema:string,
    EventSchemaVersion:string,
    EventSeverity:string,
    EventStartTime:datetime,
    EventSubType:string,
    EventType:string,
    EventUid:string,
    EventVendor:string,
    HttpUserAgent:string,
    IpAddr:string,
    NewValue:string,
    Object:string,
    ObjectId:string,
    ObjectType:string,
    OldValue:string,
    Operation:string,
    OriginalObjectType:string,
    Process:string,
    Rule:string,
    RuleName:string,
    RuleNumber:int,
    Src:string,
    SrcDescription:string,
    SrcDeviceType:string,
    SrcDomain:string,
    SrcDomainType:string,
    SrcDvcId:string,
    SrcDvcIdType:string,
    SrcDvcScope:string,
    SrcDvcScopeId:string,
    SrcFQDN:string,
    SrcGeoCity:string,
    SrcGeoCountry:string,
    SrcGeoLatitude:real,
    SrcGeoLongitude:real,
    SrcGeoRegion:string,
    SrcHostname:string,
    SrcIpAddr:string,
    SrcOriginalRiskLevel:string,
    SrcPortNumber:int,
    SrcRiskLevel:int,
    TargetAppId:string,
    TargetAppName:string,
    TargetAppType:string,
    TargetDescription:string,
    TargetDeviceType:string,
    TargetDomain:string,
    TargetDomainType:string,
    TargetDvcId:string,
    TargetDvcIdType:string,
    TargetDvcOs:string,
    TargetDvcScope:string,
    TargetDvcScopeId:string,
    TargetFQDN:string,
    TargetGeoCity:string,
    TargetGeoCountry:string,
    TargetGeoLatitude:real,
    TargetGeoLongitude:real,
    TargetGeoRegion:string,
    TargetHostname:string,
    TargetIpAddr:string,
    TargetOriginalAppType:string,
    TargetOriginalRiskLevel:string,
    TargetPortNumber:int,
    TargetRiskLevel:int,
    TargetUrl:string,
    ThreatCategory:string,
    ThreatConfidence:int,
    ThreatField:string,
    ThreatFirstReportedTime:datetime,
    ThreatId:string,
    ThreatIpAddr:string,
    ThreatIsActive:bool,
    ThreatLastReportedTime:datetime,
    ThreatName:string,
    ThreatOriginalConfidence:string,
    ThreatOriginalRiskLevel:string,
    ThreatRiskLevel:int,
    User:string,
    Value:string,
    ValueType:string
  )[];
  EmptyAuditEvents