Parser:
  Title: Audit event ASIM schema function
  Version: '0.2'
  LastUpdated: Dec 19 2022
Product:
  Name: Microsoft
Normalization:
  Schema: AuditEvent
  Version: '0.1'
References:
- Title: ASIM Audit Event Schema
  Link: https://aka.ms/ASimAuditEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Audit Event schema.
ParserName: vimAuditEventEmpty
EquivalentBuiltInParser: _Im_AuditEvent_Empty
ParserQuery: |
  let EmptyAuditEvents =datatable (
    ActorUserType:string,
    ActorUsernameType:string,
    ActorUserIdType:string,
    EventResult:string,
    EventType:string,
    EventSchema:string,
    ValueType:string,
    EventSeverity:string,
    EventVendor:string,
    EventProduct:string,
    SrcDvcIdType:string,
    TargetDvcIdType:string,
    SrcDomainType:string,
    TargetDomainType:string,
    SrcDeviceType:string,
    TargetDeviceType:string,
    ObjectType:string,
    TargetAppType:string,
    ActingAppType:string,
    ThreatConfidence:int,
    SrcGeoCountry:string,
    TargetGeoCountry:string,
    EventSubType:string,
    EventResultDetails:string,
    SrcHostname:string,
    TargetHostname:string,
    SrcIpAddr:string,
    TargetIpAddr:string,
    SrcGeoRegion:string,
    SrcGeoCity:string,
    TargetGeoRegion:string,
    TargetGeoCity:string,
    ThreatRiskLevel:int,
    EventSchemaVersion:string,
    EventReportUrl:string,
    User:string,
    ActorUsername:string,
    Application:string,
    Process:string,
    Operation:string,
    Object:string,
    ObjectId:string,
    OldValue:string,
    NewValue:string,
    Value:string,
    TimeGenerated:datetime,
    _ResourceId:string,
    Type:string,
    AdditionalFields:dynamic,
    EventMessage:string,
    EventCount:int,
    EventStartTime:datetime,
    EventEndTime:datetime,
    EventOriginalUid:string,
    EventOriginalType:string,
    EventOriginalSubType:string,
    EventOriginalResultDetails:string,
    EventOriginalSeverity:string,
    EventProductVersion:string,
    EventOwner:string,
    Rule:string,
    RuleName:string,
    RuleNumber:int,
    ThreatId:string,
    ThreatName:string,
    ThreatCategory:string,
    ThreatOriginalRiskLevel:string,
    ThreatOriginalConfidence:string,
    ThreatIsActive:bool,
    ThreatIpAddr:string,
    ThreatField:string,
    ThreatFirstReportedTime:datetime,
    ThreatLastReportedTime:datetime,
    ActorUserId:string,
    ActorScopeId:string,
    ActorScope:string,
    ActorOriginalUserType:string,
    ActorSessionId:string,
    TargetAppId:string,
    TargetAppName:string,
    TargetUrl:string,
    ActingAppId:string,
    ActingAppName:string,
    HttpUserAgent:string,
    Src:string,
    SrcPortNumber:int,
    SrcDomain:string,
    SrcFQDN:string,
    SrcDvcDescription:string,
    SrcDvcId:string,
    SrcDvcScopeId:string,
    SrcDvcScope:string,
    SrcGeoLatitude:real,
    SrcGeoLongitude:real,
    Dst:string,
    TargetPortNumber:int,
    TargetDomain:string,
    TargetFQDN:string,
    TargetDvcDescription:string,
    TargetDvcId:string,
    TargetDvcScopeId:string,
    TargetDvcScope:string,
    TargetGeoLatitude:real,
    TargetGeoLongitude:real
    , Dvc: string	
    , DvcId: string
    , DvcIpAddr: string	
    , DvcHostname: string
    , DvcDomain:string
    , DvcDomainType:string
    , DvcFQDN:string
    , DvcDescription:string
    , DvcIdType:string
    , DvcMacAddr:string
    , DvcZone:string
    , DvcOs:string
    , DvcOsVersion:string
    , DvcAction:string
    , DvcOriginalAction:string
    , DvcScope:string
    , DvcScopeOd:string
  )[];
  EmptyAuditEvents