Parser:
  Title: Audit Event ASIM filtering parser for SQLSecurityAudit Logs
  Version: '0.1.0'
  LastUpdated: Mar 11, 2026
Product:
  Name: SQLSecurityAudit Logs
Normalization:
  Schema: AuditEvent
  Version: '0.1.2'
References:
- Title: ASIM Audit Event Schema
  Link: https://aka.ms/ASimAuditEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This ASIM parser supports filtering and normalizing Azure SQL Security Audit events from the SQLSecurityAuditEvents table and the AzureDiagnostics table (with Category 'SQLSecurityAuditEvents') to the ASIM Audit Event schema.
ParserName: vimAuditEventSQLSecurityAudit
EquivalentBuiltInParser: _Im_AuditEvent_SQLSecurityAudit
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: actorusername_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: operation_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: eventtype_in
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: object_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: newvalue_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: disabled
    Type: bool
    Default: false
  - Name: pack
    Type: bool
    Default: false

ParserQuery: |
  let parser=(
    starttime:datetime=datetime(null), 
    endtime:datetime=datetime(null),
    srcipaddr_has_any_prefix:dynamic=dynamic([]), 
    eventresult:string='*',
    actorusername_has_any:dynamic=dynamic([]),
    eventtype_in:dynamic=dynamic([]),
    operation_has_any:dynamic=dynamic([]),
    object_has_any:dynamic=dynamic([]),
    newvalue_has_any:dynamic=dynamic([]),
    disabled:bool = false,
    pack:bool = false
  ){
    let SqlAuditEventTypeLookup = datatable (ActionType:string, EventType:string)
    [
      "SELECT", "Read",
      "EXECUTE", "Execute",
      "INSERT", "Create",
      "UPDATE", "Set",
      "DELETE", "Delete",
      "CREATE", "Create",
      "ALTER", "Set",
      "DROP", "Delete",
      "GRANT", "Set",
      "DENY", "Set",
      "REVOKE", "Set",
      "BATCH", "Execute",
      "LOGIN", "Execute",
      "LOGOUT", "Execute",
      "ENABLE", "Enable",
      "DISABLE", "Disable",
      "BACKUP", "Read",
      "RESTORE", "Set",
      "RENAME", "Set",
      "TRUNCATE", "Delete",
      "OPEN", "Execute",
      "CLOSE", "Execute",
      "FETCH", "Read",
      "RECEIVE", "Read"
    ];
    let SqlSecurityAuditDedicated = 
      SQLSecurityAuditEvents
      | where not(disabled)
      | where
          (isnull(starttime) or TimeGenerated >= starttime)
          and (isnull(endtime) or TimeGenerated <= endtime)
          and (array_length(newvalue_has_any) == 0)
      | where
          (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(ClientIp, srcipaddr_has_any_prefix))
          and (array_length(actorusername_has_any) == 0 or ServerPrincipalName has_any (actorusername_has_any))
          and (array_length(operation_has_any) == 0 or ActionName has_any (operation_has_any))
          and (array_length(object_has_any) == 0 or ObjectName has_any (object_has_any))
      | project-rename
          EventOriginalType = ActionName
      | extend
          SrcIpAddr = iff(isnotnull(parse_ipv4(ClientIp)), ClientIp, ""),
          EventOriginalUid = tostring(EventId),
          ActorUsername = ServerPrincipalName,
          ActorUserId = tostring(ServerPrincipalSid),
          Object = ObjectName,
          Operation = EventOriginalType,
          ActorSessionId = tostring(SessionId),
          EventResult = iff(Succeeded == true, "Success", "Failure"),
          TargetAppName = strcat(LogicalServerName, "/", DatabaseName),
          AdditionalFields = iff(pack, bag_pack(
              "Statement", Statement,
              "SchemaName", SchemaName,
              "DurationMs", DurationMs,
              "AffectedRows", AffectedRows,
              "ResponseRows", ResponseRows,
              "ApplicationName", ApplicationName,
              "ClassTypeDescription", ClassTypeDescription,
              "HostName", HostName
          ), dynamic([]))
      | where eventresult == "*" or (EventResult == eventresult)
      | extend ActionType = toupper(tostring(split(Operation, " ")[0]))
      | lookup SqlAuditEventTypeLookup on ActionType
      | extend EventType = iff(isempty(EventType), "Other", EventType)
      | where array_length(eventtype_in) == 0 or EventType in (eventtype_in)
      | project-away ActionType
      ;
    let SqlSecurityAuditDiag =
      AzureDiagnostics
      | where not(disabled)
      | where Category == "SQLSecurityAuditEvents"
      | where
          (isnull(starttime) or TimeGenerated >= starttime)
          and (isnull(endtime) or TimeGenerated <= endtime)
          and (array_length(newvalue_has_any) == 0)
      | where
          (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(client_ip_s, srcipaddr_has_any_prefix))
          and (array_length(actorusername_has_any) == 0 or server_principal_name_s has_any (actorusername_has_any))
          and (array_length(operation_has_any) == 0 or action_name_s has_any (operation_has_any))
          and (array_length(object_has_any) == 0 or object_name_s has_any (object_has_any))
      | project-rename
          EventOriginalType = action_name_s
      | extend
          SrcIpAddr = iff(isnotnull(parse_ipv4(client_ip_s)), client_ip_s, ""),
          EventOriginalUid = tostring(event_id_g),
          ActorUsername = server_principal_name_s,
          ActorUserId = tostring(server_principal_sid_s),
          Object = object_name_s,
          Operation = EventOriginalType,
          ActorSessionId = tostring(session_id_d),
          EventResult = iff(succeeded_s == "true", "Success", "Failure"),
          TargetAppName = strcat(LogicalServerName_s, "/", database_name_s),
          AdditionalFields = iff(pack, bag_pack(
              "Statement", statement_s,
              "SchemaName", schema_name_s,
              "DurationMs", duration_milliseconds_d,
              "AffectedRows", affected_rows_d,
              "ResponseRows", response_rows_d,
              "ApplicationName", application_name_s,
              "ClassTypeDescription", class_type_description_s,
              "HostName", host_name_s
          ), dynamic([]))
      | where eventresult == "*" or (EventResult == eventresult)
      | extend ActionType = toupper(tostring(split(Operation, " ")[0]))
      | lookup SqlAuditEventTypeLookup on ActionType
      | extend EventType = iff(isempty(EventType), "Other", EventType)
      | where array_length(eventtype_in) == 0 or EventType in (eventtype_in)
      | project-away ActionType
      ;
    union isfuzzy=true SqlSecurityAuditDedicated, SqlSecurityAuditDiag
    | extend
        EventCount = int(1),
        EventStartTime = TimeGenerated,
        EventEndTime = TimeGenerated,
        EventProduct = "SQL Audit Logs",
        EventVendor = "Microsoft",
        EventSchemaVersion = "0.1.2",
        EventSchema = "AuditEvent",
        TargetAppType = "SaaS application",
        ObjectType = "Cloud Resource",
        ActorUsernameType = iff(isnotempty(ActorUsername), "Simple", ""),
        ActorUserIdType = iff(isnotempty(ActorUserId), "SID", ""),
        EventSeverity = iff(EventResult == "Failure", "Low", "Informational")
    // Recommended fields
    | extend
        EventUid = EventOriginalUid,
        EventResultDetails = iff(EventResult == "Failure", "Other", "")
    // Aliases
    | extend
        IpAddr = SrcIpAddr,
        User = ActorUsername,
        Application = TargetAppName,
        Dst = TargetAppName,
        Src = SrcIpAddr,
        Dvc = EventProduct
    | project
        Type,
        TimeGenerated,
        EventOriginalUid,
        EventUid,
        EventResult,
        EventResultDetails,
        EventSeverity,
        EventCount,
        EventStartTime,
        EventEndTime,
        EventProduct,
        EventVendor,
        EventSchemaVersion,
        EventSchema,
        EventType,
        EventOriginalType,
        Operation,
        Object,
        ObjectType,
        TargetAppName,
        TargetAppType,
        ActorUsername,
        ActorUsernameType,
        ActorUserId,
        ActorUserIdType,
        ActorSessionId,
        SrcIpAddr,
        AdditionalFields,
        IpAddr,
        User,
        Application,
        Dst,
        Src,
        Dvc
  };
  parser
  (
    starttime = starttime,
    endtime = endtime,
    srcipaddr_has_any_prefix = srcipaddr_has_any_prefix,
    actorusername_has_any = actorusername_has_any,
    eventtype_in = eventtype_in,
    eventresult = eventresult,
    operation_has_any = operation_has_any,
    object_has_any=object_has_any,
    newvalue_has_any=newvalue_has_any,
    disabled=disabled,
    pack=pack
  )
