id: f0abe250-a97d-4984-ada5-77e79f8f3ceb
name: Zip-Doc - Creation of JPG Payload File
description: |-
  In the campaign where Bazarloader is delivered via emails containing pw protected zip attachments, regsvr32.exe is used to launch a malicious payload that is disguised as a JPG file.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceImageLoadEvents
tactics:
- Execution
query: |-
  DeviceImageLoadEvents
  | where InitiatingProcessFileName =~ "regsvr32.exe" and InitiatingProcessCommandLine has ".jpg" and FileName endswith ".jpg"
  | summarize by FileName, SHA256, DeviceId, bin(Timestamp, 1d)
