id: 3169dc83-9e97-452c-afcc-baebdb0ddf7c
name: Discord download invoked from cmd line (ASIM Version)
description: |
  'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'
requiredDataConnectors: []
tactics:
  - Execution
  - CommandAndControl
  - Exfiltration
relevantTechniques:
  - T1204
  - T1102
  - T1567
query: |
  imProcess
    | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
    | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
    | project-reorder TimeGenerated, Computer, Account, Process, CommandLine
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Account
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: Computer
