id: a344e28e-095d-47fb-84a8-d06edd31d2cb
name: Invoke-PowerShellTcpOneLine Usage (Normalized Process)
description: |
  'Invoke-PowerShellTcpOneLine is a PowerShell script to create a simple and small reverse shell. It can be abused by attackers to exfiltrate data. This query looks for command line activity similar to Invoke-PowerShellTcpOneLine.'
requiredDataConnectors: []
tactics:
  - Exfiltration
relevantTechniques:
  - T1011
query: |
 imProcessCreation
  | where TargetProcessFileName has_any ("powershell.exe", "PowerShell_ISE.exe", "cmd.exe")
  | where TargetProcessCommandLine has "$client = New-Object System.Net.Sockets.TCPClient"
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = DvcHostname, IPCustomEntity = IpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity