id: a1e993de-770a-4434-83e9-9e3b47a6e470
name: Enumeration of users and groups (Normalized Process Events)
description: |
  'Finds attempts to list users or groups using the built-in Windows 'net' tool '
requiredDataConnectors: []
tactics:
  - Discovery
query: |

    imProcessCreate
    | where (CommandLine has ' user ' or CommandLine has ' group ') and (CommandLine hassuffix ' /do' or CommandLine hassuffix ' /domain') 
    | where Process has 'net.exe' // performance pre-filtering
    | extend FileName=tostring(split(Process, '\\')[-1])
    | where FileName == 'net.exe' and ActorUserName != "" and CommandLine !contains '\\'  and CommandLine !contains '/add' 
    | extend Target = extract("(?i)[user|group] (\"*[a-zA-Z0-9-_ ]+\"*)", 1, CommandLine) 
    | where Target  != '' 
    | summarize minTimeGenerated=min(TimeGenerated), maxTimeGenerated=max(TimeGenerated), count() by ActorUserName, Target, CommandLine, Dvc, EventVendor, EventProduct
    | sort by ActorUserName, Target
    | extend timestamp = minTimeGenerated, AccountCustomEntity = ActorUserName, HostCustomEntity = Dvc 
  