id: 8afd1086-fc9a-4d26-b3ff-5c794c79a59a
name: Exchange PowerShell Snapin Added (Normalized Process Events)
description: |
  'The Exchange Powershell Snapin was loaded on a host, this allows for a Exchange server management via PowerShell.
  Whilst this is a legitimate administrative tool it is abused by attackers to performs actions on a compromised
  Exchange server. Hunt for unusual activity related to this Snapin including it being added on new hosts or by
  new accounts.'
requiredDataConnectors: []
tactics:
  - Collection
relevantTechniques:
  - T1119
query: |
  imProcessCreation
  | where TargetProcessFileName has_any ("cmd.exe", "powershell.exe", "PowerShell_ISE.exe")
  | where isnotempty(TargetProcessCommandLine)
  | where TargetProcessCommandLine contains "Add-PSSnapin Microsoft.Exchange.Management.Powershell.Snapin"
  | summarize FirstSeen = min(TimeGenerated), LastSeen = max(TimeGenerated) by DvcHostName, Account, TargetProcessCommandLine, EventVendor, EventProduct
  | extend timestamp = FirstSeen, AccountCustomEntity = Account, HostCustomEntity = DvcHostName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity