id:  278592b5-612b-48a4-bb38-4c01ff8ee2a5
name: SolarWinds Inventory (Normalized Process Events)
description: |
  'Beyond your internal software management systems, it is possible you may not have visibility into your entire footprint of SolarWinds installations.  This is intended to help use process exection information to discovery any systems that have SolarWinds processes'
requiredDataConnectors: []
tactics:
  - Execution
relevantTechniques:
  - T1072
tags:
  - Solorigate
  - NOBELIUM
query: |
  imProcessCreation
  | where Process has 'solarwinds' 
  | extend MachineName = DvcHostName , Process = TargetProcessFilePath
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(Dvc), AccountCount = dcount(User), MachineNames = make_set(Dvc),
  Accounts = make_set(User) by Process, EventVendor, EventProduct