id: 0e429446-2798-49e4-924d-c37338f24e23
name: Certutil (LOLBins and LOLScripts, Normalized Process Events)
description: |
  'This detection uses Sysmon telemetry to hunt Certutil activities'

requiredDataConnectors: []

tactics:
  - Command And Control
relevantTechniques:
  - T1105

query: |
  imProcessCreate
  | where Process has "certutil.exe"
  // Uncomment the next line and add your commandLine Whitelisted/ignore terms.For example "urlcache"
  // | where CommandLine !contains ("urlcache") 
  | extend HostCustomEntity = Dvc, AccountCustomEntity = User

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity