id: 58fe8fc8-54fa-48cd-bac3-197f8d862429
name: Powercat Download (Normalized Process Events)
description: |
  'Powercat is a PowerShell implementation of netcat. Whilst it can be used as a legitimate administrative tool it can be abused by attackers to exfiltrate data. This query looks for command line activity downloading PowerCat.'
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
tactics:
  - Exfiltration
relevantTechniques:
  - T1011
query: |
    imProcessCreation
    | where TargetProcessFileName has_any ("cmd.exe", "powershell.exe", "PowerShell_ISE.exe")
    | where TargetProcessCommandLine hassuffix "powercat.ps1"
    | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = DvcHostName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity