SchemaVersion: 1.0
DataTypes:
  - DataType: AuditLogs
  - DataType: SecurityEvent
Type: KQL
Provider: Sentinel
RequiredInputFieldsSets:
  - - Account_Name
    - Account_NTDomain
  - - Account_Name
    - Account_UPNSuffix
  - - Account_AADUserId
  - - Account_SID
BaseQuery: |
  let GetAccountActions = (Account_Name:string, Account_NTDomain:string, Account_UPNSuffix:string, Account_AADUserId:string, Account_SID:string){
  let Account_UPN = strcat(Account_Name, '@', Account_UPNSuffix);
  let Account_Win = strcat(Account_NTDomain,'\\', Account_Name);
  union isfuzzy=true
  (AuditLogs
    | where  tostring(bag_keys(InitiatedBy)[0]) == "user"
    | where Account_UPN =~ tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName) or Account_AADUserId =~ tostring(parse_json(tostring(InitiatedBy.user)).id)
    | where OperationName in~ ('Add user', 'Update user', 'Delete user', 'Change user password', 'Reset user password',  'Reset password (by admin)', 'Change password (self-service)', 'Reset password (self-service)')
    | extend InitiatedByAccount = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | parse InitiatedByAccount with userName:string '@' userUpnSuffix:string
    | extend InitiatedByAADUserId = tostring(parse_json(tostring(InitiatedBy.user)).id)
    | extend TargetAccount = tostring(TargetResources[0].userPrincipalName)
    | parse TargetAccount with TargetAccountName:string '@' TargetAccountUPNSuffix:string
    | extend TargetAADUserId = tostring(TargetResources[0].id)
    | extend Action = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[0])))
    | extend ModifiedProperty = tostring(parse_json(Action).displayName), ModifiedValue = tostring(parse_json(Action).newValue)
    | extend DisableUser = iif(ModifiedProperty =~ 'AccountEnabled' and ModifiedValue =~ '[false]', 'True', 'False')
  ),
  (SecurityEvent
    | where AccountType =~ "user" or isempty(AccountType)
    | where EventID in (4720, 4722, 4723, 4724, 4725, 4726, 4740)
    | where Account_Win =~ SubjectAccount or Account_SID =~ SubjectUserSid
    | parse TargetAccount with TargetAccountNTDomain '\\' TargetAccountName
    | extend InitiatedByAccount = SubjectAccount, InitiatedByUserSid = SubjectUserSid, OperationName = tostring(EventID), ModifiedProperty = Activity
  )
  };
  GetAccountActions('{{Account_Name}}', '{{Account_NTDomain}}', '{{Account_UPNSuffix}}', '{{Account_AADUserId}}', '{{Account_SID}}')
# The queries for the insights.
Insights:
 Id: ce14b423-4f00-47cc-a23f-c0fdf7e3af76
 DisplayName: Actions on account
 Description: |
  Summary of actions taken on the specified account (TargetAccount), grouped by action: password resets and changes, account lockouts (policy or admin), account creation and deletion, account enabled and disabled
 DefaultTimeRange:
  BeforeRange: 12h
  AfterRange: 12h
 TableQuery:
  ColumnsDefinitions:
  - Header: Action
    OutputType: String
    SupportDeepLink: false
  - Header: Change
    OutputType: String
    SupportDeepLink: false
  - Header: Most Recent
    OutputType: Date
    SupportDeepLink: false
  - Header: Count
    OutputType: Number
    SupportDeepLink: true

  QueriesDefinitions:
  # Account Password Resets
    - Filter:     "where OperationName in~ ('Change user password', 'Reset user password', 'Change password (self-service)',  'Reset password (by admin)', 'Reset password (self-service)', '4724', '4723')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Disabled by Policy
    - Filter:     "where OperationName in~ ('Blocked from self-service password reset', '4740')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Disabled by Admin
    - Filter:     "where OperationName =~ '4725'"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Created
    - Filter:     "where OperationName in~ ('Add user', '4720')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Deleted
    - Filter:     "where OperationName in~ ('Delete user', '4726')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Deleted or Disabled
    - Filter:     "where OperationName in~ ('4725', 'Blocked from self-service password reset', '4740') or (OperationName  =~ 'Update user' and DisableUser =~ 'True')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Created or Enabled
    - Filter:     "where OperationName in~ ('4722', '4767') or (OperationName  =~ 'Update user' and DisableUser =~ 'False')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Setting Changed
    - Filter:     "where OperationName =~ '4738'"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
 
 ChartQuery:
  Title: "Actions by type"
  DataSets:
   - Query: "summarize Count = count() by bin(TimeGenerated, 1h), OperationName"
     XColumnName: "TimeGenerated"
     YColumnName: "Count"
     LegendColumnName: "OperationName"
  Type: BarChart

 AdditionalQuery:
  Text: "See all account activity"
  Query: "project TimeGenerated, InitiatedByAccount, SubjectAccount, InitiatedByUserSid, SubjectUserSid, InitiatedByAADUserId, TargetAccount, TargetSid, TargetAADUserId, OperationName, ModifiedProperty, Activity, DisableUser, AADTenantId, AccountType, Computer, EventData"
    
Activities:
 EnabledByDefault: true
 Items:
 - Id: d6d08c94-455f-4ea5-8f76-fc6c0c442cfa
   Title: "The user has created an account"
   Content: "The user has created the account {{TargetAccount}} {{Count}} time(s)"
   Description: "This activity displays account creation events performed by the user"
   QueryDefinitions:
    Filter: "where OperationName in~ ('Add user', '4720')"
    SummarizeBy: "TargetAccount, TargetSid, TargetAADUserId"
 - Id: e0459780-ac9d-4b72-8bd4-fecf6b46a0a1
   Title: "The user has deleted an account"
   Content: "The user has deleted the account {{TargetAccount}} {{Count}} time(s)"
   Description: "This activity displays account deletion events performed by the user"
   QueryDefinitions:
    Filter: "where OperationName in~ ('Delete user', '4726')"
    SummarizeBy: "TargetAccount, TargetSid, TargetAADUserId"
 - Id: ad1f4269-5418-4c46-a3b6-4ec01031de60
   Title: "The user has reset an account's password"
   Content: "The password for account {{TargetAccount}} was reset by the user {{Count}} time(s)"
   Description: "This activity displays password reset events performed by the user"
   QueryDefinitions:
    Filter: "where OperationName in~ ('Change user password', 'Reset user password', 'Change password (self-service)',  'Reset password (by admin)', 'Reset password (self-service)', '4724', '4723')"
    SummarizeBy: "TargetAccount, TargetSid, TargetAADUserId"
