SchemaVersion: 1.0
DataTypes:
  - DataType: AuditLogs
  - DataType: SecurityEvent
Type: KQL
Provider: Sentinel
RequiredInputFieldsSets:
  - - Account_Name
    - Account_NTDomain
  - - Account_Name
    - Account_UPNSuffix
  - - Account_AADUserId
  - - Account_Sid
BaseQuery: |
  let GetAccountActions = (Account_Name:string, Account_NTDomain:string, Account_UPNSuffix:string, Account_AADUserId:string, Account_Sid:string){
  let Account_UPN = strcat(Account_Name, '@', Account_UPNSuffix);
  let Account_Win = strcat(Account_NTDomain,'\\', Account_Name);
  union isfuzzy=true
  (AuditLogs
    | where  tostring(bag_keys(InitiatedBy)[0]) == "user"
    | where OperationName in~ ('Add user', 'Update user', 'Delete user', 'Change user password', 'Reset user password',  'Reset password (by admin)', 'Change password (self-service)', 'Reset password (self-service)')
    | where Account_UPN =~ tostring(TargetResources[0].userPrincipalName) or Account_AADUserId =~ tostring(TargetResources[0].id)
    | extend InitiatedByAccount = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
    | parse InitiatedByAccount with userName:string '@' userUpnSuffix:string
    | extend InitiatedByAADUserId = tostring(parse_json(tostring(InitiatedBy.user)).id)
    | extend TargetAccount = tostring(TargetResources[0].userPrincipalName)
    | parse TargetAccount with TargetAccountName:string '@' TargetAccountUPNSuffix:string
    | extend TargetAADUserId = tostring(TargetResources[0].id)
    | extend Action = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[0])))
    | extend ModifiedProperty = tostring(parse_json(Action).displayName), ModifiedValue = tostring(parse_json(Action).newValue)
    | extend DisableUser = iif(ModifiedProperty =~ 'AccountEnabled' and ModifiedValue =~ '[false]', 'True', 'False')
  ),
  (SecurityEvent
    | where AccountType =~ "user" or isempty(AccountType)
    | where EventID in (4720, 4722, 4723, 4724, 4725, 4726, 4740)
    | where Account_Win =~ TargetAccount or Account_Sid =~ TargetSid
    | parse TargetAccount with TargetAccountNTDomain '\\' TargetAccountName
    | extend InitiatedByAccount = SubjectAccount, InitiatedByUserSid = SubjectUserSid, OperationName = tostring(EventID), ModifiedProperty = Activity
  )
  };
  GetAccountActions('{{Account_Name}}', '{{Account_NTDomain}}', '{{Account_UPNSuffix}}', '{{Account_AADUserId}}', '{{Account_Sid}}')
# The queries for the insights.
Insights:
 Id: 6db7f5d1-f41e-46c2-b935-230b36a569e6
 DisplayName: Actions on account
 Description: |
  Summary of actions taken on the specified account (TargetAccount), grouped by action: password resets and changes, account lockouts (policy or admin), account creation and deletion, account enabled and disabled
 DefaultTimeRange:
  BeforeRange: 12h
  AfterRange: 12h
 TableQuery:
  ColumnsDefinitions:
  - Header: Action
    OutputType: String
    SupportDeepLink: false
  - Header: Change
    OutputType: String
    SupportDeepLink: false
  - Header: Most Recent
    OutputType: Date
    SupportDeepLink: false
  - Header: Count
    OutputType: Number
    SupportDeepLink: true

  QueriesDefinitions:
  # Account Password Resets
    - Filter:     "where OperationName in~ ('Change user password', 'Reset user password', 'Change password (self-service)',  'Reset password (by admin)', 'Reset password (self-service)', '4724', '4723')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Disabled by Policy
    - Filter:     "where OperationName in~ ('Blocked from self-service password reset', '4740')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Disabled by Admin
    - Filter:     "where OperationName =~ '4725'"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Created
    - Filter:     "where OperationName in~ ('Add user', '4720')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Deleted
    - Filter:     "where OperationName in~ ('Delete user', '4726')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Deleted or Disabled
    - Filter:     "where OperationName in~ ('4725', 'Blocked from self-service password reset', '4740') or (OperationName  =~ 'Update user' and DisableUser =~ 'True')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Created or Enabled
    - Filter:     "where OperationName in~ ('4722', '4767') or (OperationName  =~ 'Update user' and DisableUser =~ 'False')"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
  # Account Setting Changed
    - Filter:     "where OperationName =~ '4738'"
      Summarize:  "summarize MostRecent = max(TimeGenerated), Count = count() by OperationName, ModifiedProperty"
      Project:    "project Title = OperationName, ModifiedProperty, MostRecent, Count"
      LinkColumnsDefinitions:
      - ProjectedName: Count
        Query: "{{BaseQuery}} | {{RowFilter}}"
 
 ChartQuery:
  Title: "Actions by type"
  DataSets:
   - Query: "summarize Count = count() by bin(TimeGenerated, 1h), OperationName"
     XColumnName: "TimeGenerated"
     YColumnName: "Count"
     LegendColumnName: "OperationName"
  Type: BarChart

 AdditionalQuery:
  Text: "See all account activity"
  Query: "project TimeGenerated, TargetAccount, TargetSid, TargetAADUserId, InitiatedByAccount, SubjectAccount, InitiatedByUserSid, SubjectUserSid, InitiatedByAADUserId, OperationName, ModifiedProperty, Activity, DisableUser, AADTenantId, AccountType, Computer, EventData"

Activities:
 EnabledByDefault: true
 Items:
 - Id: fde1b9cc-9480-4418-ae21-91723d16b24d
   Title: "The user account was created"
   Content: "The user account {{TargetAccount}} was created"
   Description: "This activity displays the user account events for when it was created"
   QueryDefinitions:
    Filter: "where OperationName in~ ('Add user', '4720')"
    SummarizeBy: "TargetAccount, TargetSid, TargetAADUserId"
 - Id: b15901ba-8679-4f6a-b312-722031ab58f2
   Title: "The user account was deleted"
   Content: "The user account {{TargetAccount}} was deleted"
   Description: "This activity displays the user account events for when it was deleted"
   QueryDefinitions:
    Filter: "where OperationName in~ ('Delete user', '4726')"
    SummarizeBy: "TargetAccount, TargetSid, TargetAADUserId"
 - Id: c07d1d02-0a06-455e-add9-12c5a5e426f3
   Title: "The user account password was reset"
   Content: "The user account {{TargetAccount}} had a password reset"
   Description: "This activity displays the user account events for when the password was reset"
   QueryDefinitions:
    Filter: "where OperationName in~ ('Change user password', 'Reset user password', 'Change password (self-service)',  'Reset password (by admin)', 'Reset password (self-service)', '4723', '4724')"
    SummarizeBy: "TargetAccount, TargetSid, TargetAADUserId"

GuidedInsights:
  Id: e0cc706e-dd36-40a2-89b1-2391d4a25797
  Query: |
    AuditLogs | where  tostring(bag_keys(InitiatedBy)[0]) == "user" | where OperationName in~ ('Delete user') | extend Account_UPN = tostring(TargetResources[0].userPrincipalName) , Account_AADUserId = tostring(TargetResources[0].id) | summarize Count=count() by bin(TimeGenerated, {{GuidedInsightsBinTime}}), Account_UPN, Account_AADUserId | top {{GuidedInsightsLimit}} by Count desc | parse Account_UPN with Account_Name '@' Account_UPNSuffix