SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes: []
RequiredInputFieldsSets:
- - Account_Name
  - Account_UPNSuffix
BaseQuery: |- 
  let SignInsByResource = (Account_Name:string, Account_UPNSuffix:string){
  let acc_upn = iff(isnotempty(Account_Name) and isnotempty(Account_UPNSuffix) ,strcat(Account_Name,"@" ,Account_UPNSuffix),"");
  imAuthentication(targetusername_has=Account_Name)
  | where (TargetUsernameType=='Upn' and TargetUsername =~ acc_upn) or 
          (TargetUsernameType='Simple' and TargetUsername =~ Account_Name)
  };
  SignInsByResource('{{Account_Name}}', '{{Account_UPNSuffix}}')

Activities:
     EnabledByDefault: true
     Title: "The user has authenticated (ASim Authentication)"
     Content: "The user authenticated to {{LogonTarget}} {{Count}} time(s)"
     Items: 
        - Id: 0f32df28-7e21-4596-b71c-54d09fee55d1
          Description: This activity lists user's authentication events
          QueryDefinitions:
            SummarizeBy: LogonTarget
