SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes: []
RequiredInputFieldsSets:
- - Account_Name
  - Account_UPNSuffix
- - Account_AadUserId
BaseQuery: |- 
  let SignInsByResource = (Account_Name:string, Account_UPNSuffix:string){ 
    let acc_upn = iff(Account_Name != "" and Account_UPNSuffix != "" ,strcat(Account_Name,"@" ,Account_UPNSuffix),"");
    imAuthentication(targetusername_has=Account_Name) 
    | where (TargetUsernameType=='Simple' and TargetUsername=~AccountName) or
            (TargetUsernameType=='Upn' and TargetUsername=~acc_upn)
  };
  SignInsByResource('{{Account_Name}}', '{{Account_UPNSuffix}}')

  // ** ** Removing aaduserid for use of otimized. not expected to break old Version
  // ** ** (remove from requiredInputFields)
  // ** ** - minimal filter here. may need to filter further down the road
  // ** ** - how is timeframe enforced here?
  //| where (acc_upn != "" and UserPrincipalName =~ acc_upn) or
  //   (Account_AadUserId != "" and Account_AadUserId =~ UserId) // UserPrincipalName, UserId
  // ** ** Replacing filter with the following
  //| extend shortResourceId = tostring(split(ResourceId,"/")[-1])
  // Using LogonTarget instead

Activities:
     EnabledByDefault: true
     Title: "The user signed in to a resource"
     Content: "The user signed in to {{LogonTarget}} {{Count}} time(s)"
     Items: 
        - Id: 0f328f28-7e31-4596-b61c-54399fee5551
          Description: This activity lists user's sign ins to resources
          QueryDefinitions:
            SummarizeBy: LogonTarget
