SchemaVersion: '1.0'
DataTypes:
- DataType: BehaviorAnalytics
Provider: Sentinel
Type: KQL
EntitiesFilter: {}
BaseQuery: |
  let UserTI=(v_Account_Name:string, v_Account_UPNSuffix:string){
  BehaviorAnalytics 
  | where UserPrincipalName =~ strcat(v_Account_Name,  '@', v_Account_UPNSuffix) 
  | where isnotempty(DevicesInsights.ThreatIntelIndicatorType) 
  | project TimeGenerated, ActivityType, ActionType, SourceIPAddress, SourceIPLocation, ['TI Type']=DevicesInsights.ThreatIntelIndicatorType, ['TI Description']=DevicesInsights.ThreatIntelIndicatorDescription | as fulldata |parse ['TI Description'] with * 'of' TI1 | parse ['TI Description'] with TI2 '. ' Rest | parse ['TI Description'] with TI3 '. ' * 'of' Rest2 | extend finaldesc =  iff(isnotempty(TI1) and isnotempty(TI2) and isnotempty(TI3) and (TI2!=TI3), strcat(TI1,', ',TI2,', ',TI3),  iff(isnotempty(TI1) and isnotempty(TI2) and isnotempty(TI3) and (TI2==TI3), strcat(TI1,', ',TI2), iff(isempty(TI1) and isnotempty(TI2) and isnotempty(TI3) and (TI2!=TI3), strcat(TI2,', ',TI3), iff(isnotempty(TI1) and isempty(TI2) and isnotempty(TI3) and (TI2!=TI3), strcat(TI1,', ',TI3), iff(isnotempty(TI1) and isnotempty(TI2) and isempty(TI3) and (TI2!=TI3), strcat(TI1,', ',TI2),strcat(TI1,TI2))))))
  };
  UserTI('{{Account_Name}}','{{Account_UPNSuffix}}')
RequiredInputFieldsSets:
- - Account_Name
  - Account_UPNSuffix
Insights:
  Id: 4c23a4b2-6b67-4a1f-8cd4-e567b19ca8f0
  DisplayName: Threat indicators related to user
  Description: "### Description\n ___ \nThreat type and family, enriched by Microsoft's TI service, according to IP addresses related to the user.
    Describe what the query goal and motivation."
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 0d
  ReferenceTimeRange:
    BeforeRange: 0d
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: TI Type
      OutputType: String
      SupportDeepLink: false
    - Header: TI Description
      OutputType: String
      SupportDeepLink: false
    - Header: Number of Events
      OutputType: Number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: ''
      Summarize: top-nested of tostring(['TI Type'])  by  count(), top-nested of tostring(finaldesc) by count()
      Project: project ['TI Type'],['Description']=finaldesc,['Number of Events']=aggregated_finaldesc
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View events
    Query: project TimeGenerated, ActivityType, ActionType, SourceIPAddress, SourceIPLocation, ['TI Type'], ['TI Description']
