// Id: d1cf1da4-cc35-479e-8ea6-c3e59a09b15d
// DisplayName: Most Frequent Alerts On The Device
// Description: Most Frequent Alerts On The Device
// InputEntityType: IoTDevice
// InputFields: [IoTDevice_DeviceId, IoTDevice_IoTHub]
// OutputEntityTypes: [SecurityAlert]
// DataConnector: #SecurityAlert
let Alerts_byIoTDevice = (v_IotDevice_DeviceId:string, v_IoTDevice_IoTHub:string){
    SecurityAlert 
    | extend hubId = parse_json(v_IoTDevice_IoTHub)["AzureResourceId"]
    | extend parsed_entities=parse_json(Entities) 
    | extend parsed_extended_properties=parse_json(ExtendedProperties) 
    | where (parsed_entities contains strcat("""", v_IotDevice_DeviceId, """") and parsed_entities contains strcat("""", hubId, """")) or 
        (parsed_extended_properties contains strcat("""", v_IotDevice_DeviceId, """") and parsed_extended_properties contains strcat("""", hubId, """"))
    | summarize AlertCount = count() by AlertType, DisplayName
    | top 10 by AlertCount 
    | project SecurityAlert_DisplayName = DisplayName, SecurityAlert_AlertType = AlertType
    };
Alerts_byIoTDevice('<DeviceId>', '<IoTHub>')