// Id: 992d6afb-f9e2-4ee1-b2ba-237807f049e7
// DisplayName: Most Frequent Alerts On The IoT Hub
// Description: Most Frequent Alerts On The IoT Hub
// InputEntityType: IoTDevice
// InputFields: [IoTDevice_IoTHub]
// OutputEntityTypes: [SecurityAlert]
// DataConnector: #SecurityAlert
let Alerts_byIoTDevice_IoTHub = (v_IoTDevice_IoTHub:string){
    SecurityAlert 
    | extend hubId = tostring(parse_json(v_IoTDevice_IoTHub)["AzureResourceId"])
    | extend DymanicEntities = todynamic(Entities)
    | mv-expand DymanicEntities 
    | where DymanicEntities["Type"] == 	'iot-device' and DymanicEntities["AzureResource"]["AzureResourceId"] == hubId
    | summarize AlertCount = count() by AlertType, DisplayName
    | top 10 by AlertCount 
    | project SecurityAlert_DisplayName = DisplayName, SecurityAlert_AlertType = AlertType
    };
Alerts_byIoTDevice_IoTHub('<IoTHub>')