DeviceTvmSoftwareInventory
| where TimeGenerated > ago(30d)
| extend IsUnsupported = iff(isnotempty(EndOfSupportDate) and EndOfSupportDate < now(), true, false)
| where IsUnsupported == true
| summarize arg_max(TimeGenerated, *) by DeviceId, SoftwareName
| project TimeGenerated, DeviceId, DeviceName, SoftwareName, SoftwareVendor, SoftwareVersion, EndOfSupportDate, OSPlatform
| order by DeviceName asc
