id: 9ec67c0b-e319-4f1c-bbea-67119d03740a
name: Anomalous Device Models
description: |
  This query finds anomalous models discovered
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
tactics: []
relevantTechniques: []
query: |
  // 
  let AnomalousModelCount = 5;
  DeviceInfo
  | summarize arg_max(Timestamp, *) by DeviceId
  | summarize ModelAppearanceCount=dcount(DeviceId) by Model
  | where ModelAppearanceCount < AnomalousModelCount