id: 90f30a21-5de6-4c5e-85cf-d81347361aec
name: Can Be Onboarded Devices
description: |
  This query surfaces devices that were discovered by Microsoft Defender for Endpoint and can be onboarded
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
tactics:
- Resource Development
- Initial Access
relevantTechniques: []
query: |
  // Can Be Onboarded devices
  let CanBeOnboarded = "Can be onboarded";
  DeviceInfo
  | summarize arg_max(Timestamp, *) by DeviceId
  | where OnboardingStatus == CanBeOnboarded