id: 008f87b5-5b80-4487-9612-80032d931a69
name: Devices In Subnet - IPAddressV6
description: |
  This query surfaces devices that are in a specific IPAddressV6 subnet
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
tactics: []
relevantTechniques: []
query: |
  // Specify the relevant subnet in IpV6Range
  let IpV6Range = "2001:4898::1050:1050/127";
  DeviceNetworkInfo
  | summarize arg_max(Timestamp, *) by DeviceId
  | mv-expand IPAddressEntry=todynamic(IPAddresses)
  | extend IPAddress=tostring(IPAddressEntry.IPAddress)
  | where ipv6_is_match(IPAddress, IpV6Range)