id: 88adf141-5058-4f0f-a665-cd56eed754a5
name: Devices By Specific DeviceType and DeviceSubtype
description: |
  This query finds devices by DeviceType and/or DeviceSubtype
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
tactics: []
relevantTechniques: []
query: |
  // Specify the wanted DeviceType and/or DeviceSubtype
  let HuntedDeviceType = "NetworkDevice";
  let HuntedDeviceSubtype = "Router";
  DeviceInfo
  | summarize arg_max(Timestamp, *) by DeviceId
  | where DeviceType == HuntedDeviceType and DeviceSubtype  == HuntedDeviceSubtype