id: bade21c4-36b2-4661-a895-776790aef6a3
name: MDE_Find_Out_of_date_clients
description: |
  Find endpoints with out of date Defender clients
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
query: |
  //Find out of date clients
  DeviceInfo
  | where OSPlatform contains "Windows"
  | summarize arg_max(Timestamp, *) by DeviceId
  | extend MajorClientVersion = todouble(substring(ClientVersion, 0, 7))
  | where MajorClientVersion < 10.8500
  | where OnboardingStatus == "Onboarded"
  | project-reorder ClientVersion
version: 1.0.1
metadata:
    source:
        kind: Community
    author:
        name: Matt Novitsch
    support:
        tier: Community
    categories:
        domains: [ "Security" ]