id: cd1492a0-7e53-4615-9e63-f930576a3f6b
name: Seen Connected Networks
description: |
  This query uncovers seen connected networks
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceNetworkInfo
tactics: []
relevantTechniques: []
query: |
  // 
  DeviceNetworkInfo
  | summarize arg_max(Timestamp, *) by DeviceId
  | mv-expand todynamic(ConnectedNetworks)
  | where isnotempty( ConnectedNetworks.Name)
  | summarize by NetworkNames = tostring(ConnectedNetworks.Name)