SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes:
- DataType: AzureActivity
RequiredInputFieldsSets:
- - AzureResource_ResourceId
BaseQuery: |-
  AzureActivity
  | where OperationNameValue =~ "MICROSOFT.COMPUTE/VIRTUALMACHINES/EXTENSIONS/WRITE"
  | where _ResourceId =~ '{{AzureResource_ResourceId}}'
  | extend resBody = parse_json(Properties).responseBody
  | where resBody != ""
  | extend resBody = parse_json(tostring(resBody))
  | extend extName = tostring(resBody.name), extType = resBody.properties.type
  | where extType in ("CustomScriptExtension", "CustomScript", "CustomScriptForLinux")
  | project TimeGenerated, Caller, _ResourceId, OperationNameValue, Resource, extType, extName

Activities:
     EnabledByDefault: true
     Title: "Custom Script Extension execution (Preview)"
     Content: "The account {{Caller}} ran the custom script extension {{extName}} {{Count}} time(s)"
     Items:
        - Id: c6523929-5696-4e94-8a61-61aeb1c953d1
          Description: This activity indicated Custom Script Extension execution
          QueryDefinitions:
            SummarizeBy: Caller, _ResourceId, extName
