SchemaVersion: 1.0
DataTypes:
  - DataType: SecurityEvent
Type: KQL
Provider: Sentinel
EntitiesFilter: 
 Host_OsFamily:
  - Windows
RequiredInputFieldsSets: 
 - - Host_HostName
   - Host_NTDomain
 - - Host_HostName
   - Host_DnsDomain
 - - Host_AzureID
 - - Host_OMSAgentID
BaseQuery: |
  let WellKnownLocalSID = 'S-1-5-32-5[0-9][0-9]$';
  let WellKnownGroupSID = 'S-1-5-21-[0-9]*-[0-9]*-[0-9]*-5[0-9][0-9]$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-1102$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-1103$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-498$|S-1-5-21-[0-9]*-[0-9]*-[0-9]*-1000$';
  let GetGroupAddForHost = (v_Host_Name:string, v_Host_NTDomain:string, v_Host_DnsDomain:string, v_Host_AzureID:string, v_Host_OMSAgentID:string){
  SecurityEvent
  | where EventID in (4728, 4732, 4756)
  // parsing for Host to handle variety of conventions coming from data
  | extend Host_HostName = case(
  Computer has '@', tostring(split(Computer, '@')[0]),
  Computer has '\\', tostring(split(Computer, '\\')[1]),
  Computer has '.', tostring(split(Computer, '.')[0]),
  Computer
  )
  | extend Host_NTDomain = case(
  Computer has '\\', tostring(split(Computer, '\\')[0]), 
  Computer has '.', tostring(split(Computer, '.')[-2]), 
  Computer
  )
  | extend Host_DnsDomain = case(
  Computer has '\\', tostring(split(Computer, '\\')[0]), 
  Computer has '.', strcat_array(array_slice(split(Computer,'.'),-2,-1),'.'), 
  Computer
  )
  | where (Host_HostName =~ v_Host_Name and Host_NTDomain =~ v_Host_NTDomain) 
  or (Host_HostName =~ v_Host_Name and Host_DnsDomain =~ v_Host_DnsDomain) 
  or v_Host_AzureID =~ _ResourceId 
  or v_Host_OMSAgentID == SourceComputerId
  | extend MemberAdded = case( MemberName has 'CN=', tostring(split(tostring(split(MemberName, ',')[0]),'CN=')[1]), MemberName == '-', MemberSid, MemberName) 
  | project TimeGenerated, EventID, Activity, Computer, MemberAdded, MemberName, MemberSid, TargetUserName, TargetDomainName, TargetSid, UserPrincipalName, SubjectUserName, SubjectUserSid, WellKnownGroupSID, WellKnownLocalSID, _ResourceId, SourceComputerId
  | extend GroupName = TargetUserName, AddedBy = SubjectUserName
  //support for Activities
  | extend timestamp = TimeGenerated, HostCustomEntity = Computer
  };
  GetGroupAddForHost('{{Host_HostName}}', '{{Host_NTDomain}}', '{{Host_DnsDomain}}', '{{Host_AzureID}}', '{{Host_OMSAgentID}}')
# The queries for the insights.
Insights:
 Id: 44c9d0fe-c131-4080-a34f-da0e349da336
 DisplayName: Group additions
 Description: |
   Summary of user additions to Groups on the specific host. Specifically, we provide the count of All Groups, [Privileged Groups](https://docs.microsoft.com/windows/security/identity-protection/access-control/active-directory-security-groups) and Remote Desktop Users Group.
 DefaultTimeRange: 
  BeforeRange: 12h
  AfterRange: 12h
 TableQuery:
  ColumnsDefinitions:
  - Header: "Groups"
    OutputType: String
    SupportDeepLink: false
  - Header: GroupCount
    OutputType: Number
    SupportDeepLink: true
  - Header: UsersAddedCount
    OutputType: Number
    SupportDeepLink: true
  QueriesDefinitions:

  # UserAddedToPrivilegedGroups
  - Filter:    "where TargetSid matches regex WellKnownLocalSID or TargetSid matches regex WellKnownGroupSID"
    Summarize: "summarize GroupCount = dcount(GroupName), UsersAddedCount = dcount(MemberAdded) by Computer"
    Project:   "project Title = 'Privileged', GroupCount, UsersAddedCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: UsersAddedCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UserAddedToRemoteDesktopGroup
  - Filter:    "where TargetSid in ('S-1-5-32-555')"
    Summarize: "summarize GroupCount = dcount(GroupName), UsersAddedCount = dcount(MemberAdded) by Computer"
    Project:   "project Title = 'Remote Desktop', GroupCount, UsersAddedCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UserAddedToPrivilegedGroupsExcludeRDP
  - Filter:    "where TargetSid matches regex WellKnownLocalSID or TargetSid matches regex WellKnownGroupSID | where TargetSid !in ('S-1-5-32-555')"
    Summarize: "summarize GroupCount = dcount(GroupName), UsersAddedCount = dcount(MemberAdded) by Computer"
    Project:   "project Title = 'Privileged(non-RDP)', GroupCount, UsersAddedCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # UsersAddedToGroups
  - Filter:    "order by GroupName"
    Summarize: "summarize GroupCount = dcount(GroupName), UsersAddedCount = dcount(MemberAdded) by Computer"
    Project:   "project Title = 'All', GroupCount, UsersAddedCount"
    LinkColumnsDefinitions:
    - ProjectedName: GroupCount
      Query: "{{BaseQuery}}"

 ChartQuery: 
  Title: "Group additions per hour"
  DataSets: 
   - Query: "summarize Count = count() by bin(TimeGenerated, 1h) | extend Legend = 'Total'"
     XColumnName: "TimeGenerated"
     YColumnName: "Count"
     LegendColumnName: "Legend"
  Type: LineChart

 AdditionalQuery:
  Text: "See all group additions"
  Query: "project TimeGenerated, EventID, Activity, Computer, MemberAdded, MemberName, MemberSid, TargetUserName, TargetDomainName, TargetSid, UserPrincipalName, SubjectUserName, SubjectUserSid, WellKnownGroupSID, WellKnownLocalSID, _ResourceId, SourceComputerId, timestamp, HostCustomEntity | order by TimeGenerated desc"

Activities:
 EnabledByDefault: true
 Items:
   - Id: b880ad94-f905-4ba8-8a3f-9088b19b12fa
     Description: Account added to local Administrators group
     Title: "An account was added to the local Administrators group"
     Content: "On '{{Computer}}' the user '{{MemberAdded}}' was added by '{{AddedBy}}' to group: '{{GroupName}}'"
     QueryDefinitions:
       Filter: where TargetSid == 'S-1-5-32-544'
       SummarizeBy: Computer
   - Id: aaad22c3-be50-465f-b258-8570d629c3db
     Description: Account added to the Domain Admins group
     Title: "An account was added to the Domain Admins group"
     Content: "On '{{Computer}}' the user '{{MemberAdded}}' was added by '{{AddedBy}}' to group: '{{GroupName}}'"
     QueryDefinitions:
       Filter: where TargetSid matches regex 'S-1-5-21-[0-9]*-[0-9]*-[0-9]*-512$'
       SummarizeBy: Computer
   - Id: cf3469b3-f64c-4ae2-9900-289617443d74
     Description: Account added to the Enterprise Admins group
     Title: "An account was added to the Enterprise Admins group"
     Content: "On '{{Computer}}' the user '{{MemberAdded}}' was added by '{{AddedBy}}' to group: '{{GroupName}}'"
     QueryDefinitions:
       Filter: where TargetSid matches regex 'S-1-5-21-[0-9]*-[0-9]*-[0-9]*-519$'
       SummarizeBy: Computer
   - Id: 5ba7b064-c667-4bb9-b8ac-7e87872ae479
     Description: Account added to privileged group.
     Title: "Account added to a privileged group"
     Content: "On '{{Computer}}' the user '{{MemberAdded}}' was added by '{{AddedBy}}' to group: '{{GroupName}}'"
     QueryDefinitions:
       Filter: where (TargetSid matches regex WellKnownLocalSID or TargetSid matches regex WellKnownGroupSID) and TargetSid != 'S-1-5-32-544' and not(TargetSid matches regex 'S-1-5-21-[0-9]*-[0-9]*-[0-9]*-512$') and not(TargetSid matches regex 'S-1-5-21-[0-9]*-[0-9]*-[0-9]*-519$')
       SummarizeBy: MemberAdded, AddedBy, GroupName 
