SchemaVersion: 1.0
Provider: Sentinel
Type: KQL
DataTypes: 
- DataType: AzureActivity
RequiredInputFieldsSets:
- - AzureResource_ResourceId
BaseQuery: |- 
  AzureActivity
  | where OperationNameValue =~ "MICROSOFT.COMPUTE/VIRTUALMACHINES/RUNCOMMAND/ACTION"
  | where _ResourceId =~ '{{AzureResource_ResourceId}}'
  | project TimeGenerated, Caller, _ResourceId, OperationNameValue, Resource

Activities:
     EnabledByDefault: true
     Title: "VM Run Command execution"
     Content: "The account {{Caller}} used Run Command on the VM {{Count}} time(s)"
     Items: 
        - Id: 61f3e63d-e5fa-4a88-9d66-9c1a00bc73b9
          Description: This activity indicates usage of Run Command
          QueryDefinitions:
            SummarizeBy: Caller, _ResourceId
