SchemaVersion: 1
DataTypes:
  - DataType: DeviceEvents
Type: KQL
Provider: Sentinel
EntitiesFilter:
  Host_OsFamily:
    - Windows
RequiredInputFieldsSets:
  - - Host_HostName
    - Host_NTDomain
  - - Host_HostName
    - Host_DnsDomain
BaseQuery: |-
  let ScreenshotTakers= (v_Host_HostName:string, v_Host_NTDomain:string, v_Host_DnsDomain:string){
    let p_FullDeviceName = iff(isnotempty(v_Host_DnsDomain), strcat(v_Host_HostName,'.',v_Host_DnsDomain), strcat(v_Host_HostName,'.',v_Host_NTDomain) );
    DeviceEvents 
    | where ActionType =='ScreenshotTaken' 
    | where DeviceName =~ p_FullDeviceName
  };
  ScreenshotTakers('{{Host_HostName}}', '{{Host_NTDomain}}', '{{Host_DnsDomain}}')

Activities:
 EnabledByDefault: true
 Items:
   - Id: c7def1db-6a27-45dc-bee0-0c5fd5e7f1fe
     Description: "A screenshot was taken on the host"
     Title: "Screenshot taken"
     Content: "The user '{{InitiatingProcessAccountUpn}}' has taken {{Count}} screenshot(s) on the host"
     QueryDefinitions:
       Filter: "where 1==1"
       SummarizeBy: "InitiatingProcessAccountName, InitiatingProcessAccountUpn"
