SchemaVersion: 1
DataTypes:
  - DataType: DeviceEvents
Type: KQL
Provider: Sentinel
EntitiesFilter:
  Host_OsFamily:
    - Windows
RequiredInputFieldsSets:
  - - Host_HostName
    - Host_NTDomain
  - - Host_HostName
    - Host_DnsDomain
BaseQuery: |-
  let ScreenshotTakers= (v_Host_HostName:string, v_Host_NTDomain:string, v_Host_DnsDomain:string){
    let p_FullDeviceName = iff(isnotempty(v_Host_DnsDomain), strcat(v_Host_HostName,'.',v_Host_DnsDomain), strcat(v_Host_HostName,'.',v_Host_NTDomain) );
    DeviceEvents 
    | where ActionType =='ScreenshotTaken' 
    | where DeviceName =~ p_FullDeviceName
  };
  ScreenshotTakers('{{Host_HostName}}', '{{Host_NTDomain}}', '{{Host_DnsDomain}}')

Insights:
  Id: d5bb69fd-460f-44a8-ae8a-b8e141f64c4a
  DisplayName: Screenshot taken on the host
  Description: |
    Displays the users taking the most screenshots on the host
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 7d
  TableQuery:
    ColumnsDefinitions:
      - Header: User UPN
        OutputType: String
        SupportDeepLink: false
      - Header: 'Screenshots'
        OutputType: int
        SupportDeepLink: false

    QueriesDefinitions:
      - Filter: where 1==1
        Summarize: |
           top-nested 5 of InitiatingProcessAccountUpn by Count=count()
        Project: "project User = InitiatingProcessAccountUpn, Count"

  AdditionalQuery:
    Text: See all screenshots
    Query: | 
      project-reorder TimeGenerated, InitiatingProcessAccountName, InitiatingProcessAccountUpn, InitiatingProcessAccountSid
