SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
Reference: https://github.com/Azure/Azure-Sentinel/blob/vm_insights/Insights/Azure-Resource/Top_Operations_and_Categories.yaml
EntitiesFilter: {}
BaseQuery: | 
  AzureActivity 
  | extend Azure_Resource_Id = tolower(ResourceId) 
  | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}'
RequiredInputFieldsSets:
- - AzureResource_ResourceId
Insights:
  Id: 12514fad-35e1-4940-93f8-2d3824a460c4
  DisplayName: Top Operations and Categories
  Description: "### Top Operations and Categories\n ___ \n This insight shows you the operations most performed on this Azure Resource, and their categorization."
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 2d
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: Operation
      OutputType: string
      SupportDeepLink: false
    - Header: Category
      OutputType: number
      SupportDeepLink: false
    - Header: Number of records
      OutputType: number
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: 'where 1==1'
      Summarize: "summarize ['Number of records']=count() by OperationName, Category | top 20 by count_ desc"
      Project: "project ['Operation']=OperationName, Category, ['Number of records']"
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View additional details
    Query: "project Caller, CallerIpAddress, OperationName, Category, Level, ActivityStatus, ResourceGroup, SubscriptionId"
