SchemaVersion: '1.0'
DataTypes:
- DataType: AzureActivity
Provider: Sentinel
Type: KQL
Reference: https://github.com/Azure/Azure-Sentinel/blob/vm_insights/Insights/Azure-Resource/Top_IP_addresses_and_locations.yaml
EntitiesFilter: {}
BaseQuery: | 
  AzureActivity | extend Azure_Resource_Id = tolower(ResourceId) 
  | where Azure_Resource_Id =~ '{{AzureResource_ResourceId}}' 
  | join kind= leftouter BehaviorAnalytics
  on $left._ItemId == $right.SourceRecordId
RequiredInputFieldsSets:
- - AzureResource_ResourceId
Insights:
  Id: 2ec468f6-f26c-4a6e-be12-f333aa284173
  DisplayName: Top IP addresses and locations
  Description: "### Top IP addresses and locations \n ___ \n This insight shows you the top IP addresses that accessed this Azure Resource, and their geolocation, if available."
  DefaultTimeRange:
    BeforeRange: 14d
    AfterRange: 2d
  SingleValuesQuery: {}
  TableQuery:
    ColumnsDefinitions:
    - Header: IP
      OutputType: string
      SupportDeepLink: false
    - Header: Number of Events
      OutputType: number
      SupportDeepLink: false
    - Header: Geo Location
      OutputType: string
      SupportDeepLink: false
    QueriesDefinitions:
    - Filter: 'where 1==1' 
      Summarize: "summarize count() ,any(SourceIPLocation) by CallerIpAddress | top 10 by count_ desc"
      Project: "project ['IP']=CallerIpAddress, ['Number of events']=count_, ['Geolocation']=any_SourceIPLocation"
      LinkColumnsDefinitions: []
  AdditionalQuery:
    Text: View all the addresses
    Query: "summarize count() ,any(SourceIPLocation) by CallerIpAddress | sort by count_ desc | project ['IP']=CallerIpAddress, ['Number of events']=count_, ['Geolocation']=any_SourceIPLocation"
