SchemaVersion: 1.0
DataTypes:
  - DataType: SecurityEvent
Type: KQL
Provider: Sentinel
EntitiesFilter: 
 Host_OsFamily:
  - Windows
RequiredInputFieldsSets: 
 - - Host_HostName
   - Host_NTDomain
 - - Host_HostName
   - Host_DnsDomain
 - - Host_AzureID
 - - Host_OMSAgentID
BaseQuery: |
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let includeScope = 2d;
  let historicalScope = 3d;
  let GetAllLogonsForHost = (v_Host_Name:string, v_Host_NTDomain:string, v_Host_DnsDomain:string, v_Host_AzureID:string, v_Host_OMSAgentID:string){
  let DomainAllowList = dynamic(["NT AUTHORITY", "NT SERVICE", "Font Driver Host", "Window Manager"]);
  let AccountAllowList = dynamic(["SYSTEM","NETWORK SERVICE", "LOCAL SERVICE"]);
  let AllEvents = SecurityEvent
  | where TimeGenerated >= (starttime - historicalScope)
  | where EventID in (4624, 4625)
  | where AccountType != "Machine"
  | where LogonTypeName != "3 - Network"
  | where TargetDomainName !in ('NT AUTHORITY', 'NT SERVICE', 'Font Driver Host', 'Window Manager')
  | where v_Host_AzureID =~ _ResourceId
  or v_Host_OMSAgentID == SourceComputerId
  or (Computer hasprefix v_Host_Name and Computer hassuffix v_Host_DnsDomain)
  or (Computer hassuffix v_Host_Name and Computer hasprefix v_Host_NTDomain)
  | extend RelatedRowSet = 'AllEvents'
  | extend HourOfLogin = hourofday(TimeGenerated), DayNumberofWeek = dayofweek(TimeGenerated)
  | extend DayofWeek = case(
  DayNumberofWeek == "00:00:00", "Sunday",
  DayNumberofWeek == "1.00:00:00", "Monday",
  DayNumberofWeek == "2.00:00:00", "Tuesday",
  DayNumberofWeek == "3.00:00:00", "Wednesday",
  DayNumberofWeek == "4.00:00:00", "Thursday",
  DayNumberofWeek == "5.00:00:00", "Friday",
  DayNumberofWeek == "6.00:00:00", "Saturday","InvalidTimeStamp")
  // map the most common ntstatus codes
  | extend StatusDesc = case(
  Status =~ "0x80090302", "SEC_E_UNSUPPORTED_FUNCTION",
  Status =~ "0x80090308", "SEC_E_INVALID_TOKEN",
  Status =~ "0x8009030E", "SEC_E_NO_CREDENTIALS",
  Status =~ "0xC0000008", "STATUS_INVALID_HANDLE",
  Status =~ "0xC0000017", "STATUS_NO_MEMORY",
  Status =~ "0xC0000022", "STATUS_ACCESS_DENIED",
  Status =~ "0xC0000034", "STATUS_OBJECT_NAME_NOT_FOUND",
  Status =~ "0xC000005E", "STATUS_NO_LOGON_SERVERS",
  Status =~ "0xC000006A", "STATUS_WRONG_PASSWORD",
  Status =~ "0xC000006D", "STATUS_LOGON_FAILURE",
  Status =~ "0xC000006E", "STATUS_ACCOUNT_RESTRICTION",
  Status =~ "0xC0000073", "STATUS_NONE_MAPPED",
  Status =~ "0xC00000FE", "STATUS_NO_SUCH_PACKAGE",
  Status =~ "0xC000009A", "STATUS_INSUFFICIENT_RESOURCES",
  Status =~ "0xC00000DC", "STATUS_INVALID_SERVER_STATE",
  Status =~ "0xC0000106", "STATUS_NAME_TOO_LONG",
  Status =~ "0xC000010B", "STATUS_INVALID_LOGON_TYPE",
  Status =~ "0xC000015B", "STATUS_LOGON_TYPE_NOT_GRANTED",
  Status =~ "0xC000018B", "STATUS_NO_TRUST_SAM_ACCOUNT",
  Status =~ "0xC0000224", "STATUS_PASSWORD_MUST_CHANGE",
  Status =~ "0xC0000234", "STATUS_ACCOUNT_LOCKED_OUT",
  Status =~ "0xC00002EE", "STATUS_UNFINISHED_CONTEXT_DELETED",
  EventID == 4624 or EventID == 4672, "Success",
  "See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55"
  )
  | extend SubStatusDesc = case(
  SubStatus =~ "0x80090325", "SEC_E_UNTRUSTED_ROOT",
  SubStatus =~ "0xC0000008", "STATUS_INVALID_HANDLE",
  SubStatus =~ "0xC0000022", "STATUS_ACCESS_DENIED",
  SubStatus =~ "0xC0000064", "STATUS_NO_SUCH_USER",
  SubStatus =~ "0xC000006A", "STATUS_WRONG_PASSWORD",
  SubStatus =~ "0xC000006D", "STATUS_LOGON_FAILURE",
  SubStatus =~ "0xC000006E", "STATUS_ACCOUNT_RESTRICTION",
  SubStatus =~ "0xC000006F", "STATUS_INVALID_LOGON_HOURS",
  SubStatus =~ "0xC0000070", "STATUS_INVALID_WORKSTATION",
  SubStatus =~ "0xC0000071", "STATUS_PASSWORD_EXPIRED",
  SubStatus =~ "0xC0000072", "STATUS_ACCOUNT_DISABLED",
  SubStatus =~ "0xC0000073", "STATUS_NONE_MAPPED",
  SubStatus =~ "0xC00000DC", "STATUS_INVALID_SERVER_STATE",
  SubStatus =~ "0xC0000133", "STATUS_TIME_DIFFERENCE_AT_DC",
  SubStatus =~ "0xC000018D", "STATUS_TRUSTED_RELATIONSHIP_FAILURE",
  SubStatus =~ "0xC0000193", "STATUS_ACCOUNT_EXPIRED",
  SubStatus =~ "0xC0000380", "STATUS_SMARTCARD_WRONG_PIN",
  SubStatus =~ "0xC0000381", "STATUS_SMARTCARD_CARD_BLOCKED",
  SubStatus =~ "0xC0000382", "STATUS_SMARTCARD_CARD_NOT_AUTHENTICATED",
  SubStatus =~ "0xC0000383", "STATUS_SMARTCARD_NO_CARD",
  SubStatus =~ "0xC0000384", "STATUS_SMARTCARD_NO_KEY_CONTAINER",
  SubStatus =~ "0xC0000385", "STATUS_SMARTCARD_NO_CERTIFICATE",
  SubStatus =~ "0xC0000386", "STATUS_SMARTCARD_NO_KEYSET",
  SubStatus =~ "0xC0000387", "STATUS_SMARTCARD_IO_ERROR",
  SubStatus =~ "0xC0000388", "STATUS_DOWNGRADE_DETECTED",
  SubStatus =~ "0xC0000389", "STATUS_SMARTCARD_CERT_REVOKED",
  EventID == 4624 , "Success",
  "See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55"
  )
  | project TimeGenerated, DayofWeek, HourOfLogin, EventID, Activity, IpAddress, WorkstationName, Computer, AccountType, TargetAccount, TargetUserName, TargetDomainName, ProcessName, SubjectUserName, PrivilegeList, LogonTypeName, RelatedRowSet, _ResourceId, SourceComputerId ,  StatusDesc, SubStatusDesc;
  let HostSigninToSystems = materialize(AllEvents
  | where EventID == 4624
  | project-away PrivilegeList , StatusDesc, SubStatusDesc
  | summarize SigninCount= count(), max(HourOfLogin), min(HourOfLogin), historical_DayofWeek=make_set(DayofWeek), StartTime=min(TimeGenerated), EndTime = max(TimeGenerated), SourceIP = make_set(IpAddress, 25), SourceHost = make_set(WorkstationName, 25), SubjectUserName = make_set(SubjectUserName, 25) by EventID, Activity, Computer, TargetAccount, TargetDomainName, TargetUserName , ProcessName , LogonTypeName, _ResourceId, SourceComputerId
  | extend RelatedRowSet = 'HostSigninToSystems');
  let HostFailedSigninToSystems = materialize(AllEvents
  | where EventID == 4625
  | project-away PrivilegeList
  | summarize SigninCount= count(), max(HourOfLogin), min(HourOfLogin), historical_DayofWeek=make_set(DayofWeek), StartTime=min(TimeGenerated), EndTime = max(TimeGenerated), SourceIP = make_set(IpAddress, 25), SourceHost = make_set(WorkstationName, 25), SubjectUserName = make_set(SubjectUserName, 25) by EventID, Activity, Computer, TargetAccount, TargetDomainName, TargetUserName , ProcessName , LogonTypeName, _ResourceId, SourceComputerId
  | extend RelatedRowSet = 'HostFailedSigninToSystems');
  union isfuzzy=true AllEvents, HostSigninToSystems, HostFailedSigninToSystems
  | extend timestamp = StartTime, HostCustomEntity = Computer, AccountCustomEntity = TargetAccount, TimeGenerated=coalesce(TimeGenerated, StartTime, TimeGenerated)
  };
  // change {{Host_HostName}} value below to the HostName you are interested in
  GetAllLogonsForHost('{{Host_HostName}}', '{{Host_NTDomain}}', '{{Host_DnsDomain}}', '{{Host_AzureID}}', '{{Host_OMSAgentID}}')
# The queries for the insights.
Insights:
 Id: 4ecc2229-5cbf-4b04-a2ab-0842c5e4d1cd
 DisplayName: Windows sign-in activity
 Description: |
   Summary of successful and failed sign-ins along with anomalous sign-in patterns for the specific host.  Successful sign-ins currently only include interactive and limited to LogonType 2 and 10.
 DefaultTimeRange: 
   BeforeRange: 12h
   AfterRange: 12h
 TableQuery:
  ColumnsDefinitions:
  - Header: "Signin Type"
    OutputType: String
  - Header: "Signin Count"
    OutputType: Number
    SupportDeepLink: true
  - Header: "User Count"
    OutputType: Number
    SupportDeepLink: true
  - Header: "User(s)"
    OutputType: String   
  QueriesDefinitions:

  # HostSigninToSystems
  - Filter:     "where RelatedRowSet =~ 'HostSigninToSystems' and TargetDomainName !in ('NT AUTHORITY', 'NT SERVICE', 'Font Driver Host', 'Window Manager')"
    Summarize:  "summarize SigninCount = sum(SigninCount), UserCount = dcount(TargetUserName), Users = make_set(TargetUserName, 25)"
    Project:    "project Title = 'Successful', SigninCount, UserCount, Users = case(array_length(Users) > 1, 'Many', array_length(Users) == 1, tostring(Users[0]), 'None')"
    LinkColumnsDefinitions:
    - ProjectedName: SigninCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: UserCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # HostFailedSigninToSystems
  - Filter:     "where RelatedRowSet =~ 'HostFailedSigninToSystems'"
    Summarize:  "summarize SigninCount= sum(SigninCount), UserCount = dcount(TargetUserName), Users = make_set(TargetUserName, 25)"
    Project:    "project Title = 'Failed', SigninCount, UserCount, Users = case(array_length(Users) > 1, 'Many', array_length(Users) == 1, tostring(Users[0]), 'None')"
    LinkColumnsDefinitions:
    - ProjectedName: SigninCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: UserCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # MostFrequent
  - Filter:     "where RelatedRowSet =~ 'AllEvents' | where EventID == 4624 and TargetDomainName !in ('NT AUTHORITY', 'NT SERVICE', 'Font Driver Host', 'Window Manager')"
    Summarize:  "summarize StartTime=min(TimeGenerated), EndTime = max(TimeGenerated), SourceIP = make_set(IpAddress, 25), SigninCount = count() by TargetDomainName, TargetUserName, EventID | top 1 by SigninCount desc"
    Project:    "project Title = 'Most Frequent', SigninCount, UserCount = 1, Users = TargetUserName"
    LinkColumnsDefinitions:
    - ProjectedName: SigninCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: UserCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

  # LeastFrequent
  - Filter:     "where RelatedRowSet =~ 'AllEvents' | where EventID == 4624 and TargetDomainName !in ('NT AUTHORITY', 'NT SERVICE', 'Font Driver Host', 'Window Manager')"
    Summarize:  "summarize StartTime=min(TimeGenerated), EndTime = max(TimeGenerated), SourceIP = make_set(IpAddress, 25), SigninCount = count() by TargetDomainName, TargetUserName, EventID | top 1 by SigninCount asc"
    Project:    "project Title = 'Least Frequent', SigninCount, UserCount = 1, Users = TargetUserName"
    LinkColumnsDefinitions:
    - ProjectedName: SigninCount
      Query: "{{BaseQuery}} | {{RowFilter}}"
    - ProjectedName: UserCount
      Query: "{{BaseQuery}} | {{RowFilter}}"

 ChartQuery: 
  Title: "Sign-ins over time"
  DataSets: 
   - Query: "where RelatedRowSet =~ 'AllEvents' and EventID == 4624 and TargetDomainName !in ('NT AUTHORITY', 'NT SERVICE', 'Font Driver Host', 'Window Manager') | summarize Count=count() by Time = bin(TimeGenerated, 1h) | extend Legend = 'Success'"
     XColumnName: "Time"
     YColumnName: "Count"
     LegendColumnName: "Legend"
   - Query: "where RelatedRowSet =~ 'AllEvents' and EventID == 4625 | summarize Count=count() by Time = bin(TimeGenerated, 1h) | extend Legend = 'Failed'"
     XColumnName: "Time"
     YColumnName: "Count"
     LegendColumnName: "Legend"
  Type: LineChart

 AdditionalQuery:
  Text: "See all windows sign-ins"
  Query: "where RelatedRowSet =~ 'AllEvents' | extend SubjectUserName = columnifexists('SubjectUserName', 'EventDoesNotContain') | summarize SigninCount= count(), max(HourOfLogin), min(HourOfLogin), historical_DayofWeek=make_set(DayofWeek), StartTime=min(TimeGenerated), EndTime = max(TimeGenerated), SourceIP = make_set(IpAddress, 25), SourceHost = make_set(WorkstationName, 25), SubjectUserName = make_set(SubjectUserName, 25), UserCount = dcount(TargetUserName), Users = make_set(TargetUserName, 25) by Activity, TargetDomainName, TargetUserName, ProcessName, LogonTypeName, timestamp, HostCustomEntity, AccountCustomEntity"
