id: 6e813653-df72-4b14-954e-5619d1b6d586
name: Threat information has been detected in web request. (ASIM Web Session)
description: |
  'This query looks for threat fields like EventSeverity, ThreatName, ThreatCategory and ThreatConfidence and creates an alert if threat info is found.'
severity: High
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
  - T1133
query: |
  _Im_WebSession
  | project EventSeverity, ThreatName, ThreatCategory, ThreatConfidence, TimeGenerated, SrcIpAddr, SrcUsername, SrcHostname
  | where EventSeverity =~ 'High' or isnotempty(ThreatName) or isnotempty(ThreatCategory) // Check for high severity events or that has either ThreatName or ThreatCategory field populated
  | summarize EventCount = count(), EventStartTime=min(TimeGenerated), EvenEndTime=max(TimeGenerated) by SrcIpAddr, SrcUsername, SrcHostname, ThreatCategory, ThreatConfidence, ThreatName
  | order by EventCount desc
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SrcHostname
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: SrcUsername
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  ThreatCategory: ThreatCategory
  ThreatConfidence: ThreatConfidence
  ThreatName: ThreatName
  EventCount: EventCount
version: 1.0.0