id: 9f8c2c12-7d66-4d80-9f86-9f4c8d2d5d6a
Function:
  Title: Dragos Notifications Sentinel Incidents
  Version: '1.1.1'
  LastUpdated: '2024-08-25'
Category: Microsoft Sentinel Parser
FunctionName: DragosNotificationsToSentinel
FunctionAlias: DragosNotificationsToSentinel
FunctionQuery: |
  let existingIncidents = SecurityAlert
    | where ProductName == "Dragos"
    | extend CustomDetails=tostring(parse_json(ExtendedProperties)["Custom Details"])
    | extend id = toint(extract_json("$.DragosIdentifier[0]", CustomDetails))
    | project-keep SystemAlertId, id;
  union isfuzzy=true DragosPushNotificationsToSentinel, DragosPullNotificationsToSentinel
    | join kind=leftouter (existingIncidents) on id
    | where isempty(SystemAlertId)
    | summarize arg_max(createdAt, *) by id
    | sort by severity desc
