id: 399ed349-28c3-4ae6-ab15-6ec60ae063a2
Function:
  Title: Parser for Morphisec
  Version: '1.0.0'
  LastUpdated: '2023-08-22'
Category: Microsoft Sentinel Parser
FunctionName: Morphisec
FunctionAlias: Morphisec
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor == 'Morphisec'
    | extend Start = coalesce(
                                todatetime(extract("start=([^;]+)",1,AdditionalExtensions)),                            
                                todatetime(column_ifexists("StartTime", ""))
                            )                        
    , AttackedModule = extract("AttackedModule=([^;]+)",1,AdditionalExtensions)
    , MorphisecVersion = extract("MorphisecVersion=([^;]+)",1,AdditionalExtensions)
    , AttackName = extract("AttackName=([^;]+)",1,AdditionalExtensions)
    , AttackCategory = extract("AttackCategory=([^;]+)",1,AdditionalExtensions)
    , Attackdescription = extract("Attackdescription=([^;]+)",1,AdditionalExtensions)
    , ProcessSignature = extract("ProcessSignature=([^;]+)",1,AdditionalExtensions)
    , ParentSignature = extract("ParentSignature=([^;]+)",1,AdditionalExtensions)
    , LastStackFunctionCall = extract("LastStackFunctionCall=([^;]+)",1,AdditionalExtensions)
    , LastModuleLoaded = extract("LastModuleLoaded=([^;]+)",1,AdditionalExtensions)
    , CommandLine = extract("CommandLine=([^;]+)",1,AdditionalExtensions)
    , ParentProcessCommandLine = extract("ParentProcessCommandLine=([^;]+)",1,AdditionalExtensions)
    , CodeProcessed = extract("CodeProcessed=([^;]+)",1,AdditionalExtensions)