description: |
  'Set of Administrative operational detection queries for suspicious activites based on multipe resrouce types' 
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |
  let timeframe = 7d;
  //  #1- Azure Sentinel Analytics - Rule Create / Update / Delete
AzureActivity
| where Category == "Administrative"
| where OperationNameValue in ("Microsoft.SecurityInsights/alertRules/write", "Microsoft.SecurityInsights/alertRules/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc

// #2-  Azure NSG Create / Update / Delete
AzureActivity
| where Category == "Administrative"
| where OperationNameValue in ("Microsoft.Network/networkSecurityGroups/write", "Microsoft.Network/networkSecurityGroups/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc

// #3-  Creating Virtual Network Subnets
AzureActivity
| where Category == "Administrative"
| where OperationNameValue == "Microsoft.Network/virtualNetworks/subnets/write"
| where ActivitySubstatusValue == "Created"
| sort by TimeGenerated desc

// #4-  Azure NSG Create / Update / Delete
AzureActivity
| where Category == "Administrative"
| where OperationNameValue in ("Microsoft.Network/networkSecurityGroups/write", "Microsoft.Network/networkSecurityGroups/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc

// #5-  Azure Sentinel Workbook Create / Update / Delete
AzureActivity
| where Category == "Administrative"
| where OperationNameValue in ("microsoft.insights/workbooks/write", "microsoft.insights/workbooks/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc

// #6-  Azure Sentinel Data Connectors Update / Delete
AzureActivity
| where Category == "Administrative"
| where OperationNameValue in ("Microsoft.SecurityInsights/dataConnectors/write", "Microsoft.SecurityInsights/dataConnectors/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc
