id: ef7ef44e-6129-4d8e-94fe-b5530415d8e5
name: Azure Sentinel Analytics Rules Administrative Operations
description: |
  'Identifies set of Azure Sentinel Analytics Rules administrative operational detection queries for suspicious activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |
let timeframe = 1d;
// Azure Sentinel Analytics - Rule Create / Update / Delete
AzureActivity
| where Category == "Administrative"
| where TimeGenerated >= ago(timeframe)
| where OperationNameValue in ("Microsoft.SecurityInsights/alertRules/write", "Microsoft.SecurityInsights/alertRules/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc
| extend IPCustomEntity = CallerIpAddress
| extend AccountCustomEntity = Caller
| extend TimestampCustomEntity = TimeGenerated
