id: ef7ef44e-6129-4d8e-94fe-b5530415d8e5
name: Azure Sentinel Analytics Rules Administrative Operations
description: |
  'Identifies set of Azure Sentinel Analytics Rules administrative operational detection queries for hunting activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
 
  let timeframe = 1d;
  let opValues = dynamic(["Microsoft.SecurityInsights/alertRules/write", "Microsoft.SecurityInsights/alertRules/delete"]);
  // Azure Sentinel Analytics - Rule Create / Update / Delete
  AzureActivity
  | where TimeGenerated >= ago(timeframe)
  | where Category == "Administrative"
  | where OperationNameValue in (opValues)
  | where ActivitySubstatusValue in ("Created", "OK")
  | sort by TimeGenerated desc
  | extend AccountCustomEntity = Caller
  | extend IPCustomEntity = CallerIpAddress
