id: 5a1f9655-c893-4091-8dc0-7f11d7676506
name: Azure Virtual Network Subnets Administrative Operations
description: |
  'Identifies set of Azure Virtual Network Subnets administrative operational detection queries for suspicious activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |
let timeframe = 1d;
// Creating Virtual Network Subnets
AzureActivity
| where Category == "Administrative"
| where TimeGenerated >= ago(timeframe)
| where OperationNameValue == "Microsoft.Network/virtualNetworks/subnets/write"
| where ActivitySubstatusValue == "Created"
| sort by TimeGenerated desc
| extend IPCustomEntity = CallerIpAddress
| extend AccountCustomEntity = Caller
| extend TimestampCustomEntity = TimeGenerated
