id: 5a1f9655-c893-4091-8dc0-7f11d7676506
name: Azure Virtual Network Subnets Administrative Operations
description: |
  'Identifies set of Azure Virtual Network Subnets administrative operational detection queries for hunting activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
 
  let timeframe = 1d;
  let opValues = dynamic(["Microsoft.Network/virtualNetworks/subnets/write"]);
  // Creating Virtual Network Subnets
  AzureActivity
  | where TimeGenerated >= ago(timeframe)
  | where Category == "Administrative"
  | where OperationNameValue in (opValues)
  | where ActivitySubstatusValue == "Created"
  | sort by TimeGenerated desc
  | extend timestamp = TimeGenerated, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
