id: e94d6756-981c-4f02-9a81-d006d80c8b41
name: Azure Network Security Group NSG Administrative Operations
description: |
  'Identifies set of Azure NSG administrative operational detection queries for hunting activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
 
  let timeframe = 1d;
  let opValues = dynamic(["Microsoft.Network/networkSecurityGroups/write", "Microsoft.Network/networkSecurityGroups/delete"]);
  // Azure NSG Create / Update / Delete
  AzureActivity
  | where TimeGenerated >= ago(timeframe)
  | where Category == "Administrative"
  | where OperationNameValue in (opValues)
  | where ActivitySubstatusValue in ("Created", "OK")
  | sort by TimeGenerated desc
  | extend timestamp = TimeGenerated, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity