id: 5a1f9655-c893-4091-8dc0-7f11d7676506
name: Azure Sentinel Workbooks Administrative Operations
description: |
  'Identifies set of Azure Sentinel Workbooks administrative operational detection queries for hunting activites'
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: | 
 
let timeframe = 1d; 
// Azure Sentinel Workbook Create / Update / Delete
AzureActivity
| where Category == "Administrative"
| where TimeGenerated >= ago(timeframe)
| where OperationNameValue in ("microsoft.insights/workbooks/write", "microsoft.insights/workbooks/delete")
| where ActivitySubstatusValue in ("Created", "OK")
| sort by TimeGenerated desc
| extend IP = CallerIpAddress
| extend Account = Caller
| project TimeGenerated, Account, IP, OperationName, OperationNameValue, Level, ActivityStatusValue, ActivitySubstatus
