// Name: Common deployed resources
//
// Description: this query looks for common deployed resources (resource name and resource groups) and can be used
// in combination with other signals that show suspicious deployment to evaluate if the resource is one
// that is commonly being deployed/created or unique.
//
// Data source: AzureActivity
//
// Techniques: #Execution
//
AzureActivity
| where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
| where ActivityStatus == "Succeeded" 
| project Resource, ResourceGroup 
| evaluate basket()
