id: 0278e3b8-9899-45c5-8928-700cd80d2d80
name: Common deployed resources
description: |
  'This query looks for common deployed resources (resource name and resource groups) and can be used
  in combination with other signals that show suspicious deployment to evaluate if the resource is one
  that is commonly being deployed/created or unique.' 
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |

  let timeframe = 7d;
  AzureActivity
  | where TimeGenerated >= ago(timeframe)
  | where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
  | where ActivityStatus == "Succeeded" 
  | project Resource, ResourceGroup 
  | evaluate basket()
