id: a09e6368-065b-4f1e-a4ce-b1b3a64b493b
name: Creation of an anomalous number of resources
description: |
  'Looks for anomalous number of resources creation or deployment activities in azure activity log.
  It is best to run this query on a look back period which is at least 7 days.'
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |

  let timeframe = 7d;
  AzureActivity
  | where TimeGenerated >= ago(timeframe)
  | where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
  | where ActivityStatus == "Succeeded" 
  | make-series dcount(ResourceId)  default=0 on EventSubmissionTimestamp in range(ago(7d), now(), 1d) by Caller
  | extend AccountCustomEntity = Caller
  | render timechart 

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity