// Name: Creation of an anomalous number of resources
//
// Description: looks for anomalous number of resources creation or deployment activities in azure activity log.
// It is best to run this query on a look back period which is at least 7 days.
//
// Data source: AzureActivity
//
// Techniques: #Execution
//
AzureActivity
| where OperationName == "Create or Update Virtual Machine" or OperationName == "Create Deployment" 
| where ActivityStatus == "Succeeded" 
| make-series dcount(ResourceId)  default=0 on EventSubmissionTimestamp in range(ago(7d), now(), 1d) by Caller
| render timechart 
