// Name: Granting permissions to account
//
// Description: shows the most prevalent users who grant access to others on azure resources and for each account 
// their common source ip address. If an operation is not from this IP address it may be worthy of investigation.
//
// Data source: AzureActivity
//
// Techniques: #Persistence, #Lateral Movement
//
AzureActivity
| where TimeGenerated >= ago(30d)
| where OperationName == "Create role assignment"
| where ActivityStatus == "Succeeded" 
| project EventSubmissionTimestamp, Caller, CallerIpAddress, SubscriptionId, ResourceId 
| project Caller, CallerIpAddress
| evaluate basket()
