id: 2b6a3882-d601-4298-983b-880f6dc7acdb
name: Granting permissions to account
description: |
  'Shows the most prevalent users who grant access to others on azure resources and for each account 
  their common source ip address. If an operation is not from this IP address it may be worthy of investigation.'
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1098
query: |

  let timeframe = 7d;
  AzureActivity
  | where TimeGenerated >= ago(timeframe)
  | where OperationName == "Create role assignment"
  | where ActivityStatus == "Succeeded" 
  | project Caller, CallerIpAddress
  | evaluate basket()
  | extend AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress
