// Query to list all permissions assignment to accounts on azure subscription resources, showing also 
// who granted the permission from from which source ip address
AzureActivity
| where OperationName == "Create role assignment"
| where ActivityStatus == "Succeeded" 
| project EventSubmissionTimestamp, Caller, CallerIpAddress, SubscriptionId, ResourceId 


// This query would show us the most prevalent users who grant access to others on azure resources and for each account 
// their common source ip address. If an operation is not from this ip, we should look into it
AzureActivity
| where OperationName == "Create role assignment"
| where ActivityStatus == "Succeeded" 
| project Caller, CallerIpAddress
| evaluate basket()
