id: 860cda84-765b-4273-af44-958b7cca85f7
name: Granting permissions to account
description: |
  'Shows the most prevalent users who grant access to others on azure resources and for each account 
  their common source ip address. If an operation is not from this IP address it may be worthy of investigation.'
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
tactics:
  - Persistence
  - PrivilegeEscalation
relevantTechniques:
  - T1098
query: |

  AzureActivity
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Caller, CallerIpAddress)
  on Caller, CallerIpAddress
  | project-away Caller1, CallerIpAddress1
  | extend timestamp = StartTime, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity