id: 7bb55d05-ef39-4a40-8079-0bc3c05e7881
name: Known Malicious Keywords or Commands used in URL (ASIM Web Session)
description: |
  'Use of system commands, functions could be an indication of attacker attempting to get access to the environment by exploiting a weak service. Local File Inclusion is attack which gets executed on system and all attack payloads will be delivered from URL.'
severity: High
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
  - T1133
query: |
  // You can add more keywords to the query as necessary, depending on the specific indicators you want to detect.
  let cmd_list = dynamic(['/etc/shadow', '/etc/passwd', '/etc/hosts', '/etc/ssh/', '..\\', '../', 'proc/self/environ', 'etc/issue', 'ping -i', '/usr/bin/id', 'phpinfo()', '/bin/bash', 'sleep(', '<script>', 'whoami', 'dpkg', 'useradd', 'sudo']);
  _Im_WebSession
  | where isnotempty(Url)
  | project Url, SrcIpAddr
  | extend Decoded_url = url_decode(Url)
  | where Decoded_url  has_any (cmd_list)
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: RequestURL
eventGroupingSettings:
  aggregationKind: AlertPerResult
alertDetailsOverride:
  alertDisplayNameFormat: "Known Malicious Keywords or Commands used in URL (ASIM Web Session)"
  alertDescriptionFormat: "Use of system commands, functions could be an indication of attacker attempting to get access to the environment by exploiting a weak service. Local File Inclusion is attack which gets executed on system and all attack payloads will be delivered from URL."
version: 1.0.0
kind: Scheduled