id: b7fe8f27-7010-404b-aec5-6e5245cea580
name: The download of potentially risky files from the Discord Content Delivery Network (CDN) (ASIM Web Session)
description: |
  'This detection mechanism identifies instances where requests are made to Discord CDN addresses for file extensions that are considered risky.
    It triggers when a callout is made to a Discord server that has only been encountered once in your environment. The uniqueness of Discord servers is determined based on the server ID present in the request URL (DiscordServerId in the query).
    Discord CDN has been utilized in numerous campaigns to download additional payloads, highlighting the importance of monitoring such activities.
    The query includes a sample set of popular web script extensions (scriptExtensions), which should be customized to align with the specific requirements of your environment'
severity: Medium
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
  - T1071.001
query: |
  let connectionThreshold = 1;
  let riskyExtensions = dynamic([".exe",".dll",".bin",".msi"]);
  let discord=dynamic(["cdn.discordapp.com", "media.discordapp.com"]);
  _Im_WebSession(url_has_any=discord)
  | where TimeGenerated > ago(5d)
  | project Url, SrcUsername, SrcIpAddr, TimeGenerated, EventProduct, EventResult
  | where Url has "attachments"
  | extend DiscordServerId = extract(@"\/attachments\/([0-9]+)\/", 1, Url)
  | summarize dcount(Url), make_set(SrcUsername,100), make_set(SrcIpAddr,100), make_set(Url,100), min(TimeGenerated), max(TimeGenerated), make_set(EventResult,5) by DiscordServerId
  | mv-expand set_SrcUsername to typeof(string), set_Url to typeof(string), set_EventResult to typeof(string), set_SrcIpAddr to typeof(string)
  | where dcount_Url <= connectionThreshold
  | summarize by DiscordServerId, dcount_Url, set_SrcUsername, min_TimeGenerated, max_TimeGenerated, set_EventResult, set_SrcIpAddr, set_Url
  | where set_Url has_any (riskyExtensions)
  | project StartTime=min_TimeGenerated, EndTime=max_TimeGenerated, Result=set_EventResult, SourceUser=set_SrcUsername, SrcIpAddr=set_SrcIpAddr, Url=set_Url
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: SourceUser
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: Url
eventGroupingSettings:
  aggregationKind: AlertPerResult
alertDetailsOverride:
  alertDisplayNameFormat: "A client with the IP address '{{SrcIpAddr}}' has been detected making a request for URL '{{Url}}' that involves the retrieval of files hosted on a recognized Discord Content Delivery Network (CDN) which are considered to be potentially risky"
  alertDescriptionFormat: "In order to ascertain the accuracy of this alert and ensure it is not a false positive, it is crucial to 
                          conduct further analysis of the detected URL. This entails delving deeper into the characteristics, behavior, and context 
                          surrounding the URL to gather more information and evidence. By thoroughly investigating the URL, its associated components, and 
                          any related activities or patterns, it becomes possible to make an informed determination regarding the validity of the alert"
version: 1.0.0
kind: Scheduled