id: faa40333-1e8b-40cc-a003-51ae41fa886f
name: Multiple server errors within short timeframe (ASIM Web Session)
description: |
  'Detects multiple server errors from one source within short timeframe'
severity: Medium
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - Impact
relevantTechniques:
  - T1190
  - T1133
  - T1498
query: |
  // HTTP response status codes indicate whether a specific HTTP request has been successfully completed.
  // Please refer this for more details: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status
  let threshold = 100; // You can update threshold value as per your environment
  _Im_WebSession
  | where toint(EventResultDetails) between (500 .. 599)
  | summarize TotalErrorCount = count(), URLs=make_set(Url,100), EventResultDetailsSet=make_set(EventResultDetails) by SrcIpAddr, bin(TimeGenerated, 5m), SrcUsername, SrcHostname
  | where TotalErrorCount > threshold
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: SrcUsername
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  TotalErrorCount: TotalErrorCount
  RequestURLs: URLs
  ErrorThreshold: threshold
  EventResultDetailsSet: EventResultDetailsSet
alertDetailsOverride:
  alertDisplayNameFormat: "Multiple server errors within short timeframe (ASIM Web Session)"
  alertDescriptionFormat: "Detects multiple server errors from one source within short timeframe"
version: 1.0.0
kind: Scheduled