id: 813ccf3b-0321-4622-b0bc-63518fd14454
name: Multiple user agents for single source (ASIM Web Session)
description: |
  'Detects requests with multiple user agents from one source within a short time-frame. This could potentially be web browsing activities by some unusual processes'
severity: Medium
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
  - T1133
query: |
  let threshold = 5;
  _Im_WebSession
  | summarize UserAgentArray=make_set(HttpUserAgent,100) by SrcIpAddr, bin(TimeGenerated, 5min)
  | extend UserAgentCount = array_length(UserAgentArray)
  | where UserAgentCount > threshold
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  UserAgentCount: UserAgentCount
  UserAgentArray: UserAgentArray
  UserAgentThreshold: threshold
alertDetailsOverride:
  alertDisplayNameFormat: "Multiple UserAgent has been detected from IP: '{{SrcIpAddr}}' within a short time-frame"
  alertDescriptionFormat: "This incident requires further investigation to know why this SrcIpAddr has been detected with multiple user agents"
version: 1.0.0
kind: Scheduled