id: faa40333-1e8b-40cc-a003-51ae41fa886f
name: Detect instances of multiple client errors occurring within a brief period of time (ASIM Web Session)
description: |
  'This detection mechanism identifies situations where multiple client errors originate from a single source within a limited time frame.'
severity: Medium
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
  - T1133
query: |
  // HTTP response status codes indicate whether a specific HTTP request has been successfully completed.
  // Please refer this for more details: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status
  let threshold = 100; // You can set threshold value that suits your environment
  _Im_WebSession
  | where toint(EventResultDetails) between (400 .. 499)
  | summarize TotalErrorCount = count(), URLs=make_set(Url,100), EventResultDetailsSet=make_set(EventResultDetails) by SrcIpAddr, bin(TimeGenerated, 5m), SrcUsername, SrcHostname
  | where TotalErrorCount > threshold
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: SrcUsername
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  TotalErrorCount: TotalErrorCount
  RequestURLs: URLs
  ErrorThreshold: threshold
  EventResultDetailsSet: EventResultDetailsSet
alertDetailsOverride:
  alertDisplayNameFormat: "The system has detected a high number of requests from a client with the IP address '{{SrcIpAddr}}' that have resulted in client errors"
  alertDescriptionFormat: "The client with the IP address '{{SrcIpAddr}}' has made a total of '{{TotalErrorCount}}' requests to URLs, including '{{URLs}}', 
                            which have resulted in client errors. It is recommended to thoroughly investigate this alert to determine the underlying cause behind this 
                            significant number of errors. For detailed information regarding the specific errors encountered, please refer to the following link:
                            https://developer.mozilla.org/en-US/docs/Web/HTTP/Status."
version: 1.0.0
kind: Scheduled