id: 813ccf3b-0321-4622-b0bc-63518fd14454
name: Identify instances where a single source is observed using multiple user agents (ASIM Web Session)
description: |
  'This detection mechanism identifies requests originating from a single source within a brief time period
    that exhibit multiple user agents. Such behavior could indicate unusual web browsing activities performed by unconventional processes'
severity: Medium
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
  - T1133
query: |
  let threshold = 5;
  _Im_WebSession
  | summarize UserAgentArray=make_set(HttpUserAgent,100) by SrcIpAddr, bin(TimeGenerated, 5min)
  | extend UserAgentCount = array_length(UserAgentArray)
  | where UserAgentCount > threshold
entityMappings:
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  UserAgentCount: UserAgentCount
  UserAgentArray: UserAgentArray
  UserAgentThreshold: threshold
alertDetailsOverride:
  alertDisplayNameFormat: "The system has detected multiple User Agents '{{UserAgentCount}}' originating from the IP address '{{SrcIpAddr}}' within a limited time frame"
  alertDescriptionFormat: "Further investigation is necessary to determine the reason behind the detection of multiple user agents associated with the SrcIpAddr in this incident.
                            Such behavior could indicate unusual web browsing activities performed by unconventional processes"
version: 1.0.0
kind: Scheduled