id: 7d2ed1c7-da26-45fd-b4ea-b6f2bbeccea7
name: Detect threat information in web requests (ASIM Web Session)
description: |
  'If any threat information is identified in fields such as EventSeverity, ThreatName, ThreatCategory, and ThreatConfidence, this rule generates an alert'
severity: High
status: Available 
tags:
  - Schema: WebSession
    SchemaVersion: 0.2.6
requiredDataConnectors: []
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
  - T1133
query: |
  _Im_WebSession
  | project EventSeverity, ThreatName, ThreatCategory, ThreatConfidence, TimeGenerated, SrcIpAddr, SrcUsername, SrcHostname
  | where EventSeverity =~ 'High' or isnotempty(ThreatName) or isnotempty(ThreatCategory) // Check for high severity events or that has either ThreatName or ThreatCategory field populated
  | where isempty(ThreatConfidence) or ThreatConfidence > 90 // Check if ThreatConfidence is present then it must be great than 90
  | summarize EventCount = count(), EventStartTime=min(TimeGenerated), EvenEndTime=max(TimeGenerated) by SrcIpAddr, SrcUsername, SrcHostname, ThreatCategory, ThreatConfidence, ThreatName
  | order by EventCount desc
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SrcHostname
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SrcIpAddr
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: SrcUsername
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  ThreatCategory: ThreatCategory
  ThreatConfidence: ThreatConfidence
  ThreatName: ThreatName
  EventCount: EventCount
alertDetailsOverride:
  alertDisplayNameFormat: "The IP address '{{SrcIpAddr}}' belonging to a client has been identified as being associated with a threat named '{{ThreatName}}'"
  alertDescriptionFormat: "The discovered threat has the following details: ThreatName: '{{ThreatName}}', ThreatCategory: '{{ThreatCategory}}', EventSeverity: '{{EventSeverity}}', ThreatConfidence: '{{ThreatConfidence}}'"
version: 1.0.0
kind: Scheduled