{
  "properties": {
    "lenses": {
      "0": {
        "order": 0,
        "parts": {
          "0": {
            "position": {
              "x": 1,
              "y": 0,
              "colSpan": 14,
              "rowSpan": 1
            },
            "metadata": {
              "inputs": [],
              "type": "Extension/HubsExtension/PartType/MarkdownPart",
              "settings": {
                "content": {
                  "settings": {
                    "content": "<body style='background-color:#FF0000;'><img width='180' height='50' src='https://threatstrike-65hmjzo0liillwsqi.netdna-ssl.com/wp-content/themes/Attivo/Attivo_Networks-R.png?x28874'/></body>",
                    "title": "",
                    "subtitle": ""
                  }
                }
              }
            }
          },
          "1": {
            "position": {
              "x": 0,
              "y": 1,
              "colSpan": 5,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| summarize Count = count() by LogSeverity \n| render piechart  \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "LogSeverity",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "Count",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "07265533-d8c4-4a6a-b322-6e148d6cbf44"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Alert Severity",
                  "PartSubTitle": "phil-laworkspace"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "2": {
            "position": {
              "x": 5,
              "y": 1,
              "colSpan": 5,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| summarize Count = count() by Phase=extract(\"cat=([a-zA-Z]+)\", 1, AdditionalExtensions)\n| render piechart  \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "Phase",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "Count",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "31f319b0-3208-4846-8374-f6f65d7086b5"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsDonut"
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Attack Phases",
                  "PartSubTitle": "phil-laworkspace",
                  "Query": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| summarize Count = count() by Phase=extract(\"cat=([a-zA-Z&]+)\", 1, AdditionalExtensions)\n| render piechart  \n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "3": {
            "position": {
              "x": 10,
              "y": 1,
              "colSpan": 5,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\" \n| summarize Count = count() by DeviceAddress \n| sort by Count\n| render barchart  \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P7D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "DeviceAddress",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "Count",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "715f7038-804f-45c7-9fee-bab88e993dbb"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Bar"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "BOTSinks Reporting In",
                  "PartSubTitle": "phil-laworkspace"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "4": {
            "position": {
              "x": 0,
              "y": 5,
              "colSpan": 6,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| summarize Count = count() by SourceIP \n| sort by Count \n| render barchart\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "SourceIP",
                      "type": "String"
                    },
                    "yAxis": [
                      {
                        "name": "Count",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "9fafca5e-6164-473a-8391-cb6f875fefe7"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Bar"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top Attackers",
                  "PartSubTitle": "phil-laworkspace",
                  "Query": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| where SourceIP != ''\n| summarize Count = count() by SourceIP \n| top 10 by Count desc nulls last \n| sort by Count \n| render barchart\n"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "5": {
            "position": {
              "x": 6,
              "y": 5,
              "colSpan": 9,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| summarize Very_High = countif(LogSeverity == \"Very-High\"), High = countif(LogSeverity == \"High\"), Medium = countif(LogSeverity == \"Medium\"), Low = countif(LogSeverity == \"Low\"), Very_Low = countif(LogSeverity == \"Very-Low\") by bin(TimeGenerated, 1d) \n| sort by TimeGenerated asc \n| render barchart kind=stacked\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P7D"
                },
                {
                  "name": "Dimensions",
                  "value": {
                    "xAxis": {
                      "name": "TimeGenerated",
                      "type": "DateTime"
                    },
                    "yAxis": [
                      {
                        "name": "Very_High",
                        "type": "Int64"
                      },
                      {
                        "name": "High",
                        "type": "Int64"
                      },
                      {
                        "name": "Medium",
                        "type": "Int64"
                      },
                      {
                        "name": "Low",
                        "type": "Int64"
                      }
                    ],
                    "splitBy": [],
                    "aggregation": "Sum"
                  }
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "60bc70c2-01ed-4d1e-986a-30a9fbb1bcd5"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsChart"
                },
                {
                  "name": "SpecificChart",
                  "value": "Bar"
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Attacks By Day",
                  "PartSubTitle": "phil-laworkspace"
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "6": {
            "position": {
              "x": 0,
              "y": 9,
              "colSpan": 15,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| top 20 by TimeGenerated\n| project Time=TimeGenerated, BOTSink=DeviceAddress, Severity=LogSeverity, Phase=extract(\"cat=([a-zA-Z]+)\", 1, AdditionalExtensions), SourceIP, Message\n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "3689d50d-2785-44ce-980e-19583ea74a53"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Most Recent Attacks",
                  "PartSubTitle": "phil-laworkspace",
                  "Query": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| top 50 by TimeGenerated\n| project Time=TimeGenerated, BOTSink=DeviceAddress, Severity=LogSeverity, Phase=extract(\"cat=([a-zA-Z]+)\", 1, AdditionalExtensions), SourceIP, Message=replace(@\"\\\\=\", @\"=\", Message)\n",
                  "GridColumnsWidth": {
                    "Time": "265px",
                    "BOTSink": "129px",
                    "Severity": "119px",
                    "Phase": "87px",
                    "SourceIP": "72px",
                    "Message": "694px"
                  }
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          },
          "7": {
            "position": {
              "x": 0,
              "y": 13,
              "colSpan": 15,
              "rowSpan": 4
            },
            "metadata": {
              "inputs": [
                {
                  "name": "ComponentId",
                  "value": {
                    "SubscriptionId": "{Subscription_ID}",
                    "ResourceGroup": "{Resource_Group}",
                    "Name": "{Workspace_Name}",
                    "ResourceId": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourcegroups/attivoeng/providers/microsoft.operationalinsights/workspaces/phil-laworkspace"
                  }
                },
                {
                  "name": "Query",
                  "value": "CommonSecurityLog\n| where DeviceVendor == \"Attivo\"\n| summarize Count = count() by Activity \n| top 10 by Count desc nulls last \n| sort by Count \n"
                },
                {
                  "name": "TimeRange",
                  "value": "P1D"
                },
                {
                  "name": "Version",
                  "value": "1.0"
                },
                {
                  "name": "DashboardId",
                  "value": "/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503"
                },
                {
                  "name": "PartId",
                  "value": "e4f45517-b267-4746-854d-2797b7309518"
                },
                {
                  "name": "PartTitle",
                  "value": "Analytics"
                },
                {
                  "name": "PartSubTitle",
                  "value": "phil-laworkspace"
                },
                {
                  "name": "resourceTypeMode",
                  "value": "workspace"
                },
                {
                  "name": "ControlType",
                  "value": "AnalyticsGrid"
                },
                {
                  "name": "Dimensions",
                  "isOptional": true
                },
                {
                  "name": "SpecificChart",
                  "isOptional": true
                }
              ],
              "type": "Extension/AppInsightsExtension/PartType/AnalyticsPart",
              "settings": {
                "content": {
                  "PartTitle": "Top Attack Types",
                  "PartSubTitle": "phil-laworkspace",
                  "GridColumnsWidth": {
                    "Activity": "507px",
                    "Count": "330px"
                  }
                }
              },
              "asset": {
                "idInputName": "ComponentId",
                "type": "ApplicationInsights"
              }
            }
          }
        }
      }
    },
    "metadata": {
      "model": {
        "timeRange": {
          "value": {
            "relative": {
              "duration": 24,
              "timeUnit": 1
            }
          },
          "type": "MsPortalFx.Composition.Configuration.ValueTypes.TimeRange"
        },
        "filterLocale": {
          "value": "en-us"
        },
        "filters": {
          "value": {
            "MsPortalFx_TimeRange": {
              "model": {
                "format": "utc",
                "granularity": "auto",
                "relative": "7d"
              },
              "displayCache": {
                "name": "UTC Time",
                "value": "Past 7 days"
              },
              "filteredPartIds": [
                "StartboardPart-AnalyticsPart-f66a14d0-daa6-4549-80de-dfbca93fa005",
                "StartboardPart-AnalyticsPart-f66a14d0-daa6-4549-80de-dfbca93fa009",
                "StartboardPart-AnalyticsPart-f40a193f-71ce-4979-9012-f5d9e02e7005",
                "StartboardPart-AnalyticsPart-f40a193f-71ce-4979-9012-f5d9e02e7007",
                "StartboardPart-AnalyticsPart-f40a193f-71ce-4979-9012-f5d9e02e7009",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419c9a",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419c9c",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419c9e",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419f42",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419f44",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419f46",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419f48",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419f4a",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fdd",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fdf",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fe1",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fe3",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fe5",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fe7",
                "StartboardPart-AnalyticsPart-cd0c49e2-82a8-4a45-bc59-574d3b419fe9",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590e8",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590ea",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590ec",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590ee",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590f0",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590f2",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f1590f4",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f15933c",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f15933e",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f159340",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f159342",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f159344",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f159346",
                "StartboardPart-AnalyticsPart-e855964a-dc9d-4d6f-9017-89368f159348",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08005",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08007",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08009",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df0800b",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df0800d",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df0800f",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08011",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082bb",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082bd",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082bf",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082c1",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082c3",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082c5",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df082c7",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08544",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08546",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08548",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df0854a",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df0854c",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df0854e",
                "StartboardPart-AnalyticsPart-cc0e411d-ffd3-4560-b3d3-77ea0df08550",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd007",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd009",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd00d",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd00f",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd011",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd013",
                "StartboardPart-AnalyticsPart-8dae8cf1-2354-4406-9192-b2377facd015",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041e2",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041e4",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041e6",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041e8",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041ea",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041ec",
                "StartboardPart-AnalyticsPart-0d888a4e-899b-4dad-a642-2925ed6041ee",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f007",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f009",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f00b",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f00d",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f00f",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f011",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f013",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f17c",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f17e",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f180",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f182",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f184",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f186",
                "StartboardPart-AnalyticsPart-6b5a5f78-4281-448c-a80e-1ca33149f188"
              ]
            }
          }
        }
      }
    }
  },
  "id": "arm/subscriptions/0a243633-fff7-4930-b89a-d8e4a3a03533/resourceGroups/attivoeng/providers/Microsoft.Portal/dashboards/cd0c49e2-82a8-4a45-bc59-574d3b419503",
  "name": "cd0c49e2-82a8-4a45-bc59-574d3b419503",
  "type": "Microsoft.Portal/dashboards",
  "location": "westus",
  "tags": {
    "hidden-title": "Attivo BOTSink"
  },
  "apiVersion": "2015-08-01-preview"
}
