{
    "name": "GCPAuditLogsV2_CL",
    "apiVersion": "2022-10-01",
    "type": "Microsoft.OperationalInsights/workspaces/tables",
    "location": "{{location}}",
    "properties": {
        "schema": {
            "name": "GCPAuditLogsV2_CL",
            "columns": [
                {
                    "name": "TimeGenerated",
                    "type": "datetime",
                    "description": "The timestamp when the log entry was generated."
                },
                {
                    "name": "InsertId",
                    "type": "string",
                    "description": "A unique identifier for the log entry used to prevent duplication."
                },
                {
                    "name": "Severity",
                    "type": "string",
                    "description": "The severity level of the log entry (e.g., INFO, WARNING, ERROR)."
                },
                {
                    "name": "ReceiveTimestamp",
                    "type": "datetime",
                    "description": "The timestamp when the log entry was received."
                },
                {
                    "name": "JsonPayloadType",
                    "type": "string",
                    "description": "The type identifier from the JSON payload '@type' field."
                },
                {
                    "name": "JsonPayloadAccesses",
                    "type": "string",
                    "description": "Access details extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadEventId",
                    "type": "string",
                    "description": "The event identifier from the JSON payload."
                },
                {
                    "name": "JsonPayloadLocationPrincipalEmployingEntity",
                    "type": "string",
                    "description": "Principal employing entity location extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadLocationPrincipalOfficeCountry",
                    "type": "string",
                    "description": "Principal office country location extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadLocationPrincipalPhysicalLocationCountry",
                    "type": "string",
                    "description": "Principal physical location country extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadLogMode",
                    "type": "string",
                    "description": "Log mode value extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadPrincipalJobTitle",
                    "type": "string",
                    "description": "Principal job title extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadProduct",
                    "type": "string",
                    "description": "Product name extracted from the JSON payload."
                },
                {
                    "name": "JsonPayloadReason",
                    "type": "string",
                    "description": "Reason or cause extracted from the JSON payload."
                },
                {
                    "name": "OperationId",
                    "type": "string",
                    "description": "The identifier of the operation from the operation JSON object."
                },
                {
                    "name": "ResourceLabelsProjectId",
                    "type": "string",
                    "description": "Project ID label extracted from the resource JSON object."
                },
                {
                    "name": "ServiceName",
                    "type": "String",
                    "description": "The name of the API service performing the operation. For example, 'compute.googleapis.com'."
                },
                {
                    "name": "MethodName",
                    "type": "String",
                    "description": "The name of the service method or operation. For API calls, this should be the name of the API method."
                },
                {
                    "name": "GCPResourceName",
                    "type": "String",
                    "description": "The resource or collection that is the target of the operation. The name is a scheme-less URI, not including the API service name."
                },
                {
                    "name": "NumResponseItems",
                    "type": "String",
                    "description": "The number of items returned from a list or query API method, if applicable."
                },
                {
                    "name": "Status",
                    "type": "Dynamic",
                    "description": "The status of the overall operation."
                },
                {
                    "name": "AuthenticationInfo",
                    "type": "Dynamic",
                    "description": "Authentication information."
                },
                {
                    "name": "AuthorizationInfo",
                    "type": "Dynamic",
                    "description": "Authorization information. If there are multiple resources or permissions involved, then there is one AuthorizationInfo element for each {resource, permission} tuple."
                },
                {
                    "name": "RequestMetadata",
                    "type": "Dynamic",
                    "description": "Metadata about the operation."
                },
                {
                    "name": "Request",
                    "type": "Dynamic",
                    "description": "The operation request. This may not include all request parameters, such as those that are too large, privacy-sensitive, or duplicated elsewhere in the log record. It should never include user-generated data, such as file contents. When the JSON object represented here has a proto equivalent, the proto name will be indicated in the @type property."
                },
                {
                    "name": "Response",
                    "type": "Dynamic",
                    "description": "The operation response. This may not include all response elements, such as those that are too large, privacy-sensitive, or duplicated elsewhere in the log record. It should never include user-generated data, such as file contents. When the JSON object represented here has a proto equivalent, the proto name will be indicated in the @type property."
                },
                {
                    "name": "Metadata",
                    "type": "Dynamic",
                    "description": "Other service-specific data about the request, response, and other information associated with the current audited event."
                },
                {
                    "name": "StatusMessage",
                    "type": "String",
                    "description": "The message status of the overall operation."
                },
                {
                    "name": "PrincipalEmail",
                    "type": "String",
                    "description": "The email address of the authenticated user (or service account on behalf of third party principal) making the request. For third party identity callers, the principalSubject field is populated instead of this field. For privacy reasons, the principal email address is sometimes redacted."
                },
                {
                    "name": "LogName",
                    "type": "String",
                    "description": "Information including a suffix identifying the log sub-type (e.g., admin activity, system access, data access) and where in the hierarchy the request was made."
                },
                {
                    "name": "Timestamp",
                    "type": "DateTime",
                    "description": "The time the event described by the log entry occurred."
                },
                {
                    "name": "ProjectId",
                    "type": "String",
                    "description": "The identifier of the Google Cloud Platform (GCP) project associated with this resource, such as \"my-project\"."
                },
                {
                    "name": "GCPResourceType",
                    "type": "String",
                    "description": "The identifier of the type associated with this resource, such as 'pubsub_subscription'."
                },
                {
                    "name": "Subscription",
                    "type": "String",
                    "description": "A named resource representing the stream of messages from a single, specific topic, to be delivered to the subscribing application."
                },
                {
                    "name": "ResourceLocation",
                    "type": "Dynamic",
                    "description": "The resource location information."
                },
                {
                    "name": "ResourceOriginalState",
                    "type": "Dynamic",
                    "description": "The resource original state before mutation. Present only for operations which have successfully modified the targeted resource(s). In general, this field should contain all changed fields, except those that are already been included in request, response, metadata or serviceData fields. When the JSON object represented here has a proto equivalent, the proto name will be indicated in the @type property."
                },
                {
                    "name": "ServiceData",
                    "type": "Dynamic",
                    "description": "An object containing fields of an arbitrary type. An additional field \"@type\" contains a URI identifying the type. Example: { \"id\": 1234, \"@type\": \"types.example.com/standard/id\" }."
                }
            ]
        }
    }
}