id: 08113d6f-3c95-45ba-94df-4fdd7f35d944
name: Potential OAuth phishing email delivered into Inbox
description: |
  This query can be used as a Custom Detection Rule (CDR) to trigger when a potentially malicious OAuth app URL has been delivered into an Inbox.
description-detailed: |
  This query can be used as a Custom Detection Rule (CDR) to trigger when a potentially malicious OAuth app URL has been delivered into an Inbox. The URLs contained are not directly malicious but could be an attempt to delegate permissions to an attacker-controlled App. https://learn.microsoft.com/en-us/defender-xdr/custom-detection-rules
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let LoginCom = strcat("login.", "microsoftonline.com");
  let LoginUs  = strcat("login.", "microsoftonline.us");
  let ConsentUrls = pack_array(strcat("://", LoginCom, "/common/oauth2"), strcat("://", LoginCom, "/consumers/oauth2"), strcat("://", LoginCom, "/organizations/oauth2"), strcat("://", LoginUs, "/common/oauth2"), strcat("://", LoginUs, "/consumers/oauth2"), strcat("://", LoginUs, "/organizations/oauth2"));
  EmailUrlInfo
  | where Url has_any (ConsentUrls)
  | join EmailEvents on NetworkMessageId
  | where EmailDirection == "Inbound" and LatestDeliveryAction == "Delivered"
version: 1.0.1