Parser:
  Title: DNS activity ASIM schema function
  Version: '0.3'
  LastUpdated: Jan 17 2022
Product:
  Name: Microsoft
Normalization:
  Schema: Dns
  Version: '0.1.3'
References:
- Title: ASIM DNS Schema
  Link: https://aka.ms/ASimDnsDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM DNS activity schema.
ParserName: vimDnsEmpty
EquivalentBuiltInParser: _Im_Dns_Empty
ParserQuery: |
  let EmptyNewDnsEvents=datatable(
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // *************************************************************  Event and Dvc Fields
  //  ----------------- Mandatory: 
  , EventCount:int
  , EventStartTime:datetime
  , EventType:string
  , EventResult:string
  , EventResultDetails:string 
  , EventProduct:string
  , EventVendor:string
  , EventSchema: string  
  , EventSchemaVersion:string
  , Dvc:string
  // ----------------- Optional 
  , EventMessage:string
  , EventSeverity:string
  , EventOriginalUid:string
  , EventReportUrl:string
  , TenantId:string
  , DvcHostname:string
  , EventProductVersion:string
  , DvcIpAddr:string
  , DvcAction:string
  , DvcDescription:string
  , DvcSubscriptionId:string
  , Src:string
  , SrcIpAddr:string
  , SrcPortNumber:int
  , SrcGeoCountry:string
  , SrcGeoRegion:string
  , SrcGeoCity:string
  , SrcGeoLatitude: real
  , SrcGeoLongitude: real
  , SrcRiskLevel: int
  , SrcHostname: string
  , SrcDescription:string
  , Hostname: string
  , SrcDomain: string
  , SrcDomainType: string
  , SrcFQDN: string
  , SrcDvcId: string
  , SrcDvcIdType: string
  , SrcDeviceType: string
  , SrcUserId: string
  , SrcUserIdType: string
  , SrcUsername: string
  , User: string
  , SrcUsernameType: string
  , SrcUserType: string
  , SrcOriginalUserType: string
  , SrcUserDomain: string
  , SrcProcessName: string
  , Process: string
  , SrcProcessId: string
  , SrcProcessGuid: string
  , Dst: string
  , DstIpAddr:string
  , DstPortNumber:int
  , DstGeoCountry:string
  , DstGeoRegion:string
  , DstGeoCity:string
  , DstGeoLatitude: real
  , DstGeoLongitude: real
  , DstRiskLevel: int
  , DstHostname: string
  , DstDescription:string
  , DstDomain: string
  , DstDomainType: string
  , DstFQDN: string
  , DstDvcId: string
  , DstDvcIdType: string
  , DstDeviceType: string
  , EventSubType:string
  , EventOriginalSubType:string
  , DnsQuery:string
  , DnsQueryType:int
  , DnsQueryTypeName:string
  , DnsQueryClass:int
  , DnsQueryClassName:string
  , DnsResponseCode:int
  , DnsResponseName:string
  , DnsResponseCodeName:string 
  , DnsFlags:string 
  , NetworkProtocol:string
  , UrlCategory:string 
  , ThreatCategory:string
  , DnsNetworkDuration: int
  , Duration: int
  , DnsFlagsAuthenticated:bool
  , DnsFlagsAuthoritative:bool
  , DnsFlagsCheckingDisabled:bool
  , DnsFlagsRecursionAvailable:bool
  , DnsFlagsRecursionDesired:bool
  , DnsFlagsTruncates:bool
  , DnsFlagsZ:bool
  , DnsSessionId:string
  , SessionId: string
  // ****************************************************** Aliases
  , EventEndTime:datetime 
  , DomainCategory:string   
  , IpAddr:string
  , Domain:string
  , TransactionIdHex:string
  , DvcId:string
  , EventOriginalType:string
  , AdditionalFields:dynamic
  , Query:string
  , QueryType:int
  , QueryTypeName:string
  , QueryClass:int
  , QueryClassName:string
  , ResponseCode:int
  , ResponseName:string
  , ResponseCodeName:string 
  , Flags:string
  , DvcDomain:string
  , DvcDomainType:string
  , NetworkProtocolVersion:string
  )[];
  EmptyNewDnsEvents 
