Parser:
  Title: DNS activity ASIM schema function
  Version: '0.4'
  LastUpdated: Jan 09 2023
Product:
  Name: Microsoft
Normalization:
  Schema: Dns
  Version: '0.1.7'
References:
- Title: ASIM DNS Schema
  Link: https://aka.ms/ASimDnsDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM DNS activity schema.
ParserName: vimDnsEmpty
EquivalentBuiltInParser: _Im_Dns_Empty
ParserQuery: |
  let EmptyNewDnsEvents=datatable(
    _ResourceId: string,
    AdditionalFields: dynamic,
    DnsFlags: string,
    DnsFlagsAuthenticated: bool,
    DnsFlagsAuthoritative: bool,
    DnsFlagsCheckingDisabled: bool,
    DnsFlagsRecursionAvailable: bool,
    DnsFlagsRecursionDesired: bool,
    DnsFlagsTruncated: bool,
    DnsFlagsZ: bool,
    DnsNetworkDuration: int,
    DnsQuery: string,
    DnsQueryClass: int,
    DnsQueryClassName: string,
    DnsQueryType: int,
    DnsQueryTypeName: string,
    DnsResponseCode: int,
    DnsResponseCodeName: string,
    DnsResponseIpCity: string,
    DnsResponseIpCountry: string,
    DnsResponseIpLatitude: real,
    DnsResponseIpLongitude: real,
    DnsResponseIpRegion: string,
    DnsResponseName: string,
    DnsSessionId: string,
    Domain: string,
    DomainCategory: string,
    Dst: string,
    DstDescription: string,
    DstDeviceType: string,
    DstDomain: string,
    DstDomainType: string,
    DstDvcId: string,
    DstDvcIdType: string,
    DstDvcScopeId: string,
    DstDvcScope: string,
    DstFQDN: string,
    DstGeoCity: string,
    DstGeoCountry: string,
    DstGeoLatitude: real,
    DstGeoLongitude: real,
    DstGeoRegion: string,
    DstHostname: string,
    DstIpAddr: string,
    DstPortNumber: int,
    DstRiskLevel: int,
    DstOriginalRiskLevel: string,
    Duration: int,
    Dvc: string,
    DvcAction: string,
    DvcDescription: string,
    DvcDomain: string,
    DvcDomainType: string,
    DvcFQDN: string,
    DvcHostname: string,
    DvcId: string,
    DvcIdType: string,
    DvcInterface: string,
    DvcIpAddr: string,
    DvcMacAddr: string,
    DvcOriginalAction: string,
    DvcOs: string,
    DvcOsVersion: string,
    DvcScope: string,
    DvcScopeId: string,
    DvcZone: string,
    EventCount: int,
    EventEndTime: datetime,
    EventMessage: string,
    EventOriginalSeverity: string,
    EventOriginalSubType: string,
    EventOriginalType: string,
    EventOriginalUid: string,
    EventOwner: string,
    EventProduct: string,
    EventProductVersion: string,
    EventReportUrl: string,
    EventResult: string,
    EventResultDetails: string,
    EventSchema: string,
    EventSchemaVersion: string,
    EventSeverity: string,
    EventStartTime: datetime,
    EventSubType: string,
    EventType: string,
    EventUid: string,
    EventVendor: string,
    Hostname: string,
    IpAddr: string,
    NetworkProtocol: string,
    NetworkProtocolVersion: string,
    Process: string,
    Rule: string,
    RuleName: string,
    RuleNumber: int,
    SessionId: string,
    Src: string,
    SrcDescription: string,
    SrcDeviceType: string,
    SrcDomain: string,
    SrcDomainType: string,
    SrcDvcId: string,
    SrcDvcIdType: string,
    SrcDvcScope: string,
    SrcDvcScopeId: string,
    SrcFQDN: string,
    SrcGeoCity: string,
    SrcGeoCountry: string,
    SrcGeoLatitude: real,
    SrcGeoLongitude: real,
    SrcGeoRegion: string,
    SrcHostname: string,
    SrcIpAddr: string,
    SrcOriginalRiskLevel: string,
    SrcOriginalUserType: string,
    SrcPortNumber: int,
    SrcProcessGuid: string,
    SrcProcessId: string,
    SrcProcessName: string,
    SrcRiskLevel: int,
    SrcUserId: string,
    SrcUserAadId: string,
    SrcUserSid: string,
    SrcUserAWSId: string,
    SrcUserOktaId: string,
    SrcUserUid: string,
    SrcUserIdType: string,
    SrcUserScope: string,
    SrcUserScopeId: string,
    SrcUsername: string,
    SrcUsernameType: string,
    SrcUserType: string,
    SrcUserSessionId: string,
    TenantId: string,
    ThreatCategory: string,
    ThreatConfidence: int,
    ThreatField: string,
    ThreatFirstReportedTime: datetime,
    ThreatId: string,
    ThreatIpAddr: string,
    ThreatIsActive: bool,
    ThreatLastReportedTime: datetime,
    ThreatName: string,
    ThreatOriginalConfidence: string,
    ThreatOriginalRiskLevel: string,
    ThreatRiskLevel: int,
    TimeGenerated: datetime,
    TransactionIdHex: string,
    Type: string,
    UrlCategory: string,
    User: string
  )[];
  EmptyNewDnsEvents 
