{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('Workspace')]",
      "location": "[parameters('WorkspaceRegion')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "ASimWebSessionFortinetFortiGate",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('Workspace'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "Web Session ASIM parser for Fortinet FortiGate",
            "category": "ASIM",
            "FunctionAlias": "ASimWebSessionFortinetFortiGate",
            "query": "let EventLookup=datatable(DeviceAction:string,DvcAction:string,EventResult:string)\n[\n  \"passthrough\",\"Allow\",\"Success\"\n  , \"blocked\",\"Deny\",\"Failure\"\n];\n// -- See https://docs.fortinet.com/document/fortigate/7.2.4/fortios-log-message-reference/671442/cef-priority-levels\nlet SeverityLookup = datatable (EventOriginalSeverity:string, EventSeverity:string)\n[\n  \"1\", \"Informational\", // Debug\n  \"2\", \"Informational\", // Information\n  \"3\", \"Informational\", // Notification\n  \"4\", \"Low\", // Warning\n  \"5\", \"Low\", // Error\n  \"6\", \"High\", // Critical\n  \"7\", \"Medium\", // Alert\n  \"8\", \"High\" // Emergency\n];\nlet parser=(disabled:bool=false){\n  CommonSecurityLog\n  | where not(disabled)\n  | where DeviceVendor  == \"Fortinet\" \n      and DeviceProduct startswith \"Fortigate\"\n      and Activity has_all ('webfilter', 'utm')\n  | extend \n      EventResultDetails = \"NA\"\n  | lookup EventLookup on DeviceAction \n  | project Activity,AdditionalExtensions,DestinationIP,DestinationPort,DeviceAction,DeviceInboundInterface,DeviceOutboundInterface,DeviceProduct,DeviceVersion,LogSeverity,Protocol,ReceivedBytes,SentBytes,SourceIP,SourcePort,TimeGenerated, DeviceExternalID, Type, _ItemId, Computer, EventResult, EventResultDetails, DvcAction, RequestURL, RequestContext, DestinationHostName, SourceHostName, SourceUserName, DestinationUserName\n  | project-rename \n    Url                     = RequestURL\n    , UrlCategory           = RequestContext\n    , DstBytes              = ReceivedBytes\n    , DstInterfaceName      = DeviceOutboundInterface\n    , DstIpAddr             = DestinationIP\n    , DstPortNumber         = DestinationPort\n    , DvcHostname           = Computer\n    , EventMessage          = Activity\n    , EventOriginalSeverity = LogSeverity\n    , EventProduct          = DeviceProduct\n    , EventProductVersion   = DeviceVersion\n    , SrcBytes              = SentBytes\n    , SrcInterfaceName      = DeviceInboundInterface\n    , SrcIpAddr             = SourceIP\n    , SrcPortNumber         = SourcePort\n    , DvcId                 = DeviceExternalID\n    , EventUid              = _ItemId\n    , DstHostname           = DestinationHostName\n    , SrcHostname           = SourceHostName\n    , SrcUsername           = SourceUserName\n    , DstUsername           = DestinationUserName\n  | invoke _ASIM_ResolveNetworkProtocol ('Protocol')\n  | extend \n      DstUsernameType = _ASIM_GetUsernameType(DstUsername)\n      , SrcUsernameType = _ASIM_GetUsernameType(SrcUsername)\n  | project-rename DvcOriginalAction = DeviceAction\n  | parse-kv AdditionalExtensions as (\n          FortinetFortiGatestart:datetime,\n          FortinetFortiGatesrcintfrole:string,\n          FortinetFortiGatedstintfrole:string,\n          FortinetFortiGateexternalID:string,\n          FortinetFortiGatepolicyid:int,\n          FortinetFortiGatedstcountry:string,\n          FortinetFortiGatesrccountry:string,\n          FortinetFortiGatecrscore:string,\n          FortinetFortiGateduration:int,\n          FortinetFortiGatesentpkt:long,\n          FortinetFortiGatercvdpkt:long,\n          ['ad.referralurl']:string,\n          ['ad.httpmethod']:string,\n          ['ad.agent']:string\n      ) with (pair_delimiter=';', kv_delimiter='=')\n  | parse AdditionalExtensions with * \"x-forwarded-for=\" HttpRequestXff:string \";\" *\n  | project-rename\n      HttpReferrer            = ['ad.referralurl'],\n      HttpRequestMethod       = ['ad.httpmethod'],\n      HttpUserAgent           = ['ad.agent'],\n      EventStartTime          = FortinetFortiGatestart,\n      SrcZone                 = FortinetFortiGatesrcintfrole,\n      DstZone                 = FortinetFortiGatedstintfrole,\n      NetworkSessionId        = FortinetFortiGateexternalID,\n      RuleNumber              = FortinetFortiGatepolicyid,\n      NetworkDuration         = FortinetFortiGateduration,\n      DstGeoCountry           = FortinetFortiGatedstcountry,\n      SrcGeoCountry           = FortinetFortiGatesrccountry,\n      ThreatOriginalRiskLevel = FortinetFortiGatecrscore,\n      SrcPackets              = FortinetFortiGatesentpkt,\n      DstPackets              = FortinetFortiGatercvdpkt\n  | parse AdditionalExtensions with * \"Method=\" temp_HttpRequestMethod \"|User-Agent=\" temp_HttpUserAgent \";\" *\n  | extend \n      HttpRequestMethod = coalesce(temp_HttpRequestMethod,HttpRequestMethod),\n      HttpUserAgent = coalesce(temp_HttpUserAgent,HttpUserAgent)\n  | project-away temp_*\n  | extend \n    EventCount               = int(1)\n    , EventSchema            = \"WebSession\"\n    , EventSchemaVersion     = \"0.2.6\"\n    , EventType              = \"HTTPsession\"\n    , EventVendor            = \"Fortinet\"\n    , DvcIdType              = \"Other\"\n    , NetworkBytes           = DstBytes + SrcBytes\n    , EventEndTime           = TimeGenerated\n    , EventStartTime         = coalesce(EventStartTime, TimeGenerated)\n    , NetworkProtocolVersion = case(DstIpAddr contains \".\", \"IPv4\"\n        , DstIpAddr contains \":\", \"IPv6\"\n        , \"\")\n    , NetworkPackets         = DstPackets + SrcPackets\n    , UserAgent              = HttpUserAgent\n    , Dvc                    = DvcHostname\n    , User                   = SrcUsername\n    , Hostname               = DstHostname\n  | lookup SeverityLookup on EventOriginalSeverity\n  | extend \n      Src       = SrcIpAddr,\n      Dst       = DstIpAddr,\n      SessionId = NetworkSessionId,\n      IpAddr    = SrcIpAddr,\n      Duration  = NetworkDuration,\n      Rule      = tostring(RuleNumber)\n  | project-away Protocol, AdditionalExtensions, NetworkProtocolNumber\n};\nparser (disabled=disabled)",
            "version": 1,
            "functionParameters": "disabled:bool=False"
          }
        }
      ]
    }
  ]
}