{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/ASimWebSessionFortinetFortiGate')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "Web Session ASIM parser for Fortinet FortiGate",
        "category": "ASIM",
        "FunctionAlias": "ASimWebSessionFortinetFortiGate",
        "query": "let EventLookup=datatable(DeviceAction:string,DvcAction:string,EventResult:string)\n[\n  \"passthrough\",\"Allow\",\"Success\"\n  , \"blocked\",\"Deny\",\"Failure\"\n];\n// -- See https://docs.fortinet.com/document/fortigate/7.2.4/fortios-log-message-reference/671442/cef-priority-levels\nlet SeverityLookup = datatable (EventOriginalSeverity:string, EventSeverity:string)\n[\n  \"1\", \"Informational\", // Debug\n  \"2\", \"Informational\", // Information\n  \"3\", \"Informational\", // Notification\n  \"4\", \"Low\", // Warning\n  \"5\", \"Low\", // Error\n  \"6\", \"High\", // Critical\n  \"7\", \"Medium\", // Alert\n  \"8\", \"High\" // Emergency\n];\nlet parser=(disabled:bool=false){\n  CommonSecurityLog\n  | where not(disabled)\n  | where DeviceVendor  == \"Fortinet\" \n      and DeviceProduct startswith \"Fortigate\"\n      and (Activity has_all ('webfilter', 'utm') or Activity has_all ('ips', 'utm'))\n  | lookup EventLookup on DeviceAction \n  | project Activity,AdditionalExtensions,DestinationIP,DestinationPort,DeviceAction,DeviceInboundInterface,DeviceOutboundInterface,DeviceProduct,DeviceVersion,LogSeverity,Protocol,ReceivedBytes,SentBytes,SourceIP,SourcePort,TimeGenerated, DeviceExternalID, Type, _ItemId, Computer, EventResult, DvcAction, RequestURL, RequestContext, DestinationHostName, SourceHostName, SourceUserName, DestinationUserName, ApplicationProtocol\n  | project-rename \n    Url                     = RequestURL\n    , UrlCategory           = RequestContext\n    , DstBytes              = ReceivedBytes\n    , DstInterfaceName      = DeviceOutboundInterface\n    , DstIpAddr             = DestinationIP\n    , DstPortNumber         = DestinationPort\n    , DvcHostname           = Computer\n    , EventMessage          = Activity\n    , EventOriginalSeverity = LogSeverity\n    , EventProductVersion   = DeviceVersion\n    , SrcBytes              = SentBytes\n    , SrcInterfaceName      = DeviceInboundInterface\n    , SrcIpAddr             = SourceIP\n    , SrcPortNumber         = SourcePort\n    , DvcId                 = DeviceExternalID\n    , EventUid              = _ItemId\n    , DstHostname           = DestinationHostName\n    , SrcHostname           = SourceHostName\n    , SrcUsername           = SourceUserName\n    , DstUsername           = DestinationUserName\n    , NetworkApplicationProtocol = ApplicationProtocol\n  | invoke _ASIM_ResolveNetworkProtocol ('Protocol')\n  | extend \n      DstUsernameType = _ASIM_GetUsernameType(DstUsername),\n      SrcUsernameType = _ASIM_GetUsernameType(SrcUsername)\n  | project-rename DvcOriginalAction = DeviceAction\n  | parse-kv AdditionalExtensions as (\n          // FTNTFGT format for FortiGate\n          FTNTFGTstart:datetime,\n          FTNTFGTsrcintfrole:string,\n          FTNTFGTdstintfrole:string,\n          FTNTFGTexternalID:string,\n          FTNTFGTpolicyid:int,\n          FTNTFGTdstcountry:string,\n          FTNTFGTsrccountry:string,\n          FTNTFGTcrscore:string,\n          FTNTFGTduration:int,\n          FTNTFGTsentpkt:long,\n          FTNTFGTrcvdpkt:long,\n          FTNTFGTattack:string,\n          FTNTFGTattackid:string,\n          FTNTFGTlogid:string,\n          FTNTFGTsubtype:string,\n          FTNTFGTvd:string,\n          // Simple format for FortiAnalyzer\n          start:datetime,\n          srcintfrole:string,\n          dstintfrole:string,\n          externalID:string,\n          policyid:int,\n          dstcountry:string,\n          srccountry:string,\n          crscore:string,\n          duration:int,\n          sentpkt:long,\n          rcvdpkt:long,\n          attack:string,\n          attackid:string,\n          logid:string,\n          subtype:string,\n          vd:string,\n          // Additional fields\n          ['ad.referralurl']:string,\n          ['ad.httpmethod']:string,\n          ['ad.agent']:string,\n          // IPS and other fields\n          deviceSeverity:string,\n          ref:string,\n          msg:string,\n          profile:string,\n          incidentserialno:string,\n          policytype:string,\n          direction:string,\n          severity:string\n      ) with (pair_delimiter=';', kv_delimiter='=')\n  | parse AdditionalExtensions with * \"x-forwarded-for=\" HttpRequestXff:string \";\" *\n  | invoke _ASIM_ResolveDstFQDN('DestinationHostName')\n  | extend\n      HttpReferrer            = ['ad.referralurl'],\n      HttpRequestMethod       = ['ad.httpmethod'],\n      HttpUserAgent           = ['ad.agent'],\n      ThreatName              = coalesce(FTNTFGTattack, attack),\n      ThreatId                = coalesce(FTNTFGTattackid, attackid),\n      EventOriginalUid        = coalesce(FTNTFGTlogid, logid),\n      EventOriginalSubType    = coalesce(FTNTFGTsubtype, subtype),\n      EventStartTime          = coalesce(FTNTFGTstart, start),\n      SrcZone                 = coalesce(FTNTFGTsrcintfrole, srcintfrole),\n      DstZone                 = coalesce(FTNTFGTdstintfrole, dstintfrole),\n      NetworkSessionId        = coalesce(FTNTFGTexternalID, externalID),\n      RuleNumber              = coalesce(FTNTFGTpolicyid, policyid),\n      NetworkDuration         = coalesce(FTNTFGTduration, duration),\n      DstGeoCountry           = coalesce(FTNTFGTdstcountry, dstcountry),\n      SrcGeoCountry           = coalesce(FTNTFGTsrccountry, srccountry),\n      ThreatOriginalRiskLevel = coalesce(FTNTFGTcrscore, crscore),\n      SrcPackets              = coalesce(FTNTFGTsentpkt, sentpkt),\n      DstPackets              = coalesce(FTNTFGTrcvdpkt, rcvdpkt)\n  | extend\n      temp_HttpRequestMethod = extract(@\"rawdata=.*?Method=(.*?)(?:\\||\\;|$)\", 1, AdditionalExtensions),\n      temp_HttpUserAgent = extract(@\"rawdata=.*?User-Agent=(.*?)(?:\\||\\;|$)\", 1, AdditionalExtensions)\n  | parse AdditionalExtensions with * \"Method=\" temp_HttpRequestMethod2 \"|User-Agent=\" temp_HttpUserAgent2 \";\" *\n  | extend \n      HttpRequestMethod = coalesce(temp_HttpRequestMethod, temp_HttpRequestMethod2, HttpRequestMethod),\n      HttpUserAgent = coalesce(temp_HttpUserAgent, temp_HttpUserAgent2, HttpUserAgent)\n  | project-away temp_*\n  | extend AdditionalFields = bag_pack(\n                              \"incidentserialno\", incidentserialno, \n                              \"policytype\", policytype,\n                              \"profile\", profile,\n                              \"ref\", ref,\n                              \"vd\", coalesce(FTNTFGTvd, vd),\n                              \"Message\", msg,\n                              \"deviceSeverity\", deviceSeverity\n                              )\n  | extend \n    EventCount               = int(1)\n    , EventSchema            = \"WebSession\"\n    , EventSchemaVersion     = \"0.2.6\"\n    , EventType              = \"HTTPsession\"\n    , EventVendor            = \"Fortinet\"\n    , EventProduct           = \"Fortigate\"\n    , DvcIdType              = \"Other\"\n    , NetworkBytes           = DstBytes + SrcBytes\n    , EventEndTime           = TimeGenerated\n    , EventStartTime         = coalesce(EventStartTime, TimeGenerated)\n    , NetworkProtocolVersion = case(DstIpAddr contains \".\", \"IPv4\"\n        , DstIpAddr contains \":\", \"IPv6\"\n        , \"\")\n    , NetworkPackets         = DstPackets + SrcPackets\n    , UserAgent              = HttpUserAgent\n    , Dvc                    = DvcHostname\n    , User                   = SrcUsername\n    , Hostname               = DstHostname\n  | lookup SeverityLookup on EventOriginalSeverity\n  | extend ipsseverity = case(\n      severity == \"low\", \"Low\",\n      severity == \"high\", \"High\",\n      severity == \"medium\", \"Medium\",\n      severity == \"info\", \"Informational\",\n      \"\"\n      )\n  | extend EventSeverity = iff(EventMessage has_all ('ips', 'utm'), ipsseverity, EventSeverity)\n  | extend NetworkDirection = case(\n      direction == \"incoming\", \"Inbound\",\n      direction == \"outgoing\", \"Outbound\",\n      \"\"\n      )\n  | extend \n      Src       = SrcIpAddr,\n      Dst       = DstIpAddr,\n      SessionId = NetworkSessionId,\n      IpAddr    = SrcIpAddr,\n      Duration  = NetworkDuration,\n      Rule      = tostring(RuleNumber)\n  | project-away \n      FTNTFGT*, attack, attackid, logid, subtype, start, srcintfrole, dstintfrole, \n      externalID, policyid, dstcountry, srccountry, crscore, duration, sentpkt, \n      rcvdpkt, Protocol, AdditionalExtensions, NetworkProtocolNumber, severity, \n      incidentserialno, policytype, profile, ref, msg, deviceSeverity, direction, \n      vd, ipsseverity\n};\nparser (disabled=disabled)",
        "version": 1,
        "functionParameters": "disabled:bool=False"
      }
    }
  ]
}