id: 15ae38a2-2e29-48f7-883f-863fb25a5a06
name: DNS high reverse DNS count
description: |
  'Identifies clients with a high reverse DNS counts which could be carrying out scanning activity.
  Alert is generated if the IP performing such reverse DNS lookups was not seen doing so
  in the preceding 7-day period.'
severity: Medium
requiredDataConnectors:
  - connectorId: DNS
    dataTypes:
      - DnsEvents
queryFrequency: 1d
queryPeriod: 8d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Discovery
relevantTechniques:
  - T1046
query: |

  DnsEvents 
  | where TimeGenerated > ago(1d)
  | where Name contains "in-addr.arpa" 
  | summarize dcount(Name) by ClientIP
  | where dcount_Name >10
  | project ClientIP , dcount_Name 
  | join kind=leftanti (DnsEvents 
      | where TimeGenerated between(ago(8d)..ago(1d))
      | where Name contains "in-addr.arpa" 
      | summarize dcount(Name) by ClientIP, bin(TimeGenerated, 1d)
      | where dcount_Name >10
      | project ClientIP , dcount_Name 
  ) on ClientIP
  | extend IPCustomEntity = ClientIP


