id: a83ef0f4-dace-4767-bce3-ebd32599d2a0
name: DNS tor proxies
description: check for DNS lookups associated with common Tor proxies
severity: Low
requiredDataConnectors:
  - connectorId: DNS
    dataTypes:
      - DnsEvents
queryFrequency: 24d
queryPeriod: 24d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Exfiltration
query: |

  DnsEvents
  | where Name contains "."
  | where Name contains "tor2web.org"
  or Name contains "tor2web.com"
  or Name contains "torlink.co"
  or Name contains "onion.to"
  or Name contains "onion.ink"
  or Name contains "onion.cab"
  or Name contains "onion.nu"
  or Name contains "onion.link"
  or Name contains "onion.it"
  or Name contains "onion.city"
  or Name contains "onion.direct"
  or Name contains "onion.top"
  or Name contains "onion.casa"
  or Name contains "onion.plus"
  or Name contains "onion.rip"
  or Name contains "onion.dog"
  or Name contains "tor2web.fi"
  or Name contains "tor2web.blutmagie.de"
  or Name contains "onion.sh"
  or Name contains "onion.lu"
  or Name contains "onion.pet"
  or Name contains "t2w.pw"
  or Name contains "tor2web.ae.org"
  or Name contains "tor2web.io"
  or Name contains "tor2web.xyz"
  or Name contains "onion.lt"
  or Name contains "s1.tor-gateways.de"
  or Name contains "s2.tor-gateways.de"
  or Name contains "s3.tor-gateways.de"
  or Name contains "s4.tor-gateways.de"
  or Name contains "s5.tor-gateways.de"
  or Name contains "hiddenservice.net"

