// Name: DNS events related to mining pools
// Id: 0d76e9cf-788d-4a69-ac7d-f234826b5bed
//
// Description: check for DNS lookups associated with common mining pools
//
// Data Source: DnsEvents
//
// Severity: Low
//
// QueryFrequency: 24
//
// QueryPeriod: 24
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// Techniques: #Execution
//
DnsEvents
| where Name contains "."
| where Name contains "monerohash.com"
or Name contains "do-dear.com"
or Name contains "xmrminerpro.com"
or Name contains "secumine.net"
or Name contains "xmrpool.com"
or Name contains "minexmr.org"
or Name contains "hashanywhere.com"
or Name contains "xmrget.com"
or Name contains "mininglottery.eu"
or Name contains "minergate.com"
or Name contains "moriaxmr.com"
or Name contains "multipooler.com"
or Name contains "moneropools.com"
or Name contains "xmrpool.eu"
or Name contains "coolmining.club"
or Name contains "supportxmr.com"
or Name contains "minexmr.com"
or Name contains "hashvault.pro"
or Name contains "xmrpool.net"
or Name contains "crypto-pool.fr"
or Name contains "xmr.pt"
or Name contains "miner.rocks"
or Name contains "walpool.com"
or Name contains "herominers.com"
or Name contains "gntl.co.uk"
or Name contains "semipool.com"
or Name contains "coinfoundry.org"
or Name contains "cryptoknight.cc"
or Name contains "fairhash.org"
or Name contains "baikalmine.com"
or Name contains "tubepool.xyz"
or Name contains "fairpool.xyz"
or Name contains "asiapool.io"
or Name contains "coinpoolit.webhop.me"
or Name contains "nanopool.org"
or Name contains "moneropool.com"
or Name contains "miner.center"
or Name contains "prohash.net"
or Name contains "poolto.be"
or Name contains "cryptoescrow.eu"
or Name contains "monerominers.net"
or Name contains "cryptonotepool.org"
or Name contains "extrmepool.org"
or Name contains "webcoin.me"
or Name contains "kippo.eu"
or Name contains "hashinvest.ws"
or Name contains "monero.farm"
or Name contains "supportxmr.com"
or Name contains "xmrpool.eu"
or Name contains "linux-repository-updates.com"
or Name contains "1gh.com"
or Name contains "dwarfpool.com"
or Name contains "hash-to-coins.com"
or Name contains "hashvault.pro"
or Name contains "pool-proxy.com"
or Name contains "hashfor.cash"
or Name contains "fairpool.cloud"
or Name contains "litecoinpool.org"
or Name contains "mineshaft.ml"
or Name contains "abcxyz.stream"
or Name contains "moneropool.ru"
or Name contains "cryptonotepool.org.uk"
or Name contains "extremepool.org"
or Name contains "extremehash.com"
or Name contains "hashinvest.net"
or Name contains "unipool.pro"
or Name contains "crypto-pools.org"
or Name contains "monero.net"
or Name contains "backup-pool.com"
or Name contains "mooo.com"
or Name contains "freeyy.me"
or Name contains "cryptonight.net"
or Name contains "shscrypto.net"
