id: a0907abe-6925-4d90-af2b-c7e89dc201a6
name: Rare high NXDomain count
description: |
  'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
  where most C2s are not live). Alert is generated when a new IP is seen (based on not being seen associated with 
  NXDomain records in prior 10-day baseline period).'
severity: Medium
requiredDataConnectors:
  - connectorId: DNS
    dataTypes:
      - DnsEvents
queryFrequency: 1d
queryPeriod: 10d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
  - T1483
  - T1008
query: |

  let starttime = 10d;
  let endtime = 1d;
  let threshold = 100;
  let nxDomainDnsEvents = DnsEvents 
  | where ResultCode == "3" 
  | where QueryType in ("A", "AAAA")
  | where ClientIP != "127.0.0.1"
  | where Name !contains "/"
  | where Name contains ".";
  nxDomainDnsEvents
  | where TimeGenerated > ago(endtime)
  | extend sld = tostring(split(Name, ".")[-2])
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by ClientIP
  | where dcount_sld > threshold
  // Filter out previously seen IPs
  | join kind=leftanti (nxDomainDnsEvents
      | where TimeGenerated between(ago(starttime)..ago(endtime))
      | extend sld = tostring(split(Name, ".")[-2])
      | summarize dcount(sld) by ClientIP
      | where dcount_sld > threshold ) on ClientIP
  // Pull out sample NXDomain responses for those remaining potentially infected IPs
  | join kind = inner (nxDomainDnsEvents | summarize by Name, ClientIP) on ClientIP
  | summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(Name, 100)  by ClientIP, dcount_sld
  | extend timestamp = StartTimeUtc, IPCustomEntity = ClientIP
