id: ab619659-ab7c-4ca4-be0c-ca71a07bf4cd
name: NEGOEX logins
description: |
  Query #1: To hunt on NEGOEX logins.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceLogonEvents
query: |
 DeviceLogonEvents 
| where Protocol == "NegoExtender" 
| extend Upn = parse_json(AdditionalFields).Upn 
| project Timestamp, DeviceId, DeviceName, RemoteDeviceName, RemoteIP, RemotePort, Upn, ActionType 
