id: 7228f5ed-adee-4921-85cd-19e964ffc0d0
name: NEGOEX logins
description: |
  Query #1: To hunt on NEGOEX logins.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceLogonEvents
query: |
   DeviceLogonEvents 
  | where Protocol == "NegoExtender" 
  | extend Upn = parse_json(AdditionalFields).Upn 
  | project Timestamp, DeviceId, DeviceName, RemoteDeviceName, RemoteIP, RemotePort, Upn, ActionType 
