id: e2d40221-7634-4b42-8bc7-b5cbf4a182d3
name: Non-local logons with -500 account (0)
description: |-
  Non-local logons with the built-in administrator (-500) account.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceLogonEvents
  - IdentityLogonEvents
query: |-
  DeviceLogonEvents
  | where AccountSid endswith '-500' and parse_json(AdditionalFields).IsLocalLogon != true
  | join kind=leftanti IdentityLogonEvents on AccountSid // Remove the domain's built-in admin acccount
