{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "author": "Microsoft - support@microsoft.com",
    "comments": "Solution template for Broadcom SymantecDLP"
  },
  "parameters": {
    "location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
      }
    },
    "workspace-location": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "[concat('Region to deploy solution resources -- separate from location selection',parameters('location'))]"
      }
    },
    "workspace": {
      "defaultValue": "",
      "type": "string",
      "metadata": {
        "description": "Workspace name for Log Analytics where Microsoft Sentinel is setup"
      }
    }
  },
  "variables": {
    "email": "support@microsoft.com",
    "_email": "[variables('email')]",
    "_solutionName": "Broadcom SymantecDLP",
    "_solutionVersion": "3.0.3",
    "solutionId": "azuresentinel.azure-sentinel-solution-broadcomsymantecdlp",
    "_solutionId": "[variables('solutionId')]",
    "parserObject1": {
      "_parserName1": "[concat(parameters('workspace'),'/','SymantecDLP')]",
      "_parserId1": "[resourceId('Microsoft.OperationalInsights/workspaces/savedSearches', parameters('workspace'), 'SymantecDLP')]",
      "parserTemplateSpecName1": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-pr-',uniquestring('SymantecDLP-Parser')))]",
      "parserVersion1": "1.0.0",
      "parserContentId1": "SymantecDLP-Parser"
    },
    "_solutioncontentProductId": "[concat(take(variables('_solutionId'),50),'-','sl','-', uniqueString(concat(variables('_solutionId'),'-','Solution','-',variables('_solutionId'),'-', variables('_solutionVersion'))))]"
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('parserObject1').parserTemplateSpecName1]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "SymantecDLP Data Parser with template version 3.0.3",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('parserObject1').parserVersion1]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "name": "[variables('parserObject1')._parserName1]",
              "apiVersion": "2022-10-01",
              "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "eTag": "*",
                "displayName": "SymantecDLP",
                "category": "Microsoft Sentinel Parser",
                "functionAlias": "SymantecDLP",
                "query": "CommonSecurityLog\n| where DeviceVendor == \"Symantec\" and DeviceProduct == \"DLP\"\n| extend Blocked = extract(@\"BLOCKED=([^;]+)\\;\",1,AdditionalExtensions),\n         ApplicationName = extract(@\"APPLICATION_NAME=([^;]+)\\;\",1,AdditionalExtensions),\n         IncidentId = toint(extract(@\"INCIDENT_ID=([^;]+)\\;\",1,AdditionalExtensions)),\n         IncidentSnapshot = extract(@\"INCIDENT_SNAPSHOT=([^;]+)\\;\",1,AdditionalExtensions),\n         AttachedFileName = extract(@\"ATTACHMENT_FILENAME=([^;]+)\\;\",1,AdditionalExtensions),\n         FileName = extract(@\"FILE_NAME=([^;]+)\\;\",1,AdditionalExtensions),\n         MatchCount = toint(extract(@\"MATCH_COUNT=([^;])\\;\",1,AdditionalExtensions)),\n         Protocol = extract(@\"PROTOCOL=([^;])\\;\",1,AdditionalExtensions),\n         Recipients = extract(@\"RECIPIENTS_NAME=([^;]+)\\;\",1,AdditionalExtensions),\n         Sender = extract(@\"SENDER=([^;]+)\\;\",1,AdditionalExtensions),\n         Subject = extract(@\"SUBJECT=([^;]+)\\;\",1,AdditionalExtensions),\n         Severity = extract(@\"SEVERITY=([^;]+)\\;\",1,AdditionalExtensions),\n         EndpointMachine = extract(@\"ENDPOINT_MACHINE=([^;]+)\\;\",1,AdditionalExtensions),\n         EndpointDvcId = extract(@\"ENDPOINT_DEVICE_ID=([^;]+)\\;\",1,AdditionalExtensions),\n         MachineIpAddr = extract(@\"MACHINE_IP=([^;]+)\\;\",1,AdditionalExtensions),\n         OccuredOn = extract(@\"OCCURRED_ON=([^;]+)\\;\",1,AdditionalExtensions),\n         ReportedOn = extract(@\"REPORTED_ON=([^;]+)\\;\",1,AdditionalExtensions),\n         Url = extract(@\"URL=([^;]+)\\;\",1,AdditionalExtensions),\n         DstIpAddr = extract(@\"DESTINATION_IP=([^;]+)\\;\",1,AdditionalExtensions),\n         Scan = extract(@\"SCAN=([^;]+)\\;\",1,AdditionalExtensions),\n         QuarantinePath = extract(@\"QUARANTINE_PATH=([^;]+)\\;|$\",1,AdditionalExtensions)\n",
                "functionParameters": "",
                "version": 2,
                "tags": [
                  {
                    "name": "description",
                    "value": ""
                  }
                ]
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('Parser-', last(split(variables('parserObject1')._parserId1,'/'))))]",
              "dependsOn": [
                "[variables('parserObject1')._parserId1]"
              ],
              "properties": {
                "parentId": "[resourceId('Microsoft.OperationalInsights/workspaces/savedSearches', parameters('workspace'), 'SymantecDLP')]",
                "contentId": "[variables('parserObject1').parserContentId1]",
                "kind": "Parser",
                "version": "[variables('parserObject1').parserVersion1]",
                "source": {
                  "name": "Broadcom SymantecDLP",
                  "kind": "Solution",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "Microsoft",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "Microsoft Corporation",
                  "email": "support@microsoft.com",
                  "tier": "Microsoft",
                  "link": "https://support.microsoft.com"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('parserObject1').parserContentId1]",
        "contentKind": "Parser",
        "displayName": "SymantecDLP",
        "contentProductId": "[concat(take(variables('_solutionId'),50),'-','pr','-', uniqueString(concat(variables('_solutionId'),'-','Parser','-',variables('parserObject1').parserContentId1,'-', '1.0.0')))]",
        "id": "[concat(take(variables('_solutionId'),50),'-','pr','-', uniqueString(concat(variables('_solutionId'),'-','Parser','-',variables('parserObject1').parserContentId1,'-', '1.0.0')))]",
        "version": "[variables('parserObject1').parserVersion1]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2022-10-01",
      "name": "[variables('parserObject1')._parserName1]",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "eTag": "*",
        "displayName": "SymantecDLP",
        "category": "Microsoft Sentinel Parser",
        "functionAlias": "SymantecDLP",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Symantec\" and DeviceProduct == \"DLP\"\n| extend Blocked = extract(@\"BLOCKED=([^;]+)\\;\",1,AdditionalExtensions),\n         ApplicationName = extract(@\"APPLICATION_NAME=([^;]+)\\;\",1,AdditionalExtensions),\n         IncidentId = toint(extract(@\"INCIDENT_ID=([^;]+)\\;\",1,AdditionalExtensions)),\n         IncidentSnapshot = extract(@\"INCIDENT_SNAPSHOT=([^;]+)\\;\",1,AdditionalExtensions),\n         AttachedFileName = extract(@\"ATTACHMENT_FILENAME=([^;]+)\\;\",1,AdditionalExtensions),\n         FileName = extract(@\"FILE_NAME=([^;]+)\\;\",1,AdditionalExtensions),\n         MatchCount = toint(extract(@\"MATCH_COUNT=([^;])\\;\",1,AdditionalExtensions)),\n         Protocol = extract(@\"PROTOCOL=([^;])\\;\",1,AdditionalExtensions),\n         Recipients = extract(@\"RECIPIENTS_NAME=([^;]+)\\;\",1,AdditionalExtensions),\n         Sender = extract(@\"SENDER=([^;]+)\\;\",1,AdditionalExtensions),\n         Subject = extract(@\"SUBJECT=([^;]+)\\;\",1,AdditionalExtensions),\n         Severity = extract(@\"SEVERITY=([^;]+)\\;\",1,AdditionalExtensions),\n         EndpointMachine = extract(@\"ENDPOINT_MACHINE=([^;]+)\\;\",1,AdditionalExtensions),\n         EndpointDvcId = extract(@\"ENDPOINT_DEVICE_ID=([^;]+)\\;\",1,AdditionalExtensions),\n         MachineIpAddr = extract(@\"MACHINE_IP=([^;]+)\\;\",1,AdditionalExtensions),\n         OccuredOn = extract(@\"OCCURRED_ON=([^;]+)\\;\",1,AdditionalExtensions),\n         ReportedOn = extract(@\"REPORTED_ON=([^;]+)\\;\",1,AdditionalExtensions),\n         Url = extract(@\"URL=([^;]+)\\;\",1,AdditionalExtensions),\n         DstIpAddr = extract(@\"DESTINATION_IP=([^;]+)\\;\",1,AdditionalExtensions),\n         Scan = extract(@\"SCAN=([^;]+)\\;\",1,AdditionalExtensions),\n         QuarantinePath = extract(@\"QUARANTINE_PATH=([^;]+)\\;|$\",1,AdditionalExtensions)\n",
        "functionParameters": "",
        "version": 2,
        "tags": [
          {
            "name": "description",
            "value": ""
          }
        ]
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
      "apiVersion": "2022-01-01-preview",
      "location": "[parameters('workspace-location')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('Parser-', last(split(variables('parserObject1')._parserId1,'/'))))]",
      "dependsOn": [
        "[variables('parserObject1')._parserId1]"
      ],
      "properties": {
        "parentId": "[resourceId('Microsoft.OperationalInsights/workspaces/savedSearches', parameters('workspace'), 'SymantecDLP')]",
        "contentId": "[variables('parserObject1').parserContentId1]",
        "kind": "Parser",
        "version": "[variables('parserObject1').parserVersion1]",
        "source": {
          "kind": "Solution",
          "name": "Broadcom SymantecDLP",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "Microsoft",
          "email": "[variables('_email')]"
        },
        "support": {
          "name": "Microsoft Corporation",
          "email": "support@microsoft.com",
          "tier": "Microsoft",
          "link": "https://support.microsoft.com"
        }
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentPackages",
      "apiVersion": "2023-04-01-preview",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "version": "3.0.3",
        "kind": "Solution",
        "contentSchemaVersion": "3.0.0",
        "displayName": "Broadcom SymantecDLP",
        "publisherDisplayName": "Microsoft Sentinel, Microsoft Corporation",
        "descriptionHtml": "<p><strong>Note:</strong> Please refer to the following before installing the solution:</p>\n<p>• Review the solution <a href=\"https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/Broadcom%20SymantecDLP/ReleaseNotes.md\">Release Notes</a></p>\n<p>• There may be <a href=\"https://aka.ms/sentinelsolutionsknownissues\">known issues</a> pertaining to this Solution, please refer to them before installing.</p>\n<p>The <a href=\"https://www.broadcom.com/products/cyber-security/information-protection/data-loss-prevention\">Broadcom Symantec Data Loss Prevention (DLP)</a> connector allows you to easily connect your Symantec DLP with Microsoft Sentinel.</p>\n<p>This solution is dependent on the Common Event Format solution containing the CEF via AMA connector to collect the logs. The CEF solution will be installed as part of this solution installation.</p>\n<p><strong>NOTE:</strong> Microsoft recommends installation of CEF via AMA Connector.The existing connectors were deprecated on <strong>Aug 31, 2024</strong>.</p>\n<p><strong>Parsers:</strong> 1</p>\n<p><a href=\"https://aka.ms/azuresentinel\">Learn more about Microsoft Sentinel</a> | <a href=\"https://aka.ms/azuresentinelsolutionsdoc\">Learn more about Solutions</a></p>\n",
        "contentKind": "Solution",
        "contentProductId": "[variables('_solutioncontentProductId')]",
        "id": "[variables('_solutioncontentProductId')]",
        "icon": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/Azure_Sentinel.svg\" width=\"75px\" height=\"75px\">",
        "contentId": "[variables('_solutionId')]",
        "parentId": "[variables('_solutionId')]",
        "source": {
          "kind": "Solution",
          "name": "Broadcom SymantecDLP",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "Microsoft",
          "email": "[variables('_email')]"
        },
        "support": {
          "name": "Microsoft Corporation",
          "email": "support@microsoft.com",
          "tier": "Microsoft",
          "link": "https://support.microsoft.com"
        },
        "dependencies": {
          "criteria": [
            {
              "kind": "Parser",
              "contentId": "[variables('parserObject1').parserContentId1]",
              "version": "[variables('parserObject1').parserVersion1]"
            },
            {
              "kind": "Solution",
              "contentId": "azuresentinel.azure-sentinel-solution-commoneventformat"
            }
          ]
        },
        "firstPublishDate": "2022-05-02",
        "providers": [
          "Broadcom"
        ],
        "categories": {
          "domains": [
            "Security - Information Protection"
          ]
        }
      },
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_solutionId'))]"
    }
  ],
  "outputs": {}
}
