// Name: DNS Events that match threat intelligence
//
// Description: This sample hunting query demonstrates how to utilize the threat intelligence data with the DNS event logs
//
// Data Source: #DnsEvents #ThreatIntelligenceIndicator
//
// Tactics: #Execution
//
// Id: a411fe4c-2ee0-4ee0-b579-55d74b6e7371
//
DnsEvents
| join (ThreatIntelligenceIndicator 
    | summarize arg_max(TimeGenerated, *) by IndicatorId
    | summarize by Url) on $left.Name == $right.Url
| summarize count() by Computer, ClientIP, ThreatIntel_Related_Domain = Name
| extend HostCustomEntity = Computer, IPCustomEntity = ClientIP
