id: 689a9475-440b-4e69-8ab1-a5e241685f39
name: Preview - TI map File entity to WireData Event
description: |
  'Identifies a match in WireData Event data from any FileName IOC from TI.
  As File name matches can create noise, this is best as hunting query'
requiredDataConnectors:
  - connectorId: AzureMonitor(WireData)
    dataTypes:
      - WireData
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
  - connectorId: ThreatIntelligenceTaxii
    dataTypes:
      - ThreatIntelligenceIndicator
tactics:
  - Impact
query: |

  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let ioc_lookBack = 14d;
  ThreatIntelligenceIndicator
  | where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
  | where Active == true
  | where isnotempty(FileName)
  // using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated
  | join kind=innerunique (
    WireData 
    | where TimeGenerated between(starttime..endtime)
    | where isnotempty(ProcessName)
    | extend Process =reverse(substring(reverse(ProcessName), 0, indexof(reverse(ProcessName), "\\")))
    | extend WireData_TimeGenerated = TimeGenerated
  )
  on $left.FileName == $right.Process
  | where WireData_TimeGenerated < ExpirationDateTime
  | summarize WireData_TimeGenerated = arg_max(WireData_TimeGenerated, *) by IndicatorId, Process
  | project WireData_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, Url, ExpirationDateTime, ConfidenceScore,
  FileName, Computer, Direction, LocalIP, RemoteIP, LocalPortNumber, RemotePortNumber
  | extend timestamp = WireData_TimeGenerated, HostCustomEntity = Computer, IPCustomEntity = RemoteIP, URLCustomEntity = Url
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
      - identifier: Address
        columnName: LocalIP
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: URLCustomEntity