id: a411fe4c-2ee0-4ee0-b579-55d74b6e7371
name: Preview - DNS Events that match threat intelligence
description: |
  'This sample hunting query demonstrates how to utilize the threat intelligence data with the DNS event logs'
severity: Medium
requiredDataConnectors:
  - connectorId: DNS
    dataTypes:
      - DnsEvents
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
  - connectorId: ThreatIntelligenceTaxii
    dataTypes:
      - ThreatIntelligenceIndicator
tactics:
  - Impact
query: |

  let timeframe = 1d;
  DnsEvents
  | where TimeGenerated >= ago(timeframe)
  | join (ThreatIntelligenceIndicator
    | summarize arg_max(TimeGenerated, *) by IndicatorId
    | summarize by Url) on $left.Name == $right.Url
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count()
  by Computer, ClientIP, ThreatIntel_Related_Domain = Name, Url
  | extend timestamp = StartTimeUtc, HostCustomEntity = Computer, IPCustomEntity = ClientIP, URLCustomEntity = Url
