CommonSecurityLog
| parse AdditionalExtensions with 
    "companyName=" CompanyName:string 
    ";correlationId=" CorrelationId:guid 
    ";itemId=" ItemId:guid 
    ";fileName=" SrcFileName:string
    ";fileSize=" SrcFileSize:int 
    ";passwordProtected=" PasswordProtected:bool 
    ";AVResult=" AVResult:string 
    ";threatCount=" ThreatCount:int 
    ";blockedCount=" BlockedCount:int 
    ";fileModification=" FileModification:string
    ";sanitizationResult=" SanitizationResult:string 
    ";sanitizationTime=" SanitizationTime:int 
    ";connectorType=" ConnectorType:string 
    ";connectorName=" ConnectorName:string 
    ";connectorId=" ConnectorId
    ";policyName=" PolicyName:string 
    ";exceptionId=" ExceptionId
    ";incidentURL=" IncidentURL
    ";messageId=" MessageId
    ";subject=" Subject:string 
    ";from=" From:string 
    ";recipients=" Recipients:string
| project-rename
    SrcFileSHA256=FileHash
| project-away AdditionalExtensions