Id: 4c541df8-a680-4da5-96c9-74456927213f
DisplayName: Hosts the account failed to log-in to most
Description: Hosts the account failed to log-in to most during the range of -1d and +1d
InputEntityType: Account
InputFields:
  - Name + UPNSuffix
  - Name + NTDomain
OutputEntityTypes:
  - Host
QueryPeriodBefore: 1d
QueryPeriodAfter: 1d
DataSources:
    - SecurityEvent
Tactics: 
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let SuccessfulLoginEventId = 4624;
  let FailedLoginEventId = 4625;
  let FailedLoginWithCorrectUser = '0xc000006a';
  let MostFailedLogins = (v_Account_Name:string, v_Account_NTDomain:string, v_Account_UPNSuffix:string){
  SecurityEvent
  | where Account contains v_Account_Name // Basic sanity for performance
  // parse Account sections
  | extend NameAndUPNSuffix =  split(Account,'@') 
  | extend NameAndNtDomain = split(Account,'\\')
  | extend Account_UPNSuffix = iff(array_length(NameAndUPNSuffix) == 2, NameAndUPNSuffix[1], '')
  | extend Account_NTDomain = iff(array_length(NameAndNtDomain) == 2, NameAndNtDomain[0], '')
  | extend Account_Name = iff(array_length(NameAndNtDomain) == 2, NameAndNtDomain[1], iff(array_length(NameAndUPNSuffix) == 2, NameAndUPNSuffix[0], Account))
  // filter by account
  | where (Account_Name != '' and tolower(Account_Name) == tolower(v_Account_Name)) 
           and ((Account_NTDomain != '' and tolower(v_Account_NTDomain) == tolower(Account_NTDomain) ) or 
                (Account_UPNSuffix != '' and tolower(v_Account_UPNSuffix) == tolower(Account_UPNSuffix))
               )
  | summarize Success = sum(EventID==SuccessfulLoginEventId), Host_Aux_NumberOfFailedLoginsByAccount	= sum((EventID==FailedLoginEventId and 
   tolower(SubStatus)==FailedLoginWithCorrectUser)) 
   by Computer, Account
  | top 10 by Host_Aux_NumberOfFailedLoginsByAccount
  | parse Computer with Host_NTDomain '\\' *
  | extend Host_HostName = tostring(split(Computer,'.')[0]), 
   Host_DnsDomain = strcat_array(array_slice(split(Computer,'.'),1,256),'.'), Host_Aux_SuccessfulLoginExists = (Success > 0)
  };
  MostFailedLogins('<Name>', '<NTDomain>','<UPNSuffix>')