Id: 4c541df8-a680-4da5-96c9-74456927213f
DisplayName: Hosts the account failed to log in to the most
Description: Hosts the account failed to log in to the most during the range of -1d and +1d
InputEntityType: Account
InputFields:
  - Name + UPNSuffix
  - Name + NTDomain
OutputEntityTypes:
  - Host
QueryPeriodBefore: 1d
QueryPeriodAfter: 1d
DataSources:
    - SecurityEvent
Tactics: 
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let SuccessfulLoginEventId = 4624;
  let FailedLoginEventId = 4625;
  let FailedLoginWithCorrectUser = '0xc000006a';
  let MostFailedLogins = (v_Account_Name:string, v_Account_NTDomain:string, v_Account_UPNSuffix:string){
  let MostFailedLogins = (v_Account_Name:string){
  SecurityEvent
  | where isnotempty(v_Account_Name) and Account contains v_Account_Name // Basic sanity for performance
  | extend Account_Name = extract(@'^([^\\]*\\)?([^@]+)@?',2,Account)
  // filter by account
  | where Account_Name==v_Account_Name
  | summarize Host_Aux_SuccessfulLoginCount = sum(EventID==SuccessfulLoginEventId), Host_Aux_FailedLoginsCount	= sum(EventID==FailedLoginEventId and 
   SubStatus=~FailedLoginWithCorrectUser)
   by Computer, Account
  | top 10 by Host_Aux_FailedLoginsCount
  | parse Computer with Host_NTDomain '\\' *
  | extend Host_HostName = tostring(split(Computer,'.')[0]), 
   Host_DnsDomain = strcat_array(array_slice(split(Computer,'.'),1,256),'.')
  | project-away Computer, Account  
  };
  MostFailedLogins('<Name>')