//Provides a summary view of a given account's activity
//For use when investigating an account that has been identified as having associated suspect activity or been otherwise compromised. 
//All office activity by UserName using UI to set Time range
// Tags: #Persistence, #Discovery, #Lateral Movement, #Collection
let GetAllOfficeActivityByUserName = (UserName:string){
OfficeActivity
| where UserKey contains UserName or UserId contains UserName
| order by TimeGenerated desc
};
GetAllOfficeActivityByUserName("admin@M365x411654") //Example of function being called

//All office activity by UserName where Time range is set in the function call
// Tags:  #Persistence, #Discovery, #Lateral Movement, #Collection
let GetAllOfficeActivityByUserName = (StartTime:datetime, EndTime:datetime, UserName:string){
OfficeActivity
| where UserKey contains UserName or UserId contains UserName
| where TimeGenerated between (StartTime .. EndTime)
| order by TimeGenerated desc
};
GetAllOfficeActivityByUserName(datetime('2018-08-01T10:02:51.000'),datetime('2018-08-22T10:02:51.000'),  "admin@M365x411654")  //Example of function being called

//All office activity by UserName with 6 hour window around event time that is passed into the function
// Tags: #Persistence, #Discovery, #Lateral Movement, #Collection
let GetAllOfficeActivityByUserName = (suspiciousEventTime:datetime, UserName:string){
let StartTime = suspiciousEventTime-6d;
let EndTime = suspiciousEventTime+6h;
OfficeActivity
| where UserKey contains UserName or UserId contains UserName
| where TimeGenerated between (StartTime .. EndTime)
| order by TimeGenerated desc
};
//GetAllOfficeActivityByUserName(datetime('2018-08-19T10:02:51.000'), "admin@M365x411654") //Example of function being called
