Id: 6d1c2ca8-8efe-4fa2-bea6-fa582c03637c
DisplayName: User account new interactive logon
Description: New interactive logons by a given user
InputEntityType: Account
InputFields:
  - Name
OutputEntityTypes:
  - Host
QueryPeriodBefore: 1d
QueryPeriodAfter: 1d
DataSources:
  - BehaviorAnalytics
Tactics:
  - Collection
  - LateralMovement
query: |

  let GetNewInteractiveLogonsForUser = (v_Account_Name:string)
  {
    BehaviorAnalytics
    | extend v_Account_Name = case(
           v_Account_Name has '@', tostring(split(v_Account_Name, '@')[0]),
           v_Account_Name has '\\', tostring(split(v_Account_Name, '\\')[1]),
           v_Account_Name)
    | where ActionType == "InteractiveLogon" and 
            tobool(ActivityInsights.FirstTimeUserConnectedToDestinationDevice) and
            UserName =~ v_Account_Name
    | project Host_Aux_TimeGenerated=TimeGenerated, Host_UnstructuredName=DestinationDevice
    | top 10 by Host_Aux_TimeGenerated asc nulls last
  };
  GetNewInteractiveLogonsForUser('<Name>')