Id: b66ab2aa-cd31-43b9-82a2-dd5f0ee9ca81
DisplayName: User account remote interactive logon
Description: New remote interactive logon by a given user
InputEntityType: Account
InputFields:
  - Name
OutputEntityTypes:
  - Host
QueryPeriodBefore: 1d
QueryPeriodAfter: 1d
DataSources:
  - BehaviorAnalytics
Tactics:
  - Collection
  - LateralMovement
query: |

  let GetAllNewRemoteInteractiveLogonForUser = (v_Account_Name:string)
  {
    BehaviorAnalytics
    | extend v_Account_Name = case(
           v_Account_Name has '@', tostring(split(v_Account_Name, '@')[0]),
           v_Account_Name has '\\', tostring(split(v_Account_Name, '\\')[1]),
           v_Account_Name)
    | where ActionType == "RemoteInteractiveLogon" and 
            tobool(ActivityInsights.FirstTimeUserConnectedToDestinationDevice) and
            UserName =~ v_Account_Name
    | project Host_Aux_TimeGenerated=TimeGenerated, Host_UnstructuredName=DestinationDevice
    | top 10 by Host_Aux_TimeGenerated asc nulls last
  };
  GetAllNewRemoteInteractiveLogonForUser('<Name>')
  