Id: 81d63625-6617-455d-b1e3-ee5ed989e5f8
DisplayName: Screenshots taken
Description: Summary of hosts on which the user has taken screenshots
InputEntityType: Account
InputFields:
  - Name + UPNSuffix
OutputEntityTypes:
  - Host
QueryPeriodBefore: 24h
QueryPeriodAfter: 24h
DataSources:
  - DeviceEvents
Tactics:
  - Exfiltration
query: |
  
  let HostScreenshot= (Account_Name:string, Account_UPNSuffix:string){
    let p_Account_UPN = strcat(Account_Name,'@',Account_UPNSuffix);
    DeviceEvents 
    | where ActionType =='ScreenshotTaken' 
    | where InitiatingProcessAccountUpn =~ p_Account_UPN
    | summarize Count=count() by DeviceName
    | top 10 by Count desc
    | project Host_UnstructuredName=DeviceName
  };
  HostScreenshot('<Account_Name>', '<Account_UPNSuffix>')