Parser:
  Title: M365D Process Events
  Version: '0.1'
  LastUpdated: May 23, 2021
Product:
  Name: M365D
Normalization:
  Schema: ProcessEvents
  Version: '1.0.0'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: Parser for M365 Defender for endpoint, into "Process" Normalized Schema
ParserName: M365D_ProcessEvents_Normalized
ParserQuery: |
                let ProcessEvents_M365D=(){
                DeviceProcessEvents
                |project-rename
                //***** Mandatory Fields - name change ******
                    EventOriginalUid = ReportId,
                    DvcId = DeviceId,
                      DvcHostName = DeviceName,
                      DvcMachineGroup = MachineGroup,
                      TargetUserName = AccountName,
                      TargetUserId = AccountSid,
                      TargetProcessFileName = FileName,
                      TargetProcessFilePath = FolderPath,
                  //***** Optional Fields - name change ******
                      TargetUserDomain = AccountDomain,
                      TargetUserAadId = AccountObjectId,
                      TargetUserUpn = AccountUpn,
                      TargetProcessMD5 = MD5,
                      TargetProcessSHA1 = SHA1,
                      TargetProcessSHA256 = SHA256,
                      TargetProcessCommandLine = ProcessCommandLine,
                      TargetProcessId = ProcessId,
                      TargetProcessIntegrityLevel = ProcessIntegrityLevel,
                      TargetProcessTokenElevation = ProcessTokenElevation,
                      TargetProcessSessionId = LogonId,
                      TargetProcessCreationTime = ProcessCreationTime,
                      ActorUserName = InitiatingProcessAccountName ,
                      ActorUserDomain = InitiatingProcessAccountDomain,
                      ActorUserAadId = InitiatingProcessAccountObjectId,
                      ActorUserId = InitiatingProcessAccountSid ,
                      ActorUserUpn = InitiatingProcessAccountUpn,
                      ActingProcessCommandLine = InitiatingProcessCommandLine , 
                      ActingProcessFileName = InitiatingProcessFileName , 
                      ActingProcessFilePath = InitiatingProcessFolderPath , 
                      ActingProcessId = InitiatingProcessId  ,  
                      ActingProcessIntegrityLevel = InitiatingProcessIntegrityLevel , 
                      ActingProcessMD5 = InitiatingProcessMD5 , 
                      ActingProcessSHA1 = InitiatingProcessSHA1 , 
                      ActingProcessSHA256 = InitiatingProcessSHA256 , 
                      ActingProcessSessionId = InitiatingProcessLogonId,
                      ParentProcessFileName = InitiatingProcessParentFileName , 
                      ActingProcessTokenElevation = InitiatingProcessTokenElevation,
                      ActingProcessCreationTime = InitiatingProcessCreationTime , 
                      ParentProcessId = InitiatingProcessParentId,
                      ParentProcessCreationTime = InitiatingProcessParentCreationTime
                  | extend
                  //***** Mandatory Fields - calculating value ******
                      EventCount = int(1),
                      EventProduct = "M365 Defender for Endpoint",
                      EventVendor = "Microsoft Corporation",
                      EventSchemaVersion = "0.0.1",
                      EventStartTime = todatetime(TimeGenerated),
                      EventEndTime = todatetime(TimeGenerated),
                      EventType = "ProcessCreated",
                      DvcOs = "Windows",
                      TargetUserIdType = "SID",
                      ActorUserIdType = "SID"
                  //***** Optional Fields - calculating value ******
                      //***** Aliases ******
                  | extend
                      TargetUser = TargetUserName,
                      TargetProcessName = TargetProcessFilePath,
                      Dvc = DvcHostName
                  };
                  ProcessEvents_M365D