{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "author": "Microsoft - support@microsoft.com",
    "comments": "Solution template for Akamai Security Events"
  },
  "parameters": {
    "location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
      }
    },
    "workspace-location": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "[concat('Region to deploy solution resources -- separate from location selection',parameters('location'))]"
      }
    },
    "workspace": {
      "defaultValue": "",
      "type": "string",
      "metadata": {
        "description": "Workspace name for Log Analytics where Microsoft Sentinel is setup"
      }
    }
  },
  "variables": {
    "email": "support@microsoft.com",
    "_email": "[variables('email')]",
    "_solutionName": "Akamai Security Events",
    "_solutionVersion": "3.0.2",
    "solutionId": "azuresentinel.azure-sentinel-solution-akamai",
    "_solutionId": "[variables('solutionId')]",
    "parserObject1": {
      "_parserName1": "[concat(parameters('workspace'),'/','AkamaiSIEMEvent')]",
      "_parserId1": "[resourceId('Microsoft.OperationalInsights/workspaces/savedSearches', parameters('workspace'), 'AkamaiSIEMEvent')]",
      "parserTemplateSpecName1": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-pr-',uniquestring('AkamaiSIEMEvent-Parser')))]",
      "parserVersion1": "1.0.0",
      "parserContentId1": "AkamaiSIEMEvent-Parser"
    },
    "_solutioncontentProductId": "[concat(take(variables('_solutionId'),50),'-','sl','-', uniqueString(concat(variables('_solutionId'),'-','Solution','-',variables('_solutionId'),'-', variables('_solutionVersion'))))]"
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('parserObject1').parserTemplateSpecName1]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "AkamaiSIEMEvent Data Parser with template version 3.0.2",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('parserObject1').parserVersion1]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "name": "[variables('parserObject1')._parserName1]",
              "apiVersion": "2022-10-01",
              "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
              "location": "[parameters('workspace-location')]",
              "properties": {
                "eTag": "*",
                "displayName": "AkamaiSIEMEvent",
                "category": "Microsoft Sentinel Parser",
                "functionAlias": "AkamaiSIEMEvent",
                "query": "CommonSecurityLog \n| where DeviceVendor == 'Akamai'\n| where DeviceProduct == 'akamai_siem'\n| extend EventVendor = 'Akamai'\n| extend EventProduct = 'akamai_siem'\n| extend EventProductVersion = '1.0'\n| extend EventId = DeviceEventClassID\n| extend EventCategory = Activity\n| extend EventSeverity = LogSeverity\n| extend DvcAction = DeviceAction\n| extend NetworkApplicationProtocol = ApplicationProtocol\n| extend Ipv6Src = DeviceCustomIPv6Address2\n| extend RuleName = DeviceCustomString1\n| extend RuleMessages = DeviceCustomString2\n| extend RuleData = DeviceCustomString3\n| extend RuleSelectors = DeviceCustomString4\n| extend ClientReputation = DeviceCustomString5\n| extend ApiId = DeviceCustomString6\n| extend RequestId = DevicePayloadId\n| extend DstDvcHostname = DestinationHostName\n| extend DstPortNumber = DestinationPort\n| extend ConfigId = FlexString1\n| extend PolicyId = FlexString2\n| extend NetworkBytes = SentBytes\n| extend UrlOriginal = RequestURL\n| extend HttpRequestMethod = RequestMethod\n| extend SrcIpAddr = SourceIP\n| extend EventStartTime = datetime(1970-01-01) + coalesce(\n                            tolong(extract(@'.*start=(.*?);', 1, AdditionalExtensions)),\n                            tolong(column_ifexists(\"StartTime\", long(null)))\n                        ) * 1s \n| extend SlowPostAction = extract(@'.*AkamaiSiemSlowPostAction=(.*?);', 1, AdditionalExtensions)\n| extend SlowPostRate = extract(@'.*AkamaiSiemSlowPostRate=(.*?);', 1, AdditionalExtensions)\n| extend RuleVersions = extract(@'.*AkamaiSiemRuleVersions=,?(.*?);', 1, AdditionalExtensions)\n| extend RuleTags = extract(@'.*AkamaiSiemRuleTags=(.*?);', 1, AdditionalExtensions)\n| extend ApiKey = extract(@'.*AkamaiSiemApiKey=(.*?);', 1, AdditionalExtensions)\n| extend Tls = extract(@'.*AkamaiSiemTLSVersion=(.*?);', 1, AdditionalExtensions)\n| extend RequestHeaders = extract(@'.*AkamaiSiemRequestHeaders=;?(.*?);', 1, AdditionalExtensions)\n| extend ResponseHeaders = extract(@'.*AkamaiSiemResponseHeaders=(.*?);', 1, AdditionalExtensions)\n| extend HttpStatusCode = extract(@'.*AkamaiSiemResponseStatus=(.*?);', 1, AdditionalExtensions)\n| extend GeoContinent = extract(@'.*AkamaiSiemContinent=(.*?);', 1, AdditionalExtensions)\n| extend SrcGeoCountry = extract(@'.*AkamaiSiemCountry=(.*?);', 1, AdditionalExtensions)\n| extend SrcGeoCity = extract(@'.*AkamaiSiemCity=(.*?);', 1, AdditionalExtensions)\n| extend SrcGeoRegion = extract(@'.*AkamaiSiemRegion=(.*?);', 1, AdditionalExtensions)\n| extend GeoAsn = extract(@'.*AkamaiSiemASN=(\\d+)', 1, AdditionalExtensions)\n| extend Custom = extract(@'.*AkamaiSiemCusomData=(.*?)', 1, AdditionalExtensions)\n| project TimeGenerated\n        , EventVendor\n        , EventProduct\n        , EventProductVersion\n        , EventStartTime\n        , EventId\n        , EventCategory\n        , EventSeverity\n        , DvcAction\n        , NetworkApplicationProtocol\n        , Ipv6Src\n        , RuleName\n        , RuleMessages\n        , RuleData\n        , RuleSelectors\n        , ClientReputation\n        , ApiId\n        , RequestId\n        , DstDvcHostname\n        , DstPortNumber\n        , ConfigId\n        , PolicyId\n        , NetworkBytes\n        , UrlOriginal\n        , HttpRequestMethod\n        , SrcIpAddr\n        , SlowPostAction\n        , SlowPostRate\n        , RuleVersions\n        , RuleTags\n        , ApiKey\n        , Tls\n        , RequestHeaders\n        , ResponseHeaders\n        , HttpStatusCode\n        , GeoContinent\n        , SrcGeoCountry\n        , SrcGeoCity\n        , SrcGeoRegion\n        , GeoAsn\n        , Custom\n",
                "functionParameters": "",
                "version": 2,
                "tags": [
                  {
                    "name": "description",
                    "value": ""
                  }
                ]
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2022-01-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('Parser-', last(split(variables('parserObject1')._parserId1,'/'))))]",
              "dependsOn": [
                "[variables('parserObject1')._parserId1]"
              ],
              "properties": {
                "parentId": "[resourceId('Microsoft.OperationalInsights/workspaces/savedSearches', parameters('workspace'), 'AkamaiSIEMEvent')]",
                "contentId": "[variables('parserObject1').parserContentId1]",
                "kind": "Parser",
                "version": "[variables('parserObject1').parserVersion1]",
                "source": {
                  "name": "Akamai Security Events",
                  "kind": "Solution",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "Microsoft",
                  "email": "[variables('_email')]"
                },
                "support": {
                  "name": "Microsoft Corporation",
                  "email": "support@microsoft.com",
                  "tier": "Microsoft",
                  "link": "https://support.microsoft.com"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('parserObject1').parserContentId1]",
        "contentKind": "Parser",
        "displayName": "AkamaiSIEMEvent",
        "contentProductId": "[concat(take(variables('_solutionId'),50),'-','pr','-', uniqueString(concat(variables('_solutionId'),'-','Parser','-',variables('parserObject1').parserContentId1,'-', '1.0.0')))]",
        "id": "[concat(take(variables('_solutionId'),50),'-','pr','-', uniqueString(concat(variables('_solutionId'),'-','Parser','-',variables('parserObject1').parserContentId1,'-', '1.0.0')))]",
        "version": "[variables('parserObject1').parserVersion1]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2022-10-01",
      "name": "[variables('parserObject1')._parserName1]",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "eTag": "*",
        "displayName": "AkamaiSIEMEvent",
        "category": "Microsoft Sentinel Parser",
        "functionAlias": "AkamaiSIEMEvent",
        "query": "CommonSecurityLog \n| where DeviceVendor == 'Akamai'\n| where DeviceProduct == 'akamai_siem'\n| extend EventVendor = 'Akamai'\n| extend EventProduct = 'akamai_siem'\n| extend EventProductVersion = '1.0'\n| extend EventId = DeviceEventClassID\n| extend EventCategory = Activity\n| extend EventSeverity = LogSeverity\n| extend DvcAction = DeviceAction\n| extend NetworkApplicationProtocol = ApplicationProtocol\n| extend Ipv6Src = DeviceCustomIPv6Address2\n| extend RuleName = DeviceCustomString1\n| extend RuleMessages = DeviceCustomString2\n| extend RuleData = DeviceCustomString3\n| extend RuleSelectors = DeviceCustomString4\n| extend ClientReputation = DeviceCustomString5\n| extend ApiId = DeviceCustomString6\n| extend RequestId = DevicePayloadId\n| extend DstDvcHostname = DestinationHostName\n| extend DstPortNumber = DestinationPort\n| extend ConfigId = FlexString1\n| extend PolicyId = FlexString2\n| extend NetworkBytes = SentBytes\n| extend UrlOriginal = RequestURL\n| extend HttpRequestMethod = RequestMethod\n| extend SrcIpAddr = SourceIP\n| extend EventStartTime = datetime(1970-01-01) + coalesce(\n                            tolong(extract(@'.*start=(.*?);', 1, AdditionalExtensions)),\n                            tolong(column_ifexists(\"StartTime\", long(null)))\n                        ) * 1s \n| extend SlowPostAction = extract(@'.*AkamaiSiemSlowPostAction=(.*?);', 1, AdditionalExtensions)\n| extend SlowPostRate = extract(@'.*AkamaiSiemSlowPostRate=(.*?);', 1, AdditionalExtensions)\n| extend RuleVersions = extract(@'.*AkamaiSiemRuleVersions=,?(.*?);', 1, AdditionalExtensions)\n| extend RuleTags = extract(@'.*AkamaiSiemRuleTags=(.*?);', 1, AdditionalExtensions)\n| extend ApiKey = extract(@'.*AkamaiSiemApiKey=(.*?);', 1, AdditionalExtensions)\n| extend Tls = extract(@'.*AkamaiSiemTLSVersion=(.*?);', 1, AdditionalExtensions)\n| extend RequestHeaders = extract(@'.*AkamaiSiemRequestHeaders=;?(.*?);', 1, AdditionalExtensions)\n| extend ResponseHeaders = extract(@'.*AkamaiSiemResponseHeaders=(.*?);', 1, AdditionalExtensions)\n| extend HttpStatusCode = extract(@'.*AkamaiSiemResponseStatus=(.*?);', 1, AdditionalExtensions)\n| extend GeoContinent = extract(@'.*AkamaiSiemContinent=(.*?);', 1, AdditionalExtensions)\n| extend SrcGeoCountry = extract(@'.*AkamaiSiemCountry=(.*?);', 1, AdditionalExtensions)\n| extend SrcGeoCity = extract(@'.*AkamaiSiemCity=(.*?);', 1, AdditionalExtensions)\n| extend SrcGeoRegion = extract(@'.*AkamaiSiemRegion=(.*?);', 1, AdditionalExtensions)\n| extend GeoAsn = extract(@'.*AkamaiSiemASN=(\\d+)', 1, AdditionalExtensions)\n| extend Custom = extract(@'.*AkamaiSiemCusomData=(.*?)', 1, AdditionalExtensions)\n| project TimeGenerated\n        , EventVendor\n        , EventProduct\n        , EventProductVersion\n        , EventStartTime\n        , EventId\n        , EventCategory\n        , EventSeverity\n        , DvcAction\n        , NetworkApplicationProtocol\n        , Ipv6Src\n        , RuleName\n        , RuleMessages\n        , RuleData\n        , RuleSelectors\n        , ClientReputation\n        , ApiId\n        , RequestId\n        , DstDvcHostname\n        , DstPortNumber\n        , ConfigId\n        , PolicyId\n        , NetworkBytes\n        , UrlOriginal\n        , HttpRequestMethod\n        , SrcIpAddr\n        , SlowPostAction\n        , SlowPostRate\n        , RuleVersions\n        , RuleTags\n        , ApiKey\n        , Tls\n        , RequestHeaders\n        , ResponseHeaders\n        , HttpStatusCode\n        , GeoContinent\n        , SrcGeoCountry\n        , SrcGeoCity\n        , SrcGeoRegion\n        , GeoAsn\n        , Custom\n",
        "functionParameters": "",
        "version": 2,
        "tags": [
          {
            "name": "description",
            "value": ""
          }
        ]
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
      "apiVersion": "2022-01-01-preview",
      "location": "[parameters('workspace-location')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('Parser-', last(split(variables('parserObject1')._parserId1,'/'))))]",
      "dependsOn": [
        "[variables('parserObject1')._parserId1]"
      ],
      "properties": {
        "parentId": "[resourceId('Microsoft.OperationalInsights/workspaces/savedSearches', parameters('workspace'), 'AkamaiSIEMEvent')]",
        "contentId": "[variables('parserObject1').parserContentId1]",
        "kind": "Parser",
        "version": "[variables('parserObject1').parserVersion1]",
        "source": {
          "kind": "Solution",
          "name": "Akamai Security Events",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "Microsoft",
          "email": "[variables('_email')]"
        },
        "support": {
          "name": "Microsoft Corporation",
          "email": "support@microsoft.com",
          "tier": "Microsoft",
          "link": "https://support.microsoft.com"
        }
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentPackages",
      "apiVersion": "2023-04-01-preview",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "version": "3.0.2",
        "kind": "Solution",
        "contentSchemaVersion": "3.0.0",
        "displayName": "Akamai Security Events",
        "publisherDisplayName": "Microsoft Sentinel, Microsoft Corporation",
        "descriptionHtml": "<p><strong>Note:</strong> Please refer to the following before installing the solution:</p>\n<p>• Review the solution <a href=\"https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/Akamai%20Security%20Events/ReleaseNotes.md\">Release Notes</a></p>\n<p>• There may be <a href=\"https://aka.ms/sentinelsolutionsknownissues\">known issues</a> pertaining to this Solution, please refer to them before installing.</p>\n<p>The Akamai Security Solution for Microsoft Sentinel enables ingestion of <a href=\"https://www.akamai.com/solutions/security\">Akamai Security Solutions</a> events using the Common Event Format (CEF) into Microsoft Sentinel for Security Monitoring.</p>\n<p>This solution is dependent on the Common Event Format solution containing the CEF via AMA connector to collect the logs. The CEF solution will be installed as part of this solution installation.</p>\n<p><strong>NOTE:</strong> Microsoft recommends installation of CEF via AMA Connector. The existing connectors are about to be deprecated by <strong>Aug 31, 2024.</strong></p>\n<p><strong>Parsers:</strong> 1</p>\n<p><a href=\"https://aka.ms/azuresentinel\">Learn more about Microsoft Sentinel</a> | <a href=\"https://aka.ms/azuresentinelsolutionsdoc\">Learn more about Solutions</a></p>\n",
        "contentKind": "Solution",
        "contentProductId": "[variables('_solutioncontentProductId')]",
        "id": "[variables('_solutioncontentProductId')]",
        "icon": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/akamai.svg\"width=\"75px\"height=\"75px\">",
        "contentId": "[variables('_solutionId')]",
        "parentId": "[variables('_solutionId')]",
        "source": {
          "kind": "Solution",
          "name": "Akamai Security Events",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "Microsoft",
          "email": "[variables('_email')]"
        },
        "support": {
          "name": "Microsoft Corporation",
          "email": "support@microsoft.com",
          "tier": "Microsoft",
          "link": "https://support.microsoft.com"
        },
        "dependencies": {
          "criteria": [
            {
              "kind": "Parser",
              "contentId": "[variables('parserObject1').parserContentId1]",
              "version": "[variables('parserObject1').parserVersion1]"
            },
            {
              "kind": "Solution",
              "contentId": "azuresentinel.azure-sentinel-solution-commoneventformat"
            }
          ]
        },
        "firstPublishDate": "2022-03-23",
        "providers": [
          "Akamai"
        ],
        "categories": {
          "domains": [
            "Security - Cloud Security"
          ]
        }
      },
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_solutionId'))]"
    }
  ],
  "outputs": {}
}
