{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    },
    "location": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimAuthenticationAADServicePrincipalSignInLogs",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "Azure active directory service principal authentication",
            "category": "Security",
            "FunctionAlias": "vimAuthenticationAADServicePrincipalSignInLogs",
            "query": "let AADSvcPrincipal=(){\n  AADServicePrincipalSignInLogs\n  | extend\n      EventVendor = 'Microsoft'\n      , EventProduct = 'AAD Service Principal'\n      , EventCount=1\n      , EventSchemaVersion='0.1.0'\n      , EventResult = iff (ResultType ==0, 'Success', 'Failure')\n      //, EventResultDetails= ResultType\n      , EventOriginalResultDetails = coalesce(ResultDescription, ResultType)\n      , EventStartTime = TimeGenerated\n      , EventEndTime= TimeGenerated\n      , EventType= 'Logon'\n      , Location = todynamic(LocationDetails)\n      , TargetAppId = ResourceIdentity \n      , TargetAppName=ResourceDisplayName\n    , TargetUserType='ServicePrincipal'\n    , TargetUsername=ServicePrincipalName\n    , TargetUserId=ServicePrincipalId\n    , TargetUsernameType='Simple'\n    , TargetUserIdType='AADID'\n  | extend\n      SrcGeoCity=tostring(Location.city)\n      , SrcGeoCountry=tostring(Location.countryOrRegion)\n      , SrcGeoLatitude=tostring(Location.geoCoordinates.latitude)\n      , SrcGeoLongitude=tostring(Location.geoCoordinates.longitude)\n  | project-rename\n      EventOriginalUid =Id\n      , TargetSessionId=CorrelationId\n      , SrcDvcIpAddr=IPAddress\n      | lookup AADSTSErrorCodes on ResultType\n  | project-reorder\n      TimeGenerated\n      ,EventProduct\n      , EventOriginalUid\n      , EventResult\n      //, EventResultDetails\n      , EventOriginalResultDetails\n      , EventStartTime\n      , EventEndTime\n      , TargetSessionId\n      , SrcGeoCity\n      , SrcGeoCountry\n      , TargetAppId\n      // ** Aliases\n      | extend \n        User=TargetUsername\n    , LogonTarget=ResourceIdentity\n    , Dvc=EventVendor};\nAADSvcPrincipal",
            "version": 1
          }
        }
      ]
    }
  ]
}