// Name: Cisco ASA - Threat Detection Message Fired
// Description: This indicates when the Cisco ASA Threat Detection engine fired an alert based on malicious activity occurring on the network
// https://www.cisco.com/c/en/us/td/docs/security/asa/syslog/b_syslog/syslogs9.html
// DeviceEventClassID 733101-733105
// Details on how to further troubleshoot/investigate - https://www.cisco.com/c/en/us/support/docs/security/asa-5500-x-series-next-generation-firewalls/113685-asa-threat-detection.html
//
// Id: 795edf2d-cf3e-45b5-8452-fe6c9e6a582e
//
// Severity: Medium
//
// QueryFrequency: 1h
//
// QueryPeriod: 1h
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// DataSource: #CommonSecurityLog
//
// Tactics: #Discovery
//
let timeframe = 1h;
CommonSecurityLog 
| where TimeGenerated >= ago(timeframe)
| where isempty(CommunicationDirection) 
| where DeviceEventClassID in ("733101","733102","733103","733104","733105")