id: 20d8ed2e-bb33-410f-bf00-571e2be97d9d
name: Higher Confidence Threat Intel detection on IP
description: |
  'There is indication of a higher confidence score (76 or higher) Threat Intel detection for the given IP.  It is recommended you investigate this thoroughly'
severity: Medium
requiredDataConnectors:
  - connectorId: Barracuda
    dataTypes:
      - CommonSecurityLog
  - connectorId: CEF
    dataTypes:
      - CommonSecurityLog
  - connectorId: Checkpoint
    dataTypes:
      - CommonSecurityLog
  - connectorId: CiscoASA
    dataTypes:
      - CommonSecurityLog
  - connectorId: F5
    dataTypes:
      - CommonSecurityLog
  - connectorId: Fortinet
    dataTypes:
      - CommonSecurityLog
  - connectorId: PaloAltoNetworks
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
relevantTechniques:
  - T1043
  - T1094
query: |

  let timeframe = 1h;
  CommonSecurityLog
  | where TimeGenerated >= ago(timeframe) 
  | where toint(ThreatConfidence) >= 76
  | where tolower(SimplifiedDeviceAction) !in ('deny', 'drop', 'block', 'reset-server', 'reset-both', 'reset-server', '')
  | extend IPCustomEntity = MaliciousIP