id: 20d8ed2e-bb33-410f-bf00-571e2be97d9d
name: Higher Confidence Threat Intel detection on IP
description: There is indication of a higher confidence level TI detection for the given IP
severity: Low
requiredDataConnectors:
  - dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
query: |

  let timeframe = 1h;
  CommonSecurityLog
  | where TimeGenerated >= ago(timeframe) 
  | where toint(ThreatConfidence) >= 76
  | where tolower(SimplifiedDeviceAction) !in ('deny', 'drop', 'block', 'reset-server', 'reset-both', 'reset-server', '')
