// Name: Higher Confidence Threat Intel detection on IP
// Description: There is indication of a higher confidence level TI detection for the given IP
// Id: 20d8ed2e-bb33-410f-bf00-571e2be97d9d
//
// Severity: Low
//
// QueryFrequency: 1h
//
// QueryPeriod: 1h
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// DataSource: #CommonSecurityLog
//
// Tactics: #CommandAndControl
//
let timeframe = 1h;
CommonSecurityLog
| where TimeGenerated >= ago(timeframe) 
| where toint(ThreatConfidence) >= 76

