id: b3285f15-03b8-4468-8a92-1377ca377c46
name: Rare Threat Intel detection on IP
description: Identifies new TI detections on a given IP from the last 6 hours not seen in previous 14 days.
severity: Low
requiredDataConnectors:
  - dataTypes:
      - CommonSecurityLog
queryFrequency: 6h
queryPeriod: 30d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
  - InitialAccess
query: |

  let timeframe = 6h;
  let last1dfull =
  CommonSecurityLog
  | where TimeGenerated >= ago(timeframe)
  | where tolower(SimplifiedDeviceAction) !in ('deny', 'drop', 'block', 'reset-server', 'reset-both', 'reset-server')
  | where isnotempty(MaliciousIP)
  | where Message !contains "timed out";
  let last1d = 
  CommonSecurityLog
  | where TimeGenerated >= ago(timeframe)
  | where tolower(SimplifiedDeviceAction) !in ('deny', 'drop', 'block', 'reset-server', 'reset-both', 'reset-server')
  | where isnotempty(MaliciousIP)
  | where Message !contains "timed out"
  | summarize SourceIPGroup = makeset(SourceIP), todayCount = count() by DeviceVendor, DeviceProduct, DeviceName, ThreatConfidence, MaliciousIP, IndicatorThreatType, Message
  ;
  let prev14d = CommonSecurityLog
  | where TimeGenerated between (ago(14d) .. ago(6h))
  | where tolower(SimplifiedDeviceAction) !in ('deny', 'drop', 'block', 'reset-server', 'reset-both', 'reset-server')
  | where isnotempty(MaliciousIP)
  | where Message !contains "timed out"
  | summarize SourceIPGroup = makeset(SourceIP) by DeviceVendor, DeviceProduct, DeviceName, ThreatConfidence, MaliciousIP, IndicatorThreatType, Message;
  let newToday = last1d | join kind= leftanti (
    prev14d 
  ) on DeviceVendor, DeviceProduct, DeviceName, ThreatConfidence, MaliciousIP, IndicatorThreatType, Message
  ;
  last1dfull | join (
    newToday 
  ) on DeviceVendor, DeviceProduct, DeviceName, ThreatConfidence, MaliciousIP, IndicatorThreatType, Message 
  | summarize makeset(Message), sum(todayCount) by SourceIPGroup, DeviceVendor, DeviceProduct, DeviceName, MaliciousIP, IndicatorThreatType, ThreatConfidence, MaliciousIPCountry
  | project SourceIPGroup, DeviceVendor, DeviceProduct, DeviceName, MaliciousIP, IndicatorThreatType, set_Message, FailureMessageCount = arraylength(set_Message), ThreatConfidence, MaliciousIPCountry, sum_todayCount 
  | 
