id: 06a9b845-6a95-4432-a78b-83919b28c375
name: Time series anomaly detection for total volume in network logs
description: |
  'Identifies anamalous spikes in network traffic logs as compared to baseline or normal historical patterns. 
  The query leverages a KQL built-in anomaly detection algorithm to find large deviations from baseline patterns. 
  Sudden increases in network traffic volume may be an indication of data exfiltration attempts and should be investigated.
  The higher the score, the further it is from the baseline value.'
severity: Medium
requiredDataConnectors:
  - connectorId: Barracuda
    dataTypes:
      - CommonSecurityLog
  - connectorId: CEF
    dataTypes:
      - CommonSecurityLog
  - connectorId: CheckPoint
    dataTypes:
      - CommonSecurityLog
  - connectorId: CiscoASA
    dataTypes:
      - CommonSecurityLog
  - connectorId: F5
    dataTypes:
      - CommonSecurityLog
  - connectorId: Fortinet
    dataTypes:
      - CommonSecurityLog
  - connectorId: PaloAltoNetworks
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 3
tactics:
  - Exfiltration
relevantTechniques:
  - T1030
query: |

  let starttime = 14d;
  let endtime = 1d;
  let timeframe = 1h;
  let scorethreshold = 3;
  let TimeSeriesData = CommonSecurityLog 
  | where isnotempty(DestinationIP) and isnotempty(SourceIP)
  | where TimeGenerated between (startofday(ago(starttime))..startofday(ago(endtime)))
  | project TimeGenerated,SourceIP, DestinationIP, DeviceVendor
  | make-series Total=count() on TimeGenerated from startofday(ago(starttime)) to startofday(ago(endtime)) step timeframe by DeviceVendor;
  //Filtering specific records associated with spikes as outliers
  let TimeSeriesAlerts=TimeSeriesData
  | extend (anomalies, score, baseline) = series_decompose_anomalies(Total, scorethreshold, -1, 'linefit')
  | mv-expand Total to typeof(double), TimeGenerated to typeof(datetime), anomalies to typeof(double),score to typeof(double), baseline to typeof(long)
  | where anomalies > 0 | extend score = round(score,2)
  | project DeviceVendor,TimeGenerated, Total, baseline, anomalies, score;
  //Join anomalies with Base Data to popalate associated records for investigation - Results sorted by score in descending order 
  TimeSeriesAlerts 
  | join (
      CommonSecurityLog 
  | where isnotempty(DestinationIP) and isnotempty(SourceIP)
  | where TimeGenerated between (startofday(ago(starttime))..startofday(ago(endtime)))
  | summarize HourlyCount = count(), ListOfDestPorts = make_list(DestinationPort)  by SourceIP, DestinationIP,DestinationPort, DeviceVendor, bin(TimeGenerated, 1h)
  ) on TimeGenerated, DeviceVendor | extend PercentTotal = round((HourlyCount / Total) * 100, 3) | sort by score desc 
  | project DeviceVendor ,TimeGenerated, SourceIP, DestinationIP, ListOfDestPorts, HourlyCount, PercentTotal, Total, baseline, score, anomalies
  | extend IPCustomEntity = DestinationIP
