id:
name: Wazuh - Large Number of Web errors from an IP
description: |
  'Identifies instances where Wazuh logged over 400 '403' Web Errors from one IP Address.'
severity: Low
requiredDataConnectors:
  - connectorId: Wazuh
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistance
query: | 

let incidentTime = ago(1d);
CommonSecurityLog
| where DeviceProduct == "Wazuh"
| where Activity contains "Web server 400 error code."
| where Message contains "403"
| where TimeGenerated > incidentTime
| extend CustomHostName=substring(split(DeviceCustomString1,")")[0],1)
| extend CustomIP = SourceIP 
| summarize NumberOfErrors = count(SourceIP) by CustomHostName, CustomIP
| where NumberOfErrors > 400
| sort by NumberOfErrors desc
