id: f8f8d4a5-7d7d-4c5d-9b5c-9c5d7d8f8f8f

name: File download events in the last 7 days

description: |
  This query looks for file download events identified by Microsoft Defender for Cloud Apps. It will require an corresponding app connector in Microsoft Defender for Cloud Apps.
  Reference - https://learn.microsoft.com/defender-cloud-apps/enable-instant-visibility-protection-and-governance-actions-for-your-apps
  Reference - https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Cloud%Apps/file-download-events.yaml
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
- Exfiltration
query: >
  let LookBack = 7d;
  CloudAppEvents
  | where ActionType == "FileDownloaded" and Timestamp > ago(LookBack)
  | extend FileName = RawEventData.SourceFileName, Site = RawEventData.SiteUrl, FileLabel = RawEventData.SensitivityLabelId, SiteLabel = RawEventData.SiteSensitivityLabelId
  | project Timestamp,AccountObjectId,AccountDisplayName,ActionType,Application,FileName,Site,FileLabel,SiteLabel
  entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Guid
        columnName: AccountObjectId
      - identifier: AccountDisplayName
        columnName: AccountDisplayName
  - entityType: File
    fieldMappings:
      - identifier: FileName
        columnName: FileName
version: 1.0.0
