id: 7d2ea43b-90be-4096-a889-cf490ede8025
Function:
  Title: Parser for ibossUrlEvent
  Version: '1.0.0'
  LastUpdated: '2023-08-03'
Category: Microsoft Sentinel Parser
FunctionName: ibossUrlEvent
FunctionAlias: ibossUrlEvent
FunctionParams:
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor == "iboss" and FlexString2 == "URL"
    | extend DeviceCustomNumber1 = coalesce(column_ifexists("FieldDeviceCustomNumber1", long(null)),DeviceCustomNumber1),
             DeviceCustomNumber2 = coalesce(column_ifexists("FieldDeviceCustomNumber2", long(null)),DeviceCustomNumber2)
    | project-rename EventVendor=DeviceVendor
                    , EventProduct=DeviceProduct
                    , EventProductVersion=DeviceVersion
                    , EventResult=DeviceEventClassID
                    , EventResultDetails=FlexNumber1
                    , DvcAction=DeviceAction
                    , RuleName=FlexString1
                    , SrcPortNumber=SourcePort
                    , SrcIpAddr=SourceIP
                    , SrcMacAddr=SourceMACAddress
                    , SrcUsername=SourceUserName
                    , SrcBytes=SentBytes
                    , DstPortNumber=DestinationPort
                    , DstIpAddr=DestinationIP
                    , DstBytes=ReceivedBytes
                    , Domain=DestinationHostName
                    , Url=RequestURL
                    , UrlCategory=DeviceCustomString2
                    , HttpRequestMethod=RequestMethod
                    , HttpUserAgent=RequestClientApplication
                    , FileSHA256=DeviceCustomString3
                    , ThreatName=DeviceCustomString1
                    , MalwareDetected=DeviceCustomNumber1
                    , CNCDetected=DeviceCustomNumber2
    | extend NetworkBytes=SrcBytes+DstBytes
            , EventTime=todatetime(DeviceCustomDate1)
    | project-away DeviceCustom*
                , FlexNumber*
                , FlexString*