{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/vimAuthenticationSigninLogs')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "Authentication ASIM filtering parser for Microsoft Entra ID interactive sign-in logs",
        "category": "ASIM",
        "FunctionAlias": "vimAuthenticationSigninLogs",
        "query": "let FailedReason=datatable(ResultType:string, EventResultDetails:string)[\n  '0', 'Success',\n  '50005', 'Logon violates policy',\n  '50011', 'Logon violates policy', \n  '50020', 'Logon violates policy',\n  '50034', 'No such user or password',\n  '50053', 'User locked',\n  '50055', 'Password expired',\n  '50056', 'Incorrect password',\n  '50057', 'User disabled',\n  '50058', 'Logon violates policy',\n  '50059', 'No such user or password',\n  '50064', 'No such user or password',\n  '50072', 'Logon violates policy',\n  '50074', 'Logon violates policy', \n  '50076', 'Logon violates policy',\n  '50079', 'Logon violates policy',\n  '50105', 'Logon violates policy',\n  '50126', 'No such user or password',\n  '50132', 'Password expired',\n  '50133', 'Password expired',\n  '50144', 'Password expired',\n  '50173', 'Password expired',\n  '51004', 'No such user or password',\n  '53003', 'Logon violates policy',\n  '70008', 'Password expired',\n  '80012', 'Logon violates policy',\n  '500011', 'No such user or password',\n  '700016',  'No such user or password', \n  ];\nlet UserTypeLookup = datatable (UserType:string, TargetUserType:string) [\n  'Guest','Guest', \n  'Member', 'Regular',\n  '',''\n];\nlet TargetAppType = datatable (TargetOriginalAppType: string, TargetAppType: string) [\n  'Mobile Apps and Desktop clients', 'Process',\n  'Browser', 'Service',\n  'Authenticated STMP', 'CSP',\n  'Exchange Active Sync', 'CSP',\n  'Other', 'Other',\n  'Unknown', 'Other'\n];\nlet parser=(\n  starttime: datetime=datetime(null), \n  endtime: datetime=datetime(null), \n  username_has_any: dynamic = dynamic([]),\n  targetappname_has_any: dynamic = dynamic([]),\n  srcipaddr_has_any_prefix: dynamic,\n  srchostname_has_any: dynamic = dynamic([]),\n  eventtype_in: dynamic = dynamic([]),\n  eventresultdetails_in: dynamic = dynamic([]),\n  eventresult: string = '*',\n  disabled: bool=false\n) {\n  SigninLogs\n  | where not(disabled)\n  | where \n    (isnull(starttime) or TimeGenerated >= starttime) \n    and (isnull(endtime) or TimeGenerated <= endtime) \n    and ((array_length(username_has_any) == 0) or UserPrincipalName has_any (username_has_any))\n    and ((array_length(targetappname_has_any) == 0) or ResourceDisplayName has_any (targetappname_has_any))\n    and ((array_length(srcipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(IPAddress, srcipaddr_has_any_prefix)))\n    and (array_length(srchostname_has_any) == 0 or tostring(DeviceDetail.displayName) has_any (srchostname_has_any))\n    and ((array_length(eventtype_in) == 0) or \"Logon\" in~ (eventtype_in))\n  | extend EventResult = iff (ResultType == 0, 'Success', 'Failure')\n  | where (eventresult == \"*\" or (EventResult == eventresult))\n  | lookup FailedReason on ResultType\n  | where (array_length(eventresultdetails_in) == 0 or EventResultDetails in~ (eventresultdetails_in))\n  | extend\n      EventCount = int(1),\n      EventEndTime = TimeGenerated,\n      EventOriginalResultDetails = coalesce(ResultDescription, ResultType),\n      EventProduct = 'Entra ID',\n      EventSchema = 'Authentication',\n      EventSchemaVersion = '0.1.3',\n      EventStartTime = TimeGenerated,\n      EventSubType = 'Interactive',\n      EventType = 'Logon',\n      EventVendor = 'Microsoft',\n      Type = 'SigninLogs',\n      Location = todynamic(LocationDetails),\n      SrcHostname = tostring(DeviceDetail.displayName),\n      SrcDvcId = tostring(DeviceDetail.deviceId),\n      SrcDvcIdType = \"\",\n      SrcIpAddr = IPAddress,\n      SrcDvcOs = tostring(DeviceDetail.operatingSystem),\n      TargetUserIdType = 'AADID',\n      TargetUsernameType = 'UPN',\n      LogonMethod = coalesce(AuthenticationMethodsUsed, AuthenticationRequirement)\n  | extend\n      SrcDvcIdType = iif(isempty(SrcDvcId), \"\", \"MDEId\"),\n      SrcGeoCity = tostring(Location.city),\n      SrcGeoCountry = tostring(Location.countryOrRegion),\n      SrcGeoLatitude = toreal(Location.geoCoordinates.latitude),\n      SrcGeoLongitude = toreal(Location.geoCoordinates.longitude)\n  | project-rename\n      EventOriginalUid = Id,\n      HttpUserAgent    = UserAgent,\n      TargetAppId      = AppId,\n      TargetAppName    = AppDisplayName,\n      TargetSessionId  = CorrelationId,\n      TargetUserId     = UserId,\n      TargetUsername   = UserPrincipalName,\n      TargetOriginalAppType = ClientAppUsed\n  | lookup TargetAppType on TargetOriginalAppType\n  | extend EventUid = column_ifexists(\"_ItemId\", \"\")\n  | lookup UserTypeLookup on UserType\n  // mapping ASimMatchingUsername\n  | extend temp_isMatchTargetUsername=TargetUsername has_any(username_has_any)\n  | extend ASimMatchingUsername = case(\n    array_length(username_has_any) == 0,\n    \"-\",\n    temp_isMatchTargetUsername,\n    \"TargetUsername\",\n    \"No match\"\n  )\n  // ** Aliases\n  | extend \n      Application     = TargetAppName,\n      IpAddr          = SrcIpAddr,\n      Dvc             = EventVendor,\n      LogonTarget     = TargetAppName,\n      User            = TargetUsername\n  | project\n    TimeGenerated,\n    EventSchema,\n    Type,\n    EventVendor,\n    EventProduct,\n    EventCount,\n    EventSchemaVersion,\n    EventResult,\n    EventOriginalResultDetails,\n    EventStartTime,\n    EventEndTime,\n    EventType,\n    Application,\n    IpAddr,\n    SrcDvcId,\n    SrcDvcIdType,\n    SrcHostname,\n    SrcDvcOs,\n    TargetUsernameType,\n    TargetUserIdType,\n    SrcIpAddr,\n    LogonMethod,\n    SrcGeoCity,\n    SrcGeoCountry,\n    SrcGeoLatitude,\n    SrcGeoLongitude,\n    EventOriginalUid,\n    EventUid,\n    HttpUserAgent,\n    TargetSessionId,\n    TargetUserId,\n    TargetUsername,\n    TargetAppId,\n    TargetAppName,\n    TargetAppType,\n    TargetOriginalAppType,\n    TargetUserType,\n    User,\n    LogonTarget,\n    Dvc,\n    ASimMatchingUsername\n};\nparser(\n    starttime=starttime,\n    endtime=endtime,\n    username_has_any=username_has_any,\n    targetappname_has_any=targetappname_has_any,\n    srcipaddr_has_any_prefix=srcipaddr_has_any_prefix,\n    srchostname_has_any=srchostname_has_any,\n    eventtype_in=eventtype_in,\n    eventresultdetails_in=eventresultdetails_in,\n    eventresult=eventresult,\n    disabled=pack\n)",
        "version": 1,
        "functionParameters": "starttime:datetime=datetime(null),endtime:datetime=datetime(null),username_has_any:dynamic=dynamic([]),targetappname_has_any:dynamic=dynamic([]),srcipaddr_has_any_prefix:dynamic=dynamic([]),srchostname_has_any:dynamic=dynamic([]),eventtype_in:dynamic=dynamic([]),eventresultdetails_in:dynamic=dynamic([]),eventresult:string='*',disabled:bool=False"
      }
    }
  ]
}