// Name : Detect password change for global JIT admins
WindowsEvent
| where  Provider == "Microsoft-Windows-Security-Auditing" and (EventID == 4723 or EventID == 4724)
| extend TargetUserName = Data.TargetUserName
| where  TargetUserName contains "[TBD-ADMINISTRATOR_NAME_1]" or TargetUserName contains "[TBD-ADMINISTRATOR_NAME_2]"
| extend AccountCustomEntity = TargetUserName // Entity extraction for user account