// Detect domain global group addition
WindowsEvent
    | where Provider == "Microsoft-Windows-Security-Auditing" and EventId == 4728
    | extend DomainAndName = strcat(EventData.TargetDomainName, "\\" ,EventData.TargetUserName)
    | where (DomainAndName contains "Domain Admins" or DomainAndName contains "[TBD-Domain Security group 1]" or DomainAndName contains "[TBD-Domain Security group 1]")
    | where DomainAndName !contains "[Whitelist TBD-Domain Security group 1]"