// Name : Detect global domain trust removal
WindowsEvent
| where Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4707
| extend   AccountCustomEntity = Data.SubjectUserName // Entity extraction for user account