//Detect Indiscriminate Global Group Addition - Security Group
WindowsEvent
    | where Provider == "Microsoft-Windows-Security-Auditing" and EventId == 4728
    | extend MemberName = EventData.MemberName, MemberSid = EventData.MemberSid, TargetUserName = EventData.TargetUserName
    | where (MemberName contains "Domain Computers" or (MemberSid startswith "S-1-5-21-" and MemberSid endswith "-515")
		or MemberName contains "Domain Users" or (MemberSid startswith "S-1-5-21-" and MemberSid endswith "-513")
		or MemberName contains "Everyone" or MemberSid =~ "S-1-1-0" or MemberName contains "Authenticated Users" or MemberSid =~ "S-1-5-11")
    and not(
		(MemberName contains "Domain Computers" or (MemberSid startswith "S-1-5-21-" and MemberSid endswith "-515") 
			or MemberName contains "Domain Users" 
			or (MemberSid startswith "S-1-5-21-" and MemberSid endswith "-513")
			or MemberName contains "Everyone" 
			or MemberSid =~ "S-1-1-0" 
			or MemberName contains "Authenticated Users" 
			or MemberSid =~ "S-1-5-11")
		and (TargetUserName contains "AD Readers"
			or TargetUserName contains "TBD - Whitelist User 1"
			or TargetUserName contains "TBD - Whitelist User 2")
		)