// Name : Detect global domain trust creation
WindowsEvent
| where   Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4706
| extend  AccountCustomEntity = Data.SubjectUserName // Entity extraction for user account
| extend  HostCustomEntity = Computer // Entity extraction for computer