// Name : Detect global universal group addition
WindowsEvent
| where Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4756
| extend DomainAndName = strcat(Data.TargetDomainName, "\\" ,Data.TargetUserName)
| where  DomainAndName contains "Enterprise Admins" or DomainAndName contains "Schema Admins"
| extend  AccountCustomEntity = Data.TargetUserName // Entity extraction for user account
| extend  HostCustomEntity = Computer // Entity extraction for computer