// Name : Detect global kerberos policy change
WindowsEvent
| where Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4713
| extend  AccountCustomEntity = Data.SubjectUserName // Entity extraction for user account
| extend  HostCustomEntity = Computer // Entity extraction for computer