// Name : Detect Domain controllers local group addition
WindowsEvent
| where  Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4732
| extend TargetUserName = Data.TargetUserName, TargetDomainName = Data.TargetDomainName, SubjectUserName = Data.SubjectUserName
| where  (TargetDomainName =~ "Builtin" and TargetUserName =~ "Administrators")
| where  Computer contains "[TBD-DC_1]"     or "[TBD-DC_2]" // list of domain controllers
| where  not(SubjectUserName in ("APPROVED_USER_1", "APPROVED_USER_2", "APPROVED_USER_3"))
| extend  AccountCustomEntity = TargetUserName // Entity extraction for user account
| extend  HostCustomEntity = Computer // Entity extraction for computer