//Type 9 Logon (run as) - Local Administrator
WindowsEvent
    | where Provider == "Microsoft-Windows-Security-Auditing" and EventId == 4624
    | extend   TargetUserName = EventData.TargetUserName, LogonType = EventData.LogonType
    | where LogonType == "9"
    | where TargetUserName =~ "[TBD - Administrator 1]" or TargetUserName =~ "[TBD - Administrator 2]"