// Name : Detect Member server Cobalt Strike
// Description : Cobalt Strike detected on member server
WindowsEvent
| where Provider == "Service Control Manager" and EventID == 7045
| extend   ServiceName = Data.ServiceName
| where ServiceName contains "%COMSPEC%"
| extend  HostCustomEntity = Computer // Entity extraction for computer
| extend  AccountCustomEntity = Data.SubjectUserName // Entity extraction for user account