// Name : Detect Member server audit log cleared
// Description : Audit log was cleared on member server
WindowsEvent
| where Provider == "Microsoft-Windows-Eventlog" and EventID == 1102
| extend  HostCustomEntity = Computer // Entity extraction for computer
| extend  AccountCustomEntity = Data.SubjectUserName // Entity extraction for user account