//Global - User Account Created but not machine account
WindowsEvent
    | where Provider == "Microsoft-Windows-Security-Auditing" and EventId == 4720
    | extend SubjectUserName = EventData.SubjectUserName, TargetUserName = EventData.TargetUserName
    | where not(SubjectUserName endswith "[TBD subject user pattern 1]")
    | where not(TargetUserName =~ "[TBD targert user pattern 1]")
    | where not(SubjectUserName =~ "[TBD subject user pattern 2]" and TargetUserName startswith "$")    