//'DDID 1293: SIM-00309: Process Creates injecting into memory - IOMemoryStream', folder = @'DetectionFunctionBuildout/WEC/Production/Member Server')
WindowsEvent
    | where Provider == "Microsoft-Windows-Security-Auditing" and EventId == 4688
    | extend  CommandLine = EventData.CommandLine,  NewProcessName = EventData.NewProcessName
    | where CommandLine contains "IO.MemoryStream"
    | where not(CommandLine =~ [TBD Whitelist commandline] or Computer contains "[TBD whitelist computer name] or NewProcessName contains [TBD whitelist process name])
    