// Name : Detect WannaCrypt process created
WindowsEvent
 | where Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4688
| extend   NewProcessName = Data.NewProcessName, CommandLine = Data.CommandLine
| where CommandLine contains "dllhost.dat" or CommandLine contains "perfc.dat" or (CommandLine contains "schtasks" and CommandLine contains "\\system32\\shutdown.exe /r /f")		
| extend  HostCustomEntity = Computer // Entity extraction for computer
| extend  AccountCustomEntity = Data.TargetUserName // Entity extraction for user account