// Name : Detect WannaCrypt service installed
WindowsEvent
| where   Provider == "Service Control Manager" and EventID == 7045
| where   Data.ServiceName == "Microsoft Security Center (2.0) Service"		
| extend  HostCustomEntity = Computer // Entity extraction for computer
| extend  AccountCustomEntity = Data.TargetUserName // Entity extraction for user account