// Name : Detect WannaCrypt process created
WindowsEvent
| where Provider == "Microsoft-Windows-Security-Auditing" and EventID == 4688
| extend CommandLine = Data.CommandLine, NewProcessName = Data.NewProcessName
| where CommandLine !contains "WATSON"
| where CommandLine contains "mssecsvc.exe" or CommandLine contains "tasksche.exe"| extend  HostCustomEntity = Computer // Entity extraction for computer
| extend  HostCustomEntity = Computer // Entity extraction for computer
| extend  AccountCustomEntity = Data.TargetUserName // Entity extraction for user account