Id: 588f5d9f-3380-4eff-9983-e61d62fdd172
DisplayName: Office Activity IP Address by Account
Description: Summary of Accounts for a given ClientIP on Office Activity data (set time range to +-12h when running the query)
InputEntityType: Ip
InputFields:
  - Address
OutputEntityTypes:
  - Account
QueryPeriodBefore: 12h
QueryPeriodAfter: 12h
DataSource:
  - OfficeActivity
Tactics:
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let GetAllAccountByIP = (v_IP_Address:string){
  OfficeActivity 
  | where ClientIP contains v_IP_Address
  | extend info = pack('ClientIP', ClientIP, 'UserType', UserType, 'Operation', Operation, 'OfficeWorkload', OfficeWorkload, 'ResultStatus', ResultStatus)
  | summarize min(TimeGenerated), max(TimeGenerated), count(), Account_Aux_info = makeset(info) by UserId
  | project StartTimeUtc = min_TimeGenerated, EndTimeUtc = max_TimeGenerated, UserId, count_, Account_Aux_info
  | project-rename Account_UnstructuredName=UserId
  | top 10 by count_ desc nulls last
  };
  // change <Address> value below
  GetAllAccountByIP('<Address>')