// Id: 7f3989bf-1558-4d3c-bb5e-e17ac2a67a87
// DisplayName: Office Activity Account logons from IP
// Description: Summary of IP addresses for logins based on Office Activity data (set time range to +-12h when running the query)
// InputEntityType: Account
// InputFields: [Name]
// OutputEntityTypes: [Ip]
// QueryPeriodBefore: 12h
// QueryPeriodAfter: 12h
// DataSource: #OfficeActivity
// Tactics: #Persistence, #Discovery, #LateralMovement, #Collection

let GetAllIPbyAccount = (v_Account_Name:string){
OfficeActivity 
| where UserId contains v_Account_Name
| summarize min(TimeGenerated), max(TimeGenerated) by ClientIP
| project StartTimeUtc = min_TimeGenerated, EndTimeUtc = max_TimeGenerated, ClientIP
| project-rename IP_Address=ClientIP
| top 10 by StartTimeUtc desc nulls last 
};
// change <Name> value below
GetAllIPbyAccount ('<Name>')