id: 260f16fc-4734-4635-babd-ba3c860f328b
displayName: Zscaler Internet Access DNS events IP Summary
description: |
  'This summary rule aggregates DNS events from Zscaler Internet Access devices, providing hourly insights into event count by event result details, dns query, source username, source and destination IP addresses .'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: ZscalerDNSEventsSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor == "Zscaler"
  | where DeviceProduct == "NSSDNSlog"
  | extend DeviceCustomString6 = iff (DeviceCustomString6 matches regex @'^([A-Z_]+)$', DeviceCustomString6, 'NOERROR')
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count() by SourceIP, SourceUserName, DestinationIP, DnsQuery=DeviceCustomString5, EventResultDetails=DeviceCustomString6, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - DNS" ]