{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "author": "VirtualMetric",
    "comments": "Solution template for VirtualMetric DataStream"
  },
  "parameters": {
    "location": {
      "type": "string",
      "minLength": 1,
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
      }
    },
    "workspace-location": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "[concat('Region to deploy solution resources -- separate from location selection',parameters('location'))]"
      }
    },
    "workspace": {
      "defaultValue": "",
      "type": "string",
      "metadata": {
        "description": "Workspace name for Log Analytics where Microsoft Sentinel is setup"
      }
    }
  },
  "variables": {
    "_solutionName": "VirtualMetric DataStream",
    "_solutionVersion": "3.0.0",
    "solutionId": "virtualmetric.virtualmetric-datastream-for-microsoft-sentinel",
    "_solutionId": "[variables('solutionId')]",
    "uiConfigId1": "VirtualMetricMSSentinelConnector",
    "_uiConfigId1": "[variables('uiConfigId1')]",
    "dataConnectorContentId1": "VirtualMetricMSSentinelConnector",
    "_dataConnectorContentId1": "[variables('dataConnectorContentId1')]",
    "dataConnectorId1": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectors', variables('_dataConnectorContentId1'))]",
    "_dataConnectorId1": "[variables('dataConnectorId1')]",
    "dataConnectorTemplateSpecName1": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat(parameters('workspace'),'-dc-',uniquestring(variables('_dataConnectorContentId1'))))]",
    "dataConnectorVersion1": "1.0.0",
    "_dataConnectorcontentProductId1": "[concat(take(variables('_solutionId'),50),'-','dc','-', uniqueString(concat(variables('_solutionId'),'-','DataConnector','-',variables('_dataConnectorContentId1'),'-', variables('dataConnectorVersion1'))))]",
    "_solutioncontentProductId": "[concat(take(variables('_solutionId'),50),'-','sl','-', uniqueString(concat(variables('_solutionId'),'-','Solution','-',variables('_solutionId'),'-', variables('_solutionVersion'))))]"
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentTemplates",
      "apiVersion": "2023-04-01-preview",
      "name": "[variables('dataConnectorTemplateSpecName1')]",
      "location": "[parameters('workspace-location')]",
      "dependsOn": [
        "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/contentPackages', variables('_solutionId'))]"
      ],
      "properties": {
        "description": "VirtualMetric DataStream data connector with template version 3.0.0",
        "mainTemplate": {
          "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
          "contentVersion": "[variables('dataConnectorVersion1')]",
          "parameters": {},
          "variables": {},
          "resources": [
            {
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',variables('_dataConnectorContentId1'))]",
              "apiVersion": "2021-03-01-preview",
              "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectors",
              "location": "[parameters('workspace-location')]",
              "kind": "GenericUI",
              "properties": {
                "connectorUiConfig": {
                  "id": "[variables('_uiConfigId1')]",
                  "title": "VirtualMetric DataStream for Microsoft Sentinel",
                  "publisher": "VirtualMetric",
                  "descriptionMarkdown": "VirtualMetric DataStream connector deploys Data Collection Rules to ingest security telemetry into Microsoft Sentinel.",
                  "graphQueries": [
                    {
                      "metricName": "Total CommonSecurityLog Events",
                      "legend": "CommonSecurityLog",
                      "baseQuery": "CommonSecurityLog"
                    },
                    {
                      "metricName": "Total SecurityEvent Events",
                      "legend": "SecurityEvent",
                      "baseQuery": "SecurityEvent"
                    },
                    {
                      "metricName": "Total Event Events",
                      "legend": "Event",
                      "baseQuery": "Event"
                    },
                    {
                      "metricName": "Total Syslog Events",
                      "legend": "Syslog",
                      "baseQuery": "Syslog"
                    },
                    {
                      "metricName": "Total WindowsEvent Events",
                      "legend": "WindowsEvent",
                      "baseQuery": "WindowsEvent"
                    },
                    {
                      "metricName": "Total ASimNetworkSessionLogs Events",
                      "legend": "ASimNetworkSessionLogs",
                      "baseQuery": "ASimNetworkSessionLogs"
                    },
                    {
                      "metricName": "Total ASimDnsActivityLogs Events",
                      "legend": "ASimDnsActivityLogs",
                      "baseQuery": "ASimDnsActivityLogs"
                    },
                    {
                      "metricName": "Total ASimWebSessionLogs Events",
                      "legend": "ASimWebSessionLogs",
                      "baseQuery": "ASimWebSessionLogs"
                    },
                    {
                      "metricName": "Total ASimAuthenticationLogs Events",
                      "legend": "ASimAuthenticationLogs",
                      "baseQuery": "ASimAuthenticationLogs"
                    },
                    {
                      "metricName": "Total ASimProcessEventLogs Events",
                      "legend": "ASimProcessEventLogs",
                      "baseQuery": "ASimProcessEventLogs"
                    },
                    {
                      "metricName": "Total ASimFileEventLogs Events",
                      "legend": "ASimFileEventLogs",
                      "baseQuery": "ASimFileEventLogs"
                    },
                    {
                      "metricName": "Total ASimRegistryEventLogs Events",
                      "legend": "ASimRegistryEventLogs",
                      "baseQuery": "ASimRegistryEventLogs"
                    },
                    {
                      "metricName": "Total ASimAuditEventLogs Events",
                      "legend": "ASimAuditEventLogs",
                      "baseQuery": "ASimAuditEventLogs"
                    },
                    {
                      "metricName": "Total ASimUserManagementLogs Events",
                      "legend": "ASimUserManagementLogs",
                      "baseQuery": "ASimUserManagementLogs"
                    },
                    {
                      "metricName": "Total ASimDhcpEventLogs Events",
                      "legend": "ASimDhcpEventLogs",
                      "baseQuery": "ASimDhcpEventLogs"
                    }
                  ],
                  "sampleQueries": [
                    {
                      "description": "Get sample CommonSecurityLog events from the last 24 hours",
                      "query": "CommonSecurityLog\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample SecurityEvent events from the last 24 hours",
                      "query": "SecurityEvent\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample Event events from the last 24 hours",
                      "query": "Event\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample Syslog events from the last 24 hours",
                      "query": "Syslog\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample WindowsEvent events from the last 24 hours",
                      "query": "WindowsEvent\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimNetworkSessionLogs events from the last 24 hours",
                      "query": "ASimNetworkSessionLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimDnsActivityLogs events from the last 24 hours",
                      "query": "ASimDnsActivityLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimWebSessionLogs events from the last 24 hours",
                      "query": "ASimWebSessionLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimAuthenticationLogs events from the last 24 hours",
                      "query": "ASimAuthenticationLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimProcessEventLogs events from the last 24 hours",
                      "query": "ASimProcessEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimFileEventLogs events from the last 24 hours",
                      "query": "ASimFileEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimRegistryEventLogs events from the last 24 hours",
                      "query": "ASimRegistryEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimAuditEventLogs events from the last 24 hours",
                      "query": "ASimAuditEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimUserManagementLogs events from the last 24 hours",
                      "query": "ASimUserManagementLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    },
                    {
                      "description": "Get sample ASimDhcpEventLogs events from the last 24 hours",
                      "query": "ASimDhcpEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
                    }
                  ],
                  "dataTypes": [
                    {
                      "name": "CommonSecurityLog",
                      "lastDataReceivedQuery": "CommonSecurityLog\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "SecurityEvent",
                      "lastDataReceivedQuery": "SecurityEvent\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "Event",
                      "lastDataReceivedQuery": "Event\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "Syslog",
                      "lastDataReceivedQuery": "Syslog\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "WindowsEvent",
                      "lastDataReceivedQuery": "WindowsEvent\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimNetworkSessionLogs",
                      "lastDataReceivedQuery": "ASimNetworkSessionLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimDnsActivityLogs",
                      "lastDataReceivedQuery": "ASimDnsActivityLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimWebSessionLogs",
                      "lastDataReceivedQuery": "ASimWebSessionLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimAuthenticationLogs",
                      "lastDataReceivedQuery": "ASimAuthenticationLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimProcessEventLogs",
                      "lastDataReceivedQuery": "ASimProcessEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimFileEventLogs",
                      "lastDataReceivedQuery": "ASimFileEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimRegistryEventLogs",
                      "lastDataReceivedQuery": "ASimRegistryEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimAuditEventLogs",
                      "lastDataReceivedQuery": "ASimAuditEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimUserManagementLogs",
                      "lastDataReceivedQuery": "ASimUserManagementLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    },
                    {
                      "name": "ASimDhcpEventLogs",
                      "lastDataReceivedQuery": "ASimDhcpEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
                    }
                  ],
                  "availability": {
                    "isPreview": false
                  },
                  "permissions": [
                    {
                      "resource": [
                        {
                          "type": "Workspace",
                          "permissions": [
                            "read",
                            "write"
                          ]
                        }
                      ]
                    }
                  ],
                  "instructionSteps": [
                    {
                      "description": "Configure the VirtualMetric DataStream for Microsoft Sentinel to send data.",
                      "instructions": [
                        {
                          "type": "InstructionStepsGroup",
                          "parameters": {
                            "enable": true,
                            "instructionSteps": [
                              {
                                "title": "Register Application in Microsoft Entra ID (Optional)",
                                "description": "**Choose your authentication method:**\n\n**Option A: Use Azure Managed Identity (Recommended)**\n- Skip this step if you plan to use Azure Managed Identity for authentication.\n- Azure Managed Identity provides a more secure authentication method without managing credentials.\n\n**Option B: Register a Service Principal Application**\n\n1. **Open the [Microsoft Entra ID page](https://entra.microsoft.com/)**:\n   - Click the provided link to open the **Microsoft Entra ID** registration page in a new tab.\n   - Ensure you are logged in with an account that has **Application Administrator** or **Global Administrator** permissions.\n\n2. **Create a New Application**:\n   - In the **Microsoft Entra ID portal**, select **App registrations** from the left-hand navigation.\n   - Click on **+ New registration**.\n   - Fill out the following fields:\n     - **Name**: Enter a descriptive name for the app (e.g., \"VirtualMetric ASIM Connector\").\n     - **Supported account types**: Choose **Accounts in this organizational directory only** (Single tenant).\n     - **Redirect URI**: Leave this blank.\n   - Click **Register** to create the application.\n\n3. **Copy Application and Tenant IDs**:\n   - Once the app is registered, note the **Application (client) ID** and **Directory (tenant) ID** from the **Overview** page. You'll need these for VirtualMetric DataStream configuration.\n\n4. **Create a Client Secret**:\n   - In the **Certificates & secrets** section, click **+ New client secret**.\n   - Add a description (e.g., 'VirtualMetric ASIM Secret') and set an appropriate expiration period.\n   - Click **Add**.\n   - **Copy the client secret value immediately**, as it will not be shown again. Store this securely for VirtualMetric DataStream configuration."
                              },
                              {
                                "title": "Assign Required Permissions",
                                "description": "Assign the **Monitoring Metrics Publisher** role to your chosen authentication method (Service Principal or Managed Identity).\n\n**For Service Principal (if you completed Step 1):**\n\n1. **Navigate to Your Resource Group**:\n   - Open the **Azure Portal** and navigate to the **Resource Group** that contains your **Log Analytics Workspace** and where **Data Collection Rules (DCRs)** will be deployed.\n\n2. **Assign the Role**:\n   - In the **Resource Group**, click on **Access control (IAM)** from the left-hand menu.\n   - Click **+ Add** and select **Add role assignment**.\n   - In the **Role** tab, search for and select **Monitoring Metrics Publisher**.\n   - Click **Next** to go to the **Members** tab.\n   - Under **Assign access to**, select **User, group, or service principal**.\n   - Click **+ Select members** and search for your registered application by name or client ID.\n   - Select your application and click **Select**.\n   - Click **Review + assign** twice to complete the assignment.\n\n**For Azure Managed Identity:**\n\n1. **Create or Identify Your Managed Identity**:\n   - If using **System-assigned Managed Identity**: Enable it on your Azure resource (VM, App Service, etc.).\n   - If using **User-assigned Managed Identity**: Create one in your resource group if it doesn't exist.\n\n2. **Assign the Role to Managed Identity**:\n   - Follow the same steps as above, but in the **Members** tab:\n   - Under **Assign access to**, select **Managed identity**.\n   - Click **+ Select members** and choose the appropriate managed identity type and select your identity.\n   - Click **Select**, then **Review + assign** twice to complete.\n\n**Required Permission Scope:**\nThe **Monitoring Metrics Publisher** role provides the necessary permissions to:\n- Write data to Data Collection Endpoints (DCE)\n- Send telemetry through Data Collection Rules (DCR)\n- Access Log Analytics workspace for ASIM table ingestion"
                              },
                              {
                                "title": "Deploy Azure Infrastructure",
                                "description": "Deploy the required Data Collection Endpoint (DCE) and Data Collection Rules (DCR) for Microsoft Sentinel tables using our ARM template.\n\n1. **Retrieve the Workspace ID**:\n   - Navigate to your **Log Analytics Workspace** in the **Azure Portal**.\n   - In the **Overview** section, locate the **Workspace ID** field under **Workspace details**.\n   - **Copy the Workspace ID** and keep it handy for the deployment.\n\n2. **Deploy to Azure**:\n   - Click the Deploy to Azure button below to automatically deploy the required infrastructure:\n   - [![Deploy to Azure](https://aka.ms/deploytoazurebutton)](https://portal.azure.com/#create/Microsoft.Template/uri/https%3A%2F%2Fraw.githubusercontent.com%2Fvirtualmetric%2FAzure-Sentinel%2Fmain%2FSolutions%2FVirtualMetric-ASIM%2FData%2520Connectors%2FDeployToAzure.json)\n   - This will take you directly to the Azure portal to start the deployment.\n\n3. **Configure Deployment Parameters**:\n   - On the custom deployment page, ensure you're deploying to the correct **subscription** and **resource group**.\n   - Fill in the required parameters:\n     - **Workspace Name**: Enter your Log Analytics workspace name\n     - **Workspace ID**: Enter the Workspace ID from step 1\n     - **Workspace Location**: Select the region where your workspace is located\n     - **DCE Name**: Provide a name for the Data Collection Endpoint (e.g., \"VirtualMetric-ASIM-DCE\")\n\n4. **Complete the Deployment**:\n   - Click **Review + create** to validate the template.\n   - Review the parameters and click **Create** to deploy the resources.\n   - Wait for the deployment to complete (typically takes 2-5 minutes).\n\n5. **Verify Deployed Resources**:\n   - After deployment, verify the following resources were created:\n     - **Data Collection Endpoint (DCE)**: Check **Azure Portal > Monitor > Data Collection Endpoints**\n     - **Data Collection Rules (DCRs)**: Check **Azure Portal > Monitor > Data Collection Rules**\n   - **Copy the DCE Logs Ingestion URI** from the DCE **Overview** page (format: `https://<dce-name>.<region>.ingest.monitor.azure.com`)\n   - For each DCR, note the **Immutable ID** from the **Overview** page - you'll need these for VirtualMetric DataStream configuration."
                              },
                              {
                                "title": "Configure VirtualMetric DataStream Integration",
                                "description": "Set up VirtualMetric DataStream to send security telemetry to Microsoft Sentinel tables.\n\n1. **Access VirtualMetric DataStream Configuration**:\n   - Log into your **VirtualMetric DataStream** management console.\n   - Navigate to **Connectors** or **Data Sources** section.\n   - Select **Microsoft Sentinel ASIM** connector.\n\n2. **Configure Authentication** (choose based on Step 1):\n   \n   **For Service Principal Authentication:**\n   - **Tenant ID**: Enter the Directory (tenant) ID from Step 1\n   - **Client ID**: Enter the Application (client) ID from Step 1\n   - **Client Secret**: Enter the client secret value from Step 1\n   \n   **For Azure Managed Identity:**\n   - **Authentication Method**: Select \"Managed Identity\"\n   - **Managed Identity Type**: Choose System-assigned or User-assigned\n   - **Managed Identity Client ID**: (Only for user-assigned, leave blank for system-assigned)\n\n3. **Configure Data Collection Settings**:\n   - **Data Collection Endpoint URI**: Enter the DCE Logs Ingestion URI from Step 3\n   - **Workspace ID**: Enter your Log Analytics Workspace ID\n   - **Subscription ID**: Enter your Azure subscription ID\n   - **Resource Group**: Enter the resource group name containing your workspace\n\n4. **Map Data Sources to ASIM Tables**:\n   - Configure which security data sources should map to specific ASIM tables:\n     - **Network logs** → ASimNetworkSessionLogs\n     - **DNS logs** → ASimDnsActivityLogs\n     - **Web proxy logs** → ASimWebSessionLogs\n     - **Authentication logs** → ASimAuthenticationLogs\n     - **Process events** → ASimProcessEventLogs\n     - **File events** → ASimFileEventLogs\n     - **Registry events** → ASimRegistryEventLogs\n     - **Audit events** → ASimAuditEventLogs\n     - **User management** → ASimUserManagementLogs\n     - **DHCP events** → ASimDhcpEventLogs\n\n5. **Test the Connection**:\n   - Use the **Test Connection** feature in VirtualMetric DataStream to verify:\n     - Authentication is successful\n     - DCE endpoint is reachable\n     - Data can be sent to the configured ASIM tables\n\n6. **Enable Data Flow**:\n   - **Save** the configuration\n   - **Enable** the connector to start sending data\n   - Monitor the connector status to ensure data is flowing successfully\n\n7. **Verify Data Ingestion in Microsoft Sentinel**:\n   - Return to your **Log Analytics Workspace**\n   - Run sample queries on the ASIM tables to confirm data is being received:\n     ```kql\n     ASimNetworkSessionLogs\n     | where TimeGenerated > ago(1h)\n     | take 10\n     ```\n   - Check the **Microsoft Sentinel Overview** dashboard for new data sources and event counts."
                              }
                            ]
                          }
                        }
                      ],
                      "title": "Configure VirtualMetric DataStream for Microsoft Sentinel"
                    }
                  ]
                }
              }
            },
            {
              "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
              "apiVersion": "2023-04-01-preview",
              "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('DataConnector-', last(split(variables('_dataConnectorId1'),'/'))))]",
              "properties": {
                "parentId": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectors', variables('_dataConnectorContentId1'))]",
                "contentId": "[variables('_dataConnectorContentId1')]",
                "kind": "DataConnector",
                "version": "[variables('dataConnectorVersion1')]",
                "source": {
                  "kind": "Solution",
                  "name": "VirtualMetric DataStream",
                  "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                  "name": "VirtualMetric"
                },
                "support": {
                  "name": "VirtualMetric",
                  "email": "support@virtualmetric.com",
                  "tier": "Partner",
                  "link": "https://support.virtualmetric.com"
                }
              }
            }
          ]
        },
        "packageKind": "Solution",
        "packageVersion": "[variables('_solutionVersion')]",
        "packageName": "[variables('_solutionName')]",
        "packageId": "[variables('_solutionId')]",
        "contentSchemaVersion": "3.0.0",
        "contentId": "[variables('_dataConnectorContentId1')]",
        "contentKind": "DataConnector",
        "displayName": "VirtualMetric DataStream for Microsoft Sentinel",
        "contentProductId": "[variables('_dataConnectorcontentProductId1')]",
        "id": "[variables('_dataConnectorcontentProductId1')]",
        "version": "[variables('dataConnectorVersion1')]"
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
      "apiVersion": "2023-04-01-preview",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',concat('DataConnector-', last(split(variables('_dataConnectorId1'),'/'))))]",
      "dependsOn": [
        "[variables('_dataConnectorId1')]"
      ],
      "location": "[parameters('workspace-location')]",
      "properties": {
        "parentId": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectors', variables('_dataConnectorContentId1'))]",
        "contentId": "[variables('_dataConnectorContentId1')]",
        "kind": "DataConnector",
        "version": "[variables('dataConnectorVersion1')]",
        "source": {
          "kind": "Solution",
          "name": "VirtualMetric DataStream",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "VirtualMetric"
        },
        "support": {
          "name": "VirtualMetric",
          "email": "support@virtualmetric.com",
          "tier": "Partner",
          "link": "https://support.virtualmetric.com"
        }
      }
    },
    {
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',variables('_dataConnectorContentId1'))]",
      "apiVersion": "2021-03-01-preview",
      "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectors",
      "location": "[parameters('workspace-location')]",
      "kind": "GenericUI",
      "properties": {
        "connectorUiConfig": {
          "title": "VirtualMetric DataStream for Microsoft Sentinel",
          "publisher": "VirtualMetric",
          "descriptionMarkdown": "VirtualMetric DataStream connector deploys Data Collection Rules to ingest security telemetry into Microsoft Sentinel.",
          "graphQueries": [
            {
              "metricName": "Total CommonSecurityLog Events",
              "legend": "CommonSecurityLog",
              "baseQuery": "CommonSecurityLog"
            },
            {
              "metricName": "Total SecurityEvent Events",
              "legend": "SecurityEvent",
              "baseQuery": "SecurityEvent"
            },
            {
              "metricName": "Total Event Events",
              "legend": "Event",
              "baseQuery": "Event"
            },
            {
              "metricName": "Total Syslog Events",
              "legend": "Syslog",
              "baseQuery": "Syslog"
            },
            {
              "metricName": "Total WindowsEvent Events",
              "legend": "WindowsEvent",
              "baseQuery": "WindowsEvent"
            },
            {
              "metricName": "Total ASimNetworkSessionLogs Events",
              "legend": "ASimNetworkSessionLogs",
              "baseQuery": "ASimNetworkSessionLogs"
            },
            {
              "metricName": "Total ASimDnsActivityLogs Events",
              "legend": "ASimDnsActivityLogs",
              "baseQuery": "ASimDnsActivityLogs"
            },
            {
              "metricName": "Total ASimWebSessionLogs Events",
              "legend": "ASimWebSessionLogs",
              "baseQuery": "ASimWebSessionLogs"
            },
            {
              "metricName": "Total ASimAuthenticationLogs Events",
              "legend": "ASimAuthenticationLogs",
              "baseQuery": "ASimAuthenticationLogs"
            },
            {
              "metricName": "Total ASimProcessEventLogs Events",
              "legend": "ASimProcessEventLogs",
              "baseQuery": "ASimProcessEventLogs"
            },
            {
              "metricName": "Total ASimFileEventLogs Events",
              "legend": "ASimFileEventLogs",
              "baseQuery": "ASimFileEventLogs"
            },
            {
              "metricName": "Total ASimRegistryEventLogs Events",
              "legend": "ASimRegistryEventLogs",
              "baseQuery": "ASimRegistryEventLogs"
            },
            {
              "metricName": "Total ASimAuditEventLogs Events",
              "legend": "ASimAuditEventLogs",
              "baseQuery": "ASimAuditEventLogs"
            },
            {
              "metricName": "Total ASimUserManagementLogs Events",
              "legend": "ASimUserManagementLogs",
              "baseQuery": "ASimUserManagementLogs"
            },
            {
              "metricName": "Total ASimDhcpEventLogs Events",
              "legend": "ASimDhcpEventLogs",
              "baseQuery": "ASimDhcpEventLogs"
            }
          ],
          "dataTypes": [
            {
              "name": "CommonSecurityLog",
              "lastDataReceivedQuery": "CommonSecurityLog\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "SecurityEvent",
              "lastDataReceivedQuery": "SecurityEvent\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "Event",
              "lastDataReceivedQuery": "Event\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "Syslog",
              "lastDataReceivedQuery": "Syslog\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "WindowsEvent",
              "lastDataReceivedQuery": "WindowsEvent\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimNetworkSessionLogs",
              "lastDataReceivedQuery": "ASimNetworkSessionLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimDnsActivityLogs",
              "lastDataReceivedQuery": "ASimDnsActivityLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimWebSessionLogs",
              "lastDataReceivedQuery": "ASimWebSessionLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimAuthenticationLogs",
              "lastDataReceivedQuery": "ASimAuthenticationLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimProcessEventLogs",
              "lastDataReceivedQuery": "ASimProcessEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimFileEventLogs",
              "lastDataReceivedQuery": "ASimFileEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimRegistryEventLogs",
              "lastDataReceivedQuery": "ASimRegistryEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimAuditEventLogs",
              "lastDataReceivedQuery": "ASimAuditEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimUserManagementLogs",
              "lastDataReceivedQuery": "ASimUserManagementLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            },
            {
              "name": "ASimDhcpEventLogs",
              "lastDataReceivedQuery": "ASimDhcpEventLogs\n| where TimeGenerated > ago(7d)\n| summarize Time = max(TimeGenerated)\n| where isnotempty(Time)"
            }
          ],
          "sampleQueries": [
            {
              "description": "Get sample CommonSecurityLog events from the last 24 hours",
              "query": "CommonSecurityLog\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample SecurityEvent events from the last 24 hours",
              "query": "SecurityEvent\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample Event events from the last 24 hours",
              "query": "Event\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample Syslog events from the last 24 hours",
              "query": "Syslog\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample WindowsEvent events from the last 24 hours",
              "query": "WindowsEvent\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimNetworkSessionLogs events from the last 24 hours",
              "query": "ASimNetworkSessionLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimDnsActivityLogs events from the last 24 hours",
              "query": "ASimDnsActivityLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimWebSessionLogs events from the last 24 hours",
              "query": "ASimWebSessionLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimAuthenticationLogs events from the last 24 hours",
              "query": "ASimAuthenticationLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimProcessEventLogs events from the last 24 hours",
              "query": "ASimProcessEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimFileEventLogs events from the last 24 hours",
              "query": "ASimFileEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimRegistryEventLogs events from the last 24 hours",
              "query": "ASimRegistryEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimAuditEventLogs events from the last 24 hours",
              "query": "ASimAuditEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimUserManagementLogs events from the last 24 hours",
              "query": "ASimUserManagementLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            },
            {
              "description": "Get sample ASimDhcpEventLogs events from the last 24 hours",
              "query": "ASimDhcpEventLogs\n| where TimeGenerated > ago(24h)\n| take 10"
            }
          ],
          "availability": {
            "isPreview": false
          },
          "permissions": [
            {
              "resource": [
                {
                  "type": "Workspace",
                  "permissions": [
                    "read",
                    "write"
                  ]
                }
              ]
            }
          ],
          "instructionSteps": [
            {
              "description": "Configure the VirtualMetric DataStream for Microsoft Sentinel to send data.",
              "instructions": [
                {
                  "type": "InstructionStepsGroup",
                  "parameters": {
                    "enable": true,
                    "instructionSteps": [
                      {
                        "title": "Register Application in Microsoft Entra ID (Optional)",
                        "description": "**Choose your authentication method:**\n\n**Option A: Use Azure Managed Identity (Recommended)**\n- Skip this step if you plan to use Azure Managed Identity for authentication.\n- Azure Managed Identity provides a more secure authentication method without managing credentials.\n\n**Option B: Register a Service Principal Application**\n\n1. **Open the [Microsoft Entra ID page](https://entra.microsoft.com/)**:\n   - Click the provided link to open the **Microsoft Entra ID** registration page in a new tab.\n   - Ensure you are logged in with an account that has **Application Administrator** or **Global Administrator** permissions.\n\n2. **Create a New Application**:\n   - In the **Microsoft Entra ID portal**, select **App registrations** from the left-hand navigation.\n   - Click on **+ New registration**.\n   - Fill out the following fields:\n     - **Name**: Enter a descriptive name for the app (e.g., \"VirtualMetric ASIM Connector\").\n     - **Supported account types**: Choose **Accounts in this organizational directory only** (Single tenant).\n     - **Redirect URI**: Leave this blank.\n   - Click **Register** to create the application.\n\n3. **Copy Application and Tenant IDs**:\n   - Once the app is registered, note the **Application (client) ID** and **Directory (tenant) ID** from the **Overview** page. You'll need these for VirtualMetric DataStream configuration.\n\n4. **Create a Client Secret**:\n   - In the **Certificates & secrets** section, click **+ New client secret**.\n   - Add a description (e.g., 'VirtualMetric ASIM Secret') and set an appropriate expiration period.\n   - Click **Add**.\n   - **Copy the client secret value immediately**, as it will not be shown again. Store this securely for VirtualMetric DataStream configuration."
                      },
                      {
                        "title": "Assign Required Permissions",
                        "description": "Assign the **Monitoring Metrics Publisher** role to your chosen authentication method (Service Principal or Managed Identity).\n\n**For Service Principal (if you completed Step 1):**\n\n1. **Navigate to Your Resource Group**:\n   - Open the **Azure Portal** and navigate to the **Resource Group** that contains your **Log Analytics Workspace** and where **Data Collection Rules (DCRs)** will be deployed.\n\n2. **Assign the Role**:\n   - In the **Resource Group**, click on **Access control (IAM)** from the left-hand menu.\n   - Click **+ Add** and select **Add role assignment**.\n   - In the **Role** tab, search for and select **Monitoring Metrics Publisher**.\n   - Click **Next** to go to the **Members** tab.\n   - Under **Assign access to**, select **User, group, or service principal**.\n   - Click **+ Select members** and search for your registered application by name or client ID.\n   - Select your application and click **Select**.\n   - Click **Review + assign** twice to complete the assignment.\n\n**For Azure Managed Identity:**\n\n1. **Create or Identify Your Managed Identity**:\n   - If using **System-assigned Managed Identity**: Enable it on your Azure resource (VM, App Service, etc.).\n   - If using **User-assigned Managed Identity**: Create one in your resource group if it doesn't exist.\n\n2. **Assign the Role to Managed Identity**:\n   - Follow the same steps as above, but in the **Members** tab:\n   - Under **Assign access to**, select **Managed identity**.\n   - Click **+ Select members** and choose the appropriate managed identity type and select your identity.\n   - Click **Select**, then **Review + assign** twice to complete.\n\n**Required Permission Scope:**\nThe **Monitoring Metrics Publisher** role provides the necessary permissions to:\n- Write data to Data Collection Endpoints (DCE)\n- Send telemetry through Data Collection Rules (DCR)\n- Access Log Analytics workspace for ASIM table ingestion"
                      },
                      {
                        "title": "Deploy Azure Infrastructure",
                        "description": "Deploy the required Data Collection Endpoint (DCE) and Data Collection Rules (DCR) for Microsoft Sentinel tables using our ARM template.\n\n1. **Retrieve the Workspace ID**:\n   - Navigate to your **Log Analytics Workspace** in the **Azure Portal**.\n   - In the **Overview** section, locate the **Workspace ID** field under **Workspace details**.\n   - **Copy the Workspace ID** and keep it handy for the deployment.\n\n2. **Deploy to Azure**:\n   - Click the Deploy to Azure button below to automatically deploy the required infrastructure:\n   - [![Deploy to Azure](https://aka.ms/deploytoazurebutton)](https://portal.azure.com/#create/Microsoft.Template/uri/https%3A%2F%2Fraw.githubusercontent.com%2Fvirtualmetric%2FAzure-Sentinel%2Fmain%2FSolutions%2FVirtualMetric-ASIM%2FData%2520Connectors%2FDeployToAzure.json)\n   - This will take you directly to the Azure portal to start the deployment.\n\n3. **Configure Deployment Parameters**:\n   - On the custom deployment page, ensure you're deploying to the correct **subscription** and **resource group**.\n   - Fill in the required parameters:\n     - **Workspace Name**: Enter your Log Analytics workspace name\n     - **Workspace ID**: Enter the Workspace ID from step 1\n     - **Workspace Location**: Select the region where your workspace is located\n     - **DCE Name**: Provide a name for the Data Collection Endpoint (e.g., \"VirtualMetric-ASIM-DCE\")\n\n4. **Complete the Deployment**:\n   - Click **Review + create** to validate the template.\n   - Review the parameters and click **Create** to deploy the resources.\n   - Wait for the deployment to complete (typically takes 2-5 minutes).\n\n5. **Verify Deployed Resources**:\n   - After deployment, verify the following resources were created:\n     - **Data Collection Endpoint (DCE)**: Check **Azure Portal > Monitor > Data Collection Endpoints**\n     - **Data Collection Rules (DCRs)**: Check **Azure Portal > Monitor > Data Collection Rules**\n   - **Copy the DCE Logs Ingestion URI** from the DCE **Overview** page (format: `https://<dce-name>.<region>.ingest.monitor.azure.com`)\n   - For each DCR, note the **Immutable ID** from the **Overview** page - you'll need these for VirtualMetric DataStream configuration."
                      },
                      {
                        "title": "Configure VirtualMetric DataStream Integration",
                        "description": "Set up VirtualMetric DataStream to send security telemetry to Microsoft Sentinel tables.\n\n1. **Access VirtualMetric DataStream Configuration**:\n   - Log into your **VirtualMetric DataStream** management console.\n   - Navigate to **Connectors** or **Data Sources** section.\n   - Select **Microsoft Sentinel ASIM** connector.\n\n2. **Configure Authentication** (choose based on Step 1):\n   \n   **For Service Principal Authentication:**\n   - **Tenant ID**: Enter the Directory (tenant) ID from Step 1\n   - **Client ID**: Enter the Application (client) ID from Step 1\n   - **Client Secret**: Enter the client secret value from Step 1\n   \n   **For Azure Managed Identity:**\n   - **Authentication Method**: Select \"Managed Identity\"\n   - **Managed Identity Type**: Choose System-assigned or User-assigned\n   - **Managed Identity Client ID**: (Only for user-assigned, leave blank for system-assigned)\n\n3. **Configure Data Collection Settings**:\n   - **Data Collection Endpoint URI**: Enter the DCE Logs Ingestion URI from Step 3\n   - **Workspace ID**: Enter your Log Analytics Workspace ID\n   - **Subscription ID**: Enter your Azure subscription ID\n   - **Resource Group**: Enter the resource group name containing your workspace\n\n4. **Map Data Sources to ASIM Tables**:\n   - Configure which security data sources should map to specific ASIM tables:\n     - **Network logs** → ASimNetworkSessionLogs\n     - **DNS logs** → ASimDnsActivityLogs\n     - **Web proxy logs** → ASimWebSessionLogs\n     - **Authentication logs** → ASimAuthenticationLogs\n     - **Process events** → ASimProcessEventLogs\n     - **File events** → ASimFileEventLogs\n     - **Registry events** → ASimRegistryEventLogs\n     - **Audit events** → ASimAuditEventLogs\n     - **User management** → ASimUserManagementLogs\n     - **DHCP events** → ASimDhcpEventLogs\n\n5. **Test the Connection**:\n   - Use the **Test Connection** feature in VirtualMetric DataStream to verify:\n     - Authentication is successful\n     - DCE endpoint is reachable\n     - Data can be sent to the configured ASIM tables\n\n6. **Enable Data Flow**:\n   - **Save** the configuration\n   - **Enable** the connector to start sending data\n   - Monitor the connector status to ensure data is flowing successfully\n\n7. **Verify Data Ingestion in Microsoft Sentinel**:\n   - Return to your **Log Analytics Workspace**\n   - Run sample queries on the ASIM tables to confirm data is being received:\n     ```kql\n     ASimNetworkSessionLogs\n     | where TimeGenerated > ago(1h)\n     | take 10\n     ```\n   - Check the **Microsoft Sentinel Overview** dashboard for new data sources and event counts."
                      }
                    ]
                  }
                }
              ],
              "title": "Configure VirtualMetric DataStream for Microsoft Sentinel"
            }
          ],
          "id": "[variables('_uiConfigId1')]"
        }
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/contentPackages",
      "apiVersion": "2023-04-01-preview",
      "location": "[parameters('workspace-location')]",
      "properties": {
        "version": "3.0.0",
        "kind": "Solution",
        "contentSchemaVersion": "3.0.0",
        "displayName": "VirtualMetric DataStream",
        "publisherDisplayName": "VirtualMetric",
        "descriptionHtml": "<p><strong>Note:</strong> Please refer to the following before installing the solution:</p>\n<p>• Review the solution <a href=\"https://github.com/Azure/Azure-Sentinel/tree/master/Solutions/VirtualMetric%20DataStream/ReleaseNotes.md\">Release Notes</a></p>\n<p>• There may be <a href=\"https://aka.ms/sentinelsolutionsknownissues\">known issues</a> pertaining to this Solution, please refer to them before installing.</p>\n<p>VirtualMetric DataStream solution provides comprehensive data collection capabilities for Microsoft Sentinel, supporting ASIM normalized tables, Microsoft Defender tables, and standard security tables with both native and custom table options.</p>\n<p><strong>Data Connectors:</strong> 1</p>\n<p><a href=\"https://aka.ms/azuresentinel\">Learn more about Microsoft Sentinel</a> | <a href=\"https://aka.ms/azuresentinelsolutionsdoc\">Learn more about Solutions</a></p>\n",
        "contentKind": "Solution",
        "contentProductId": "[variables('_solutioncontentProductId')]",
        "id": "[variables('_solutioncontentProductId')]",
        "icon": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/VirtualMetric.svg\" width=\"75px\" height=\"75px\">",
        "contentId": "[variables('_solutionId')]",
        "parentId": "[variables('_solutionId')]",
        "source": {
          "kind": "Solution",
          "name": "VirtualMetric DataStream",
          "sourceId": "[variables('_solutionId')]"
        },
        "author": {
          "name": "VirtualMetric"
        },
        "support": {
          "name": "VirtualMetric",
          "email": "support@virtualmetric.com",
          "tier": "Partner",
          "link": "https://support.virtualmetric.com"
        },
        "dependencies": {
          "operator": "AND",
          "criteria": [
            {
              "kind": "DataConnector",
              "contentId": "[variables('_dataConnectorContentId1')]",
              "version": "[variables('dataConnectorVersion1')]"
            }
          ]
        },
        "firstPublishDate": "2025-09-15",
        "providers": [
          "VirtualMetric"
        ],
        "categories": {
          "domains": [
            "Security - Network",
            "Security - Cloud Security",
            "IT Operations"
          ]
        }
      },
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_solutionId'))]"
    }
  ],
  "outputs": {}
}
