id: 62913c05-c88d-4ba7-ae98-51176b48ff61
name: PhishingEmailUrlRedirector
description: |-
  This query was originally published on Twitter, by @MsftSecIntel.
  The query helps detect emails associated with the open redirector URL campaign. The campaign's URLs begin with the distinct pattern, hxxps://t[.]domain[.]tld/r/?. Attackers use URL redirection to manipulate users into visiting a malicious website or to evade detection.
  Reference - https://twitter.com/MsftSecIntel
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - EmailUrlInfo
tactics:
- Initial access
query: |-
  EmailUrlInfo
  | where Url matches regex @"s?\:\/\/(?:www\.)?t\.(?:[\w\-\.]+\/+)+(?:r|redirect)\/?\?"
