id: cdc4da1c-64a1-4941-be59-1f5cc85481ab
name: referral-phish-emails
description: |
  The "Referral" infrastructure is a point-in-time set of infrastructure associated with spoofed emails that imitate SharePoint and other legitimate products to conduct credential phishing. The operator is also known to use legitimate URL infrastructure such as Google, Microsoft, and Digital Ocean to host their phishing pages.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
  - EmailUrlInfo
tactics:
- Credential Access
query: |
  let EmailAddresses = pack_array
  ('zreffertalt.com.com','zreffesral.com.com','kzreffertal.com.com',
  'wzreffertal.com.com','refferal.comq','refferal.net','zreffertal.com.com',
  'zrefferal.com.com','refferasl.com.com','zreffesral.com','zrefsfertal.com.com',
  'irefferal.com','refferasl.co','zrefferal.com');
  EmailEvents
  | where SenderMailFromDomain in (EmailAddresses)
  | extend RecipientDomain = extract("[^@]+$", 0, RecipientEmailAddress)
  | where SenderFromDomain == RecipientDomain
  | join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId
