id: b3180ac0-6d94-494a-8b8c-fcc84319ea6e
name: Spoof and impersonation detections by sender IP
description: |
  This query helps reviewing count of spoof and impersonation detections done per sender IP
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
- Initial access
query: |
  EmailEvents 
  |where Timestamp > ago (30d) and (DetectionMethods contains 'spoof' or DetectionMethods contains "impersonation")  
  | project Timestamp, EmailDirection, SenderFromAddress, AdditionalFields, SenderIPv4 
  | summarize count() by SenderIPv4
