id: 4396f8c3-d114-4154-9f4c-048ba522ed04
name: Attempted VBScript Stored in Non-Run CurrentVersion Registry Key Value
description: |
  'Identify potential new registry key name that is a non-autorun and non-run key in the HKLM\Software\Microsoft\Windows\CurrentVersion\ registry key containing VBScript in the key value value.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
query: |
  SecurityEvent
  | where ObjectName has "\\CurrentVersion"
  | where ObjectName !has "\\Run"
  | where NewValue contains "RunHTMLApplication" or 
    NewValue contains "vbscript" or 
    NewValue contains "jscript" or 
    NewValue contains "mshtml" or 
    NewValue contains "mshtml," or 
    NewValue contains "mshtml " or 
    NewValue contains "Execute(" or 
    NewValue contains "CreateObject" or 
    NewValue contains "RegRead" or 
    NewValue contains "window.close"
  | project TimeGenerated, Computer, Process, ObjectName, ObjectValueName, NewValue, OldValue, SubjectUserName, NewProcessId, SourceComputerId
  | order by TimeGenerated