id: d7233f14-4705-403e-9db9-e0d677c9506b
name: Attempted VBScript Stored in Non-Run CurrentVersion Registry Key Value
description: |
  'Identify potential new registry key name that is a non-autorun and non-run key in the HKLM\Software\Microsoft\Windows\CurrentVersion\ registry key containing VBScript in the key value value.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1112
query: |
  SecurityEvent
  | where ObjectName has "\\CurrentVersion"
  | where ObjectName !has "\\Run"
  | where NewValue contains "RunHTMLApplication" or 
    NewValue contains "vbscript" or 
    NewValue contains "jscript" or 
    NewValue contains "mshtml" or 
    NewValue contains "mshtml," or 
    NewValue contains "mshtml " or 
    NewValue contains "Execute(" or 
    NewValue contains "CreateObject" or 
    NewValue contains "RegRead" or 
    NewValue contains "window.close"
  | project TimeGenerated, Computer, Process, ObjectName, ObjectValueName, NewValue, OldValue, SubjectUserName, NewProcessId, SourceComputerId
  | order by TimeGenerated
version: 1.0.0