id: 4894a60b-d2ee-4f24-be61-0d0c96a84e63
name: LSASS Memory Dumping using WerFault.exe - Command Identification
description: |
  'Identifies WerFault.exe creating a memory dump of lsass.exe (Local Security Authority Subsystem Service, a process responsible for the enforcement of security policies on Windows systems, which generates and stores credentials in its process memory).'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
tactics:
  - CredentialAccess
relevantTechniques:
  - T1003
query: |
  SecurityEvent
  | where NewProcessName endswith "werfault.exe"
  | where ObjectName endswith "lsass.exe"
  | project NewProcessName, ObjectName
version: 1.0.0