id: 9d57df2f-1e06-413a-88e3-896c8c723215
name: LSASS Memory Dumping using WerFault.exe - Command Identification
description: |
  'Identifies WerFault.exe creating a memory dump of lsass.exe (Local Security Authority Subsystem Service, a process responsible for the enforcement of security policies on Windows systems, which generates and stores credentials in its process memory).'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
query: |
  SecurityEvent
  | where NewProcessName endswith "werfault.exe"
  | where ObjectName endswith "lsass.exe"
  | project NewProcessName, ObjectName