id: 9967016e-3fff-4476-91c8-7dc727eb1f93
name: Metasploit / Impacket PsExec Process Creation Activity
description: |
  'Meant to detect process creations containing names consistent with the schema used by Metasploit or Impacket's PsExec tool. Metasploit and Impacket's PsExec tooling is used by malicious actors for lateral movement & performing actions on remote systems.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
query: |
  SecurityEvent
  | where ParentProcessName has "services.exe"
  | where NewProcessName matches regex "C:\\\\Windows\\\\[a-zA-Z]{8}.exe"
  | where EventID == "4688"
  | project EventID, NewProcessName, CommandLine, Computer, ParentProcessName