id: 50731913-bafb-4587-a11b-44982b9d68b0
name: Powershell Encoded Command Execution
description: |
  'Looks for valid variations of the -EncodedCommand parameter. This is commonly used to encode or obfuscate commands, and not all occurrences are malicious. For example, benign complex commands may require encoding to properly run on a target system. Analysis of the encoded command by base64 decoding the encoded data will be necessary.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, EventID, CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId)
  | where NewProcessName endswith "powershell.exe"
  | where CommandLine matches regex "-[Ee^]{1,2}[NnCcOoDdEeMmAaPpHh^`]+\\s+\"?[a-zA-Z0-9+/=]{6,}"