id: e186a8af-3d4a-4003-93b7-9b199e0b1dd1
name: PowerShell Pastebin Download
description: |
  'Detects PowerShell commands downloading and execute code hosted on Pastebin and other services. This technique has been used by malicious actors to distribute malware, in particular it has been used by the EvilCorp Ransomware variants such as Sodinokibi.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
tactics:
  - CommandandControl
relevantTechniques:
  - T1102
query: |
  SecurityEvent
  | where Process  has "powershell.exe"
  | where CommandLine contains "http"
  | where CommandLine has_any (
    "pastebin",
    "github",
    "ghostbin",
    "githubusercontent",
    "0bin",
    "zerobin",
    "privatebin",
    "klgrth",
    "termbin",
    "hatebin",
    "hastebin",
    "dumpz"
  ) or  CommandLine contains ".onion" or CommandLine contains "paste."
  | project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData| order by TimeGenerated
version: 1.0.0