id: d2d3bbc2-6e57-4043-ab24-988a6a6c88db
name: Powershell Encoded Command Execution
description: |
  'Looks for valid variations of the -EncodedCommand parameter. Commonly used to encode or obfuscate commands, and not all occurrences are malicious.'
requiredDataConnectors:
  - connectorId: SecurityEvent
    dataTypes:
      - SecurityEvent
tactics:
  - DefenseEvasion
  - Execution
relevantTechniques:
  - T1027
  - T1059.001
query: |
  SecurityEvent
  | where TimeGenerated >= ago(7d)
  | project TimeGenerated, Computer, Activity, EventID, CommandLine, NewProcessName, processId = tolong(NewProcessId), ParentProcessName, parentProcessId = tolong(ProcessId)
  | where NewProcessName endswith "powershell.exe"
  | where CommandLine matches regex "-[Ee^]{1,2}[NnCcOoDdEeMmAaPpHh^`]+\\s+\"?[a-zA-Z0-9+/=]{6,}"
version: 1.0.0