id: 271e8881-3044-4332-a5f4-42264c2e0315
name: Anomalous access to other users mailboxes.
description: |
  'Looks for users accessing multiple other user's mailboxes or accessing multiple folders in another users mailbox'
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
tactics:
  - Collection
relevantTechniques:
  - T1114.002
query: |

  let timeframe = 14d;
  let user_threshold = 1;
  let folder_threshold = 5;
  OfficeActivity
  | where TimeGenerated > ago(timeframe)
  | where Operation =~ "MailItemsAccessed" 
  | where ResultStatus =~ "Succeeded"
  | mv-expand parse_json(Folders)
  | extend folders = tostring(Folders.Path)
  | where tolower(MailboxOwnerUPN) != tolower(UserId)
  | extend ClientIP = iif(Client_IPAddress startswith "[", extract("\\[([^\\]]*)", 1, Client_IPAddress), Client_IPAddress)
  | summarize make_set(folders), make_set(ClientInfoString), make_set(ClientIP), make_set(MailboxGuid), make_set(MailboxOwnerUPN)  by UserId
  | extend folder_count = array_length(set_folders)
  | extend user_count = array_length(set_MailboxGuid)
  | where user_count > user_threshold or folder_count > folder_threshold
  | sort by user_count desc
  | project-reorder UserId, user_count, folder_count, set_MailboxOwnerUPN, set_ClientIP, set_ClientInfoString, set_folders