// Name: Summary of users creating new user accounts
//
// Id: bfac3310-c5e7-4e78-8df6-f158be1909fc
//
// Description: creating new user accounts is a privileged activity that may be abused by attackers to provide persistent access.
// Reviewing which user accounts have been created, and by whom, can help detect attacker attempts to provide themselves with backdoor access to data.
//
// DataSource: #OfficeActivity
//
// Techniques: #Persistence
//
OfficeActivity
| where Operation == "Add user."
| project addedBy=UserId, newUser=OfficeObjectId 
| summarize newUserCount=dcount(newUser) by addedBy
| render barchart
