id: 9891684a-1e3a-4546-9403-3439513cbc70
name: Mail redirect via ExO transport rule
description: |
  'Identifies when Exchange Online transport rule configured to forward emails.
  This could be an adversary mailbox configured to collect mail from multiple user accounts.'
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity (Exchange)
tactics:
  - Collection
  - Exfiltration
relevantTechniques:
  - T1114
  - T1020
query: |

  OfficeActivity
  | where OfficeWorkload == "Exchange"
  | where Operation in~ ("New-TransportRule", "Set-TransportRule")
  | extend ParametersValues = extract_all(@'Name\":\"(?P<Name>\w+)\",\"Value\":\"(?P<Value>[^\"]*)', dynamic(["Name", "Value"]), Parameters)
  | mv-apply ParametersValues on (summarize ParsedParameters = make_bag(pack(tostring(ParametersValues[0]), ParametersValues[1])))
  | extend RuleName = case(
      Operation =~ "Set-TransportRule", OfficeObjectId,
      Operation =~ "New-TransportRule", ParsedParameters.Name,
      "Unknown")
  | mv-expand Parameters = todynamic(Parameters)
  | where Parameters.Name in~ ("BlindCopyTo", "RedirectMessageTo") and isnotempty(Parameters.Value)
  | extend RedirectTo = Parameters.Value
  | extend ClientIPValues = extract_all(@'\[?(::ffff:)?(?P<IPAddress>(\d+\.\d+\.\d+\.\d+)|[^\]]+)\]?([-:](?P<Port>\d+))?', dynamic(["IPAddress", "Port"]), ClientIP)[0]
  | project TimeGenerated, RedirectTo, IPAddress = tostring(ClientIPValues[0]), Port = tostring(ClientIPValues[1]), UserId, Operation, RuleName, ParsedParameters
  | extend
      timestamp = TimeGenerated,
      AccountCustomEntity = UserId,
      IPCustomEntity = IPAddress
    
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
