// Name: Non-owner mailbox login activity
//
// Description: This will help you determine if mailbox access observed with Admin/Delegate Logontype. 
// The logon type indicates mailbox accessed from non-owner user. Exchange allows Admin and delegate permissions to access other user`s inbox.
// If your orgnization has valid admin, delegate access given to users , you can whitelist those and investigate other results.
//
// https://docs.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-schema#logontype
// 
// Id: 0a8f410d-38b5-4d75-90da-32b472b97230
//
// DataSource: #OfficeActivity
//
// Tactics: #InitialAccess
//
let timeframe = 1d;
OfficeActivity
| where TimeGenerated >= ago(timeframe)
| where Operation == "MailboxLogin" and Logon_Type != "Owner" 
| summarize count(), min(TimeGenerated), max(TimeGenerated) by Operation, OrganizationName, UserType, UserId, MailboxOwnerUPN, Logon_Type