// Name: multiple users forwarding Office mail to same destination
//
// Id: 261fe949-e554-40d5-9801-edad91c2e336
//
// Description: This query over Office Activity audit data highlights cases where user mail is being forwarded.
//
// DataSource: #OfficeActivity
//
// Techniques: #Exfiltration
//
OfficeActivity
| where Operation == "Set-Mailbox"
| where TimeGenerated >= ago(30d)
| where Parameters contains "ForwardingSmtpAddress"
| extend parsed=parse_json(Parameters)
| extend parameterName=parsed[1].Name, fwdingDestination=tostring(parsed[1].Value)
| where fwdingDestination != ""
  