// Name: multiple users forwarding Office mail to same destination
//
// Id: 261fe949-e554-40d5-9801-edad91c2e336
//
// Description: This query over Office Activity audit data highlights cases where user mail is being forwarded.
//
// DataSource: #OfficeActivity
//
// Techniques: #Exfiltration
//
OfficeActivity
| where TimeGenerated >= ago(14d)
| where (Operation == "Set-Mailbox" and Parameters contains 'ForwardingSmtpAddress') 
    or (Operation == 'New-InboxRule' and Parameters contains 'ForwardTo')
| extend parsed=parse_json(Parameters)
| extend fwdingDestination = iif(Operation=="Set-Mailbox", tostring(parsed[1].Value), tostring(parsed[2].Value))
| where fwdingDestination != ""
| project TimeGenerated, UserId, Operation, fwdingDestination, ClientIP 
| extend AccountCustomEntity = UserId, IPCustomEntity = ClientIP
