//Phishing   
let TimeFrame = ago(365d); 
let FileList = dynamic(["zip","docx","pptx","xlsx","pdf","exe","aspx","war","py","com","bat","dll","jar","swf","qzquar","zix","ocx","vbs","ws","ozd","wmf","bin","js","class","drv","aru","shs","chm","dev","pgm","pif","xnxx","xlm","vbe","vxd","tps","vba","pcx","boo","0_full_0_tgod_signed","386","sop","tsa","hlp","vb","scr","exe1","bkd","exe_renamed","rhk","lik","vbx","dxz","osa","cih","mjz","wsc",".9","dyz","php3","dlb","dom","hlw","cla","s7p","mfu","mjg","dyv","kcd","bup","rsc_tmp","spam", "mcq","wsh","upa","bhx","txs""dli","bxz","cxq","xir","xlv","fnr","xdu","wlpginstall","ska","cfxxe","tti","smtmp","dllx","vexe","xtbl","qrn","fag","oar","ceo","uzy",
"tko","bll","dbd","plc","smm","ssy","blf","zvz","cC","ceO","ce0","nls","ctbl","crypt1","iws","hsq","vzr","lkh","ezt","aepl","rna","hts","let","atm","fuj","fjl","aut","buk","delf","bmw","cyw","capxml","bps","iva","pid","dx","lpaq5","bqf","git","pr","xnt","lok" ]);  
let FileIoc = dynamic(["update","buy","password","quick","click","open","payment","https","http","reminder","bill","urgent","request","important","attention","html","txt", "link", "url", "attachment", " raise " , "pay","Covid","account","change","here","CEO","upload","new","please","war","access","contact","enable","encrypted","disable"'word','transfer']);  
EmailAttachmentInfo  
| where TimeGenerated > TimeFrame 
| where FileType  has_any (FileList)   
 and    FileName    has_any (FileIoc) 
