// Name: Powershell or non-browser mailbox login activity
//
// Description: This will help you determine if mailbox login was done from Exchange Powershell session. 
// By default, all accounts you create in Office 365 are allowed to use Exchange Online PowerShell. 
// Administrators can use Exchange Online PowerShell to enable or disable a user's ability to connect to Exchange Online PowerShell.
// Whitelist any benign scheduled activities using exchange powershell if applicable in your environment.
//
// https://docs.microsoft.com/en-us/powershell/exchange/exchange-online/connect-to-exchange-online-powershell/connect-to-exchange-online-powershell?view=exchange-ps
//
// Id: 49a4f65a-fe18-408e-afec-042fde93d3ce
//
// DataSource: #OfficeActivity
//
// Tactics: #InitialAccess #Execution
//
let timeframe = 1d;
OfficeActivity
| where TimeGenerated >= ago(timeframe)
| where Operation == "MailboxLogin"
| where ClientInfoString == "Client=Microsoft.Exchange.Powershell; Microsoft WinRM Client"
| summarize count(), min(TimeGenerated), max(TimeGenerated) by Operation, OrganizationName, UserType, UserId, MailboxOwnerUPN, Logon_Type, ClientInfoString