// Name: New user agents associated with a clientIP for sharepoint file uploads/downloads
//
// Description: New user agents associated with a clientIP for sharepoint file uploads/downloads. 
//
// Data source: OfficeActivity
//
// Techniques: #Exfiltration
//
let historicalUA=
OfficeActivity
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where TimeGenerated between(ago(30d)..ago(7d))
| summarize by ClientIP, UserAgent;
let recentUA = OfficeActivity
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where TimeGenerated > ago(1d) 
| summarize by ClientIP, UserAgent;
recentUA | join kind=leftanti (
   historicalUA 
) on ClientIP, UserAgent; 
