id: be602d80-c1e0-4246-853d-df2516fa6cf9
name: Suspicious User Agent associated with password spray campaigns
description: |
  ' This query helps identify Suspicious User Agents associated with password spray campaigns. Attackers often use fictitious user agent string generated from a dictionary during initial credential acquisition phase. The query uses a regular expression to identify these potentially bad user strings. Malicious IP addresses are also identified that could be used for further investigation’ 
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
tactics:
  - Credential Access
relevantTechniques:
  - T1110
query: |

  let valid_logons = (OfficeActivity
    | where TimeGenerated > ago(14d)
    | where Operation == 'UserLoggedIn'
    | summarize by ClientIP);
  let only_invalid_logons = (OfficeActivity
    | where TimeGenerated > ago(14d)
    | where Operation == 'UserLoginFailed'
    | summarize by ClientIP) 
    | join kind=anti (valid_logons) on ClientIP;
  let RecentOfficeActivity_UA = ( OfficeActivity
        | where TimeGenerated > ago(14d)
        | join kind=inner (only_invalid_logons) on ClientIP
       | extend UserAgent = case(isnotempty(UserAgent),UserAgent,tostring(parse_json(ExtendedProperties)[0].Value)));
  RecentOfficeActivity_UA
    | where UserAgent matches regex '^[\\w\\.\\d\\-\\_]{4,15}\\/[\\.\\w\\d\\-\\_]{4,30}$'
    | extend timestamp = TimeGenerated,  AccountCustomEntity = UserId, IPCustomEntity = ClientIP 