{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "041885bf-2e2c-42ae-ad35-2e12272b4dc4",
            "version": "KqlParameterItem/1.0",
            "name": "Help",
            "label": "Show Guide",
            "type": 10,
            "isRequired": true,
            "typeSettings": {
              "additionalResourceOptions": "[variables('TemplateEmptyArray')]"
            },
            "jsonData": "[\n    {\"value\": \"Yes\", \"label\": \"Yes\", \"selected\":true},\n    {\"value\": \"No\", \"label\": \"No\"}\n]",
            "timeContext": {
              "durationMs": 86400000
            },
            "value": "No"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 6"
    },
    {
      "type": 1,
      "content": {
        "json": "### Guide: IP Correlation \n\nRecorded Future’s IP Correlation Workbook helps you detect malicious IPs within your environment by correlating your logs with Recorded Future IP Risk Lists.\n\n### How to Correlate IPs\n\nTo correlate IPs, follow the steps below:\n\n1. In the **IP Logs Table** dropdown, select a log table that contains IP logs.\n\t* If a particular log table is not listed in the dropdown, ensure it is enabled in your environment.\n2. In the **Log field with IPs** dropdown, select the log field that holds the IPs to be correlated.\n\t* The workbook can correlate IPs in the format: `5.56.61.62`.\n3. Select a Recorded Future IP Risk List for correlation.\n4. If necessary, adjust the values in the **Logs from** and **Data from** dropdowns to match your requirements.\n5. Done\n\n---\n\n#### Log table with examples of correlatable log fields\n\n\n| Table                        | Field              | Table                           | Field     |\n|------------------------------|--------------------|---------------------------------|-----------|\n| AzureActivity                | CallerIpAddress    | VMConnection                    | RemoteIp  |\n| AzureDiagnostics             | CallerIPAddress    | W3CIISLog                       | cIP       |\n| AWSCloudTrail                | SourceIpAddress    | _Im_NetworkSession              | SrcIpAddr |\n| AppServiceHTTPLogs           | CIp                | _Im_NetworkSession              | DstIpAddr |\n| AzureDiagnostics             | client_ip_s        | _Im_WebSession                  | SrcIpAddr |\n| CommonSecurityLog            | SourceIpAddress    | SigninLogs                      | IPAddress |\n| CommonSecurityLog            | DestinationIP      | AADNonInteractiveUserSignInLogs | IPAddress |\n| DuoSecurityAuthentication_CL | access_device_ip_s |                                 |           |",
        "style": "info"
      },
      "conditionalVisibility": {
        "parameterName": "Help",
        "comparison": "isEqualTo",
        "value": "Yes"
      },
      "name": "text - 11"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 1,
            "content": {
              "json": "### IP (from logs)"
            },
            "customWidth": "50",
            "name": "text - 2"
          },
          {
            "type": 1,
            "content": {
              "json": "### Recorded Future Risk List"
            },
            "customWidth": "50",
            "name": "text - 3"
          },
          {
            "type": 9,
            "content": {
              "version": "KqlParameterItem/1.0",
              "parameters": [
                {
                  "id": "b91b8b5b-10cf-4106-99e2-793eb0d72dce",
                  "version": "KqlParameterItem/1.0",
                  "name": "IP_Logs_Time_Range",
                  "label": "Logs from",
                  "type": 4,
                  "isRequired": true,
                  "typeSettings": {
                    "selectableValues": [
                      {
                        "durationMs": 300000
                      },
                      {
                        "durationMs": 900000
                      },
                      {
                        "durationMs": 1800000
                      },
                      {
                        "durationMs": 3600000
                      },
                      {
                        "durationMs": 14400000
                      },
                      {
                        "durationMs": 43200000
                      },
                      {
                        "durationMs": 86400000
                      },
                      {
                        "durationMs": 172800000
                      },
                      {
                        "durationMs": 259200000
                      },
                      {
                        "durationMs": 604800000
                      },
                      {
                        "durationMs": 1209600000
                      },
                      {
                        "durationMs": 2419200000
                      },
                      {
                        "durationMs": 2592000000
                      },
                      {
                        "durationMs": 5184000000
                      },
                      {
                        "durationMs": 7776000000
                      }
                    ]
                  },
                  "timeContext": {
                    "durationMs": 86400000
                  },
                  "value": {
                    "durationMs": 7776000000
                  }
                },
                {
                  "id": "3300ad41-acbc-4ebd-900a-c6ab250b7c73",
                  "version": "KqlParameterItem/1.0",
                  "name": "IP_Logs_Table",
                  "label": "IP Logs Table",
                  "type": 2,
                  "description": "Log Table to correlate IPs Against",
                  "isRequired": true,
                  "query": "search * \n| where TimeGenerated {IP_Logs_Time_Range:query}\n| summarize count() by $table \n| sort by count_ desc \n| where $table != \"ThreatIntelligenceIndicator\" \n| project $table\n",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "value": "NetScreen_Firewall_CL"
                },
                {
                  "id": "f4f77ada-b97c-4a82-9421-20a58fb7ce26",
                  "version": "KqlParameterItem/1.0",
                  "name": "IP_Logs_Field",
                  "label": "Log Field with IPs",
                  "type": 2,
                  "description": "Select the field containing the IP that you want to correlate against",
                  "isRequired": true,
                  "query": "{IP_Logs_Table:value}\n| where TimeGenerated {IP_Logs_Time_Range:query}\n| getschema\n| where DataType == \"System.String\"\n| project ColumnName",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "value": "Dst_IPv4_s"
                }
              ],
              "style": "pills",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "customWidth": "50",
            "name": "parameters - 0"
          },
          {
            "type": 9,
            "content": {
              "version": "KqlParameterItem/1.0",
              "parameters": [
                {
                  "id": "95e78560-1e69-437c-8226-7b0f8c4dc199",
                  "version": "KqlParameterItem/1.0",
                  "name": "Threat_Intelligence_Time_Range",
                  "label": "Data from",
                  "type": 4,
                  "isRequired": true,
                  "typeSettings": {
                    "selectableValues": [
                      {
                        "durationMs": 300000
                      },
                      {
                        "durationMs": 900000
                      },
                      {
                        "durationMs": 1800000
                      },
                      {
                        "durationMs": 3600000
                      },
                      {
                        "durationMs": 14400000
                      },
                      {
                        "durationMs": 43200000
                      },
                      {
                        "durationMs": 86400000
                      },
                      {
                        "durationMs": 172800000
                      },
                      {
                        "durationMs": 259200000
                      },
                      {
                        "durationMs": 604800000
                      },
                      {
                        "durationMs": 1209600000
                      },
                      {
                        "durationMs": 2419200000
                      },
                      {
                        "durationMs": 2592000000
                      },
                      {
                        "durationMs": 5184000000
                      },
                      {
                        "durationMs": 7776000000
                      }
                    ]
                  },
                  "value": {
                    "durationMs": 5184000000
                  }
                },
                {
                  "id": "e7c7e2ea-f5b3-4505-b64c-b18ca8561168",
                  "version": "KqlParameterItem/1.0",
                  "name": "RF_Risk_list",
                  "label": "Risk List",
                  "type": 2,
                  "description": "Which IP Risk List do you want to correlate against",
                  "isRequired": true,
                  "query": "ThreatIntelligenceIndicator\n| where isnotempty(NetworkIP)\n| where TimeGenerated {Threat_Intelligence_Time_Range:query}\n| where Description contains \"Recorded Future\"\n//| summarize count() by Description\n| distinct Description\n| project output = strcat('\"', Description, '\"')\n",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "value": "\"Recorded Future - IP - Actively Communicating C&C Server\""
                }
              ],
              "style": "pills",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "customWidth": "50",
            "name": "parameters - 1"
          }
        ],
        "exportParameters": true
      },
      "name": "group - 10"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 1,
            "content": {
              "json": "\n### Guide: Detected IPs Per Day\n\nThe chart displays the number of correlation detections per day between IP logs and Recorded Future's IP Risk lists.",
              "style": "info"
            },
            "conditionalVisibility": {
              "parameterName": "Help",
              "comparison": "isEqualTo",
              "value": "Yes"
            },
            "name": "text - 0"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "ThreatIntelligenceIndicator\r\n| where TimeGenerated {Threat_Intelligence_Time_Range:query}\r\n| where Description contains {RF_Risk_list:value}\r\n| where isnotempty(Tags)\r\n| join (\r\n    {IP_Logs_Table:value}\r\n    | where TimeGenerated {IP_Logs_Time_Range:query}\r\n    // renaming time column so it is clear the log this came from\r\n    | extend IP_TimeGenerated = TimeGenerated\r\n)\r\non $left.NetworkIP == $right.{IP_Logs_Field:value}\r\n| summarize Correlation_Matches=count() by bin(IP_TimeGenerated, 1d)\r\n| render barchart",
              "size": 0,
              "title": "Detected IPs Per Day",
              "noDataMessage": "No detected IPs",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "name": "query - 1"
          }
        ]
      },
      "name": "group - 11"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 1,
            "content": {
              "json": "\n### Guide: Detected IPs\n\nThe Detected IPs table lists IPs from the correlated logs that have been matched with Recorded Future IP Risk Lists.\n\n**Table Columns**\n\n* **Risk Score:** The Recorded Future Risk Score for the IP (IOC), ranging from 1 to 99, with 99 being the highest level of severity.\n* **IP:** The detected IP.\n* **Detected:** The time when the log was correlated with a Risk List.\n* **Log Created:** The time when the log event itself was created.\n* **Threat Classification:** The type of threat associated with the IP (IOC).",
              "style": "info"
            },
            "conditionalVisibility": {
              "parameterName": "Help",
              "comparison": "isEqualTo",
              "value": "Yes"
            },
            "name": "text - 0"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "ThreatIntelligenceIndicator\r\n| where TimeGenerated {Threat_Intelligence_Time_Range:query}\r\n| where Description contains {RF_Risk_list:value}\r\n| where isnotempty(Tags)\r\n| join (\r\n    {IP_Logs_Table:value}\r\n    | where TimeGenerated {IP_Logs_Time_Range:query}\r\n    // renaming time column so it is clear the log this came from\r\n    | extend IP_TimeGenerated = TimeGenerated\r\n)\r\non $left.NetworkIP == $right.{IP_Logs_Field:value}\r\n| project [\"Risk Score\"]=ConfidenceScore, IP=NetworkIP, Detected=format_datetime(TimeGenerated, 'yyyy-MM-dd HH:mm:ss'), [\"Log Created\"]=format_datetime(IP_TimeGenerated, 'yyyy-MM-dd HH:mm:ss'), [\"Threat Classification\"]=ThreatType\r\n| summarize [\"Log Created\"]=max([\"Log Created\"]) by IP, [\"Risk Score\"], Detected, [\"Threat Classification\"]\r\n| project [\"Risk Score\"], IP, Detected, [\"Log Created\"], [\"Threat Classification\"]\r\n| sort by [\"Risk Score\"] desc",
              "size": 0,
              "title": "Detected IPs",
              "noDataMessage": "No detected IPs",
              "exportedParameters": [
                {
                  "fieldName": "IP",
                  "parameterName": "MaliciousIPMatch",
                  "parameterType": 5
                }
              ],
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "Risk",
                    "formatter": 18,
                    "formatOptions": {
                      "thresholdsOptions": "colors",
                      "thresholdsGrid": [
                        {
                          "operator": ">=",
                          "thresholdValue": "90",
                          "representation": "redBright",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": ">=",
                          "thresholdValue": "65",
                          "representation": "orange",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": ">=",
                          "thresholdValue": "25",
                          "representation": "yellow",
                          "text": "{0}{1}"
                        },
                        {
                          "operator": "Default",
                          "representation": "blue",
                          "text": "{0}{1}"
                        }
                      ]
                    }
                  },
                  {
                    "columnMatch": "AdditionalInformation",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "100%"
                    }
                  }
                ],
                "sortBy": [
                  {
                    "itemKey": "$gen_thresholds_Risk_0",
                    "sortOrder": 2
                  }
                ]
              },
              "sortBy": [
                {
                  "itemKey": "$gen_thresholds_Risk_0",
                  "sortOrder": 2
                }
              ]
            },
            "customWidth": "70",
            "name": "query - 3"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "ThreatIntelligenceIndicator\r\n| where TimeGenerated {Threat_Intelligence_Time_Range:query}\r\n| where Description contains {RF_Risk_list:value}\r\n| where isnotempty(Tags)\r\n| join (\r\n    {IP_Logs_Table:value}\r\n    | where TimeGenerated {IP_Logs_Time_Range:query}\r\n    // renaming time column so it is clear the log this came from\r\n    | extend IP_TimeGenerated = TimeGenerated\r\n)\r\non $left.NetworkIP == $right.{IP_Logs_Field:value}\r\n| project Risk=ConfidenceScore, NetworkIP, ThreatType, Tags\r\n| extend Evidence=parse_json(Tags)[0]\r\n| mv-expand Evidence = parse_json(tostring(Evidence))\r\n| extend Rule=Evidence['Rule']\r\n| summarize count() by tostring(Rule)\r\n| sort by count_ desc",
              "size": 0,
              "title": "Top Triggered Risk Rules",
              "noDataMessage": "No triggered Risk Rules",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "count_",
                    "formatter": 8,
                    "formatOptions": {
                      "palette": "orange"
                    }
                  }
                ]
              }
            },
            "customWidth": "30",
            "name": "query - 2"
          },
          {
            "type": 1,
            "content": {
              "json": "### Detected IPs: Evidence Details\n\nTo view evidence details, click a row (IP) in the Detected IPs table."
            },
            "name": "text - 3"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "ThreatIntelligenceIndicator\n| where TimeGenerated {Threat_Intelligence_Time_Range:query}\n| where Description contains {RF_Risk_list:value}\n| where NetworkIP == \"{MaliciousIPMatch}\"\n| where isnotempty(Tags)\n//| where ExpirationDateTime > now()\n| extend Evidence=parse_json(Tags)[0]\n| take 1\n| mv-expand Evidence = parse_json(tostring(Evidence))\n| project Rules = Evidence['Rule'], Criticality = Evidence['Criticality'], Evidence_String = Evidence['EvidenceString']\n| sort by toint(Criticality) desc",
              "size": 1,
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "gridSettings": {
                "formatters": [
                  {
                    "columnMatch": "Evidence_String",
                    "formatter": 0,
                    "formatOptions": {
                      "customColumnWidthSetting": "100%"
                    }
                  }
                ]
              }
            },
            "conditionalVisibility": {
              "parameterName": "MaliciousIPMatch",
              "comparison": "isNotEqualTo"
            },
            "name": "query - 5"
          },
          {
            "type": 1,
            "content": {
              "json": "\n### Source data from {IP_Logs_Table:value}\nTo view source data of correlated IP, click a row (IP) in the Detected IPs table."
            },
            "name": "text - 5"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "{IP_Logs_Table:value}\n| where TimeGenerated {IP_Logs_Time_Range:query}\n| where {IP_Logs_Field:value} == \"{MaliciousIPMatch}\"\n",
              "size": 1,
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "conditionalVisibility": {
              "parameterName": "MaliciousIPMatch",
              "comparison": "isNotEqualTo"
            },
            "name": "query - 9"
          }
        ]
      },
      "name": "group - 11"
    }
  ],
  "styleSettings": {
    "paddingStyle": "wide"
  },
  "fromTemplateId": "sentinel-RecordedFutureIPCorrelationWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}