Parser:
  Title: Dhcp event ASIM schema function
  Version: '0.2.0'
  LastUpdated: Mar 17, 2026
Product:
  Name: Microsoft
Normalization:
  Schema: DhcpEvent
  Version: '0.1.1'
References:
- Title: ASIM Dhcp Event Schema
  Link: https://aka.ms/ASimDhcpEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Dhcp Event schema.
ParserName: vimDhcpEventEmpty
EquivalentBuiltInParser: _Im_DhcpEvent_Empty
ParserQuery: |
  let EmptyDhcpEvents =datatable (
    TimeGenerated:datetime,
    _ResourceId:string,
    Type:string,
    AdditionalFields:dynamic,
    DhcpCircuitId:string,
    DhcpLeaseDuration:int,
    DhcpSessionDuration:int,
    DhcpSessionId:string,
    DhcpSrcDHCId:string,
    DhcpSubscriberId:string,
    DhcpUserClass:string,
    DhcpUserClassId:string,
    DhcpVendorClass:string,
    DhcpVendorClassId:string,
    Duration:int,
    Dvc:string,
    DvcAction:string,
    DvcDescription:string,
    DvcDomain:string,
    DvcDomainType:string,
    DvcFQDN:string,
    DvcHostname:string,
    DvcId:string,
    DvcIdType:string,
    DvcInterface:string,
    DvcIpAddr:string,
    DvcMacAddr:string,
    DvcOriginalAction:string,
    DvcOs:string,
    DvcOsVersion:string,
    DvcScope:string,
    DvcScopeId:string,
    DvcZone:string,
    EventCount:int,
    EventEndTime:datetime,
    EventMessage:string,
    EventOriginalResultDetails:string,
    EventOriginalSeverity:string,
    EventOriginalSubType:string,
    EventOriginalType:string,
    EventOriginalUid:string,
    EventOwner:string,
    EventProduct:string,
    EventProductVersion:string,
    EventReportUrl:string,
    EventResult:string,
    EventResultDetails:string,
    EventSchema:string,
    EventSchemaVersion:string,
    EventSeverity:string,
    EventStartTime:datetime,
    EventSubType:string,
    EventType:string,
    EventUid:string,
    EventVendor:string,
    Hostname:string,
    IpAddr:string,
    RequestedIpAddr:string,
    Rule:string,
    RuleName:string,
    RuleNumber:int,
    SessionId:string,
    Src:string,
    SrcDescription:string,
    SrcDeviceType:string,
    SrcDomain:string,
    SrcDomainType:string,
    SrcDvcId:string,
    SrcDvcIdType:string,
    SrcDvcScope:string,
    SrcDvcScopeId:string,
    SrcFQDN:string,
    SrcGeoCity:string,
    SrcGeoCountry:string,
    SrcGeoLatitude:real,
    SrcGeoLongitude:real,
    SrcGeoRegion:string,
    SrcHostname:string,
    SrcIpAddr:string,
    SrcMacAddr:string,
    SrcOriginalRiskLevel:string,
    SrcOriginalUserType:string,
    SrcPortNumber:int,
    SrcRiskLevel:int,
    SrcUserId:string,
    SrcUserIdType:string,
    SrcUsername:string,
    SrcUsernameType:string,
    SrcUserScope:string,
    SrcUserScopeId:string,
    SrcUserSessionId:string,
    SrcUserType:string,
    SrcUserUid:string,
    ThreatCategory:string,
    ThreatConfidence:int,
    ThreatField:string,
    ThreatFirstReportedTime:datetime,
    ThreatId:string,
    ThreatIsActive:bool,
    ThreatLastReportedTime:datetime,
    ThreatName:string,
    ThreatOriginalConfidence:string,
    ThreatOriginalRiskLevel:string,
    ThreatRiskLevel:int,
    User:string
  )[];
  EmptyDhcpEvents