Parser:
  Title: Dhcp event ASIM schema function
  Version: '0.1.0'
  LastUpdated: Mar 11 2024
Product:
  Name: Microsoft
Normalization:
  Schema: DhcpEvent
  Version: '0.1'
References:
- Title: ASIM Dhcp Event Schema
  Link: https://aka.ms/ASimDhcpEventDoc
- Title: ASIM
  Link: https://aka.ms/AboutASIM
Description: |
  This function returns an empty ASIM Dhcp Event schema.
ParserName: vimDhcpEventEmpty
EquivalentBuiltInParser: _Im_DhcpEvent_Empty
ParserQuery: |
  let EmptyDhcpEvents =datatable (
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // ****** Event fields ******
  , EventType:string
  , EventProduct:string
  , EventProductVersion:string
  , EventCount:int
  , EventMessage:string
  , EventVendor:string
  , EventSchema:string
  , EventSchemaVersion:string
  , EventSeverity:string
  , EventSubType:string
  , EventOriginalUid:string
  , EventOriginalType:string
  , EventOriginalResultDetails:string
  , EventOriginalSeverity:string
  , EventOriginalSubType:string
  , EventStartTime:datetime
  , EventEndTime:datetime
  , EventReportUrl:string
  , EventResult: string
  , EventResultDetails: string
  , AdditionalFields:dynamic
  , EventOwner:string
  // ****** Device fields ******
  ,  DvcId:string
  ,  DvcHostname:string
  ,  DvcDomain:string
  ,  DvcDomainType:string
  ,  DvcFQDN:string
  ,  DvcIpAddr:string
  ,  DvcOs:string
  ,  DvcOsVersion:string
  ,  DvcMacAddr:string
  ,  DvcAction:string
  ,  DvcOriginalAction:string
  ,  DvcDescription: string
  ,  DvcIdType: string
  ,  DvcInterface: string
  ,  DvcZone: string
  ,  DvcScopeId:string
  ,  DvcScope:string
  // ****** Source User fields ******
  , SrcUserId:string
  , SrcUserUid:string
  , SrcUserIdType:string
  , SrcUserScopeId:string
  , SrcUserScope:string
  , SrcUsername:string
  , SrcUsernameType:string
  , SrcUserType:string
  , SrcOriginalUserType:string
  , SrcUserSessionId:string
  // ****** Source System fields ******
  , SrcIpAddr: string
  , SrcPortNumber:int
  , SrcHostname:string
  , SrcMacAddr:string
  , SrcDomain:string
  , SrcDomainType:string
  , SrcFQDN:string
  , SrcDescription:string
  , SrcDvcId:string
  , SrcDvcIdType:string
  , SrcDvcScopeId:string
  , SrcDvcScope:string
  , SrcDeviceType:string
  , SrcGeoCountry:string
  , SrcGeoLatitude:real
  , SrcGeoLongitude:real
  , SrcGeoRegion:string
  , SrcGeoCity:string
  , SrcRiskLevel:int
  , SrcOriginalRiskLevel:string
  // ****** Dhcp Event Fields ******
  , RequestedIpAddr:string //Optional
  , DhcpLeaseDuration:int
  , DhcpSessionId:string
  , DhcpSessionDuration:int
  , DhcpSrcDHCId:string
  , DhcpCircuitId:string
  , DhcpSubscriberId:string
  , DhcpVendorClassId:string
  , DhcpVendorClass:string
  , DhcpUserClassId:string
  , DhcpUserClass:string
  // ****** aliases ******
  , SessionId:string
  , Duration:int
  , Src: string
  , Dst: string
  , User: string
  , IpAddr:string
  , Hostname:string
  //****** Inspection fields ******
  ,  RuleName:string
  ,  RuleNumber:int
  ,  ThreatId:string
  ,  ThreatName:string
  ,  ThreatCategory:string
  ,  ThreatRiskLevel:int
  ,  ThreatOriginalRiskLevel:string
  ,  ThreatConfidence:int
  ,  ThreatOriginalConfidence:string
  ,  ThreatIsActive:bool
  ,  ThreatFirstReportedTime:datetime
  ,  ThreatLastReportedTime:datetime
  ,  ThreatField:string
  )[];
  EmptyDhcpEvents