id: e3c63c74-1140-406b-bfd6-9ddee2677f9e
name: Access to sensitive data from known TI matched IP Addresses
description: |
  This query detects access to data that has classification insights (link below) and/or sensitivity label insights (link below), from IP adresses that are marked via the TI.
  Classification insights: https://docs.microsoft.com/en-us/azure/purview/classification-insights
  Sensitivty label insigths: https://docs.microsoft.com/en-us/azure/purview/sensitivity-insights
requiredDataConnectors: []
severity: High
queryPeriod: 1d
queryFrequency: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Exfiltration
  - Collection
relevantTechniques:
  - T1567
  - T1530
query: |

  // accesses to labeled and/or classified data
  let AccessLogs = DSMAzureBlobStorageLogs
      | where isnotempty(CorrelationId)
      | project
          Asset = tostring(parse_url(Uri).Path),
          UserObjectId=RequesterObjectId,
          StatusCode,
          AggregationCount,
          CorrelationId,
          TimeGenerated,
          NetworkIP = CallerIpAddress;
  let ScanDataLookback = now() - 30d;
  let Sensitivity = 
      DSMDataLabelingLogs
      | where TimeGenerated > ScanDataLookback
      | where isnotempty(SensitivityLabelName)
      | project
          SensitivityLabelName = replace(@'\[|\]|\"', @'', SensitivityLabelName),
          CorrelationId
      | distinct *;
  // classified data
  let Classification = 
      DSMDataClassificationLogs
      | where TimeGenerated > ScanDataLookback
      | where isnotempty(ClassificationDetails)
      | mv-expand ClassificationDetails
      | project
          ClassificationName = tostring(ClassificationDetails.Name),
          UniqueCount = tostring(ClassificationDetails.UniqueCount),
          Confidence = tostring(ClassificationDetails.Confidence),
          CorrelationId
      | distinct *;
  // all labeled and/or classified data
  let ScanData = Classification
      | join kind=fullouter Sensitivity
          on CorrelationId;
  let TI_IPs = ThreatIntelligenceIndicator
      | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
      | project NetworkIP;
  AccessLogs
  | join kind=inner ScanData on CorrelationId
  | join kind=inner TI_IPs on NetworkIP
  | summarize 
      AccessCount = sum(AggregationCount),
      StartTime = min(TimeGenerated),
      EndTime = max(TimeGenerated)
      by
      NetworkIP,
      UserObjectId,
      ClassificationName,
      UniqueCount,
      Confidence,
      SensitivityLabelName,
      StatusCode,
      Asset
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: ObjectGuid
        columnName: UserObjectId
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: NetworkIP
version: 1.0.0
kind: Scheduled


