id: 48c026d8-7f36-4a95-9568-6f1420d66e37
kind: Scheduled
name: Subscription moved to another tenant
description: |
  Detects when a subscription is moved to another tenant. This may indicate a subscription hijacking event.
severity: Low
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryPeriod: 20m
queryFrequency: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
relevantTechniques:
  - T1496
query: |
  let queryFrequency = 5m;
  let eventCapture = "moved from tenant ([0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}) to tenant ([0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12})";
  AzureActivity
  | where ingestion_time() > ago(queryFrequency)
  | where OperationNameValue == "Microsoft.Subscription/updateTenant/action"
  | where isnotempty(Properties_d)
  | extend Summary = tostring(Properties_d.message)
  | extend EventCapture = extract_all(eventCapture, Summary)
  | extend SourceTenantId = iff(isnotempty(EventCapture), EventCapture[0][0], "")
  | extend DestinationTenantId = iff(isnotempty(EventCapture), EventCapture[0][1], "")
  | extend UserParts = split(Caller, "@")
  | extend UserName = iff(array_length(UserParts) == 2, UserParts[0], Caller)
  | extend UserUPNSuffix = iff(array_length(UserParts) == 2, UserParts[1], "")
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
  - entityType: AzureResource
    fieldMappings: 
      - identifier: ResourceId
        columnName: SubscriptionId                 
  - entityType: Account
    fieldMappings: 
      - identifier: Name
        columnName: UserName
      - identifier: UPNSuffix
        columnName: UserUPNSuffix
customDetails:
  DestinationTenantId: DestinationTenantId
  SourceTenantId: SourceTenantId
  SubscriptionId: SubscriptionId
alertDetailsOverride:
  alertDescriptionFormat: |
    The user {{Caller}} moved a subscription:
    
    {{Summary}}
    
    If this was not expected, it may indicate a subscription hijacking event.
  alertDisplayNameFormat: |
    Subscription {{SubscriptionId}} changed tenants
version: 1.0.0