{
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion":  "1.0.0.0",
    "metadata":  {
                     "author":  "Ronald Czachara - ron@signl4.com",
                     "comments":  "Solution template for SIGNL4"
                 },
    "parameters":  {
                       "location":  {
                                        "type":  "string",
                                        "minLength":  1,
                                        "defaultValue":  "[resourceGroup().location]",
                                        "metadata":  {
                                                         "description":  "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
                                                     }
                                    },
                       "workspace-location":  {
                                                  "type":  "string",
                                                  "minLength":  1,
                                                  "defaultValue":  "[parameters(\u0027location\u0027)]",
                                                  "metadata":  {
                                                                   "description":  "Region to deploy solution resources"
                                                               }
                                              },
                       "workspace":  {
                                         "defaultValue":  "",
                                         "type":  "string",
                                         "metadata":  {
                                                          "description":  "Workspace name for Log Analytics where Sentinel is setup"
                                                      }
                                     },
                       "playbook1-PlaybookName":  {
                                                      "defaultValue":  "SIGNL4_Alerting_and_Response",
                                                      "type":  "string",
                                                      "minLength":  1,
                                                      "metadata":  {
                                                                       "description":  "Resource name for the logic app playbook.  No spaces are allowed"
                                                                   }
                                                  },
                       "connector1-name":  {
                                               "type":  "string",
                                               "defaultValue":  "69d7587b-7319-4f09-aa7f-ef6e16eba8e5"
                                           }
                   },
    "variables":  {
                      "playbook1-Playbooks":  "playbook1-Playbooks",
                      "_playbook1-Playbooks":  "[variables(\u0027playbook1-Playbooks\u0027)]",
                      "playbook1-AzureSentinelConnectionName":  "[concat(\u0027azuresentinel-\u0027, parameters(\u0027playbook1-PlaybookName\u0027))]",
                      "playbook1-SIGNL4ConnectionName":  "[concat(\u0027signl4-\u0027, parameters(\u0027playbook1-PlaybookName\u0027))]",
                      "playbook-1-connection-1":  "[concat(\u0027/subscriptions/\u0027, subscription().subscriptionId, \u0027/providers/Microsoft.Web/locations/\u0027, parameters(\u0027workspace-location\u0027), \u0027/managedApis/azuresentinel\u0027)]",
                      "_playbook-1-connection-1":  "[variables(\u0027playbook-1-connection-1\u0027)]",
                      "playbook-1-connection-2":  "[concat(\u0027/subscriptions/\u0027, subscription().subscriptionId, \u0027/providers/Microsoft.Web/locations/\u0027, parameters(\u0027workspace-location\u0027), \u0027/managedApis/signl4\u0027)]",
                      "_playbook-1-connection-2":  "[variables(\u0027playbook-1-connection-2\u0027)]",
                      "connector1-source":  "[concat(\u0027/subscriptions/\u0027,subscription().subscriptionId,\u0027/resourceGroups/\u0027,resourceGroup().name,\u0027/providers/Microsoft.OperationalInsights/workspaces/\u0027,parameters(\u0027workspace\u0027),\u0027/providers/Microsoft.SecurityInsights/dataConnectors/\u0027,parameters(\u0027connector1-name\u0027))]",
                      "_connector1-source":  "[variables(\u0027connector1-source\u0027)]",
                      "DerdackSIGNL4Connector":  "DerdackSIGNL4Connector",
                      "_DerdackSIGNL4Connector":  "[variables(\u0027DerdackSIGNL4Connector\u0027)]",
                      "sourceId":  "signl4.azure-sentinel-solution-signl4",
                      "_sourceId":  "[variables(\u0027sourceId\u0027)]"
                  },
    "resources":  [
                      {
                          "type":  "Microsoft.Web/connections",
                          "apiVersion":  "2016-06-01",
                          "name":  "[variables(\u0027playbook1-AzureSentinelConnectionName\u0027)]",
                          "location":  "[parameters(\u0027workspace-location\u0027)]",
                          "kind":  "V1",
                          "properties":  {
                                             "displayName":  "[variables(\u0027playbook1-AzureSentinelConnectionName\u0027)]",
                                             "parameterValueType":  "Alternative",
                                             "api":  {
                                                         "id":  "[variables(\u0027_playbook-1-connection-1\u0027)]"
                                                     }
                                         }
                      },
                      {
                          "type":  "Microsoft.Web/connections",
                          "apiVersion":  "2016-06-01",
                          "name":  "[variables(\u0027playbook1-SIGNL4ConnectionName\u0027)]",
                          "location":  "[parameters(\u0027workspace-location\u0027)]",
                          "properties":  {
                                             "displayName":  "[variables(\u0027playbook1-SIGNL4ConnectionName\u0027)]",
                                             "api":  {
                                                         "id":  "[variables(\u0027_playbook-1-connection-2\u0027)]"
                                                     }
                                         }
                      },
                      {
                          "type":  "Microsoft.Logic/workflows",
                          "apiVersion":  "2017-07-01",
                          "name":  "[parameters(\u0027playbook1-PlaybookName\u0027)]",
                          "location":  "[parameters(\u0027workspace-location\u0027)]",
                          "tags":  {
                                       "LogicAppsCategory":  "security",
                                       "hidden-SentinelTemplateName":  "SIGNL4",
                                       "hidden-SentinelTemplateVersion":  "1.0"
                                   },
                          "identity":  {
                                           "type":  "SystemAssigned"
                                       },
                          "dependsOn":  [
                                            "[resourceId(\u0027Microsoft.Web/connections\u0027, variables(\u0027playbook1-AzureSentinelConnectionName\u0027))]",
                                            "[resourceId(\u0027Microsoft.Web/connections\u0027, variables(\u0027playbook1-SIGNL4ConnectionName\u0027))]"
                                        ],
                          "properties":  {
                                             "state":  "Enabled",
                                             "definition":  {
                                                                "$schema":  "https://schema.@{variables(\u0027azureManagementUrl\u0027)}/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#",
                                                                "actions":  {
                                                                                "For_each":  {
                                                                                                 "foreach":  "@triggerBody()?[\u0027object\u0027]?[\u0027properties\u0027]?[\u0027Alerts\u0027]",
                                                                                                 "actions":  {
                                                                                                                 "Trigger_Alert":  {
                                                                                                                                       "type":  "ApiConnection",
                                                                                                                                       "inputs":  {
                                                                                                                                                      "body":  {
                                                                                                                                                                   "flags":  0,
                                                                                                                                                                   "severity":  0,
                                                                                                                                                                   "text":  "@items(\u0027For_each\u0027)?[\u0027properties\u0027]?[\u0027description\u0027]",
                                                                                                                                                                   "title":  "Azure Sentinel Alert"
                                                                                                                                                               },
                                                                                                                                                      "host":  {
                                                                                                                                                                   "connection":  {
                                                                                                                                                                                      "name":  "@parameters(\u0027$connections\u0027)[\u0027signl4\u0027][\u0027connectionId\u0027]"
                                                                                                                                                                                  }
                                                                                                                                                               },
                                                                                                                                                      "method":  "post",
                                                                                                                                                      "path":  "/alerts"
                                                                                                                                                  }
                                                                                                                                   }
                                                                                                             },
                                                                                                 "type":  "Foreach"
                                                                                             }
                                                                            },
                                                                "contentVersion":  "1.0.0.0",
                                                                "parameters":  {
                                                                                   "$connections":  {
                                                                                                        "type":  "Object"
                                                                                                    }
                                                                               },
                                                                "triggers":  {
                                                                                 "When_Azure_Sentinel_incident_creation_rule_was_triggered":  {
                                                                                                                                                  "inputs":  {
                                                                                                                                                                 "body":  {
                                                                                                                                                                              "callback_url":  "@{listCallbackUrl()}"
                                                                                                                                                                          },
                                                                                                                                                                 "host":  {
                                                                                                                                                                              "connection":  {
                                                                                                                                                                                                 "name":  "@parameters(\u0027$connections\u0027)[\u0027azuresentinel\u0027][\u0027connectionId\u0027]"
                                                                                                                                                                                             }
                                                                                                                                                                          },
                                                                                                                                                                 "path":  "/incident-creation"
                                                                                                                                                             },
                                                                                                                                                  "type":  "ApiConnectionWebhook"
                                                                                                                                              }
                                                                             }
                                                            },
                                             "parameters":  {
                                                                "$connections":  {
                                                                                     "value":  {
                                                                                                   "azuresentinel":  {
                                                                                                                         "connectionId":  "[resourceId(\u0027Microsoft.Web/connections\u0027, variables(\u0027playbook1-AzureSentinelConnectionName\u0027))]",
                                                                                                                         "connectionName":  "[variables(\u0027playbook1-AzureSentinelConnectionName\u0027)]",
                                                                                                                         "id":  "[concat(\u0027/subscriptions/\u0027, subscription().subscriptionId, \u0027/providers/Microsoft.Web/locations/\u0027, parameters(\u0027workspace-location\u0027), \u0027/managedApis/azuresentinel\u0027)]",
                                                                                                                         "connectionProperties":  {
                                                                                                                                                      "authentication":  {
                                                                                                                                                                             "type":  "ManagedServiceIdentity"
                                                                                                                                                                         }
                                                                                                                                                  }
                                                                                                                     },
                                                                                                   "signl4":  {
                                                                                                                  "connectionId":  "[resourceId(\u0027Microsoft.Web/connections\u0027, variables(\u0027playbook1-SIGNL4ConnectionName\u0027))]",
                                                                                                                  "connectionName":  "[variables(\u0027playbook1-SIGNL4ConnectionName\u0027)]",
                                                                                                                  "id":  "[concat(\u0027/subscriptions/\u0027, subscription().subscriptionId, \u0027/providers/Microsoft.Web/locations/\u0027, parameters(\u0027workspace-location\u0027), \u0027/managedApis/signl4\u0027)]"
                                                                                                              }
                                                                                               }
                                                                                 }
                                                            }
                                         }
                      },
                      {
                          "id":  "[variables(\u0027_connector1-source\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/\u0027,parameters(\u0027connector1-name\u0027))]",
                          "apiVersion":  "2021-03-01-preview",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/dataConnectors",
                          "location":  "[parameters(\u0027workspace-location\u0027)]",
                          "kind":  "GenericUI",
                          "properties":  {
                                             "connectorUiConfig":  {
                                                                       "title":  "Derdack SIGNL4",
                                                                       "publisher":  "Derdack",
                                                                       "descriptionMarkdown":  "SIGNL4 offers critical alerting, incident response and service dispatching for operating critical infrastructure. It alerts you persistently via app push, SMS text and voice calls including tracking, escalation, collaboration and duty planning. \n\n[Learn more \u003e](https://www.signl4.com)",
                                                                       "graphQueries":  [
                                                                                            {
                                                                                                "metricName":  "Total data received",
                                                                                                "legend":  "SIGNL4_CL",
                                                                                                "baseQuery":  "SecurityIncident"
                                                                                            }
                                                                                        ],
                                                                       "sampleQueries":  [
                                                                                             {
                                                                                                 "description":  "Get SIGNL4 alert and status information.",
                                                                                                 "query":  "SecurityIncident\n | where Labels contains \"SIGNL4\""
                                                                                             }
                                                                                         ],
                                                                       "dataTypes":  [
                                                                                         {
                                                                                             "name":  "SIGNL4_CL",
                                                                                             "lastDataReceivedQuery":  "SecurityIncident\n | where Labels contains \"SIGNL4\" | summarize Time = max(TimeGenerated) | where isnotempty(Time)"
                                                                                         }
                                                                                     ],
                                                                       "connectivityCriterias":  [
                                                                                                     {
                                                                                                         "type":  "IsConnectedQuery",
                                                                                                         "value":  [
                                                                                                                       "SecurityIncident\n | where Labels contains \"SIGNL4\""
                                                                                                                   ]
                                                                                                     }
                                                                                                 ],
                                                                       "availability":  {
                                                                                            "status":  1,
                                                                                            "isPreview":  true
                                                                                        },
                                                                       "permissions":  {
                                                                                           "resourceProvider":  [
                                                                                                                    {
                                                                                                                        "provider":  "Microsoft.OperationalInsights/workspaces",
                                                                                                                        "permissionsDisplayText":  "read and write permissions are required.",
                                                                                                                        "providerDisplayName":  "Workspace",
                                                                                                                        "scope":  "Workspace",
                                                                                                                        "requiredPermissions":  {
                                                                                                                                                    "write":  true,
                                                                                                                                                    "read":  true,
                                                                                                                                                    "delete":  true
                                                                                                                                                }
                                                                                                                    },
                                                                                                                    {
                                                                                                                        "provider":  "Microsoft.OperationalInsights/workspaces/sharedKeys",
                                                                                                                        "permissionsDisplayText":  "read permissions to shared keys for the workspace are required. [See the documentation to learn more about workspace keys](https://docs.microsoft.com/azure/azure-monitor/platform/agent-windows#obtain-workspace-id-and-key).",
                                                                                                                        "providerDisplayName":  "Keys",
                                                                                                                        "scope":  "Workspace",
                                                                                                                        "requiredPermissions":  {
                                                                                                                                                    "action":  true
                                                                                                                                                }
                                                                                                                    }
                                                                                                                ]
                                                                                       },
                                                                       "instructionSteps":  [
                                                                                                {
                                                                                                    "description":  "\u003e**NOTE:** This data connector is mainly configured on the SIGNL4 side. You can find a description video here: [**Integrate SIGNL4 with Azure Sentinel**](https://www.signl4.com/blog/portfolio_item/azure-sentinel-mobile-alert-notification-duty-schedule-escalation/)."
                                                                                                },
                                                                                                {
                                                                                                    "description":  "\u003e**SIGNL4 Connector:** The SIGNL4 connector for Azure Sentinel, Azure Security Center and other Azure Graph Security API providers provides seamless 2-way integration with your Azure Security solutions. Once added to your SIGNL4 team, the connector will read security alerts from Azure Graph Security API and fully automatically and trigger alert notifications to your team members on duty. It will also synchronize the alert status from SIGNL4 to Graph Security API, so that if alerts are acknowledged or closed, this status is also updated on the according Azure Graph Security API alert or the corresponding security provider. As mentioned, the connector mainly uses Azure Graph Security API, but for some security providers, such as Azure Sentinel, it also uses dedicated REST APIs from according Azure solutions."
                                                                                                },
                                                                                                {
                                                                                                    "description":  "Azure Sentinel is a cloud native SIEM solution from Microsoft and a security alert provider in Azure Graph Security API. However, the level of alert details available with the Graph Security API is limited for Azure Sentinel. The connector can therefore augment alerts with further details (insights rule search results), from the underlying Azure Sentinel Log Analytics workspace. To be able to do that, the connector communicates with Azure Log Analytics REST API and needs according permissions (see below). Furthermore, the app can also update the status of Azure Sentinel incidents, when all related security alerts are e.g. in progress or resolved. In order to be able to do that, the connector needs to be a member of the \u0027Azure Sentinel Contributors\u0027 group in your Azure Subscription.\n **Automated deployment in Azure**\n The credentials required to access the beforementioned APIs, are generated by a small PowerShell script that you can download below. The script performs the following tasks for you:\n - Logs you on to your Azure Subscription (please login with an administrator account)\n - Creates a new enterprise application for this connector in your Azure AD, also referred to as service principal\n - Creates a new role in your Azure IAM that grants read/query permission to only Azure Log Analytics workspaces.\n - Joins the enterprise application to that user role\n - Joins the enterprise application to the \u0027Azure Sentinel Contributors\u0027 role\n - Outputs some data that you need to configure app (see below)",
                                                                                                    "title":  "Azure Sentinel Features"
                                                                                                },
                                                                                                {
                                                                                                    "description":  "1. Download the PowerShell deployment script from [here](https://github.com/signl4/signl4-integration-azuresentinel/blob/master/registerSIGNL4Client.ps1).\n2. Review the script and the roles and permission scopes it deploys for the new app registration. If you don\u0027t want to use the connector with Azure Sentinel, you could remove all role creation and role assignment code and only use it to create the app registration (SPN) in your Azure Active Directory.\n3. Run the script. At the end it outputs information that you need to enter in the connector app configuration.\n4. In Azure AD, click on \u0027App Registrations\u0027. Find the app with the name \u0027SIGNL4AzureSecurity\u0027 and open its details\n5. On the left menu blade click \u0027API Permissions\u0027. Then click \u0027Add a permission\u0027.\n6. On the blade that loads, under \u0027Microsoft APIs\u0027 click on the \u0027Microsoft Graph\u0027 tile, then click \u0027App permission\u0027.\n7. In the table that is displayed expand \u0027SecurityEvents\u0027 and check \u0027SecurityEvents.Read.All\u0027 and \u0027SecurityEvents.ReadWrite.All\u0027.\n8. Click \u0027Add permissions\u0027.",
                                                                                                    "title":  "Deployment procedure"
                                                                                                },
                                                                                                {
                                                                                                    "description":  "Finally, enter the IDs, that the script has outputted in the connector configuration:\n - Azure Tenant ID\n - Azure Subscription ID\n - Client ID (of the enterprise application)\n - Client Secret (of the enterprise application)\n Once the app is enabled, it will start reading your Azure Graph Security API alerts.\n\n\u003e**NOTE:** It will initially only read the alerts that have occurred within the last 24 hours.",
                                                                                                    "instructions":  [
                                                                                                                         {
                                                                                                                             "parameters":  {
                                                                                                                                                "fillWith":  [
                                                                                                                                                                 "WorkspaceId"
                                                                                                                                                             ],
                                                                                                                                                "label":  "Workspace ID"
                                                                                                                                            },
                                                                                                                             "type":  "CopyableLabel"
                                                                                                                         }
                                                                                                                     ],
                                                                                                    "title":  "Configuring the SIGNL4 connector app"
                                                                                                }
                                                                                            ]
                                                                   }
                                         }
                      },
                      {
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/metadata",
                          "apiVersion":  "2021-03-01-preview",
                          "properties":  {
                                             "version":  "1.0.0",
                                             "kind":  "Solution",
                                             "contentId":  "[variables(\u0027_sourceId\u0027)]",
                                             "parentId":  "[variables(\u0027_sourceId\u0027)]",
                                             "source":  {
                                                            "kind":  "Solution",
                                                            "name":  "SIGNL4",
                                                            "sourceId":  "[variables(\u0027_sourceId\u0027)]"
                                                        },
                                             "author":  {
                                                            "name":  "Ronald",
                                                            "email":  "Czachara"
                                                        },
                                             "support":  {
                                                             "name":  "Derdack",
                                                             "email":  "success@signl4.com",
                                                             "tier":  "Derdack",
                                                             "link":  "https://www.signl4.com"
                                                         },
                                             "dependencies":  {
                                                                  "operator":  "AND",
                                                                  "criteria":  [
                                                                                   {
                                                                                       "kind":  "Playbook",
                                                                                       "contentId":  "[variables(\u0027_playbook1-Playbooks\u0027)]",
                                                                                       "version":  "1.0.0"
                                                                                   },
                                                                                   {
                                                                                       "kind":  "DataConnector",
                                                                                       "contentId":  "[variables(\u0027_DerdackSIGNL4Connector\u0027)]",
                                                                                       "version":  "1.0.0"
                                                                                   }
                                                                               ]
                                                              },
                                             "firstPublishDate":  "2021-12-10",
                                             "lastPublishDate":  "2021-12-10",
                                             "providers":  [
                                                               "Derdack"
                                                           ],
                                             "categories":  {
                                                                "domains":  [
                                                                                "DevOps",
                                                                                "IT Operations"
                                                                            ]
                                                            }
                                         },
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/\u0027, variables(\u0027_sourceId\u0027))]"
                      }
                  ],
    "outputs":  {

                }
}
