id: d292d770-69a4-4399-9272-6e86c4e53e58
name: Login into LastPass from a previously unknown IP.
description: |
  'This query will check how many activity there is in LastPass from IPs that are not seen before in the Sign-in Logs'
requiredDataConnectors:
  - connectorId: LastPass
    dataTypes:
      - LastPassNativePoller_CL
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
  - T1190
query: |
  let IPs = SigninLogs
    | project IPAddress;
  LastPassNativePoller_CL
  | where Action_s != "Reporting"
  | where IP_Address_s !in (IPs)
  | summarize by IP_Address_s, Username_s, bin(todatetime(Time_s), 1d)
  | extend AccountCustomEntity = Username_s, IPCustomEntity = IP_Address_s, TimestampCustomEntity = Time_s
 
