id: af925b11-0a84-4eeb-bcb0-d614ebbe79d3
name: app-armor-stopped
description: |-
  This query was originally published in the threat analytics report, Sysrv botnet evolution.
  Sysrv is a Go-based botnet that targets both Windows and Linux servers, and steals resources to mine cryptocurrency.
  The following query finds instances of the attacker attempting to stop the AppArmor network security service on devices running Linux.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents
  | where InitiatingProcessCommandLine  has "/bin/bash /tmp/" and ProcessCommandLine has "service apparmor stop"
