id: e22d0cc2-e2e0-40f6-b2ae-8b61a2accac2
name: kinsing-miner-download
description: |-
  This query was originally published in the threat analytics report, Sysrv botnet evolution.
  Sysrv is a Go-based botnet that targets both Windows and Linux servers, and steals resources to mine cryptocurrency.
  The following query finds instances where the attacker commanded the Kinsing miner file to be downloaded on Linux devices.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents
  | where ProcessCommandLine has_all('curl', '-o /etc/kinsing')
