id: 4a5e8d60-ba88-4a0e-8bae-0615060d9fe3
name: oracle-webLogic-executing-powershell
description: |-
  This query was originally published in the threat analytics report, Sysrv botnet evolution.
  Sysrv is a Go-based botnet that targets both Windows and Linux servers, and steals resources to mine cryptocurrency.
  The following query finds instances of Oracle WebLogic being exploited to run a PowerShell script that downloads payloads.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
  - DeviceFileEvents
query: |-
  union DeviceProcessEvents, DeviceFileEvents
  | where InitiatingProcessParentFileName =~ 'wlsvcX64.exe' and InitiatingProcessFileName =~ 'powershell.exe'
