id: 2397f77e-e33e-4658-9a81-fe9dbafb810d
name: oracle-webLogic-executing-powershell
description: |
  This query was originally published in the threat analytics report, Sysrv botnet evolution.
  Sysrv is a Go-based botnet that targets both Windows and Linux servers, and steals resources to mine cryptocurrency.
  The following query finds instances of Oracle WebLogic being exploited to run a PowerShell script that downloads payloads.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
  - DeviceFileEvents
query: |
  union DeviceProcessEvents, DeviceFileEvents
  | where InitiatingProcessParentFileName =~ 'wlsvcX64.exe' and InitiatingProcessFileName =~ 'powershell.exe'
