Id: 62527635-bc5a-4233-bb93-e4eb4e60bb70
DisplayName: Files identified on host
Description: Any file referenced on a given host during the time of or recently after compromise (set time range to +-30m when running the query)
InputEntityType: File
InputFields:
  - FileName
OutputEntityTypes:
  - Host
QueryPeriodBefore: 30m
QueryPeriodAfter: 30m
DataSources:
  - SecurityEvent
Tactics:
  - Persistence
  - Discovery
  - LateralMovement
  - Collection
query: |

  let GetFilesHost = (v_File_Name:string){
  SecurityEvent
  | where CommandLine contains v_File_Name or ServiceFileName contains v_File_Name or ServiceName contains v_File_Name
  | summarize min(TimeGenerated), max(TimeGenerated) by Computer
  | project min_TimeGenerated, max_TimeGenerated, Computer
  | project-rename Host_UnstructuredName=Computer
  | top 10 by min_TimeGenerated desc nulls last
  };
  // change <Name> value below
  GetFilesHost('<Name>')

