id: f1e51dcc-6fa5-4de8-a70e-cd57956cc4a5
name: Qakbot Craigslist Domains
description: |-
  Qakbot operators have been abusing the Craigslist messaging system to send malicious emails. These emails contain non-clickable links to malicious domains impersonating Craigslist, which the user is instructed to manually type into the address bar to access.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceNetworkEvents
tactics:
- Initial access
query: |-
  DeviceNetworkEvents
  | where RemoteUrl matches regex @"abuse\.[a-zA-Z]\d{2}-craigslist\.org"
