id: 06ea5081-cdea-40c8-b829-240ece951243
name: Disabling Services via Registry
description: |
  Search for processes modifying the registry to disable security features.
description-detailed: |
  This query checks for processes modifying the registry to disable security features. This is a common technique used by threat actors for defence evasion.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - DefenseEvasion
query: |   
  DeviceProcessEvents
  | where InitiatingProcessCommandLine has_all(@'"reg"', 'add', @'"HKLM\SOFTWARE\Policies\', '/v','/t', 'REG_DWORD', '/d', '/f')
    and InitiatingProcessCommandLine has_any('DisableRealtimeMonitoring', 'UseTPMKey', 'UseTPMKeyPIN', 'UseAdvancedStartup', 
    'EnableBDEWithNoTPM', 'RecoveryKeyMessageSource')
version: 1.0.0