id: f086d58b-c44b-4fae-903b-f65ad042a4ee
name: DLLHost.exe WMIC domain discovery
description: |
  This query checks for dllhost.exe calling WMIC to discover additional hosts and associated domain.
description-detailed: |
  This query checks for dllhost.exe calling WMIC to discover additional hosts and associated domain. This is a common technique used by ransomware to discover additional hosts and associated domain.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - Reconnaissance
query: |   
  DeviceProcessEvents 
  | where InitiatingProcessFileName =~ "dllhost.exe" and InitiatingProcessCommandLine == "dllhost.exe" 
  | where ProcessCommandLine has "wmic computersystem get domain"
version: 1.0.0