id: 88707168-d4a4-4ca7-a516-b2ee0310af1b
name: PowerShell adding exclusion path for Microsoft Defender of ProgramData
description: |
  Identify PowerShell creating an exclusion path of ProgramData directory for Microsoft Defender to not monitor.
description-detailed: |
  This query checks for PowerShell adding an exclusion path for Microsoft Defender to not monitor. This is a common technique used by ransomware to avoid detection by security products.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - DefenseEvasion
query: |   
  DeviceProcessEvents 
  | where FileName =~ "powershell.exe" and ProcessCommandLine has_all("try", "Add-MpPreference", "-ExclusionPath", "ProgramData", "catch")
version: 1.0.0