id: bff058b2-500e-4ae5-bb49-a5b1423cbd5b
name: Accessed files shared by temporary external user
description: |
  'This detection identifies an external user is added to a Team or Teams chat
  and shares a files which is accessed by many users (>10) and the users is removed within short period of time. This might be
  an indicator of suspicious activity.'
severity: Low
status: Available 
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity (Teams)
  - connectorId: Office365
    dataTypes:
      - OfficeActivity (SharePoint)
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
 let fileAccessThrehold = 10;
 OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "MemberAdded"
  | extend MemberAdded = tostring(parse_json(Members)[0].UPN)
  | where MemberAdded contains ("#EXT#")
  | project TimeAdded=TimeGenerated, Operation, MemberAdded, UserWhoAdded = UserId, TeamName
  | join kind = inner(
                        OfficeActivity
                        | where OfficeWorkload =~ "MicrosoftTeams"
                        | where Operation =~ "MemberRemoved"
                        | extend MemberAdded = tostring(parse_json(Members)[0].UPN)
                        | where MemberAdded contains ("#EXT#")
                        | project TimeDeleted=TimeGenerated, Operation, MemberAdded, UserWhoDeleted = UserId, TeamName
                      ) on MemberAdded
  | where TimeDeleted > TimeAdded
  | join kind=inner 
                    (
                    OfficeActivity
                    | where RecordType == "SharePointFileOperation"
                    | where SourceRelativeUrl has "Microsoft Teams Chat Files"
                    | where Operation == "FileUploaded"
                    | join kind = inner 
                                        (
                                        OfficeActivity
                                        | where RecordType == "SharePointFileOperation"
                                        | where Operation  == "FileAccessed"
                                        | where SourceRelativeUrl has "Microsoft Teams Chat Files"
                                        | summarize FileAccessCount = count() by OfficeObjectId
                                        | where FileAccessCount > fileAccessThrehold
                                        ) on $left.OfficeObjectId == $right.OfficeObjectId
                    )on $left.MemberAdded == $right.UserId
  | extend AccountName = tostring(split(MemberAdded, "@")[0]), AccountUPNSuffix = tostring(split(MemberAdded, "@")[1])
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName 
        columnName: MemberAdded
      - identifier: Name
        columnName: AccountName
      - identifier: UPNSuffix
        columnName: AccountUPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ClientIP
version: 2.0.3
kind: Scheduled
