id: fbd72eb8-087e-466b-bd54-1ca6ea08c6d3
name: Office Policy Tampering
description: |
  'Identifies if any tampering is done to either auditlog, ATP Safelink, SafeAttachment, AntiPhish or Dlp policy. 
  An adversary may use this technique to evade detection or avoid other policy based defenses.
  References: https://docs.microsoft.com/powershell/module/exchange/advanced-threat-protection/remove-antiphishrule?view=exchange-ps.'
severity: Medium
status: Available 
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity (Exchange)
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - DefenseEvasion
relevantTechniques:
  - T1098
  - T1562
query: |
  // Generate the list of operations for Enriched Logs
    let opListEnriched = EnrichedMicrosoft365AuditLogs 
        | summarize by Operation
        | where Operation has_any ("Remove", "Disable")
        | where Operation contains "AntiPhish" or Operation contains "SafeAttachment" or Operation contains "SafeLinks" or Operation contains "Dlp" or Operation contains "Audit"
        | summarize make_set(Operation, 500);
    // Generate the list of operations for Office Logs
    let opListOffice = OfficeActivity 
        | summarize by Operation
        | where Operation has_any ("Remove", "Disable")
        | where Operation contains "AntiPhish" or Operation contains "SafeAttachment" or Operation contains "SafeLinks" or Operation contains "Dlp" or Operation contains "Audit"
        | summarize make_set(Operation, 500);
    // Query for EnrichedMicrosoft365AuditLogs
    let EnrichedEvents = EnrichedMicrosoft365AuditLogs
        | where RecordType == "ExchangeAdmin"
        | where UserType in~ ("Admin", "DcAdmin")
        | where Operation in~ (opListEnriched)
        | extend ClientIPOnly = case( 
            ClientIp has ".", tostring(split(ClientIp, ":")[0]), 
            ClientIp has "[", tostring(trim_start(@'[[]', tostring(split(ClientIp, "]")[0]))),
            ClientIp
          )  
        | extend Port = case(
            ClientIp has ".", tostring(split(ClientIp, ":")[1]),
            ClientIp has "[", tostring(split(ClientIp, "]:")[1]),
            ""
          )
        | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), OperationCount = count() by Operation, UserType, UserId, ClientIP = ClientIPOnly, Port, ResultStatus, Parameters = tostring(AdditionalProperties.Parameters)
        | extend AccountName = tostring(split(UserId, "@")[0]), AccountUPNSuffix = tostring(split(UserId, "@")[1]);
    // Query for OfficeActivity
        let OfficeEvents = OfficeActivity
        | where RecordType =~ "ExchangeAdmin"
        | where UserType in~ ("Admin", "DcAdmin")
        | where Operation in~ (opListOffice)
        | extend ClientIPOnly = case( 
            ClientIP has ".", tostring(split(ClientIP, ":")[0]), 
            ClientIP has "[", tostring(trim_start(@'[[]', tostring(split(ClientIP, "]")[0]))),
            ClientIP
          )  
        | extend Port = case(
            ClientIP has ".", tostring(split(ClientIP, ":")[1]),
            ClientIP has "[", tostring(split(ClientIP, "]:")[1]),
            ""
          )
        | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), OperationCount = count() by Operation, UserType, UserId, ClientIP = ClientIPOnly, Port, ResultStatus, Parameters
        | extend AccountName = tostring(split(UserId, "@")[0]), AccountUPNSuffix = tostring(split(UserId, "@")[1]);
        // Combine and Deduplicate Office and Enriched Logs
            let CombinedEvents = OfficeEvents
            | union EnrichedEvents
            | summarize arg_min(StartTimeUtc, *) by Operation, UserId, ClientIP;
        // Final Output
        CombinedEvents
        | project StartTimeUtc, EndTimeUtc, Operation, UserType, UserId, ClientIP, Port, ResultStatus, Parameters, AccountName, AccountUPNSuffix
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserId
      - identifier: Name
        columnName: AccountName
      - identifier: UPNSuffix
        columnName: AccountUPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ClientIP
version: 2.0.3
kind: Scheduled