id: 1d2c3da7-60ec-40be-9c14-bade6eaf3c49
name: Data Alert
description: |
  'This query identifies clients or servers whose data has been compromised.'
severity: Medium
status: Available
requiredDataConnectors: []
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
  - Impact

relevantTechniques:
  - T1578
  - T1531
tags:
  - Commvault
  - Metallic
  - Threat Intelligence
  - Ransomware
query: |
    SecurityIncident
    | where Title has "Cvlt Alert" and Description has "Client" and Description has "Compromised" and Status has "New"
    | extend extracted_word = extract("Client\\s(.*?)\\sCompromised", 1, Description)
    | project TimeGenerated, Title, Description, Status
entityMappings: null
version: 1.0.0
kind: Scheduled
