id: 29e0767c-80ac-4689-9a2e-b25b9fc88fce
name: User Alert
description: |
  'This query identifies users whose user account or credentials have been compromised.'
severity: Medium
status: Available
requiredDataConnectors:
  - connectorId: CommvaultSecurityIQ_CL
    datatypes:
      - CommvaultSecurityIQ_CL
queryFrequency: 5m
queryPeriod: 5m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
  - Impact
customDetails:
  User: User
relevantTechniques:
  - T1578
  - T1531
tags:
  - Commvault
  - Metallic
  - Threat Intelligence
  - Ransomware
query: |
    SecurityIncident
    | where Title has "Cvlt Alert" and Description has "User" and Description has "Compromised" and Status has "New"
    | extend extracted_word = extract("User\\s(.*?)\\sCompromised", 1, Description)
    | project TimeGenerated, Title, Description, Status, User = extracted_word
entityMappings: null
version: 1.0.2
kind: Scheduled
