id: 4d11f63f-5b64-416e-8d77-266e4c6d382e
name: Dropping Payload via certutil
description: |
  BazaCall campaign tricks users into calling a fake customer support center, and download a malicious Excel file which contains a macro to infect users' device with BazaLoader. This query searches for a copy of certutil.exe used by the macro.
description-detailed: |
  BazaCall is a campaign that manipulate users into calling a customer support center, where they are instructed to download an Excel file to unsubscribe from a phony service. When the user opens the Excel file, they are prompted to enable a malicious macro that infects their device with BazaLoader.
  This query hunts for an attacker-created copy of certutil.exe, a legitimate process, which the macro uses to download BazaLoader.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceFileEvents
tactics:
  - InitialAccess
  - DefenseEvasion
query: |
  DeviceFileEvents
  | where InitiatingProcessFileName !~ "certutil.exe"
  | where InitiatingProcessFileName !~ "cmd.exe"
  | where InitiatingProcessCommandLine has_all("-urlcache", "split", "http")
version: 1.0.0
