id: c2b4ef3a-216d-4506-8b35-6a1b0f2a3bf7
name: Malicious URL Clicks by workload
description: |
  Summarizes malicious URL click events by Microsoft 365 workload to help identify which services are most targeted or impacted.
description-detailed: |
  This query provides a breakdown of malicious URL clicks (phishing, malware, or spam) by Microsoft 365 workload (e.g., Exchange, Teams, SharePoint), helping security teams identify which services are being targeted or impacted by user click activity.
  By default, results are limited to the top 10 workloads; you can remove or adjust the limit to view all results.
  Part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
    - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  UrlClickEvents
  | where Timestamp between (TimeStart .. TimeEnd)
  | where ThreatTypes has_any ("Phish", "Malware", "Spam")
  | summarize MaliciousClicks = count() by Workload
  | sort by MaliciousClicks desc
  | top 10 by MaliciousClicks  // Uncomment to limit to top 10 workloads; remove to see all
  //| render piechart // Uncomment to visualize proportional breakdown by workload
  //| render columnchart // Uncomment to compare workloads
version: 1.0.0
