id: ba4f7e56-a2f8-4a30-b848-200fdc7fc3a2
name: Malicious Clicks allowed (click-through)
description: |
  Identifies allowed click-through events on URLs categorized as malicious to help analysts track users who bypassed protection
  Note: Time range is controlled by the portal's time picker; uncomment filters to focus on specific threat types
  Based on Defender for Office 365 workbook: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  UrlClickEvents
  | where ActionType == "ClickAllowed"
  // | where ThreatTypes has_any ("Malware", "Phish", "Spam")  // Uncomment to include only allowed clicks on URLs categorized as malicious
  | summarize ClickCount = count(), (Timestamp, NetworkMessageId) = arg_max(Timestamp, NetworkMessageId) by AccountUpn, ThreatTypes
  | sort by ClickCount desc
  // | top 10 by ClickCount desc  // Uncomment or adjust N for summary/reporting use
version: 1.0.0