id: a937905e-ee5c-406c-ab86-8e2581240112
name: Top 10 Users clicking on Malicious URLs (Phish)
description: |
  Identifies the top 10 users who have clicked on URLs classified as phishing, helping prioritize user training and response.
description-detailed: |
  This query identifies the top 10 users who have clicked on URLs detected as phishing by Safe Links or other Defender for Office 365 protections.
  By default, results are limited to the top 10 users with the highest click counts for phishing URLs; you can remove or adjust this limit to see all users.
  Recommended visualization: columnchart for comparing users, or piechart for proportional breakdown if there are few users.
  Part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
    - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  UrlClickEvents
  | where Timestamp between (TimeStart .. TimeEnd)
  | where ThreatTypes has "Phish"
  | summarize PhishClicks = count() by User = AccountUpn
  | sort by PhishClicks desc
  | top 10 by PhishClicks  // Uncomment to limit to top 10 users; remove to see all results
  //| render columnchart // Recommended for comparing top users
  //| render piechart // Use for proportional breakdown if user count is small
version: 1.0.0
