id: 4620ece3-dceb-4151-8621-5a56351c97cd
name: URL Clicks by Action
description: |
  Categorizes URL clicks by action type (Allowed/Blocked) and threat type for analysis.
description-detailed: |
  Summarizes URL click events by action type (Allowed, Blocked) and threat type (Phish, Malware), 
  enabling analysis of click-through rates and policy enforcement effectiveness. Part of the Defender for Office 365 
  solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  UrlClickEvents
  | where Timestamp between (TimeStart .. TimeEnd)
  | extend ActionCategory = case(
      ActionType == "ClickBlocked", "Blocked",
      ActionType == "ClickAllowed", "Allowed",
      "Other"
    )
  | summarize Count = count() by ActionCategory, ThreatType = tostring(ThreatTypes)
  | sort by Count desc
  //| render piechart // Works for proportional breakdown
version: 1.0.0
