id: 3eef362d-3aee-4950-9208-4afa6f7afbe9
name: URL Click attempts by threat type
description: |
  Summarizes URL click attempts by threat type to help identify which threats users are most exposed to.
description-detailed: |
  This query provides a breakdown of URL click attempts by threat type (Phish, Malware, Spam), enabling security teams to assess user exposure to different categories of malicious content.
  By default, results are limited to the top 10 threat types; you can remove or adjust the limit to view all results.
  Part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
    - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  UrlClickEvents
  | where Timestamp between (TimeStart .. TimeEnd)
  | where isnotempty(ThreatTypes)
  | summarize ClickAttempts = count() by ThreatType = tostring(ThreatTypes)
  | sort by ClickAttempts desc
  | top 10 by ClickAttempts  // Uncomment to limit to top 10 threat types; remove to see all
  //| render piechart // Uncomment to visualize proportional breakdown by threat type
  //| render columnchart // Uncomment to compare threat types
version: 1.0.0
