{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string"
    },
    "location": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimNetworkSessionZScalerZIA",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
          ],
          "properties": {
            "etag": "*",
            "displayName": "ZScaler Network Sessions",
            "category": "Security",
            "FunctionAlias": "vimNetworkSessionZScalerZIA",
            "query": "let NetworkParserZscaler=(){\n    CommonSecurityLog\n    | where DeviceVendor == \"Zscaler\" and DeviceProduct == \"NSSFWlog\"\n    | project-rename \n        EventOriginalUid = _ItemId \n        , EventVendor=DeviceVendor\n        , EventProduct=DeviceProduct\n        , EventResourceId=_ResourceId \n        //, TenantId=TenantId\n    //, DestinationUserId=DestinationUserID \n        , NetworkRuleName=Activity \n        , NetworkProtocol=Protocol\n        , NetworkApplicationProtocol=DeviceCustomString2\n        , SrcBytes=SentBytes\n        , DstBytes=ReceivedBytes \n    , NetworkDuration=DeviceCustomNumber1\n        , EventProductVersion=DeviceVersion\n        , EventSeverity=LogSeverity \n        , SrcNatIpAddr=SourceTranslatedAddress\n        , DstNatIpAddr=DestinationTranslatedAddress\n        , DstDvcHostname=DestinationHostName\n    , DvcMacAddress=DeviceMacAddress\n    , DstMacAddr=DestinationMACAddress \n    , SrcMacAddr=SourceMACAddress\n    | extend\n        EventTimeIngested =ingestion_time()\n        , EventCount=toint(EventCount)\n        , EventType=\"Traffic\"\n        , DvcAction=case(DeviceAction has \"Allow\", \"Allow\", DeviceAction has \"Drop\",\"Drop\", \"\") \n        , EventResult=case(DeviceAction has \"Allow\",\"Success\",\"Failure\") \n        , EventSchemaVersion=\"1.0.0\"\n//  Auto complete bug mitigation\n//  Trivial renames to mitigate Autocomplete\n| project-rename\n    NetworkDirection=CommunicationDirection\n    , EventEndTime=EndTime\n  , EventStartTime= StartTime\n  , EventMessage=Message\n  , TimeGenerated=TimeGenerated\n    , DstIpAddr=DestinationIP\n    , DstPortNumber=DestinationPort\n    , DstNatPortNumber=DestinationTranslatedPort\n  , SrcPortNumber=SourcePort\n    , SrcIpAddr=SourceIP\n    , DeviceAction=DeviceAction\n  , DstUserName=DestinationUserName\n  , SrcNatPortNumber=SourceTranslatedPort\n  , DvcOutboundInterface=DeviceOutboundInterface\n  , DvcInboundInterface=DeviceInboundInterface\n  , SrcUserName=SourceUserName \n};\nNetworkParserZscaler\n",
            "version": 1
          }
        }
      ]
    }
  ]
}