{
  "Name": "Pathlock_TDnR",
  "Author": "Pathlock Inc. - support@pathlock.com",
  "Logo": "<img src=\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Logos/pathlock_logo.svg\" width=\"75px\" height=\"75px\">",
  "Description": "The [Pathlock TD&R](https://pathlock.com/products/cybersecurity-application-controls/) integration enables organizations to seamlessly forward Pathlock Threat Detection and Response (TD&R) events from both on-premise and cloud-based SAP systems into Microsoft Sentinel Solution for SAP for unified security visibility and incident correlation across the enterprise.\n\nBuilt on Pathlock’s Cybersecurity Application Controls (CAC) platform, this connector utilizes the Common Connector Platform (CCP) framework to securely transmit log and event data while maintaining data integrity and governance. The Custom Logs solution is automatically deployed during installation, ensuring a quick and reliable setup without manual configuration steps.\n\nWith this integration, SOC and SAP security teams can:\n- Consolidate SAP-specific threat intelligence and correlate it with enterprise events in Microsoft Sentinel.\n- Leverage 4500+ Pathlock detection signatures and 75+ SAP log sources for comprehensive SAP monitoring.\n- Automate alerting and response workflows in Microsoft Sentinel for faster mean-time-to-detect (MTTD) and mean-time-to-respond (MTTR).\n- Maintain audit readiness by demonstrating end-to-end visibility of SAP threat activity.\n\nThis out-of-the-box connector simplifies secure event forwarding from SAP to Microsoft Sentinel—enabling centralized analysis, compliance reporting, and proactive response within your existing security ecosystem.",
  "Workbooks": [
  ],
  "Analytic Rules": [
  ],
  "Data Connectors": [
    "Data Connectors/Pathlock_TDnR_PUSH_CCP/Pathlock_TDnR_connectorDefinition.json"
  ],
  "BasePath": "C:\\Github\\Azure-Sentinel\\Solutions\\Pathlock_TDnR",
  "Version": "3.0.0",
  "Metadata": "SolutionMetadata.json",
  "TemplateSpec": true
}
