{
    "version": "Notebook/1.0",
    "items": [
      {
        "type": 11,
        "content": {
          "version": "LinkItem/1.0",
          "style": "tabs",
          "links": [
            {
              "id": "4df9243a-749d-4698-98f6-188e0b687e13",
              "cellValue": "selectedTab",
              "linkTarget": "parameter",
              "linkLabel": "Servers and extensions installed",
              "subTarget": "ServersExtensions",
              "style": "link"
            },
            {
              "id": "4c0faa80-5c85-4d02-989d-37921b12ae87",
              "cellValue": "selectedTab",
              "linkTarget": "parameter",
              "linkLabel": "Data Collection Rules under Subscription",
              "subTarget": "DCRs",
              "style": "link"
            },
            {
              "id": "ffceb6e6-3756-466e-860b-c017f0421e9f",
              "cellValue": "selectedTab",
              "linkTarget": "parameter",
              "linkLabel": "VMs with AMA",
              "subTarget": "AMAvms",
              "style": "link"
            }
          ]
        },
        "name": "links - 19"
      },
      {
        "type": 9,
        "content": {
          "version": "KqlParameterItem/1.0",
          "parameters": [
            {
              "id": "cd3be59c-92d1-4c08-945e-bd9420459a0a",
              "version": "KqlParameterItem/1.0",
              "name": "Subscription",
              "label": "Subscriptions",
              "type": 6,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "value": [
              ],
              "typeSettings": {
                "additionalResourceOptions": [],
                "includeAll": true,
                "showDefault": false
              },
              "timeContext": {
                "durationMs": 86400000
              }
            }
          ],
          "style": "pills",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces"
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "name": "parameters - 21 - only one"
      },
      {
        "type": 9,
        "content": {
          "version": "KqlParameterItem/1.0",
          "parameters": [
            {
              "id": "bcd3ee68-9319-4de6-8904-eae492693e64",
              "version": "KqlParameterItem/1.0",
              "name": "Subscription2",
              "label": "Subscription",
              "type": 6,
              "isRequired": true,
              "value": "",
              "typeSettings": {
                "additionalResourceOptions": [],
                "includeAll": false
              },
              "timeContext": {
                "durationMs": 86400000
              }
            }
          ],
          "style": "pills",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces"
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isNotEqualTo",
          "value": "ServersExtensions"
        },
        "name": "parameters - 21 "
      },
      {
        "type": 9,
        "content": {
          "version": "KqlParameterItem/1.0",
          "parameters": [
            {
              "id": "521cf079-688f-4f0c-b446-64a353ac8aa1",
              "version": "KqlParameterItem/1.0",
              "name": "InternalWSs",
              "type": 1,
              "query": "SecurityIncident\r\n| take 1\r\n| parse IncidentUrl with * \"/workspaces/\" Workspace \"/\" *\r\n| project Workspace",
              "isHiddenWhenLocked": true,
              "timeContext": {
                "durationMs": 86400000
              },
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            {
              "id": "eaa69221-591b-448c-b18b-5828487030ab",
              "version": "KqlParameterItem/1.0",
              "name": "Workspace",
              "type": 5,
              "isRequired": true,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "query": "where type =~ \"microsoft.operationalinsights/workspaces\"\r\n| project value =id, label = name, selected = iff(name =~ '{InternalWSs}', true, false)",
              "crossComponentResources": [
                "value::all"
              ],
              "value": [
                "value::all"
              ],
              "typeSettings": {
                "additionalResourceOptions": [
                  "value::all"
                ],
                "showDefault": false
              },
              "timeContext": {
                "durationMs": 86400000
              },
              "defaultValue": "value::all",
              "queryType": 1,
              "resourceType": "microsoft.resourcegraph/resources"
            },
            {
              "id": "8f323b26-e505-40f3-8ea8-4d0fd69dcc9b",
              "version": "KqlParameterItem/1.0",
              "name": "InternalRG",
              "type": 1,
              "query": "where type =~ \"microsoft.operationalinsights/workspaces\"\r\n| where id =~  \"{Workspace}\"\r\n| project resourceGroup",
              "isHiddenWhenLocked": true,
              "timeContext": {
                "durationMs": 86400000
              },
              "queryType": 1,
              "resourceType": "microsoft.resourcegraph/resources"
            },
             {
            "id": "2209d79a-3a7d-4840-a45e-579b98c35cfc",
            "version": "KqlParameterItem/1.0",
            "name": "resourceGroup",
            "label": "Resource group",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "Resources\r\n| summarize Count = count() by subscriptionId, resourceGroup\r\n| order by Count desc\r\n| extend Rank = row_number()\r\n| project value = strcat('/subscriptions/', subscriptionId, '/resourceGroups/', resourceGroup), label = resourceGroup, selected = false",
            "crossComponentResources": [
            "{Subscription}"
        ],
        "typeSettings": {
          "additionalResourceOptions": [],
          "showDefault": false
        },
        "queryType": 1,
        "resourceType": "microsoft.resourcegraph/resources"
      },
            {
              "id": "4335a281-83dd-4a49-91e8-4f93a4241ca2",
              "version": "KqlParameterItem/1.0",
              "name": "Help",
              "label": "Show Help",
              "type": 10,
              "description": "This will show some help information to help you understand the page you are on",
              "isRequired": true,
              "value": "Yes",
              "typeSettings": {
                "additionalResourceOptions": []
              },
              "jsonData": "[\r\n { \"value\": \"Yes\", \"label\": \"Yes\"},\r\n { \"value\": \"No\", \"label\": \"No\", \"selected\":true }\r\n]"
            }
          ],
          "style": "pills",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces"
        },
        "name": "parameters - 1 - Copy"
      },
      {
        "type": 1,
        "content": {
          "json": "Use this section to see all the servers (either from Azure, other clouds, on-prem and Arc enabled (prerequisite to install the Azure Monitoring agent) under the selected subscription.\r\nUse the Subscription and Resource group filters to narrow down your results.",
          "style": "info"
        },
        "conditionalVisibilities": [
          {
            "parameterName": "Help",
            "comparison": "isEqualTo",
            "value": "Yes"
          },
          {
            "parameterName": "selectedTab",
            "comparison": "isEqualTo",
            "value": "ServersExtensions"
          }
        ],
        "name": "text - 18"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\"\r\n| where type == \"microsoft.compute/virtualmachines\"\r\n| summarize TotalCountofVMs = count()",
          "size": 4,
          "title": "Current VMs in {Subscription:label}",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ],
          "visualization": "tiles",
          "tileSettings": {
            "titleContent": {},
            "leftContent": {
              "columnMatch": "TotalCountofVMs",
              "formatter": 3,
              "formatOptions": {
                "palette": "blue"
              }
            },
            "showBorder": false
          }
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "20",
        "name": "query - 0"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "Heartbeat\r\n| where isempty(_ResourceId) == true or ResourceProvider =~ \"microsoft.hybridcompute\"\r\n| distinct Computer\r\n| summarize count()",
          "size": 4,
          "title": "Arc or non-Azure with Heartbeat",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "visualization": "tiles",
          "tileSettings": {
            "titleContent": {},
            "leftContent": {
              "columnMatch": "count_",
              "formatter": 3,
              "formatOptions": {
                "palette": "blue"
              }
            },
            "showBorder": false
          }
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "20",
        "name": "query - 5"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\"\r\n| where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'MicrosoftMonitoringAgent' or name has 'OmsAgentForLinux' \r\n| extend Computer = extract('virtualMachines/(.*)/extensions',1,id) \r\n| summarize count()",
          "size": 4,
          "title": "Machines with MMA",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ],
          "visualization": "tiles",
          "tileSettings": {
            "titleContent": {},
            "leftContent": {
              "columnMatch": "count_",
              "formatter": 3,
              "formatOptions": {
                "palette": "blue"
              }
            },
            "showBorder": false
          }
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "20",
        "name": "query - 6"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources \r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'AzureMonitorWindowsAgent' or name has 'AzureMonitorLinuxAgent' \r\n| extend AzureVM = extract('virtualMachines/(.*)/extensions',1,id), ArcVM = extract('machines/(.*)/extensions',1,id) \r\n| summarize count() by AzureVM, ArcVM, subscriptionId, resourceGroup \r\n| project AzureVM, ArcVM, resourceGroup\r\n| summarize count()",
          "size": 4,
          "title": "Machines with AMA",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ],
          "visualization": "tiles",
          "tileSettings": {
            "titleContent": {},
            "leftContent": {
              "columnMatch": "count_",
              "formatter": 3,
              "formatOptions": {
                "palette": "blue"
              }
            },
            "showBorder": false
          }
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "20",
        "name": "query - 4"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where type has 'microsoft.compute/virtualmachines/extensions' or  type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'MicrosoftMonitoringAgent' or name has 'OmsAgentForLinux' or name has 'AzureMonitorWindowsAgent' or name has 'AzureMonitorLinuxAgent'\r\n| extend AzureVM = extract('virtualMachines/(.*)/extensions',1,id), ArcVM = extract('machines/(.*)/extensions',1,id)\r\n| summarize count() by AzureVM=tolower(AzureVM), ArcVM=tolower(ArcVM), subscriptionId, resourceGroup \r\n| extend hasBoth = iff(count_ > 1, 'Yes', 'No') | where count_ > 1 \r\n| join (resources | where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'MicrosoftMonitoringAgent' or name has 'OmsAgentForLinux' \r\n| extend AzureVM = extract('virtualMachines/(.*)/extensions',1,id)) on AzureVM  \r\n| summarize count()",
          "size": 4,
          "title": "Machines with Both Agents",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ],
          "visualization": "tiles",
          "tileSettings": {
            "titleContent": {},
            "leftContent": {
              "columnMatch": "count_",
              "formatter": 3,
              "formatOptions": {
                "palette": "blue"
              }
            },
            "showBorder": false
          }
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "20",
        "name": "query - 7"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\"\r\n| where type == \"microsoft.compute/virtualmachines\"\r\n| extend Subscription = extract('(/subscriptions/.*)/resource.*',1,id)\r\n| summarize by id, Location=location, resourceGroup, OSType=tostring(properties.storageProfile.osDisk.osType), Subscription\r\n| sort by id asc",
          "size": 0,
          "title": "Azure machines within {Subscription:label}",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ]
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "50",
        "name": "Azure VMs within Subscription"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\"\r\n| extend Subscription = extract('(/subscriptions/.*)/resource.*',1,id)\r\n| where type == \"microsoft.hybridcompute/machines\"\r\n| project Computer=id, Location=location, resourceGroup, type, Subscription",
          "size": 0,
          "title": "Arc machines within {Subscription:label}",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ]
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "50",
        "name": "Arc machines"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\" \r\n| where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'MicrosoftMonitoringAgent' or name has 'OmsAgentForLinux' \r\n| extend Server = extract('(.*)/extensions',1,id)\r\n| extend Subscription = extract('(/subscriptions/.*)/resource.*',1,id)\r\n| summarize count() by Server, subscriptionId, resourceGroup, Subscription\r\n| project Server, resourceGroup, Subscription\r\n| sort by Server asc",
          "size": 0,
          "title": "Azure or Arc machines with MMA",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ]
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "50",
        "name": "query - 1"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources \r\n| where \"{Subscription:Id}\" has subscriptionId or \"{Subscription}\" == \"\"\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\"\r\n| where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'AzureMonitorWindowsAgent' or name has 'AzureMonitorLinuxAgent' \r\n| extend VM = extract('(/subscriptions.*)/extensions',1,id)\r\n| extend Subscription = extract('(/subscriptions/.*)/resource.*',1,id)\r\n| summarize count() by VM, subscriptionId, resourceGroup, Subscription\r\n| project VM, resourceGroup, Subscription\r\n| sort by VM asc",
          "size": 0,
          "title": "Machines with AMA",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "{Subscription}"
          ]
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "50",
        "name": "query - 2"
      },
      {
        "type": 12,
        "content": {
          "version": "NotebookGroup/1.0",
          "groupType": "editable",
          "title": "View all VMs with AMA under the {Subscription:label} subscription and their data collection rules",
          "items": [
            {
              "type": 1,
              "content": {
                "json": "These are all the servers with AMA installed. Select each one individually to see the Data Collection Rules associated to them.</br>You will find information such as what is being collected and to what workspace those logs are being sent. The stream will normally match the destination table in the Microsoft Sentinel workspace. If it starts with \"Microsoft-\", the destination table is what comes after. For example, if the stream says \"Microsoft-Perf\", then the destination table is \"Perf\".</br> To learn more about DCRs, please check https://docs.microsoft.com/azure/azure-monitor/agents/data-collection-rule-azure-monitor-agent",
                "style": "info"
              },
              "conditionalVisibilities": [
                {
                  "parameterName": "selectedTab",
                  "comparison": "isEqualTo",
                  "value": "AMAvms"
                },
                {
                  "parameterName": "Help",
                  "comparison": "isEqualTo",
                  "value": "Yes"
                }
              ],
              "name": "text - 19"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "resources\r\n| where type has 'microsoft.compute/virtualmachines' or type has \"microsoft.hybridcompute/machines\"                        \r\n| project Computer=tolower(name)\r\n| join (resources | where type has 'microsoft.compute/virtualmachines/extensions' \r\n| where name has 'azuremonitorwindowsagent' or name has 'azuremonitorlinuxagent' \r\n| extend type, temp = extract('virtualmachines|virtualMachines/(.*)/extensions',1,id), vmid = extract('(/subscriptions/.*achines/.*)(/extensions*)',1,id)\r\n| extend Subscription = extract('(/subscriptions/.*)/resource.*',1,id)\r\n| extend Computer = tolower(temp)\r\n)\r\non Computer\r\n| union (resources | where type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'azuremonitorwindowsagent' or name has 'azuremonitorlinuxagent'\r\n| extend id, Computer = extract('machines/(.*)/extensions',1,id), vmid = extract('(/subscriptions/.*achines/.*)(/extensions*)',1,id))\r\n| project vmid, Computer, resourceGroup, location, Subscription",
                "size": 0,
                "title": "Get Azure and hybrid VMs with AMA",
                "exportedParameters": [
                  {
                    "fieldName": "Computer",
                    "parameterName": "vmname",
                    "parameterType": 1
                  },
                  {
                    "fieldName": "resourceGroup",
                    "parameterName": "vmrg",
                    "parameterType": 1
                  },
                  {
                    "fieldName": "vmid",
                    "parameterName": "vmid1",
                    "parameterType": 1
                  }
                ],
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources",
                "crossComponentResources": [
                  "{Subscription}"
                ],
                "gridSettings": {
                  "formatters": [
                    {
                      "columnMatch": "vmname",
                      "formatter": 5
                    }
                  ],
                  "sortBy": [
                    {
                      "itemKey": "$gen_link_vmid_0",
                      "sortOrder": 2
                    }
                  ]
                },
                "sortBy": [
                  {
                    "itemKey": "$gen_link_vmid_0",
                    "sortOrder": 2
                  }
                ]
              },
              "name": "Azure and hybrid VMs with AMA"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "resources \r\n| where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'AzureMonitorWindowsAgent' or name has 'AzureMonitorLinuxAgent' \r\n| extend AzureVM = extract('virtualMachines/(.*)/extensions',1,id), ArcVM = extract('machines/(.*)/extensions',1,id) \r\n| summarize count() by AzureVM, ArcVM, subscriptionId, resourceGroup \r\n| project AzureVM, ArcVM, resourceGroup",
                "size": 0,
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources"
              },
              "conditionalVisibility": {
                "parameterName": "0",
                "comparison": "isEqualTo",
                "value": "0"
              },
              "name": "Azure or Arc machines with AMA"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/{vmid1}/providers/Microsoft.Insights/dataCollectionRuleAssociations\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2019-11-01-preview\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"$..dataCollectionRuleId\",\"columnid\":\"DCRname\",\"substringRegexMatch\":\"\\\\/subscriptions\\\\/[A-Za-z0-9]{8}-[A-Za-z0-9]{4}-[A-Za-z0-9]{4}-[A-Za-z0-9]{4}-[A-Za-z0-9]{12}\\\\/\\\\w+\\\\/[a-zA-Z0-9\\\\.\\\\_\\\\-\\\\(\\\\)]{1,90}\\\\/providers\\\\/\\\\w+\\\\.\\\\w+\\\\/\\\\w+\\\\/([a-zA-Z0-9\\\\.\\\\_\\\\-\\\\(\\\\)]{1,64})\",\"substringReplace\":\"$1\"},{\"path\":\"$..dataCollectionRuleId\",\"columnid\":\"DCR\"},{\"path\":\"$..dataCollectionRuleId\",\"columnid\":\"DCRrg\",\"substringRegexMatch\":\"\\\\/.*\\\\/resource.*s\\\\/(.*)\\\\/providers.*\",\"substringReplace\":\"$1\"}]}}]}",
                "size": 0,
                "exportedParameters": [
                  {
                    "fieldName": "DCRname",
                    "parameterName": "DCRname",
                    "parameterType": 1
                  },
                  {
                    "fieldName": "DCRrg",
                    "parameterName": "DCRrg",
                    "parameterType": 1
                  }
                ],
                "queryType": 12
              },
              "conditionalVisibility": {
                "parameterName": "a",
                "comparison": "isEqualTo",
                "value": "a"
              },
              "name": "Get DCR associations for a given VM"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription2:Id}/providers/Microsoft.Insights/dataCollectionRules\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2019-11-01-preview\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"name\",\"columnid\":\"Name\"},{\"path\":\"properties.dataFlows[*].streams[0]\",\"columnid\":\"Streams\",\"substringRegexMatch\":\"(Microsoft-)*(\\\\w+)\",\"substringReplace\":\"$2\"},{\"path\":\"$..workspaceResourceId\",\"columnid\":\"Workspace\"},{\"path\":\"kind\",\"columnid\":\"OS\"},{\"path\":\"$..xPathQueries\",\"columnid\":\"xPath\",\"columnType\":\"string\"},{\"path\":\"$..facilityNames\",\"columnid\":\"SyslogFacilities\"},{\"path\":\"$..counterSpecifiers\",\"columnid\":\"CounterSpecifiers\"},{\"path\":\"properties.dataFlows[*].streams[0]\",\"columnid\":\"Custom\"}]}}]}",
                "size": 0,
                "queryType": 12
              },
              "conditionalVisibility": {
                "parameterName": "a",
                "comparison": "isEqualTo",
                "value": "a"
              },
              "name": "Get ALL DCRs under subscription"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "{\"version\":\"Merge/1.0\",\"merges\":[{\"id\":\"24881457-2964-4063-b883-330dad837178\",\"mergeType\":\"innerunique\",\"leftTable\":\"Get DCR associations for a given VM\",\"rightTable\":\"Get ALL DCRs under subscription\",\"leftColumn\":\"DCRname\",\"rightColumn\":\"Name\"}],\"projectRename\":[{\"originalName\":\"[Get DCR associations for a given VM].DCR\",\"mergedName\":\"DCR\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get DCR associations for a given VM].DCRrg\",\"mergedName\":\"DCR RG\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].OS\",\"mergedName\":\"OS\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].Workspace\",\"mergedName\":\"Workspace\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].Streams\",\"mergedName\":\"Streams\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].xPath\",\"mergedName\":\"xPath\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].SyslogFacilities\",\"mergedName\":\"SyslogFacilities\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].CounterSpecifiers\",\"mergedName\":\"CounterSpecifiers\",\"fromId\":\"24881457-2964-4063-b883-330dad837178\"},{\"originalName\":\"[Get ALL DCRs under subscription].Parsed streams\",\"mergedName\":\"Parsed streams\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get ALL DCRs under subscription].ParsedStreams\",\"mergedName\":\"ParsedStreams\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get ALL DCRs under subscription].test\",\"mergedName\":\"test\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get ALL DCRs under subscription].WindowsStreams\",\"mergedName\":\"WindowsStreams\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get ALL DCRs under subscription].SyslogStreams\",\"mergedName\":\"SyslogStreams\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get ALL DCRs under subscription].DataFlows\",\"mergedName\":\"DataFlows\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get ALL DCRs under subscription].LinuxStreams\",\"mergedName\":\"LinuxStreams\",\"fromId\":\"unknown\"},{\"originalName\":\"[Get DCR associations for a given VM].DCRname\"},{\"originalName\":\"[Get ALL DCRs under subscription].Name\"},{\"originalName\":\"[Get ALL DCRs under subscription].Custom\"},{\"originalName\":\"[Get ALL DCRs under subscription].Streams2\"},{\"originalName\":\"[Get ALL DCRs under subscription].StreamsRegex\"}]}",
                "size": 1,
                "queryType": 7
              },
              "showPin": false,
              "name": "query - 4"
            },
            {
              "type": 9,
              "content": {
                "version": "KqlParameterItem/1.0",
                "parameters": [
                  {
                    "id": "beb26b8d-3f76-4177-8dac-5c7f7e19791d",
                    "version": "KqlParameterItem/1.0",
                    "name": "TimeRange",
                    "label": "Time range",
                    "type": 4,
                    "isRequired": true,
                    "value": {
                      "durationMs": 2592000000
                    },
                    "typeSettings": {
                      "selectableValues": [
                        {
                          "durationMs": 86400000
                        },
                        {
                          "durationMs": 259200000
                        },
                        {
                          "durationMs": 604800000
                        },
                        {
                          "durationMs": 1209600000
                        },
                        {
                          "durationMs": 2592000000
                        },
                        {
                          "durationMs": 7776000000
                        }
                      ],
                      "allowCustom": true
                    },
                    "timeContext": {
                      "durationMs": 86400000
                    }
                  }
                ],
                "style": "pills",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces"
              },
              "conditionalVisibility": {
                "parameterName": "selectedTab",
                "comparison": "isEqualTo",
                "value": "AMAvms"
              },
              "name": "Time Picker"
            },
            {
              "type": 1,
              "content": {
                "json": "Below you can find the number of events submitted by the selected VM to some of the main native tables in Microsoft Sentinel and Log Analytics.</br>The first graph includes events logged in the tables: <b>SecurityEvent, Heartbeat, Perf and Event</b>.</br>The second graph shows the number of events forwarded by the selected VM to the <b>WindowsEvent<b/> table if you are using the Windows Forwarded Events connector.</br> Note that if the selected VM also has MMA installed, the logs could come from either one of the agents, AMA or MMA",
                "style": "info"
              },
              "conditionalVisibilities": [
                {
                  "parameterName": "selectedTab",
                  "comparison": "isEqualTo",
                  "value": "AMAvms"
                },
                {
                  "parameterName": "Help",
                  "comparison": "isEqualTo",
                  "value": "Yes"
                }
              ],
              "name": "text - 19 - Copy"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "SecurityEvent | union Heartbeat, Event, Perf\r\n| extend _ResourceId, WEC = extract('Machines|machines/(.*)',1,_ResourceId)\r\n| where TimeGenerated {TimeRange} and Computer == \"{vmname}\" or WEC == \"{vmname}\"\r\n| summarize count()  by bin(TimeGenerated, 1d), Type\r\n| project Table=Type, TimeGenerated, count_",
                "size": 0,
                "title": "{TimeRange:label}: Number of events in {Workspace:label} in for {vmname} in the SecurityEvent, Heartbeat, Perf or Event tables",
                "timeContext": {
                  "durationMs": 2592000000
                },
                "timeContextFromParameter": "TimeRange",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "linechart",
                "chartSettings": {
                  "showLegend": true
                }
              },
              "conditionalVisibility": {
                "parameterName": "selectedTab",
                "comparison": "isEqualTo",
                "value": "AMAvms"
              },
              "name": "LA volume by Table"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "WindowsEvent\r\n| extend _ResourceId, WEC = extract('Machines|machines/(.*)',1,_ResourceId)\r\n| where TimeGenerated {TimeRange} and WEC == \"{vmname}\"\r\n| summarize count()  by bin(TimeGenerated, 1d)\r\n| project TimeGenerated, count_",
                "size": 0,
                "title": "{TimeRange:label}: Number of WEF events in {Workspace:label} forwarded by {vmname} to the WindowsEvent table",
                "timeContext": {
                  "durationMs": 2592000000
                },
                "timeContextFromParameter": "TimeRange",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "linechart",
                "chartSettings": {
                  "showLegend": true
                }
              },
              "conditionalVisibility": {
                "parameterName": "selectedTab",
                "comparison": "isEqualTo",
                "value": "AMAvms"
              },
              "name": "WEF"
            }
          ]
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "AMAvms"
        },
        "name": "VMs and DCRA"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\"\r\n| where type has 'microsoft.compute/virtualmachines/extensions' or  type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'MicrosoftMonitoringAgent' or name has 'OmsAgentForLinux' or name has 'AzureMonitorWindowsAgent' or name has 'AzureMonitorLinuxAgent'\r\n| extend AzureVM = extract('virtualmachines|virtualMachines/(.*)/extensions',1,id), ArcVM = extract('machines/(.*)/extensions',1,id)\r\n| summarize count() by AzureVM=tolower(AzureVM), ArcVM=tolower(ArcVM), subscriptionId, resourceGroup \r\n| extend hasBoth = iff(count_ > 1, 'Yes', 'No') | where count_ > 1 \r\n| join (resources | where \"{resourceGroup:label}\" contains resourceGroup or \"{resourceGroup}\" == \"\" | where type has 'microsoft.compute/virtualmachines/extensions' or type has 'microsoft.hybridcompute/machines/extensions'\r\n| where name has 'MicrosoftMonitoringAgent' or name has 'OmsAgentForLinux' \r\n| extend AzureVM = extract('virtualmachines|virtualMachines/(.*)/extensions',1,id)) on AzureVM  \r\n| project AzureVM, ArcVM, resourceGroup, MMAVersion=name, hasBoth",
          "size": 0,
          "title": "Machines with Both Agents under any RG",
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources"
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "50",
        "name": "query - 3"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "let onprem = Heartbeat | where isempty(_ResourceId) == true;\r\nlet Arc = Heartbeat | where ResourceProvider =~ \"microsoft.hybridcompute\";\r\nunion withsource=\"Heartbeat\"\r\nonprem, Arc\r\n| summarize by Computer, OSType, ResourceProvider",
          "size": 0,
          "title": "Non-Azure or hybrid VMs under any RG reporting to {Workspace:label} in the last 30d",
          "timeContext": {
            "durationMs": 2592000000
          },
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "gridSettings": {
            "sortBy": [
              {
                "itemKey": "ResourceProvider",
                "sortOrder": 2
              }
            ]
          },
          "sortBy": [
            {
              "itemKey": "ResourceProvider",
              "sortOrder": 2
            }
          ]
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "ServersExtensions"
        },
        "customWidth": "50",
        "name": "query - 9"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription2:Id}/providers/Microsoft.Insights/dataCollectionRules\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2019-11-01-preview\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"name\",\"columnid\":\"Name\"},{\"path\":\"$..workspaceResourceId\",\"columnid\":\"Workspace\"},{\"path\":\"kind\",\"columnid\":\"OS\"},{\"path\":\"properties.dataFlows[*].streams[0]\",\"columnid\":\"Streams\",\"substringRegexMatch\":\"(Microsoft-)*(\\\\w+)\",\"substringReplace\":\"$2\"},{\"path\":\"$..xPathQueries\",\"columnid\":\"xPath\"},{\"path\":\"location\",\"columnid\":\"Location\"},{\"path\":\"$..facilityNames\",\"columnid\":\"SyslogFacilities\"}]}}]}",
          "size": 0,
          "title": "Get all DCRs under {Subscription:label}",
          "exportedParameters": [
            {
              "fieldName": "Name",
              "parameterName": "dcrName",
              "parameterType": 1
            },
            {
              "fieldName": "resourceGroup",
              "parameterName": "resourceGroup",
              "parameterType": 1
            }
          ],
          "queryType": 12,
          "gridSettings": {
            "formatters": [
              {
                "columnMatch": "workspace2",
                "formatter": 5
              }
            ]
          }
        },
        "conditionalVisibility": {
          "parameterName": "0",
          "comparison": "isEqualTo",
          "value": "0"
        },
        "name": "Get DCRs and associations"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "resources\r\n| where type has 'microsoft.insights/datacollectionrules'\r\n| extend Subscription = extract('(/subscriptions/.*)/resource.*',1,id)\r\n| project name, Subscription, resourceGroup",
          "size": 0,
          "queryType": 1,
          "resourceType": "microsoft.resourcegraph/resources",
          "crossComponentResources": [
            "value::all"
          ]
        },
        "conditionalVisibility": {
          "parameterName": "0",
          "comparison": "isEqualTo",
          "value": "0"
        },
        "name": "Get DCRs from Graph"
      },
      {
        "type": 1,
        "content": {
          "json": "Use this section to see all the DCRs under the selected subscription. You will find Streams and the xPath query.\r\nThe stream will normally match the destination table in the Microsoft Sentinel workspace. If it starts with \"Microsoft-\", the destination table is what comes after. For example, if the stream says \"Microsoft-Perf\", then the destination table is \"Perf\".\r\nClick on the DCRs to see associated VMs.",
          "style": "info"
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "DCRs"
        },
        "name": "Help tab 2"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "{\"version\":\"Merge/1.0\",\"merges\":[{\"id\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\",\"mergeType\":\"leftouter\",\"leftTable\":\"Get DCRs and associations\",\"rightTable\":\"Get DCRs from Graph\",\"leftColumn\":\"Name\",\"rightColumn\":\"name\"}],\"projectRename\":[{\"originalName\":\"[Get DCRs and associations].Name\",\"mergedName\":\"Name\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs and associations].Workspace\",\"mergedName\":\"Workspace\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs and associations].OS\",\"mergedName\":\"OS\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs and associations].Streams\",\"mergedName\":\"Streams\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs and associations].xPath\",\"mergedName\":\"xPath\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs and associations].Location\",\"mergedName\":\"Location\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs and associations].SyslogFacilities\",\"mergedName\":\"SyslogFacilities\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs from Graph].id\",\"mergedName\":\"id\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs from Graph].name\",\"mergedName\":\"name\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs from Graph].kind\",\"mergedName\":\"kind\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs from Graph].resourceGroup\",\"mergedName\":\"resourceGroup\",\"fromId\":\"bee4471d-99cc-4c86-9f3a-1e4f0a05e32a\"},{\"originalName\":\"[Get DCRs from Graph].Subscription\",\"mergedName\":\"Subscription\",\"fromId\":\"unknown\"}]}",
          "size": 0,
          "title": "Select a DCR to view associated VMs",
          "exportedParameters": [
            {
              "fieldName": "Name",
              "parameterName": "DCR",
              "parameterType": 1
            },
            {
              "fieldName": "resourceGroup",
              "parameterName": "DCRrg",
              "parameterType": 1
            }
          ],
          "queryType": 7
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "DCRs"
        },
        "name": "Merge - DCRs and RG"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription2:Id}/resourceGroups/{DCRrg}/providers/Microsoft.Insights/dataCollectionRules/{DCR}/associations\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2019-11-01-preview\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"id\",\"columnid\":\"VMs\",\"columnType\":\"string\",\"substringRegexMatch\":\"(\\\\/subscriptions.*)(\\\\/providers.*|Providers.*)\",\"substringReplace\":\"$1\"}]}}]}",
          "size": 4,
          "title": "VMs associated to the selected DCR",
          "noDataMessage": "No VMs found or no DCR selected above",
          "queryType": 12
        },
        "conditionalVisibility": {
          "parameterName": "selectedTab",
          "comparison": "isEqualTo",
          "value": "DCRs"
        },
        "name": "query - 18"
      }
    ],
    "fallbackResourceIds": [
      
    ],
    "fromTemplateId": "sentinel-AMAmigrationTracker",
    "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
  }
