{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "f17541eb-2772-4f17-bd9e-ef53df715b43",
            "version": "KqlParameterItem/1.0",
            "name": "subscriptionId",
            "type": 2,
            "description": "Select the subscription where Sentinel workspace is under",
            "isRequired": true,
            "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2019-11-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"subscriptionId\",\"columnid\":\"subscriptionId\"},{\"path\":\"displayName\",\"columnid\":\"displayName\"}]}}]}",
            "value": null,
            "typeSettings": {
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "queryType": 12
          },
          {
            "id": "eb1c9175-3062-4019-9d87-ad0ddfc452f3",
            "version": "KqlParameterItem/1.0",
            "name": "resourceGroup",
            "type": 1,
            "isRequired": true,
            "value": "",
            "resourceType": "microsoft.insights/components"
          },
          {
            "id": "39dbe709-911b-4c33-aace-0ab9e7f4aa35",
            "version": "KqlParameterItem/1.0",
            "name": "workspace",
            "type": 1,
            "isRequired": true,
            "value": "",
            "resourceType": "microsoft.insights/components"
          }
        ],
        "style": "pills",
        "queryType": 12
      },
      "name": "parameters - 5"
    },
    {
      "type": 1,
      "content": {
        "json": "## Azure Security Center connector status"
      },
      "name": "Title"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroup}/providers/Microsoft.OperationalInsights/workspaces/{workspace}/providers/Microsoft.SecurityInsights/dataConnectors/?api-version=2019-01-01-preview\",\"urlParams\":[{\"key\":\"\",\"value\":\"\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"name\",\"columnid\":\"ConnectionName\"},{\"path\":\"kind\",\"columnid\":\"kind\"},{\"path\":\"properties.subscriptionId\",\"columnid\":\"subscriptionId\"}]}}]}",
        "size": 2,
        "queryType": 12,
        "gridSettings": {
          "rowLimit": 10000,
          "filter": true
        }
      },
      "conditionalVisibility": {
        "parameterName": "true",
        "comparison": "isEqualTo",
        "value": "true"
      },
      "customWidth": "70",
      "name": "Get data connectors"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"1.0.0\",\"content\":\"{\\\"Kind\\\":\\\"AzureSecurityCenter\\\"}\",\"transformers\":null}",
        "size": 0,
        "queryType": 8
      },
      "conditionalVisibility": {
        "parameterName": "true",
        "comparison": "isEqualTo",
        "value": "true"
      },
      "customWidth": "30",
      "name": "kind=asc"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityAlert\r\n| where ProductName == \"Azure Security Center\"\r\n| summarize arg_max(TimeGenerated,* ) by WorkspaceSubscriptionId",
        "size": 0,
        "title": "Last logs from ASC by subscription",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "rowLimit": 10000,
          "filter": true
        }
      },
      "conditionalVisibility": {
        "parameterName": "true",
        "comparison": "isEqualTo",
        "value": "true"
      },
      "name": "Last logs from ASC by subscription"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"Merge/1.0\",\"merges\":[{\"id\":\"06882b07-0325-4fb4-a31d-e93bb6ca5047\",\"mergeType\":\"inner\",\"leftTable\":\"Get data connectors\",\"rightTable\":\"kind=asc\",\"leftColumn\":\"kind\",\"rightColumn\":\"Kind\"}],\"projectRename\":[{\"originalName\":\"[Get data connectors].subscriptionId\",\"mergedName\":\"subscriptionId\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5047\"},{\"originalName\":\"[Get data connectors].ConnectionName\",\"mergedName\":\"ConnectionName\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5047\"},{\"originalName\":\"[Get data connectors].kind\",\"mergedName\":\"kind\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5047\"},{\"originalName\":\"[kind=asc].Kind\",\"mergedName\":\"Kind\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5047\"}]}",
        "size": 0,
        "title": "Connected Subscriptions to ASC",
        "noDataMessage": "No connection rules to ASC found.",
        "queryType": 7,
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "kind",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Kind",
              "formatter": 18,
              "formatOptions": {
                "showIcon": true,
                "thresholdsOptions": "icons",
                "thresholdsGrid": [
                  {
                    "operator": "Default",
                    "thresholdValue": null,
                    "representation": "success",
                    "text": ""
                  }
                ]
              }
            },
            {
              "columnMatch": "Count",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true,
                "aggregation": "Count"
              }
            }
          ],
          "rowLimit": 10000,
          "filter": true,
          "sortBy": [
            {
              "itemKey": "subscriptionId",
              "sortOrder": 1
            }
          ],
          "labelSettings": [
            {
              "columnId": "subscriptionId"
            },
            {
              "columnId": "ConnectionName"
            },
            {
              "columnId": "kind"
            },
            {
              "columnId": "Kind",
              "label": "Connected"
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "subscriptionId",
            "sortOrder": 1
          }
        ]
      },
      "customWidth": "70",
      "name": "Connected Subscriptions to ASC"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"Merge/1.0\",\"merges\":[{\"id\":\"06882b07-0325-4fb4-a31d-e93bb6ca5078\",\"mergeType\":\"table\",\"leftTable\":\"Connected Subscriptions to ASC\"}],\"projectRename\":[{\"originalName\":\"[Connected Subscriptions to ASC].ConnectionName\",\"mergedName\":\"ConnectionName\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5078\"},{\"originalName\":\"[Connected Subscriptions to ASC].kind\",\"mergedName\":\"kind\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5078\"},{\"originalName\":\"[Connected Subscriptions to ASC].subscriptionId\",\"mergedName\":\"subscriptionId\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5078\"},{\"originalName\":\"[Connected Subscriptions to ASC].Kind\",\"mergedName\":\"Connected\",\"fromId\":\"06882b07-0325-4fb4-a31d-e93bb6ca5078\"},{\"originalName\":\"[Added column]\",\"mergedName\":\"Added column\",\"fromId\":null,\"isNewItem\":true,\"newItemData\":[{\"condition\":\"if (ConnectionName is not empty ), result = '1'\",\"criteriaContext\":{\"leftOperand\":\"ConnectionName\",\"operator\":\"isNotNull\",\"rightValType\":\"column\",\"resultValType\":\"static\",\"resultVal\":\"1\"}},{\"condition\":\"Click edit to specify a result for the default condition.\",\"criteriaContext\":{\"operator\":\"Default\",\"rightValType\":\"column\",\"resultValType\":\"column\"}}]}]}",
        "size": 4,
        "title": "Amount of connected subscriptions",
        "queryType": 7,
        "visualization": "table",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "$gen_group",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "ConnectionName",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true,
                "aggregation": "Sum"
              }
            },
            {
              "columnMatch": "kind",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "subscriptionId",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Connected",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Added column",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true,
                "aggregation": "Sum"
              },
              "numberFormat": {
                "unit": 17,
                "options": {
                  "style": "decimal"
                }
              }
            }
          ],
          "hierarchySettings": {
            "treeType": 1,
            "groupBy": [
              "Added column"
            ]
          },
          "labelSettings": [
            {
              "columnId": "ConnectionName"
            },
            {
              "columnId": "kind"
            },
            {
              "columnId": "subscriptionId"
            },
            {
              "columnId": "Connected"
            },
            {
              "columnId": "Added column",
              "label": "Count"
            }
          ]
        },
        "tileSettings": {
          "showBorder": false
        }
      },
      "customWidth": "30",
      "name": "Amount of connected subscriptions"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{\"version\":\"Merge/1.0\",\"merges\":[{\"id\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\",\"mergeType\":\"outer\",\"leftTable\":\"Connected Subscriptions to ASC\",\"rightTable\":\"Last logs from ASC by subscription\",\"leftColumn\":\"subscriptionId\",\"rightColumn\":\"WorkspaceSubscriptionId\"}],\"projectRename\":[{\"originalName\":\"[Connected Subscriptions to ASC].subscriptionId\",\"mergedName\":\"subscriptionId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Connected Subscriptions to ASC].ConnectionName\",\"mergedName\":\"ConnectionName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Connected Subscriptions to ASC].kind\",\"mergedName\":\"kind\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Connected Subscriptions to ASC].Kind\",\"mergedName\":\"Connected\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].WorkspaceSubscriptionId\",\"mergedName\":\"WorkspaceSubscriptionId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].TimeGenerated\",\"mergedName\":\"TimeGenerated\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].TenantId\",\"mergedName\":\"TenantId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].DisplayName\",\"mergedName\":\"DisplayName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].AlertName\",\"mergedName\":\"AlertName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].AlertSeverity\",\"mergedName\":\"AlertSeverity\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].Description\",\"mergedName\":\"Description\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ProviderName\",\"mergedName\":\"ProviderName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].VendorName\",\"mergedName\":\"VendorName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].VendorOriginalId\",\"mergedName\":\"VendorOriginalId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].SystemAlertId\",\"mergedName\":\"SystemAlertId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ResourceId\",\"mergedName\":\"ResourceId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].SourceComputerId\",\"mergedName\":\"SourceComputerId\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].AlertType\",\"mergedName\":\"AlertType\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ConfidenceLevel\",\"mergedName\":\"ConfidenceLevel\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ConfidenceScore\",\"mergedName\":\"ConfidenceScore\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].IsIncident\",\"mergedName\":\"IsIncident\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].StartTime\",\"mergedName\":\"StartTime\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].EndTime\",\"mergedName\":\"EndTime\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ProcessingEndTime\",\"mergedName\":\"ProcessingEndTime\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].RemediationSteps\",\"mergedName\":\"RemediationSteps\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ExtendedProperties\",\"mergedName\":\"ExtendedProperties\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].Entities\",\"mergedName\":\"Entities\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].SourceSystem\",\"mergedName\":\"SourceSystem\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].WorkspaceResourceGroup\",\"mergedName\":\"WorkspaceResourceGroup\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ExtendedLinks\",\"mergedName\":\"ExtendedLinks\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ProductName\",\"mergedName\":\"ProductName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].ProductComponentName\",\"mergedName\":\"ProductComponentName\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].AlertLink\",\"mergedName\":\"AlertLink\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"},{\"originalName\":\"[Last logs from ASC by subscription].Type\",\"mergedName\":\"Type\",\"fromId\":\"44d3379f-6eed-4256-a8c3-ffa28357d07e\"}]}",
        "size": 0,
        "title": "Connected Subscriptions with Last Logs",
        "queryType": 7,
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "kind",
              "formatter": 18,
              "formatOptions": {
                "showIcon": true,
                "thresholdsOptions": "icons",
                "thresholdsGrid": [
                  {
                    "operator": "Default",
                    "thresholdValue": null,
                    "representation": "success",
                    "text": ""
                  }
                ]
              }
            },
            {
              "columnMatch": "Connected",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "WorkspaceSubscriptionId",
              "formatter": 5,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "rowLimit": 10000,
          "filter": true,
          "sortBy": [
            {
              "itemKey": "subscriptionId",
              "sortOrder": 1
            }
          ],
          "labelSettings": [
            {
              "columnId": "subscriptionId"
            },
            {
              "columnId": "ConnectionName"
            },
            {
              "columnId": "kind",
              "label": "Connected"
            },
            {
              "columnId": "Connected"
            },
            {
              "columnId": "WorkspaceSubscriptionId"
            },
            {
              "columnId": "TimeGenerated"
            },
            {
              "columnId": "TenantId"
            },
            {
              "columnId": "DisplayName"
            },
            {
              "columnId": "AlertName"
            },
            {
              "columnId": "AlertSeverity"
            },
            {
              "columnId": "Description"
            },
            {
              "columnId": "ProviderName"
            },
            {
              "columnId": "VendorName"
            },
            {
              "columnId": "VendorOriginalId"
            },
            {
              "columnId": "SystemAlertId"
            },
            {
              "columnId": "ResourceId"
            },
            {
              "columnId": "SourceComputerId"
            },
            {
              "columnId": "AlertType"
            },
            {
              "columnId": "ConfidenceLevel"
            },
            {
              "columnId": "ConfidenceScore"
            },
            {
              "columnId": "IsIncident"
            },
            {
              "columnId": "StartTime"
            },
            {
              "columnId": "EndTime"
            },
            {
              "columnId": "ProcessingEndTime"
            },
            {
              "columnId": "RemediationSteps"
            },
            {
              "columnId": "ExtendedProperties"
            },
            {
              "columnId": "Entities"
            },
            {
              "columnId": "SourceSystem"
            },
            {
              "columnId": "WorkspaceResourceGroup"
            },
            {
              "columnId": "ExtendedLinks"
            },
            {
              "columnId": "ProductName"
            },
            {
              "columnId": "ProductComponentName"
            },
            {
              "columnId": "AlertLink"
            },
            {
              "columnId": "Type"
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "subscriptionId",
            "sortOrder": 1
          }
        ]
      },
      "name": "Last Logs recieved from connected subscriptions"
    }
  ],
  "fromTemplateId": "sentinel-ASCconnectionsWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}