{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "crossComponentResources": [
        ],
        "parameters": [
          {
            "id": "193018ae-9d71-428b-97c9-567bc424b446",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "typeSettings": {
              "additionalResourceOptions": [],
              "includeAll": true,
              "showDefault": false
            },
            "value": [
            ]
          },
          {
            "id": "56adbf21-6ff1-472e-a1bc-0080686fac66",
            "version": "KqlParameterItem/1.0",
            "name": "Workspace",
            "type": 5,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| project id",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "typeSettings": {
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources",
            "value": [
            ]
          },
          {
            "id": "482be6d3-096d-4546-bbdc-a4bbae626160",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "label": "Time range",
            "type": 4,
            "value": {
              "durationMs": 7776000000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            },
            "timeContext": {
              "durationMs": 86400000
            }
          },
          {
            "id": "28ea2c0a-97e1-4978-b7bd-6de29f7c550b",
            "version": "KqlParameterItem/1.0",
            "name": "ShowHelp",
            "label": "Show help?",
            "type": 10,
            "typeSettings": {
              "additionalResourceOptions": [],
              "showDefault": false
            },
            "jsonData": "[\r\n    {\"value\": \"Yes\", \"label\": \"Yes\"},\r\n    {\"value\": \"No\", \"label\": \"No\"}\r\n]",
            "value": "No"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.resourcegraph/resources"
      },
      "name": "parameters - 0"
    },
    {
      "type": 1,
      "content": {
        "json": "Sentinel Health table contains the following information:\r\n\r\n1. Automation rule run<br>\r\nAny run of automation rule is logged, except those which their conditions not met hence no action performed.<br>\r\nPlaybooks triggered by the automation rules, including trigger status, not including the run result\r\n\r\n2. Playbook was triggered on demand<br>\r\nAny trigger of playbook on an incident from portal or API, including trigger status, not including the run result\r\n\r\nTo get details about playbooks run result, for each playbook you are interested in monitoring, follow these steps - https://docs.microsoft.com/azure/logic-apps/monitor-logic-apps-log-analytics#set-up-azure-monitor-logs.<br>\r\nMake sure to select Send to Log Analytics workspace as destination, and choose your Microsoft Sentinel workspace. Sample KQL to find details:\r\n\r\nAzureDiagnostics<br>\r\n| where OperationName = \"Microsoft.Logic/workflows/workflowRunCompleted\"",
        "style": "info"
      },
      "conditionalVisibility": {
        "parameterName": "ShowHelp",
        "comparison": "isEqualTo",
        "value": "Yes"
      },
      "name": "text - 20"
    },
    {
      "type": 11,
      "content": {
        "version": "LinkItem/1.0",
        "style": "tabs",
        "links": [
          {
            "id": "21bca600-cdf0-45d3-b8b4-f4fdd4791a27",
            "cellValue": "Tab",
            "linkTarget": "parameter",
            "linkLabel": "Automation Health",
            "subTarget": "AutomationHealth",
            "preText": "Autmation health",
            "style": "link"
          },
          {
            "id": "55a16002-e96e-4e60-a5d3-27b7798e1451",
            "cellValue": "Tab",
            "linkTarget": "parameter",
            "linkLabel": "Playbooks run by Automation Rules",
            "subTarget": "AutomationRulePlaybooks",
            "style": "link"
          },
          {
            "id": "31f4c16a-28bf-4ca6-b12c-2df54e138ee3",
            "cellValue": "Tab",
            "linkTarget": "parameter",
            "linkLabel": "Automation per Incident",
            "subTarget": "PerIncident",
            "style": "link"
          }
        ]
      },
      "name": "links - 6"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType == \"Automation rule\"\r\n| where Status == \"Failure\"\r\n| summarize FailedRuns=count(Status) by SentinelResourceName, SentinelResourceId\r\n| top 5 by FailedRuns",
              "size": 1,
              "title": "Top 5 failed Automation rules",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "customWidth": "30",
            "name": "query - 13"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType == \"Playbook\"\r\n| where Status == \"Failure\"\r\n| summarize FailedRuns=count(Status) by SentinelResourceName, SentinelResourceId\r\n| top 5 by FailedRuns",
              "size": 1,
              "title": "Top 5 failed Playbooks on-demand (failed triggers)",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "customWidth": "30",
            "name": "query - 14"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "AzureDiagnostics\r\n| where OperationName == \"Microsoft.Logic/workflows/workflowRunCompleted\"\r\n| where status_s == \"Failed\"\r\n| summarize FailedRuns=count(status_s) by SentinelResourceName = resource_workflowName_s, SentinelResourceId = workflowId_s\r\n| top 5 by FailedRuns",
              "size": 1,
              "title": "Top 5 failed Playbooks - Azure Diagnostics (failed runs)",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "customWidth": "30",
            "name": "query - 2"
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationHealth"
      },
      "name": "Top failed automations"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "title": "Automation runs by type",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Playbook\", \"Automation rule\")\r\n| summarize Runs=count(Status) by SentinelResourceType",
              "size": 1,
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "piechart"
            },
            "customWidth": "20",
            "name": "query - 5"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Playbook\", \"Automation rule\")\r\n| summarize Runs=count(Status) by SentinelResourceType",
              "size": 4,
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "SentinelResourceType",
              "exportParameterName": "SentinelResourceType",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "customWidth": "20",
            "name": "query - 1"
          }
        ],
        "exportParameters": true
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationHealth"
      },
      "name": "Automation runs"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "title": "Status by automation type",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType}\"\r\n| summarize Runs=count(SentinelResourceType) by Status",
              "size": 1,
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "visualization": "piechart"
            },
            "customWidth": "20",
            "name": "query - 4"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType}\"\r\n| summarize Runs=count(SentinelResourceType) by Status",
              "size": 4,
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "Status",
              "exportParameterName": "Status",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspace}"
              ]
            },
            "customWidth": "20",
            "name": "query - 2"
          }
        ],
        "exportParameters": true
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationHealth"
      },
      "name": "runs per automation type"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType}\"\r\n| where Status == \"{Status}\"\r\n| sort by TimeGenerated desc",
        "size": 0,
        "title": "List of runs per status",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "RecordId",
        "exportParameterName": "RecordId",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationHealth"
      },
      "name": "query - 3"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType}\"\r\n| where RecordId == \"{RecordId}\"\r\n| project IncidentNumber=ExtendedProperties.IncidentNumber, SentinelResourceId, runId=ExtendedProperties.RunId, Description, Reason, TriggeredOn=ExtendedProperties.TriggeredOn, TriggeredBy=ExtendedProperties.TriggeredByName.UserDisplayName, UPN=ExtendedProperties.TriggeredByName.UserPrincipalName",
        "size": 4,
        "title": "Playbook on-demand run details",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "runId",
        "exportParameterName": "runIdP",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType",
          "comparison": "isEqualTo",
          "value": "Playbook"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "AutomationHealth"
        }
      ],
      "name": "query - 4"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"Playbook\"\r\n| extend RunId=tostring(ExtendedProperties.RunId)\r\n| where RunId == \"{runIdP}\"\r\n| join (AzureDiagnostics\r\n| where OperationName == \"Microsoft.Logic/workflows/workflowRunCompleted\"\r\n| project resource_runId_s, playbookName = resource_workflowName_s, playbookRunStatus = status_s, errorMessage = error_message_s) on\r\n$left.RunId == $right.resource_runId_s\r\n| project RecordId, TimeGenerated, workflowRunId = RunId, playbookName, SentinelResourceId, playbookRunStatus, errorMessage",
        "size": 4,
        "title": "Playbook run details (Azure Diagnostic)",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType",
          "comparison": "isEqualTo",
          "value": "Playbook"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "AutomationHealth"
        }
      ],
      "name": "query - 15"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType}\"\r\n| where RecordId == \"{RecordId}\"\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| project IncidentNumber=ExtendedProperties.IncidentNumber, workflowId=tostring(TriggeredPlaybooks.WorkflowId), runId=tostring(TriggeredPlaybooks.RunId), Description, Reason, TriggeredOn=ExtendedProperties.TriggeredOn, TriggeredWhen=ExtendedProperties.TriggeredWhen, TotalActions=ExtendedProperties.TotalActions, ActionsTriggeredSuccessfuly=ExtendedProperties.ActionsTriggeredSuccessfuly",
        "size": 4,
        "title": "Automation rule run details",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "runId",
        "exportParameterName": "runId",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType",
          "comparison": "isEqualTo",
          "value": "Automation rule"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "AutomationHealth"
        }
      ],
      "name": "query - 5"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"Automation rule\"\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| extend RunId=tostring(TriggeredPlaybooks.RunId)\r\n| where RunId == \"{runId}\"\r\n| join (AzureDiagnostics\r\n| where OperationName == \"Microsoft.Logic/workflows/workflowRunCompleted\"\r\n| project resource_runId_s, playbookName = resource_workflowName_s, playbookRunStatus = status_s, errorMessage = error_message_s) on\r\n$left.RunId == $right.resource_runId_s\r\n| project RecordId, TimeGenerated, workflowRunId = RunId, playbookName, workflowId=tostring(TriggeredPlaybooks.WorkflowId), playbookRunStatus, errorMessage",
        "size": 4,
        "title": "Playbook run details (Azure Diagnostic)",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "AutomationHealth"
        },
        {
          "parameterName": "SentinelResourceType",
          "comparison": "isEqualTo",
          "value": "Automation rule"
        }
      ],
      "name": "query - 14"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityIncident\r\n| extend Owner = tostring(Owner.assignedTo)\r\n| summarize arg_max(TimeGenerated, Title, Severity, Status, ProviderName, Owner, ModifiedBy, IncidentUrl) by IncidentNumber\r\n| sort by IncidentNumber desc",
        "size": 0,
        "title": "List of incidents",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "IncidentNumber",
        "exportParameterName": "IncidentNumber",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "PerIncident"
      },
      "name": "query - 7"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "title": "Automations run on incident",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Playbook\", \"Automation rule\")\r\n| extend IncidentNo = ExtendedProperties.IncidentNumber\r\n| where IncidentNo == {IncidentNumber}\r\n| summarize Runs=count(Status) by SentinelResourceType\r\n",
              "size": 1,
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "piechart"
            },
            "customWidth": "20",
            "conditionalVisibility": {
              "parameterName": "Tab",
              "comparison": "isEqualTo",
              "value": "PerIncident"
            },
            "name": "query - 8"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Playbook\", \"Automation rule\")\r\n| extend IncidentNo = ExtendedProperties.IncidentNumber\r\n| where IncidentNo == {IncidentNumber}\r\n| summarize Runs=count(Status) by SentinelResourceType\r\n",
              "size": 4,
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "SentinelResourceType",
              "exportParameterName": "SentinelResourceType2",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "customWidth": "20",
            "name": "query - 9"
          }
        ],
        "exportParameters": true
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "PerIncident"
      },
      "name": "Automation run on incident"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "title": "Automation run statuses",
        "items": [
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType2}\"\r\n| extend IncidentNo = tostring(ExtendedProperties.IncidentNumber)\r\n| where IncidentNo == \"{IncidentNumber}\"\r\n| summarize Runs=count(SentinelResourceType) by Status",
              "size": 4,
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "piechart"
            },
            "customWidth": "20",
            "name": "query - 10"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType2}\"\r\n| extend IncidentNo = tostring(ExtendedProperties.IncidentNumber)\r\n| where IncidentNo == \"{IncidentNumber}\"\r\n| summarize Runs=count(SentinelResourceType) by Status",
              "size": 4,
              "timeContextFromParameter": "TimeRange",
              "exportFieldName": "Status",
              "exportParameterName": "Status2",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "customWidth": "20",
            "name": "query - 1"
          }
        ],
        "exportParameters": true
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "PerIncident"
      },
      "name": "status by automation type"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType2}\"\r\n| where Status == \"{Status2}\"\r\n| extend IncidentNo = tostring(ExtendedProperties.IncidentNumber)\r\n| where IncidentNo == \"{IncidentNumber}\"\r\n| sort by TimeGenerated desc",
        "size": 1,
        "title": "Automation details",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "RecordId",
        "exportParameterName": "RecordId2",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "PerIncident"
      },
      "name": "query - 10"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType2}\"\r\n| where RecordId == \"{RecordId2}\"\r\n| extend IncidentNo = tostring(ExtendedProperties.IncidentNumber)\r\n| where IncidentNo == \"{IncidentNumber}\"\r\n| project IncidentNumber=ExtendedProperties.IncidentNumber, SentinelResourceId, RunId=ExtendedProperties.RunId, Description, Reason, TriggeredOn=ExtendedProperties.TriggeredOn, TriggeredBy=ExtendedProperties.TriggeredByName.UserDisplayName, UPN=ExtendedProperties.TriggeredByName.UserPrincipalName",
        "size": 4,
        "title": "Playbook on-demand run details",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "RunId",
        "exportParameterName": "RunIdInc",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType2",
          "comparison": "isEqualTo",
          "value": "Playbook"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "PerIncident"
        }
      ],
      "name": "query - 11"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"Playbook\"\r\n| extend RunId=tostring(ExtendedProperties.RunId)\r\n| where RunId == \"{RunIdInc}\"\r\n| join (AzureDiagnostics\r\n| where OperationName == \"Microsoft.Logic/workflows/workflowRunCompleted\"\r\n| project resource_runId_s, playbookName = resource_workflowName_s, playbookRunStatus = status_s, errorMessage = error_message_s) on\r\n$left.RunId == $right.resource_runId_s\r\n| project RecordId, TimeGenerated, workflowRunId = RunId, playbookName, SentinelResourceId, playbookRunStatus, errorMessage",
        "size": 4,
        "title": "Playbook run details (Azure Diagnostic)",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType2",
          "comparison": "isEqualTo",
          "value": "Playbook"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "PerIncident"
        }
      ],
      "name": "query - 21"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"{SentinelResourceType2}\"\r\n| where RecordId == \"{RecordId2}\"\r\n| extend IncidentNo = tostring(ExtendedProperties.IncidentNumber)\r\n| where IncidentNo == \"{IncidentNumber}\"\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| project IncidentNumber=ExtendedProperties.IncidentNumber, workflowId=tostring(TriggeredPlaybooks.WorkflowId), RunId=tostring(TriggeredPlaybooks.RunId), Description, Reason, TriggeredOn=ExtendedProperties.TriggeredOn, TriggeredWhen=ExtendedProperties.TriggeredWhen, TotalActions=ExtendedProperties.TotalActions, ActionsTriggeredSuccessfuly=ExtendedProperties.ActionsTriggeredSuccessfuly",
        "size": 1,
        "title": "Automation rule run details",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "RunId",
        "exportParameterName": "RunIdIcAR",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType2",
          "comparison": "isEqualTo",
          "value": "Automation rule"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "PerIncident"
        }
      ],
      "name": "query - 12"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"Automation rule\"\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| extend RunId=tostring(TriggeredPlaybooks.RunId)\r\n| where RunId == \"{RunIdIcAR}\"\r\n| join (AzureDiagnostics\r\n| where OperationName == \"Microsoft.Logic/workflows/workflowRunCompleted\"\r\n| project resource_runId_s, playbookName = resource_workflowName_s, playbookRunStatus = status_s, errorMessage = error_message_s) on\r\n$left.RunId == $right.resource_runId_s\r\n| project RecordId, TimeGenerated, workflowRunId = RunId, playbookName, workflowId=tostring(TriggeredPlaybooks.WorkflowId), playbookRunStatus, errorMessage",
        "size": 4,
        "title": "Playbook run details (Azure Diagnostic)",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibilities": [
        {
          "parameterName": "SentinelResourceType2",
          "comparison": "isEqualTo",
          "value": "Automation rule"
        },
        {
          "parameterName": "Tab",
          "comparison": "isEqualTo",
          "value": "PerIncident"
        }
      ],
      "name": "query - 22"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Automation rule\")\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| extend Playbooks = \"Playbooks\"\r\n| project AutomationRulePlaybook = tostring(TriggeredPlaybooks.WorkflowId), RunId = tostring(TriggeredPlaybooks.RunId), Playbooks\r\n| summarize Runs = count() by Playbooks",
        "size": 4,
        "title": "Playbooks run by Automation rule",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationRulePlaybooks"
      },
      "name": "query - 3"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Automation rule\")\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| project Playbook = tostring(TriggeredPlaybooks.WorkflowId)\r\n| summarize Runs=count() by Playbook\r\n| sort by Runs desc",
        "size": 0,
        "title": "List of Playbooks run by Automation rules",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "Playbook",
        "exportParameterName": "PlaybookAR",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationRulePlaybooks"
      },
      "name": "query - 19"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType in (\"Automation rule\")\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| extend Playbook = tostring(TriggeredPlaybooks.WorkflowId)\r\n| where Playbook == \"{PlaybookAR}\"\r\n| project IncidentNumber = tostring(ExtendedProperties.IncidentNumber), Playbook, RunId = tostring(TriggeredPlaybooks.RunId), TriggeredOn = ExtendedProperties.TriggeredOn, TriggeredWhen = ExtendedProperties.TriggeredWhen\r\n| sort by IncidentNumber desc",
        "size": 0,
        "title": "Specific Playbook runs",
        "timeContextFromParameter": "TimeRange",
        "exportFieldName": "RunId",
        "exportParameterName": "RunIdAR",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "gridSettings": {
          "sortBy": [
            {
              "itemKey": "TriggeredWhen",
              "sortOrder": 1
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "TriggeredWhen",
            "sortOrder": 1
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationRulePlaybooks"
      },
      "name": "query - 20"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SentinelHealth\r\n| where SentinelResourceType == \"Automation rule\"\r\n| mv-expand TriggeredPlaybooks = ExtendedProperties.TriggeredPlaybooks\r\n| extend RunId=tostring(TriggeredPlaybooks.RunId)\r\n| where RunId == \"{RunIdAR}\"\r\n| join (AzureDiagnostics\r\n| where OperationName == \"Microsoft.Logic/workflows/workflowRunCompleted\"\r\n| project resource_runId_s, playbookName = resource_workflowName_s, playbookRunStatus = status_s, errorMessage = error_message_s) on\r\n$left.RunId == $right.resource_runId_s\r\n| project RecordId, TimeGenerated, workflowRunId = RunId, playbookName, workflowId=tostring(TriggeredPlaybooks.WorkflowId), playbookRunStatus, errorMessage",
        "size": 4,
        "title": "Playbook run details from Azure Diagnostics",
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "Tab",
        "comparison": "isEqualTo",
        "value": "AutomationRulePlaybooks"
      },
      "name": "query - 21"
    }
  ],
  "fallbackResourceIds": [
  ],
  "fromTemplateId": "sentinel-AutomationHealth",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}