{
    "version": "Notebook/1.0",
    "items": [
      {
        "type": 1,
        "content": {
          "json": "## Conditional Access Trends"
        },
        "name": "text - 0"
      },
      {
        "type": 9,
        "content": {
          "version": "KqlParameterItem/1.0",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "parameters": [
            {
              "id": "18302244-0cfb-46d8-92e2-554fa9974c38",
              "version": "KqlParameterItem/1.0",
              "name": "Workspace",
              "type": 5,
              "description": "Select at least one workspace that contains continuous export data based on the selected subscriptions",
              "isRequired": true,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "query": "resources\r\n| where type =~ 'microsoft.operationalinsights/workspaces'\r\n| project id",
              "crossComponentResources": [
                "value::all"
              ],
              "typeSettings": {
                "additionalResourceOptions": []
              },
              "timeContext": {
                "durationMs": 0
              },
              "timeContextFromParameter": "CAPTime",
              "queryType": 1,
              "resourceType": "microsoft.resourcegraph/resources",
              "value": [
                "/subscriptions/d1d8779d-38d7-4f06-91db-9cbc8de0176f/resourceGroups/SOC/providers/Microsoft.OperationalInsights/workspaces/CyberSecuritySOC"
              ]
            },
            {
              "id": "9943b4a1-371e-4e50-8cbe-749a6dd87d76",
              "version": "KqlParameterItem/1.0",
              "name": "CAPTime",
              "type": 4,
              "isRequired": true,
              "typeSettings": {
                "selectableValues": [
                  {
                    "durationMs": 300000
                  },
                  {
                    "durationMs": 900000
                  },
                  {
                    "durationMs": 1800000
                  },
                  {
                    "durationMs": 3600000
                  },
                  {
                    "durationMs": 14400000
                  },
                  {
                    "durationMs": 43200000
                  },
                  {
                    "durationMs": 86400000
                  },
                  {
                    "durationMs": 172800000
                  },
                  {
                    "durationMs": 259200000
                  },
                  {
                    "durationMs": 604800000
                  },
                  {
                    "durationMs": 1209600000
                  },
                  {
                    "durationMs": 2419200000
                  },
                  {
                    "durationMs": 2592000000
                  },
                  {
                    "durationMs": 5184000000
                  },
                  {
                    "durationMs": 7776000000
                  }
                ]
              },
              "value": {
                "durationMs": 604800000
              }
            },
            {
              "id": "7ffbab18-9e02-4840-a27f-e89207b0636a",
              "version": "KqlParameterItem/1.0",
              "name": "UserPrincipalName",
              "type": 2,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "query": "// Get Sign-in logs for any Report-Only Conditional Access policies where the result = ReportOnlyFailure\r\nSigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n//| where ConditionalAccessPolicies[\"result\"] == \"reportOnlyFailure\"\r\n| where ConditionalAccessPolicies[\"result\"] contains \"report\"\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| extend City = tostring(todynamic(LocationDetails).city)\r\n| extend State = tostring(todynamic(LocationDetails).state)\r\n| extend AzureADApplication = AppDisplayName\r\n| distinct UserPrincipalName\r\n| union \r\n// Get Non Interactive Sign-in logs for any Report-Only Conditional Access policies where the result = ReportOnlyFailure\r\n(AADNonInteractiveUserSignInLogs \r\n| mv-expand todynamic(ConditionalAccessPolicies)\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| extend City = tostring(todynamic(LocationDetails).city)\r\n| extend State = tostring(todynamic(LocationDetails).state)\r\n| extend AzureADApplication = AppDisplayName\r\n//| project TimeGenerated, Category,UserPrincipalName, AzureADApplication = AppDisplayName, ClientApplication = ClientAppUsed, ClientBrowser = todynamic(DeviceDetail).browser, ClientOperatingSystem = todynamic(DeviceDetail).operatingSystem, ClientIPAddress = IPAddress ,ConditionalAccessPolicyName = ConditionalAccessPolicies[\"displayName\"], City, State, CAResult)\r\n| distinct UserPrincipalName)\r\n\r\n",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "typeSettings": {
                "additionalResourceOptions": [
                  "value::all"
                ],
                "showDefault": false
              },
              "timeContext": {
                "durationMs": 0
              },
              "timeContextFromParameter": "CAPTime",
              "defaultValue": "value::all",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "value": [
                "value::all"
              ]
            },
            {
              "id": "75142a7d-ca45-427e-a349-a7d217191be2",
              "version": "KqlParameterItem/1.0",
              "name": "CategorySignIn",
              "type": 2,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "typeSettings": {
                "additionalResourceOptions": [
                  "value::all"
                ],
                "showDefault": false
              },
              "jsonData": "[\"SignInLogs\",\"NonInteractiveUserSignInLogs\"]",
              "defaultValue": "value::all",
              "value": [
                "SignInLogs"
              ]
            },
            {
              "id": "b506d8e1-ce7a-4af8-b94c-65bbd3e70534",
              "version": "KqlParameterItem/1.0",
              "name": "AzureADApplication",
              "type": 2,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "query": "// Get Sign-in logs for\r\nSigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| project AzureADApplication = AppDisplayName\r\n| union \r\n// Get Non Interactive Sign-in logs \r\n(AADNonInteractiveUserSignInLogs \r\n| mv-expand todynamic(ConditionalAccessPolicies)\r\n| project  AzureADApplication = AppDisplayName)\r\n| distinct AzureADApplication\r\n| sort by AzureADApplication asc nulls first ",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "typeSettings": {
                "additionalResourceOptions": [
                  "value::all"
                ],
                "showDefault": false
              },
              "timeContext": {
                "durationMs": 0
              },
              "timeContextFromParameter": "CAPTime",
              "defaultValue": "value::all",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            {
              "id": "e14cf77f-6d3d-46f2-a0bf-fe18d731e51f",
              "version": "KqlParameterItem/1.0",
              "name": "PolicyName",
              "type": 2,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "query": "// Get Sign-in logs \r\nSigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend ['PolicyName'] = tostring(ConditionalAccessPolicies.displayName)\r\n| distinct ['PolicyName']\r\n| union \r\n// Get Non Interactive Sign-in logs \r\n(AADNonInteractiveUserSignInLogs \r\n| mv-expand todynamic(ConditionalAccessPolicies)\r\n| extend ['PolicyName'] = tostring(ConditionalAccessPolicies.displayName)\r\n| distinct ['PolicyName'])\r\n| distinct ['PolicyName']\r\n| sort by ['PolicyName'] asc",
              "crossComponentResources": [
                "{Workspace}"
              ],
              "typeSettings": {
                "additionalResourceOptions": [
                  "value::all"
                ],
                "showDefault": false
              },
              "timeContext": {
                "durationMs": 0
              },
              "timeContextFromParameter": "CAPTime",
              "defaultValue": "value::all",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            {
              "id": "b4ddb6f0-8afb-4f3c-aca9-c3d3847e019b",
              "version": "KqlParameterItem/1.0",
              "name": "Report",
              "type": 2,
              "multiSelect": true,
              "quote": "'",
              "delimiter": ",",
              "typeSettings": {
                "additionalResourceOptions": [
                  "value::all"
                ],
                "showDefault": false
              },
              "jsonData": "[\"reportOnlySuccess\",\"reportOnlyNotApplied\",\"reportOnlyInterrupted\",\"reportOnlyFailure\",\"success\",\"notApplied\",\"notEnabled\",\"failure\"]",
              "timeContext": {
                "durationMs": 86400000
              },
              "defaultValue": "value::all",
              "value": [
                "success"
              ]
            }
          ],
          "style": "pills",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces"
        },
        "name": "parameters - 22 - Copy"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "// Get Sign-in logs for any Report-Only Conditional Access policies where the result = ReportOnlyFailure\nSigninLogs\n| mvexpand ConditionalAccessPolicies\n| where ConditionalAccessPolicies[\"result\"] has_any ('')\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\n| project CAResult\n| union \n// Get Non Interactive Sign-in logs for any Report-Only Conditional Access policies where the result = ReportOnlyFailure\nAADNonInteractiveUserSignInLogs \n| mvexpand todynamic(ConditionalAccessPolicies)\n| where ConditionalAccessPolicies[\"result\"] has_any ('')\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\n| project CAResult\n| summarize count() by CAResult\n",
          "size": 4,
          "title": "Conditional Access Signin Summaries",
          "timeContextFromParameter": "CAPTime",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "visualization": "tiles",
          "tileSettings": {
            "showBorder": false,
            "titleContent": {
              "columnMatch": "CAResult",
              "formatter": 1
            },
            "leftContent": {
              "columnMatch": "count_",
              "formatter": 12,
              "formatOptions": {
                "palette": "auto"
              },
              "numberFormat": {
                "unit": 17,
                "options": {
                  "maximumSignificantDigits": 3,
                  "maximumFractionDigits": 2
                }
              }
            }
          }
        },
        "name": "query - 3"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "// Get Sign-in logs for any Report-Only Conditional Access policies\r\nSigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend Result = tostring(ConditionalAccessPolicies.result)\r\n| extend AzureADApplication = AppDisplayName\r\n| extend ['PolicyName'] = tostring(ConditionalAccessPolicies.displayName)\r\n| extend NamedNetwork = tostring(parse_json(tostring(parse_json(NetworkLocationDetails)[0].networkNames))[0])\r\n| where Result in ({Report}) or '*' in ({Report})\r\n| where Category in ({CategorySignIn}) or '*' in ({CategorySignIn})\r\n| where AzureADApplication in ({AzureADApplication}) or '*' in ({AzureADApplication})\r\n| where UserPrincipalName in ({UserPrincipalName}) or '*' in ({UserPrincipalName})\r\n| where ['PolicyName'] in ({PolicyName}) or '*' in ({PolicyName})\r\n| project TimeGenerated, Category, UserPrincipalName, AzureADApplication, Grant = ConditionalAccessPolicies.enforcedGrantControls,ClientOS = DeviceDetail.operatingSystem, DeviceName = DeviceDetail.displayName, Managed = DeviceDetail.isManaged, Trust = DeviceDetail.trustType,ClientIP = IPAddress, Location, NamedNetwork, ['PolicyName'], Result\r\n| union \r\n// Get Non Interactive Sign-in logs \r\n(AADNonInteractiveUserSignInLogs \r\n| mv-expand todynamic(ConditionalAccessPolicies)\r\n| extend Result = tostring(ConditionalAccessPolicies.result)\r\n| extend AzureADApplication = AppDisplayName\r\n| extend ['PolicyName'] = tostring(ConditionalAccessPolicies.displayName)\r\n| extend NamedNetwork = tostring(parse_json(tostring(parse_json(NetworkLocationDetails)[0].networkNames))[0])\r\n| where Result in ({Report}) or '*' in ({Report})\r\n| where Category in ({CategorySignIn}) or '*' in ({CategorySignIn})\r\n| where AzureADApplication in ({AzureADApplication}) or '*' in ({AzureADApplication})\r\n| where UserPrincipalName in ({UserPrincipalName}) or '*' in ({UserPrincipalName})\r\n| where ['PolicyName'] in ({PolicyName}) or '*' in ({PolicyName})\r\n| project TimeGenerated, Category,UserPrincipalName, AzureADApplication, Grant = ConditionalAccessPolicies.enforcedGrantControls,ClientOS = todynamic(DeviceDetail).operatingSystem, ClientIP = IPAddress, ['PolicyName'], Location, NamedNetwork, Result)\r\n| order by TimeGenerated\r\n",
          "size": 0,
          "showAnalytics": true,
          "title": "Conditional Access Status",
          "timeContextFromParameter": "CAPTime",
          "exportParameterName": "Detail",
          "exportDefaultValue": "{ \"Name\":\"\", \"Type\":\"*\", \"Parent\":\"*\"}",
          "exportToExcelOptions": "all",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "gridSettings": {
            "formatters": [
              {
                "columnMatch": "$gen_group",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "70ch"
                }
              },
              {
                "columnMatch": "TimeGenerated",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "25ch"
                }
              },
              {
                "columnMatch": "Category",
                "formatter": 5
              },
              {
                "columnMatch": "UserPrincipalName",
                "formatter": 5,
                "formatOptions": {
                  "customColumnWidthSetting": "35ch"
                }
              },
              {
                "columnMatch": "AzureADApplication",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "25ch"
                }
              },
              {
                "columnMatch": "ClientIP",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "15ch"
                }
              },
              {
                "columnMatch": "Location",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "13ch"
                }
              },
              {
                "columnMatch": "NamedNetwork",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "20ch"
                }
              },
              {
                "columnMatch": "PolicyName",
                "formatter": 5
              },
              {
                "columnMatch": "Result",
                "formatter": 5
              },
              {
                "columnMatch": "$gen_group",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "70ch"
                }
              },
              {
                "columnMatch": "CA Policy Name",
                "formatter": 5
              },
              {
                "columnMatch": "CAResult",
                "formatter": 5
              },
              {
                "columnMatch": "GrantControls",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "18ch"
                }
              }
            ],
            "hierarchySettings": {
              "treeType": 1,
              "groupBy": [
                "Result",
                "PolicyName",
                "UserPrincipalName"
              ],
              "expandTopLevel": false,
              "finalBy": "Category"
            }
          },
          "sortBy": [],
          "tileSettings": {
            "showBorder": false,
            "titleContent": {
              "columnMatch": "CA Policy Name",
              "formatter": 1
            },
            "leftContent": {
              "columnMatch": "failure",
              "formatter": 12,
              "formatOptions": {
                "palette": "auto"
              },
              "numberFormat": {
                "unit": 17,
                "options": {
                  "maximumSignificantDigits": 3,
                  "maximumFractionDigits": 2
                }
              }
            }
          },
          "mapSettings": {
            "locInfo": "LatLong",
            "sizeSettings": "failure",
            "sizeAggregation": "Sum",
            "legendMetric": "failure",
            "legendAggregation": "Sum",
            "itemColorSettings": {
              "type": "heatmap",
              "colorAggregation": "Sum",
              "nodeColorField": "failure",
              "heatmapPalette": "greenRed"
            }
          }
        },
        "customWidth": "100",
        "name": "query - 10 - Copy - Copy",
        "styleSettings": {
          "margin": "25"
        }
      },
      {
        "type": 12,
        "content": {
          "version": "NotebookGroup/1.0",
          "groupType": "editable",
          "items": [
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "SigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| extend deviceState = case(DeviceDetail[\"trustType\"] == \"\", \"Unmanaged\", DeviceDetail[\"trustType\"])\r\n| summarize count() by deviceState\r\n",
                "size": 3,
                "title": "Device State - Total",
                "timeContextFromParameter": "CAPTime",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "piechart"
              },
              "customWidth": "33",
              "name": "query - 7"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "SigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| extend device = tostring(DeviceDetail[\"operatingSystem\"])\r\n| summarize count() by UserPrincipalName, device\r\n| summarize count() by device",
                "size": 3,
                "title": "Device Platform - Total",
                "timeContextFromParameter": "CAPTime",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "piechart"
              },
              "customWidth": "33",
              "name": "query - 8"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "SigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| summarize count() by RiskLevelDuringSignIn",
                "size": 3,
                "title": "Sign-in Risk - Total",
                "timeContextFromParameter": "CAPTime",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "piechart"
              },
              "customWidth": "33",
              "name": "query - 9"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "SigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| summarize count() by ClientAppUsed",
                "size": 3,
                "title": "Client App - Total",
                "timeContextFromParameter": "CAPTime",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "piechart"
              },
              "customWidth": "33",
              "name": "query - 8"
            },
            {
              "type": 3,
              "content": {
                "version": "KqlItem/1.0",
                "query": "SigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| summarize count() by Location\r\n",
                "size": 3,
                "title": "Location - Total",
                "timeContextFromParameter": "CAPTime",
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "visualization": "map",
                "mapSettings": {
                  "locInfo": "CountryRegion",
                  "locInfoColumn": "Location",
                  "sizeSettings": "Location",
                  "sizeAggregation": "Sum",
                  "minSize": 10,
                  "maxSize": 30,
                  "defaultSize": 12,
                  "labelSettings": "Location",
                  "legendMetric": "count_",
                  "legendAggregation": "Sum",
                  "itemColorSettings": {
                    "nodeColorField": "Location",
                    "colorAggregation": "Sum",
                    "type": "heatmap",
                    "heatmapPalette": "greenDarkDark"
                  },
                  "numberFormatSettings": {
                    "unit": 0,
                    "options": {
                      "style": "decimal",
                      "useGrouping": false
                    }
                  }
                }
              },
              "customWidth": "55",
              "showPin": false,
              "name": "query - 10",
              "styleSettings": {
                "margin": "40",
                "padding": "0"
              }
            }
          ]
        },
        "name": "group - 9"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "SigninLogs\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| extend ['CA Policy Name'] = tostring(ConditionalAccessPolicies.displayName)\r\n| where RiskLevelDuringSignIn <> \"none\" or RiskState <> \"none\"\r\n| union\r\nAADUserRiskEvents\r\n| project TimeGenerated, UserPrincipalName, RiskDetail, RiskEventType, RiskLevel, RiskState, ['CA Policy Name']\r\n| sort by TimeGenerated desc",
          "size": 0,
          "title": "Conditional Access Risk Details",
          "timeContextFromParameter": "CAPTime",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "gridSettings": {
            "formatters": [
              {
                "columnMatch": "$gen_group",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "75ch"
                }
              },
              {
                "columnMatch": "UserPrincipalName",
                "formatter": 5
              },
              {
                "columnMatch": "CA Policy Name",
                "formatter": 5
              },
              {
                "columnMatch": "$gen_group",
                "formatter": 0,
                "formatOptions": {
                  "customColumnWidthSetting": "75ch"
                }
              }
            ],
            "hierarchySettings": {
              "treeType": 1,
              "groupBy": [
                "UserPrincipalName"
              ],
              "finalBy": "CA Policy Name"
            }
          }
        },
        "name": "query - 6"
      },
      {
        "type": 3,
        "content": {
          "version": "KqlItem/1.0",
          "query": "SigninLogs\r\n| project TimeGenerated, ConditionalAccessPolicies, UserPrincipalName, AppDisplayName\r\n| mv-expand ConditionalAccessPolicies\r\n| extend CAResult = tostring(ConditionalAccessPolicies.result)\r\n| extend CAPolicyName = tostring(ConditionalAccessPolicies.displayName)\r\n| where CAResult == \"failure\"\r\n| summarize\r\n    ['List of Failed Application']=make_set(AppDisplayName),\r\n    ['Count of Failed Application']=dcount(AppDisplayName)\r\n    by UserPrincipalName, bin(TimeGenerated, 1h)\r\n| where ['Count of Failed Application'] >= 5",
          "size": 0,
          "title": "Conditional Access Block to 5+ Apps within 1 Hour",
          "queryType": 0,
          "resourceType": "microsoft.operationalinsights/workspaces",
          "crossComponentResources": [
            "{Workspace}"
          ],
          "visualization": "table",
          "tileSettings": {
            "showBorder": false,
            "titleContent": {
              "columnMatch": "UserPrincipalName",
              "formatter": 1
            },
            "leftContent": {
              "columnMatch": "Count of Failed Application",
              "formatter": 12,
              "formatOptions": {
                "palette": "auto"
              },
              "numberFormat": {
                "unit": 17,
                "options": {
                  "maximumSignificantDigits": 3,
                  "maximumFractionDigits": 2
                }
              }
            }
          }
        },
        "name": "query - 6"
      }
    ],
    "fromTemplateId": "sentinel-ConditionalAccessTrends",
    "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
  }