{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Darktrace Model Breaches\n---\n\nDisplaying Darktrace model breach summary determined by the Timeframe set below"
      },
      "name": "text - 2"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "e12ee2fa-c488-4c2f-9463-f6add28055b5",
            "version": "KqlParameterItem/1.0",
            "name": "Timeframe",
            "type": 4,
            "description": "Select a timeframe to display Darktrace model breaches",
            "value": {
              "durationMs": 5184000000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            },
            "timeContext": {
              "durationMs": 86400000
            }
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog | where DeviceVendor == \"Darktrace\" | summarize count() by TimeGenerated \n",
        "size": 0,
        "title": "Breaches Over Time",
        "color": "orange",
        "timeContext": {
          "durationMs": 2592000000
        },
        "timeBrushParameterName": "Timeframe",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "timechart",
        "tileSettings": {
          "showBorder": false
        },
        "graphSettings": {
          "type": 0,
          "topContent": {
            "columnMatch": "LogSeverity",
            "formatter": 9,
            "formatOptions": {
              "palette": "red"
            }
          },
          "nodeIdField": "TimeGenerated",
          "sourceIdField": "TimeGenerated",
          "targetIdField": "LogSeverity",
          "graphOrientation": 3,
          "showOrientationToggles": false,
          "nodeSize": null,
          "staticNodeSize": 100,
          "colorSettings": null,
          "hivesMargin": 5
        },
        "chartSettings": {
          "showMetrics": false,
          "ySettings": {
            "numberFormatSettings": {
              "unit": 0,
              "options": {
                "style": "decimal",
                "useGrouping": false,
                "maximumFractionDigits": 0
              }
            }
          }
        }
      },
      "customWidth": "70",
      "name": "query - 5"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog | where DeviceVendor == \"Darktrace\" | where isnotempty(DeviceName) | summarize count(Activity) by DeviceName\n\n",
        "size": 2,
        "title": "Device Breach Summary",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "Timeframe",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "piechart",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "count",
              "formatter": 0,
              "formatOptions": {
                "aggregation": "Count"
              }
            }
          ]
        },
        "chartSettings": {
          "xAxis": "TimeGenerated"
        }
      },
      "customWidth": "30",
      "name": "query - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog | where DeviceVendor == \"Darktrace\" | where isnotempty(DeviceName) | top 10 by LogSeverity desc | project DeviceName, DeviceAddress, Activity, LogSeverity",
        "size": 0,
        "title": "Top Hitting Devices",
        "timeContext": {
          "durationMs": 5184000000
        },
        "timeContextFromParameter": "Timeframe",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "LogSeverity",
              "formatter": 8,
              "formatOptions": {
                "min": 0,
                "max": 8,
                "palette": "orange"
              }
            }
          ]
        }
      },
      "customWidth": "50",
      "name": "query - 3"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog | where DeviceVendor == \"Darktrace\" | summarize event_count=count() by Activity | where Activity!=\"System/System\" | top 10 by event_count",
        "size": 0,
        "title": "Most Breached Models",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "event_count",
              "formatter": 3,
              "formatOptions": {
                "palette": "orange"
              }
            }
          ]
        }
      },
      "customWidth": "50",
      "name": "query - 4"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "\nCommonSecurityLog | where DeviceVendor == \"Darktrace\" | where isnotempty(DestinationHostName) | summarize count(Activity) by DestinationHostName",
        "size": 0,
        "title": "Top External Hostnames ",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "piechart"
      },
      "name": "query - 7"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "\n\nCommonSecurityLog | where DeviceVendor == \"Darktrace\" | where isnotempty(DestinationIP) | where DestinationIP !startswith \"10\"| where DestinationIP !startswith \"192\"| where DestinationIP !startswith \"172\"| summarize event_count=count() by DestinationIP | top 5 by event_count",
        "size": 2,
        "title": "Top 5 External IP addresses over 30 days",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "categoricalbar",
        "tileSettings": {
          "showBorder": false,
          "titleContent": {
            "columnMatch": "DestinationIP",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "event_count",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          }
        },
        "graphSettings": {
          "type": 2,
          "topContent": {
            "columnMatch": "DestinationIP",
            "formatter": 1
          },
          "centerContent": {
            "columnMatch": "event_count",
            "formatter": 1,
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "hivesContent": {
            "columnMatch": "DestinationIP",
            "formatter": 1
          },
          "nodeIdField": "DestinationIP",
          "graphOrientation": 3,
          "showOrientationToggles": false,
          "nodeSize": null,
          "staticNodeSize": 100,
          "colorSettings": null,
          "groupByField": "DestinationIP",
          "hivesMargin": 4
        },
        "chartSettings": {
          "group": "DestinationIP",
          "createOtherGroup": null,
          "ySettings": {
            "numberFormatSettings": {
              "unit": 0,
              "options": {
                "style": "decimal",
                "useGrouping": true
              }
            }
          }
        },
        "mapSettings": {
          "locInfo": "LatLong",
          "sizeSettings": "event_count",
          "sizeAggregation": "Sum",
          "legendMetric": "event_count",
          "legendAggregation": "Sum",
          "itemColorSettings": {
            "type": "heatmap",
            "colorAggregation": "Sum",
            "nodeColorField": "event_count",
            "heatmapPalette": "greenRed"
          }
        }
      },
      "name": "Top Hitting External IP addresses",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog | where DeviceVendor == \"Darktrace\" | where Activity contains \"compliance\" | summarize count() by TimeGenerated",
        "size": 0,
        "title": "Compliance Breaches Over Time",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "linechart"
      },
      "name": "query - 8"
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/20ac8776-c56d-4158-a314-56ed60f9d5d8/resourcegroups/sentinel-testing/providers/microsoft.operationalinsights/workspaces/dev-test-mail-lab"
  ],
  "fromTemplateId": "sentinel-Darktrace Model Breach Summary",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}