{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "<h2>Users With Number of Failure Logs</h2>"
      },
      "name": "text - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog \r\n| extend outcome = split(split(AdditionalExtensions, \";\", 2)[0], \"=\", 1)[0]\r\n| extend reason = split(split(AdditionalExtensions, \";\", 3)[0], \"=\", 1)[0]\r\n| where DeviceVendor == \"Forcepoint CASB\"\r\n| where DeviceProduct in (\"SaaS Security Gateway\", \"Cloud Service Monitoring\", \"CASB Admin audit log\")\r\n| where outcome ==\"Failure\" \r\n| summarize Count= count() by DestinationUserName| render barchart",
        "size": 0,
        "timeContext": {
          "durationMs": 13568400000,
          "endTime": "2020-02-05T11:48:00.000Z"
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 2"
    },
    {
      "type": 1,
      "content": {
        "json": "\r\n<h2>Top 5 Users With The Highest Number Of Logs</h2>"
      },
      "name": "text - 3"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog \r\n| where DeviceVendor == \"Forcepoint CASB\"\r\n| where DeviceProduct in (\"SaaS Security Gateway\", \"Cloud Service Monitoring\", \"CASB Admin audit log\")\r\n| summarize Count = count() by DestinationUserName\r\n| top 5 by DestinationUserName| render barchart",
        "size": 1,
        "timeContext": {
          "durationMs": 13568400000,
          "endTime": "2020-02-05T11:49:00.000Z"
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 4"
    },
    {
      "type": 1,
      "content": {
        "json": "<h1>Login Faliture & IP Addresses</h1>\r\n"
      },
      "name": "text - 4"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog  \r\n\r\n| extend outcome = split(split(AdditionalExtensions, \";\", 2)[0], \"=\", 1)[0] \r\n\r\n| extend reason = split(split(AdditionalExtensions, \";\", 3)[0], \"=\", 1)[0] \r\n\r\n| where outcome ==\"Failure\" \r\n\r\n| summarize countFailure = count() by DestinationUserName, DestinationIP, SourceIP \r\n\r\n| join kind= leftouter (CommonSecurityLog  \r\n\r\n    | extend outcome = split(split(AdditionalExtensions, \";\", 2)[0], \"=\", 1)[0] \r\n\r\n    | extend reason = split(split(AdditionalExtensions, \";\", 3)[0], \"=\", 1)[0] \r\n\r\n    | where outcome ==\"Success\" \r\n\r\n    | summarize countSuccess = count() by DestinationUserName, DestinationIP, SourceIP) on DestinationUserName and SourceIP \r\n\r\n| extend flagSummary = iff(isnull(countSuccess), strcat(countFailure, \":true:\", iif(isnull(countSuccess),0, countSuccess)), strcat(countFailure, \":false:\", iif(isnull(countSuccess),0, countSuccess))) \r\n\r\n|where flagSummary endswith(\"true:0\") and isnotempty(SourceIP) \r\n\r\n|project DestinationUserName,SourceIP,countFailure,countSuccess,flagSummary \r\n\r\n|top 5 by countFailure ",
        "size": 0,
        "timeContext": {
          "durationMs": 13568400000,
          "endTime": "2020-02-05T11:53:00.000Z"
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 5"
    }
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}