{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/ASimFileEventAWSCloudTrail')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "FileEvent ASIM parser for AWS Cloud Trail",
        "category": "ASIM",
        "FunctionAlias": "ASimFileEventAWSCloudTrail",
        "query": "let ParseS3Events = (T: (EventSource: string, EventName: string, RequestParameters: dynamic, ResponseElements: dynamic, Resources: dynamic)) {\n    let S3EventNameLookup = datatable(EventName: string, EventType: string, EventSubType: string)\n    [  \n        \"CompleteMultipartUpload\", \"FileCreated\", \"Checkin\",\n        \"CopyObject\", \"FileCopied\", \"\",\n        \"CreateBucket\", \"FolderCreated\", \"\",\n        \"CreateBucketMetadataConfiguration\", \"FolderModified\", \"\",\n        \"CreateBucketMetadataTableConfiguration\", \"FolderModified\", \"\",\n        \"CreateMultipartUpload\", \"FileCreated\", \"Checkin\",\n        \"DeleteBucket\", \"FolderDeleted\", \"\",\n        \"DeleteBucketAnalyticsConfiguration\", \"FolderModified\", \"\",\n        \"DeleteBucketCors\", \"FolderModified\", \"\",\n        \"DeleteBucketEncryption\", \"FolderModified\", \"\",\n        \"DeleteBucketIntelligentTieringConfiguration\", \"FolderModified\", \"\",\n        \"DeleteBucketInventoryConfiguration\", \"FolderModified\", \"\",\n        \"DeleteBucketLifecycle\", \"FolderModified\", \"\",\n        \"DeleteBucketMetadataConfiguration\", \"FolderModified\", \"\",\n        \"DeleteBucketMetadataTableConfiguration\", \"FolderModified\", \"\",\n        \"DeleteBucketMetricsConfiguration\", \"FolderModified\", \"\",\n        \"DeleteBucketOwnershipControls\", \"FolderModified\", \"\",\n        \"DeleteBucketPolicy\", \"FolderModified\", \"\",\n        \"DeleteBucketReplication\", \"FolderModified\", \"\",\n        \"DeleteBucketTagging\", \"FolderModified\", \"\",\n        \"DeleteBucketWebsite\", \"FolderModified\", \"\",\n        \"DeleteObject\", \"FileDeleted\", \"\",\n        \"DeleteObjects\", \"FileDeleted\", \"\",\n        \"DeleteObjectTagging\", \"FileAttributesUpdated\", \"\",\n        \"DeletePublicAccessBlock\", \"FileAttributesUpdated\", \"\",\"\"\n        \"GetBucketAbac\", \"FolderAttributesAccessed\", \"\",\n        \"GetBuckeAccelerateConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketAcl\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketAnalyticsConfiguation\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketCors\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketEncryption\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketIntelligentTieringConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketInventoryConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketLifecycle\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketLifecycleConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketLocation\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketLogging\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketMetadataConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketMetadataTableConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketMetricsConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketNotification\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketNotificationConfiguration\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketOwnershipControls\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketPolicy\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketPolicyStatus\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketReplication\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketRequestPayment\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketTagging\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketVersioning\", \"FolderAttributesAccessed\", \"\",\n        \"GetBucketWebsite\", \"FolderAttributesAccessed\", \"\",\n        \"GetObject\", \"FileAccessed\", \"Download\",\n        \"GetObjectAcl\", \"FileAccessed\", \"\",\n        \"GetObjectAttributes\", \"FileAccessed\", \"\",\n        \"GetObjectLegalHold\", \"FileAccessed\", \"\",\n        \"GetObjectLockConfiguration\", \"FileAccessed\", \"\",\n        \"GetObjectRetention\", \"FileAccessed\", \"\",\n        \"GetObjectTagging\", \"FileAccessed\", \"\",\n        \"GetObjectTorrent\", \"FileAccessed\", \"\",\n        \"GetPublicAccessBlock\", \"FolderAttributesAccessed\", \"\",\n        \"HeadBucket\", \"FolderAttributesAccessed\", \"\",\n        \"HeadObject\", \"FileAccessed\", \"\",\n        \"ListBucketAnalyticsConfigurations\", \"FolderAttributesAccessed\", \"\",\n        \"ListBucketIntelligentTieringConfigurations\", \"FolderAttributesAccessed\", \"\",\n        \"ListBucketMetricsConfigurations\", \"FolderAttributesAccessed\", \"\",\n        \"ListBuckets\", \"FolderAttributesAccessed\", \"\",\n        \"ListDirectoryBuckets\", \"FolderAttributesAccessed\", \"\",\n        \"ListObjects\", \"FileAccessed\", \"\",\n        \"ListObjectsV2\", \"FileAccessed\", \"\",\n        \"ListObjectversions\", \"FileAccessed\", \"\",\n        \"ListParts\", \"FileAccessed\", \"\",\n        \"PutBucketAbac\", \"FolderModified\", \"\",\n        \"PutBucketAccelerateConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketAcl\", \"FolderModified\", \"\",\n        \"PutBucketAnalayticsConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketCors\", \"FolderModified\", \"\",\n        \"PutBucketEncryption\", \"FolderModified\", \"\",\n        \"PutBucketIntelligentTieringConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketInventoryConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketLifecycle\", \"FolderModified\", \"\",\n        \"PutBucketLifecycleConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketLogging\", \"FolderModified\", \"\",\n        \"PutBucketMetricsConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketNotification\", \"FolderModified\", \"\",\n        \"PutBucketNotificationConfiguration\", \"FolderModified\", \"\",\n        \"PutBucketOwnershipControls\", \"FolderModified\", \"\",\n        \"PutBucketPolicy\", \"FolderModified\", \"\",\n        \"PutBucketReplication\", \"FolderModified\", \"\",\n        \"PutBucketRequestPayment\", \"FolderModified\", \"\",\n        \"PutBucketTagging\", \"FolderModified\", \"\",\n        \"PutBucketVersioning\", \"FolderModified\", \"\",\n        \"PutBucketWebsite\", \"FolderModified\", \"\",\n        \"PutObject\", \"FileCreated\", \"Upload\",\n        \"PutObjectAcl\", \"FileAttributesUpdated\", \"\",\n        \"PutObjectLegalHold\", \"FileAttributesUpdated\", \"\",\n        \"PutObjectLockConfiguration\", \"FileAttributesUpdated\", \"\",\n        \"PutObjectRetention\", \"FileAttributesUpdated\", \"\",\n        \"PutObjectTagging\", \"FileAttributesUpdated\", \"\",\n        \"PutPublicAccessBlock\", \"FolderModified\", \"\",\n        \"RenameObject\", \"FileRenamed\", \"\",\n        \"RestoreObject\", \"FileCreated\", \"\",\n        \"SelectObjectContent\", \"FileAccessed\", \"\",\n        \"UpdateBucketMetadataInventoryTableConfiguration\", \"FolderModified\", \"\",\n        \"UpdateBucketMetadataJournalTableConfiguration\", \"FolderModified\", \"\",\n        \"UpdateObjectEncryption\", \"FileAttributesUpdated\", \"\",\n        \"UploadPart\", \"FileCreated\", \"Upload\",\n        \"UploadPartCopy\", \"FileCreated\", \"Upload\"\n        // Omitted Actions\n        // AbortMultipartUpload\n        // CreateSession\n        // ListMultipartUploads\n        // WriteGetObjectResponse\n    ];\n    T\n    | where EventSource == \"s3.amazonaws.com\"\n    | lookup S3EventNameLookup on EventName\n    | where isnotempty(EventType)\n    | extend EventSubType = case(\n        EventType == \"FileDeleted\" and ResponseElements[\"a-amz-delete-marker\"] == true, \"Versions\",\n        EventSubType\n    )\n    | extend\n        TargetFileDirectory = tostring(RequestParameters.bucketName),\n        TargetFileName = coalesce(tostring(RequestParameters.key), tostring(RequestParameters.prefix))\n    | extend\n        TargetFilePathType = \"Unix\",\n        TargetFilePath = strcat(TargetFileDirectory, \"/\", TargetFileName),\n        TargetAppType = \"Service\"\n    | extend\n        SrcFilePath = tostring(RequestParameters[\"x-amz-copy-source\"])\n    // Avoids using mv-apply as it filters insteads of assigning null\n    // At most, the Resources array contains two objects: Bucket and Object\n    // Resources may contain no objects, or just one of Bucket or Object\n    | extend AdditionalData = iff(pack, bag_pack(\n        \"BucketARN\", coalesce(\n            iff(Resources[0].type == \"AWS::S3::Bucket\", tostring(Resources[0].ARN), \"\"),\n            iff(Resources[1].type == \"AWS::S3::Bucket\", tostring(Resources[1].ARN), \"\")),\n        \"ObjectARN\", coalesce(\n            iff(Resources[0].type == \"AWS::S3::Object\", tostring(Resources[0].ARN), \"\"),\n            iff(Resources[1].type == \"AWS::S3::Object\", tostring(Resources[1].ARN), \"\"))\n    ), dynamic([]))\n};\nlet parser = (disabled: bool, pack: bool) {\nlet SupportedEventSources = dynamic([\n    \"s3.amazonaws.com\"\n]);\nlet EventSourceNameLookup = datatable(EventSource: string, TargetAppName: string)\n[\n    \"s3.amazonaws.com\", \"Amazon S3\"\n];\nlet SupportedEvents = AWSCloudTrail\n    | where EventSource in (SupportedEventSources)\n    | extend RequestParameters = todynamic(RequestParameters), ResponseElements = todynamic(ResponseElements), Resources = todynamic(Resources);\nunion isfuzzy=false\nParseS3Events(SupportedEvents)\n| extend\n    Type = \"AWSCloudTrail\",\n    EventCount = int(1),\n    EventStartTime = TimeGenerated,\n    EventEndTime = TimeGenerated,\n    EventSeverity = \"Informational\",\n    EventSchema = \"FileEvent\",\n    EventSchemaVersion = \"0.1.2\",\n    EventVendor = \"AWS\",\n    EventProduct = \"CloudTrail\",\n    Dvc = \"CloudTrail\",\n    EventResult = iff(isempty(ErrorCode) and isempty(ErrorMessage), \"Success\", \"Failure\"),\n    EventMessage = ErrorMessage\n| lookup EventSourceNameLookup on EventSource\n| project-rename\n    EventOriginalSubType = EventTypeName,\n    EventOriginalType = EventName,\n    EventUid = AwsEventId,\n    EventOriginalResultDetails = ErrorMessage,\n    EventProductVersion = EventVersion\n| project-rename\n    ActorUserId = UserIdentityAccountId,\n    ActorUsername = UserIdentityUserName,\n    ActorOriginalUserType = UserIdentityType,\n    HttpUserAgent = UserAgent\n| extend\n    ActorUserIdType = iff(isempty(ActorUserId), \"\", \"AWSId\"),\n    ActorUsernameType = iff(isempty(ActorUsername), \"\", \"Simple\"),\n    SrcIpAddr = iff(ipv4_is_in_range(SourceIpAddress, \"0.0.0.0/0\"), SourceIpAddress, \"\")\n| extend AdditionalFields = iff(pack, bag_pack(\n    \"ActorAccessKeyId\", UserIdentityAccessKeyId,\n    \"AWSRegion\", AWSRegion,\n    \"APIVersion\", APIVersion,\n    \"ManagementEvent\", ManagementEvent,\n    \"ReadOnly\", ReadOnly,\n    \"RequestParameters\", RequestParameters,\n    \"ResponseElements\", ResponseElements\n), dynamic([]))\n| extend AdditionalFields = iff(pack, bag_merge(AdditionalFields, AdditionalData), dynamic([]))\n// Alias\n| extend\n    User = ActorUsername,\n    IpAddr = SrcIpAddr,\n    FileName = TargetFileName,\n    FilePath = TargetFilePath,\n    Application = TargetAppName\n| project\n    TimeGenerated,\n    Type,\n    EventCount,\n    EventStartTime,\n    EventEndTime,\n    EventSeverity,\n    EventSchema,\n    EventSchemaVersion,\n    EventVendor,\n    EventProduct,\n    Dvc,\n    EventResult,\n    EventMessage,\n    TargetAppName,\n    EventOriginalSubType,\n    EventOriginalType,\n    EventUid,\n    EventOriginalResultDetails,\n    EventProductVersion,\n    ActorUserId,\n    ActorUsername,\n    ActorOriginalUserType,\n    HttpUserAgent,\n    ActorUserIdType,\n    ActorUsernameType,\n    SrcIpAddr,\n    AdditionalFields,\n    User,\n    IpAddr,\n    FileName,\n    FilePath,\n    Application,\n    TargetAppType,\n    EventType,\n    EventSubType,\n    TargetFileDirectory,\n    TargetFileName,\n    TargetFilePathType,\n    TargetFilePath,\n    SrcFilePath\n};\nparser(disabled=disabled, pack=pack)",
        "version": 1,
        "functionParameters": "disabled:bool=False,pack:bool=False"
      }
    }
  ]
}