{
    "properties": {
        "category": "SAPFunctions",
        "displayName": "SAPConnectorOverview",
        "query": "union isfuzzy=true  ABAP*, SAP_HeartBeat_CL, SecurityAlert\r\n| where Type != 'SecurityAlert'\r\n| where TimeGenerated > ago(DaysAgo)\r\n| extend SystemID_s= column_ifexists('SystemID_s','No system found')\r\n| project TimeGenerated, SystemID_s, Type\r\n",
        "functionAlias": "SAPConnectorOverview",
        "functionParameters": "DaysAgo:timespan = 14d",
        "version": 2,
        "etag": "*"
    },
    "name": "SAPConnectorOverview",
    "type": "savedSearches",
    "apiVersion": "2022-10-01"
}