{
    "properties": {
        "category": "SAPFunctions",
        "displayName": "SAPThreatIntelligenceIndicator",
        "query": "//generated function structure for table ThreatIntelligenceIndicator \r\n//generated on 2022-12-13 \r\n//Sentinel4SAP solution version 2.0.33 \r\nlet D_ThreatIntelligenceIndicator = datatable(TimeGenerated:datetime \r\n,Action:string\r\n,ActivityGroupNames:string\r\n,AdditionalInformation:string\r\n,ApplicationId:string\r\n,AzureTenantId:string\r\n,ConfidenceScore:real\r\n,Description:string\r\n,DiamondModel:string\r\n,ExternalIndicatorId:string\r\n,ExpirationDateTime:datetime\r\n,IndicatorId:string\r\n,ThreatType:string\r\n,Active:bool\r\n,KillChainActions:bool\r\n,KillChainC2:bool\r\n,KillChainDelivery:bool\r\n,KillChainExploitation:bool\r\n,KillChainReconnaissance:bool\r\n,KillChainWeaponization:bool\r\n,KnownFalsePositives:string\r\n,MalwareNames:string\r\n,PassiveOnly:bool\r\n,ThreatSeverity:int\r\n,Tags:string\r\n,TrafficLightProtocolLevel:string\r\n,EmailEncoding:string\r\n,EmailLanguage:string\r\n,EmailRecipient:string\r\n,EmailSenderAddress:string\r\n,EmailSenderName:string\r\n,EmailSourceDomain:string\r\n,EmailSourceIpAddress:string\r\n,EmailSubject:string\r\n,EmailXMailer:string\r\n,FileCompileDateTime:datetime\r\n,FileCreatedDateTime:datetime\r\n,FileHashType:string\r\n,FileHashValue:string\r\n,FileMutexName:string\r\n,FileName:string\r\n,FilePacker:string\r\n,FilePath:string\r\n,FileSize:int\r\n,FileType:string\r\n,DomainName:string\r\n,NetworkIP:string\r\n,NetworkPort:int\r\n,NetworkDestinationAsn:int\r\n,NetworkDestinationCidrBlock:string\r\n,NetworkDestinationIP:string\r\n,NetworkCidrBlock:string\r\n,NetworkDestinationPort:int\r\n,NetworkProtocol:int\r\n,NetworkSourceAsn:int\r\n,NetworkSourceCidrBlock:string\r\n,NetworkSourceIP:string\r\n,NetworkSourcePort:int\r\n,Url:string\r\n,UserAgent:string\r\n,IndicatorProvider:string\r\n,Type:string\r\n)[];\r\nlet T_ThreatIntelligenceIndicator = (ThreatIntelligenceIndicator | project \r\nTimeGenerated = column_ifexists('TimeGenerated', '1000-01-01T00:00:00Z')\r\n,Action = column_ifexists('Action', 'initialString')\r\n,ActivityGroupNames = column_ifexists('ActivityGroupNames', 'initialString')\r\n,AdditionalInformation = column_ifexists('AdditionalInformation', 'initialString')\r\n,ApplicationId = column_ifexists('ApplicationId', 'initialString')\r\n,AzureTenantId = column_ifexists('AzureTenantId', 'initialString')\r\n,ConfidenceScore = column_ifexists('ConfidenceScore', 1.1111)\r\n,Description = column_ifexists('Description', 'initialString')\r\n,DiamondModel = column_ifexists('DiamondModel', 'initialString')\r\n,ExternalIndicatorId = column_ifexists('ExternalIndicatorId', 'initialString')\r\n,ExpirationDateTime = column_ifexists('ExpirationDateTime', '1000-01-01T00:00:00Z')\r\n,IndicatorId = column_ifexists('IndicatorId', 'initialString')\r\n,ThreatType = column_ifexists('ThreatType', 'initialString')\r\n,Active = column_ifexists('Active', true)\r\n,KillChainActions = column_ifexists('KillChainActions', true)\r\n,KillChainC2 = column_ifexists('KillChainC2', true)\r\n,KillChainDelivery = column_ifexists('KillChainDelivery', true)\r\n,KillChainExploitation = column_ifexists('KillChainExploitation', true)\r\n,KillChainReconnaissance = column_ifexists('KillChainReconnaissance', true)\r\n,KillChainWeaponization = column_ifexists('KillChainWeaponization', true)\r\n,KnownFalsePositives = column_ifexists('KnownFalsePositives', 'initialString')\r\n,MalwareNames = column_ifexists('MalwareNames', 'initialString')\r\n,PassiveOnly = column_ifexists('PassiveOnly', true)\r\n,ThreatSeverity = column_ifexists('ThreatSeverity', 1)\r\n,Tags = column_ifexists('Tags', 'initialString')\r\n,TrafficLightProtocolLevel = column_ifexists('TrafficLightProtocolLevel', 'initialString')\r\n,EmailEncoding = column_ifexists('EmailEncoding', 'initialString')\r\n,EmailLanguage = column_ifexists('EmailLanguage', 'initialString')\r\n,EmailRecipient = column_ifexists('EmailRecipient', 'initialString')\r\n,EmailSenderAddress = column_ifexists('EmailSenderAddress', 'initialString')\r\n,EmailSenderName = column_ifexists('EmailSenderName', 'initialString')\r\n,EmailSourceDomain = column_ifexists('EmailSourceDomain', 'initialString')\r\n,EmailSourceIpAddress = column_ifexists('EmailSourceIpAddress', 'initialString')\r\n,EmailSubject = column_ifexists('EmailSubject', 'initialString')\r\n,EmailXMailer = column_ifexists('EmailXMailer', 'initialString')\r\n,FileCompileDateTime = column_ifexists('FileCompileDateTime', '1000-01-01T00:00:00Z')\r\n,FileCreatedDateTime = column_ifexists('FileCreatedDateTime', '1000-01-01T00:00:00Z')\r\n,FileHashType = column_ifexists('FileHashType', 'initialString')\r\n,FileHashValue = column_ifexists('FileHashValue', 'initialString')\r\n,FileMutexName = column_ifexists('FileMutexName', 'initialString')\r\n,FileName = column_ifexists('FileName', 'initialString')\r\n,FilePacker = column_ifexists('FilePacker', 'initialString')\r\n,FilePath = column_ifexists('FilePath', 'initialString')\r\n,FileSize = column_ifexists('FileSize', 1)\r\n,FileType = column_ifexists('FileType', 'initialString')\r\n,DomainName = column_ifexists('DomainName', 'initialString')\r\n,NetworkIP = column_ifexists('NetworkIP', 'initialString')\r\n,NetworkPort = column_ifexists('NetworkPort', 1)\r\n,NetworkDestinationAsn = column_ifexists('NetworkDestinationAsn', 1)\r\n,NetworkDestinationCidrBlock = column_ifexists('NetworkDestinationCidrBlock', 'initialString')\r\n,NetworkDestinationIP = column_ifexists('NetworkDestinationIP', 'initialString')\r\n,NetworkCidrBlock = column_ifexists('NetworkCidrBlock', 'initialString')\r\n,NetworkDestinationPort = column_ifexists('NetworkDestinationPort', 1)\r\n,NetworkProtocol = column_ifexists('NetworkProtocol', 1)\r\n,NetworkSourceAsn = column_ifexists('NetworkSourceAsn', 1)\r\n,NetworkSourceCidrBlock = column_ifexists('NetworkSourceCidrBlock', 'initialString')\r\n,NetworkSourceIP = column_ifexists('NetworkSourceIP', 'initialString')\r\n,NetworkSourcePort = column_ifexists('NetworkSourcePort', 1)\r\n,Url = column_ifexists('Url', 'initialString')\r\n,UserAgent = column_ifexists('UserAgent', 'initialString')\r\n,IndicatorProvider = column_ifexists('IndicatorProvider', 'initialString')\r\n,Type = column_ifexists('Type', 'initialString')\r\n);\r\nT_ThreatIntelligenceIndicator | union isfuzzy= true D_ThreatIntelligenceIndicator ",
        "functionAlias": "SAPThreatIntelligenceIndicator",
        "version": 2,
        "etag": "*"
    },
    "name": "SAPThreatIntelligenceIndicator",
    "type": "savedSearches",
    "apiVersion": "2022-10-01"
}