id: 2e20ec77-8d50-4959-a70d-79c341ee2c37
name: Anomalous Login to Devices
description: |
  'Adversaries may steal the credentials of a specific user or service account using credential access techniques or capture credentials earlier in their reconnaissance process through social engineering as a means of gaining initial access. APT33, for example, has used valid accounts for initial access and privilege escalation. The query below generates an output of all administrator users performing an interactive logon (4624:2) where one or more features of the activity deviate from the user, his peers, or the tenant profile.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078
query: |
 BehaviorAnalytics
 | where UsersInsights.IsDormantAccount == true
 | where DevicesInsights.IsLocalAdmin == true
 | where ActivityType =~ "LogOn"
 | where ActionType =~ "InteractiveLogon"
 | where ActivityInsights has "True"
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
 | extend Name=split(UserPrincipalName, "@")[0], UPNSuffix=split(UserPrincipalName, "@")[1]
 | extend Account_0_Name = Name
 | extend Account_0_UPNSuffix = UPNSuffix
 | extend IP_0_Address = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
version: 2.0.0