id: 8cf3c78e-cd10-4bfb-bd69-d62dc7f375f1
name: Anomalous Database Export Activity
description: |
 'Adversaries may attempt to exfiltrate sensitive data by exporting databases.
 The query identifies users performing an "Export database" operation where one or more behavioral features deviate from the user''s baseline, peer group, or the tenant profile.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
        - BehaviorAnalytics
tactics:
  - Collection
relevantTechniques:
  - T1530
query: |
    let operations = dynamic(['Export an existing database']);
    BehaviorAnalytics
    | where ActionType in~ (operations)
    | where ActivityInsights has "True"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
    | extend Name=split(UserPrincipalName, "@")[0], UPNSuffix=split(UserPrincipalName, "@")[1]
    | extend Account_0_Name = Name
    | extend Account_0_UPNSuffix = UPNSuffix
    | extend IP_0_Address = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
version: 2.0.0