id: 22b0262c-b6b5-4f15-82a4-93663e9965d7
name: Anomalous Password Reset
description: |
  'Adversaries may interrupt the availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to them. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset User Password where one or more features of the activity deviate from the user, his peers, or the tenant profile.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
       - BehaviorAnalytics
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
tactics:
  - Impact
relevantTechniques:
  - T1531
query: |
 BehaviorAnalytics
 | where ActionType =~ "Reset user password"
 | where ActivityInsights has "True"
 | join kind=inner (
 AuditLogs
 ) on $left.SourceRecordId == $right._ItemId
 | mv-expand TargetResources
 | extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace_string(tostring(split(TargetResources.userPrincipalName, "#")[0]),"_","@"),TargetResources.userPrincipalName)
 | extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace_string(tostring(split(UserPrincipalName, "#")[0]),"_","@"),UserPrincipalName),
 UserName = iff(UserName has "#EXT#",replace_string(tostring(split(UserPrincipalName, "#")[0]),"_","@"),UserName)
 | sort by TimeGenerated desc
 | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
 | extend Name=split(UserPrincipalName, "@")[0], UPNSuffix=split(UserPrincipalName, "@")[1]
 | extend Account_0_Name = Name
 | extend Account_0_UPNSuffix = UPNSuffix
 | extend IP_0_Address = SourceIPAddress
 | extend AzureResource_0_ResourceId = ResourceId
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
  - entityType: AzureResource
    fieldMappings:
      - identifier: ResourceId
        columnName: ResourceId
version: 2.0.0