id: 9ba2b304-7767-4d54-b03c-b0161ae87cc7
name: Anomalous action performed in tenant by privileged user
description: |
  'Shows activities that have never been executed in the tenant, performed by a user with high privileges.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
relevantTechniques:
query: |
  BehaviorAnalytics
  | where ActivityInsights.FirstTimeActionPerformedInTenant == True
  | where UsersInsights.BlastRadius =~ 'High'
  | extend AadUserId = UsersInsights.AccountObjectID
  | extend Account_0_AadUserId = AadUserId
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: AadUserId
version: 2.0.0