id: bd6fda76-c0df-41b0-b8cd-808190e1ded0
name: Anomalous Activity Role Assignment
description: |
    'Adversaries may circumvent mechanisms designed to control elevated privileges to gain higher-level permissions. The query below generates an output
    of all users performing an "action" operation regarding an access elevation, where one or more features of the activity deviate from the user,
    his peers or the tenant profile.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1548
query: |
    let operations = dynamic(['Create role assignment']);
    BehaviorAnalytics
    | where ActionType in~ (operations)
    | where ActivityInsights has "True"
    | project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
    | extend Name=split(UserPrincipalName, "@")[0], UPNSuffix=split(UserPrincipalName, "@")[1]
    | extend Account_0_Name = Name
    | extend Account_0_UPNSuffix = UPNSuffix
    | extend IP_0_Address = SourceIPAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: SourceIPAddress
version: 2.0.0