name: Anomalous login activity originated from Botnet, Tor proxy or C2
description: |
  'Shows login activity (successful or failed) originated from botnet, Tor proxy or C2, with at least one 'True' activity insight.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
relevantTechniques:
query: |
  BehaviorAnalytics
  | where ActivityType == 'LogOn' or ActivityType == 'FailedLogOn'
  | where DevicesInsights.ThreatIntelIndicatorType == 'Botnet' 
    or DevicesInsights.ThreatIntelIndicatorType == 'C2' 
    or DevicesInsights.ThreatIntelIndicatorType == 'Proxy'
  | where ActivityInsights contains 'True'
  | extend AadUserId = UsersInsights.AccountObjectID
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: AadUserId
