id: 8a255821-844a-4b6a-a529-0fdaff23219b
name: New account added to admin group 
description: |
  'Account created in the last 7 days that is added to administrators group'
requiredDataConnectors:
  - connectorId: IdentityInfo
    dataTypes:
      - IdentityInfo
tactics:
relevantTechniques:
query: |
  let adminGroup = 'Administrators';
  IdentityInfo
  | where AccountCreationTime >= ago(7d)
  | where GroupMembership contains adminGroup
  | extend Account_0_AadUserId = AccountObjectId
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: AccountObjectId
version: 2.0.0
