id: f0ad3b3f-72ac-48b1-9f01-ad408b3af88e
name: Terminated employee accessing High Value Asset
description: |
  'Shows all users tagged as terminated employees in the Terminated Employees watchlist that had activities after their termination date.'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
relevantTechniques:
query: |
  _GetWatchlist('HighValueAssets')
  | join ( BehaviorAnalytics
          | where ActionType contains "ResourceAccess")
          on $left.['Asset Name'] == $right.DestinationDevice
  | join _GetWatchlist('TerminatedEmployees')
    on $left.UserPrincipalName == $right.['User Principal Name']
  | extend AadUserId = UsersInsights.AccountObjectID
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: AadUserId
