id: 202ee40b-e6d8-4968-9a79-cf24c5c09db9
name: Anomalous update Key Vault activity by high blast radius user 
description: |
  'Shows all update Key Vault activities done by a user with a High blast radius. If the activity is performed for the first time (by the user or in the tenant) or if the activity originated in a never seen before country'
requiredDataConnectors:
  - connectorId: BehaviorAnalytics
    dataTypes:
      - BehaviorAnalytics
tactics:
relevantTechniques:
query: |
  BehaviorAnalytics
  | where ActivityType =~ "Administrative"
  | where ActionType =~ "Update Key Vault"
  | where UsersInsights.BlastRadius =~ "High"
  | where ActivityInsights.FirstTimeActionPerformedInTenant == true or
    ActivityInsights.FirstTimeUserPerformedAction == true or
    ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == true
  | extend AadUserId = UsersInsights.AccountObjectID
  |extend Account_0_AadUserId = AadUserId
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: AadUserId
version: 2.0.0 
