id: 643c2025-9604-47c5-833f-7b4b9378a1f5
name: IP with multiple failed AAD logins successfully logs in to the AWS Console.
description: |
	This query creates a list of IP addresses with a number failed login attempts to AAD 
	above a set threshold.  It then looks for any successful AWS Console logins from any
	of these IPs within the same timeframe.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
     - SigninLogs
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
releventTechniques:
  - T1078

query: |
	//Adjust this threshold to fit your environment
	let signin_threshold = 5; 
	//Make a list of IPs with AAD signin failures above our threshold
	let suspicious_signins = 
	SigninLogs
	| where TimeGenerated >= ago(1d)
	| where ResultType !in ("0", "50125", "50140")
	| where IPAddress != "127.0.0.1"
	| summarize count() by IPAddress
	| where count_ >  signin_threshold
	| summarize makelist(IPAddress);
	//See if any of those IPs have sucessfully logged into the AWS console
	AWSCloudTrail
	| where TimeGenerated > ago(1d)
	| where EventName == "ConsoleLogin"
	| extend LoginResult = tostring(parse_json(ResponseElements).ConsoleLogin) 
	| where LoginResult == "Success"
	| where SourceIpAddress in (suspicious_signins)
	| extend Reason = "Multiple failed AAD logins from IP address"
	| extend MFAUsed = tostring(parse_json(AdditionalEventData).MFAUsed)
	| extend User = iif(UserIdentityUserName == "", UserIdentityType, UserIdentityUserName) 
	| extend AccountCustomEntity = User
	| extend IPCustomEntity = SourceIpAddress
	| project TimeGenerated, Reason, LoginResult, EventTypeName, UserIdentityType, User, AWSRegion, SourceIpAddress, UserAgent, MFAUsed, AccountCustomEntity, IPCustomEntity 
