id: 643c2025-9604-47c5-833f-7b4b9378a1f5
name: IP with multiple failed AAD logins successfully logs in to the AWS Console.
description: |
	This query looks for IP addresses with multiple failed login attempts to AAD 
	with a successful AWS Console login within the same timeframe.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
     - SigninLogs
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  
query: |

	let signin_threshold = 5; 
	let suspicious_signins = 
	SigninLogs
	| where TimeGenerated >= ago(1d)
	| where ResultType !in ("0", "50125", "50140")
	| summarize count() by IPAddress
	| where count_ >  signin_threshold
	| summarize makelist(IPAddress);
	AWSCloudTrail
	| where TimeGenerated > ago(1d)
	| where EventName == "ConsoleLogin"
	| extend LoginResult = tostring(parse_json(ResponseElements).ConsoleLogin) 
	| where LoginResult == "Success"
	| where SourceIpAddress in (suspicious_signins)
	| extend Reason = "Multiple failed AAD logins from IP address"
	| extend MFAUsed = tostring(parse_json(AdditionalEventData).MFAUsed)
	| extend User = iif(UserIdentityUserName == "", UserIdentityType, UserIdentityUserName) 
	| project TimeGenerated, Reason, LoginResult, EventTypeName, UserIdentityType, User, AWSRegion, SourceIpAddress, UserAgent, MFAUsed
