id:  8ee967a2-a645-4832-85f4-72b635bcb3a6
name: IP with multiple failed AAD login attempts and successful remote login to host.
description: |
	This query looks for IP addresses with multiple failed logins to Azure AD and
	within the same timeframe a successful login to a host via a remote protocol such as RDP or SSH.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
     - SigninLogs
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvents
  - connectorId: Syslog
    dataTypes:
      - Syslog 
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  
query: |

	let signin_threshold = 5; 
	let suspicious_signins =
	SigninLogs
	| where TimeGenerated >= ago(1d)
	| where ResultType !in ("0", "50125", "50140")
	| summarize count() by IPAddress
	| where count_ > signin_threshold
	| summarize makelist(IPAddress);
	let linux_logons =
	Syslog
	| where TimeGenerated >= ago(1d)
	| where Facility contains "auth" and ProcessName != "sudo"
	| where SyslogMessage has "Accepted"
	| where SyslogMessage has_any (suspicious_signins)
	| extend Reason = "Multiple failed AAD logins from IP address"
	| project TimeGenerated, Computer, HostIP, SyslogMessage, Facility, ProcessName, Reason;
	let win_logons =
	SecurityEvent
	| where TimeGenerated >= ago(1d)
	| where EventID == 4624
	| where LogonType == 10 or LogonType == 7 or LogonType == 3
	| where IpAddress != "-"
	| where IpAddress in (suspicious_signins)
	| extend Reason = "Multiple failed AAD logins from IP address"
	| project TimeGenerated, Account, AccountType, Computer, Activity, EventID, LogonProcessName, IpAddress,  LogonTypeName, TargetUserSid, Reason;
	union isfuzzy=true linux_logons,win_logons
