id: 910124df-913c-47e3-a7cd-29e1643fa55e
name: IP with multiple failed AWS console logins successfully logs in to Azure AD.
description: |
	This query creates a list of IP addresses with multiple failed login attempts 
	to the AWS console above a set threshold. It then looks for any successful Azure
	AD logins from these IPs within the same timeframe.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
     - SigninLogs
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - CredentialAccess
 relevantTechniques:
   - T1078
   - T1110
  
query: |
	//Adjust this threshold to fit environment
	let  signin_threshold = 5; 
	//Make a list of IPs with failed AWS console logins
	let aws_fails = AWSCloudTrail
	| where TimeGenerated >= ago(1d)
	| where EventName == "ConsoleLogin"
	| extend LoginResult = tostring(parse_json(ResponseElements).ConsoleLogin) 
	| where LoginResult == "Success"
	| where SourceIPAddress != "127.0.0.1"
	| summarize count() by SourceIpAddress
	| where count_ >  signin_threshold
	| summarize makelist(SourceIpAddress);
	//See if any of those IPs have sucessfully logged into Azure AD.
	SigninLogs
	| where TimeGenerated >= ago(1d)
	| where ResultType !in ("0", "50125", "50140")
	| where IPAddress in (aws_fails) 
	| extend Reason=  "Multiple failed AWS Console logins from IP address"
	| extend AccountCustomEntity = UserPrincipalName
	| extend IPCustomEntity = IPAddress
