id:  1ce5e766-26ab-4616-b7c8-3b33ae321e80
name: IP with multiple failed host login attempts successfully logs into Azure AD.
description: |
	This query makes a list of IP addresses with multiple failed host logins
	above our defined threshold. It then looks for a sucessful Azure AD login
	from any of those IPs within the same timeframe.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
     - SigninLogs
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvents
  - connectorId: Syslog
    dataTypes:
      - Syslog 
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - CredentialAccess
relevantTechniques:
  - T1078
  - T1110
  
query: |
	//Adjust this threshold to fit environment
	let signin_threshold = 5; 
	//Make a list of IPs with failed Windows host logins above threshold
	let win_fails = 
	SecurityEvent
	| where TimeGenerated >= ago(1d)
	| where EventID == 4625
	| where LogonType == 10 or LogonType == 7 or LogonType == 3
	| where IpAddress != "-"
	| summarize count() by IpAddress
	| where count_ > signin_threshold
	| summarize makelist(IpAddress);
	//Make a list of IPs with failed *nix host logins above threshold
	let nix_fails = 
	Syslog
	| where TimeGenerated > ago(1d)
	| where Facility contains 'auth' and ProcessName != 'sudo'
	| extend SourceIP = extract("(([0-9]{1,3})\\.([0-9]{1,3})\\.([0-9]{1,3})\\.(([0-9]{1,3})))",1,SyslogMessage)
	| where SourceIP != "" and SourceIP != "127.0.0.1"
	| summarize count() by SourceIP
	| where count_ > signin_threshold
	| summarize makelist(SourceIP);
	//See if any of the IPs with failed host logins hve had a sucessful Azure AD login
	SigninLogs
	| where TimeGenerated > ago(1d)
	| where ResultType !in ("0", "50125", "50140")
	| where IPAddress in (win_fails) or IPAddress in (nix_fails)
	| extend Reason=  "Multiple failed host logins from IP address"
	| extend AccountCustomEntity = UserPrincipalName
	| extend IPCustomEntity = IPAddress
