id: a357535e-f722-4afe-b375-cff362b2b376
name: Malformed user agent
description: |
  'Malware authors will sometimes hardcode user agent string values when writing the network communication component of their malware.
  Malformed user agents can be an indication of such malware.'
severity: Medium
requiredDataConnectors:
  - connectorId: WAF
    dataTypes:
      - AzureDiagnostics
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - CommandAndControl
  - Execution
relevantTechniques:
  - T1189
  - T1071
  - T1203
query: |

  let endtime = 1d;
  (union isfuzzy=true
  (OfficeActivity | where TimeGenerated >= ago(endtime) | where UserAgent != ""),
  (OfficeActivity
  | where TimeGenerated >= ago(endtime)
  | where RecordType in ("AzureActiveDirectoryAccountLogon", "AzureActiveDirectoryStsLogon")
  | extend OperationName = Operation, UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))),
  (AzureDiagnostics
  | where TimeGenerated >= ago(endtime)
  | where ResourceType == "APPLICATIONGATEWAYS" 
  | where OperationName == "ApplicationGatewayAccess" 
  | extend ClientIP = CallerIpAddress, UserAgent = replace(@'\+', @' ', userAgent_s)))
  // Likely artefact of hardcoding
  | where UserAgent startswith "User" or UserAgent startswith "\""
  // Incorrect casing
  or (UserAgent startswith "Mozilla" and not(UserAgent containscs "Mozilla"))
  // Incorrect casing
  or UserAgent containscs  "(Compatible;"
  // Missing MSIE version
  or UserAgent matches regex @"MSIE\s?;"
  // Incorrect spacing around MSIE version
  or UserAgent matches regex  @"MSIE(?:\d|.{1,5}?\d\s;)"
  | summarize by TimeGenerated, UserId, ClientIP, UserAgent, OperationName, RecordType
  | extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, AccountCustomEntity = UserId
