id: b725d62c-eb77-42ff-96f6-bdc6745fc6e0
name: New UserAgent observed in last 24 hours
description: |
  Shows new UserAgent observed in the last 24 hours versus the previous 30 days. These new UserAgent could be benign. 
  However, in normally stable environments, these new UserAgent could provide a starting point for investigating malicious activity.
severity: Low
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
  - connectorId: Office365
    dataTypes:
     - OfficeActivity
  - connectorId: WAF
    dataTypes:
     - AzureDiagnostics
  - dataTypes:
    - W3CIISLog
queryFrequency: 1d
queryPeriod: 30d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - Discovery
query: |

  let UserAgentAll =
  (union isfuzzy=true
  (OfficeActivity
  | where TimeGenerated >= ago(30d) 
  | extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
  | extend SourceIP = ClientIP
  ),
  (
  AzureDiagnostics
  | where TimeGenerated >= ago(30d) 
  | extend UserAgent = replace(@'\+', @' ', userAgent_s)
  | where isnotempty(UserAgent)
  | parse msg_s with * 'HTTPS request from' SourceIP ':' * 
  | where isnotempty(SourceIP)
  ),
  (
  W3CIISLog
  | where TimeGenerated >= ago(30d) 
  | where UserAgent = csUserAgent
  | where SourceIP = cIP
  ),
  (
  AWSCloudTrail
  | where TimeGenerated >= ago(30d) 
  | where UserAgent = UserAgent
  | where SourceIP = SourceIpAddress
  ));
  UserAgentAll
  | where TimeGenerated < ago(1d)
  | summarize IP =dcount(SourceIP) by tostring(UserAgent)
  | join kind=rightanti
  (
  UserAgentAll
  | where TimeGenerated >= ago(1d) 
  | summarize IP =dcount(SourceIP) by tostring(UserAgent), SourceIP 
  ) on UserAgent 
  | project  UserAgent , SourceIP

