id: a5b3429d-f1da-42b9-883c-327ecb7b91ff
name: Detecting suspicious sign-in with workspace deletion attempt
description: |
  'This hunting query will alert on any sign-ins from devices infected with malware and actively communicating with a bot server with potential workspace deletion activity. 
Attackers may attempt to delete Machine Learning based workspaces containing production based compute instances  after successful compromise to cause service unavailability as part of their goal of interruption to regular business operation.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectoryIdentityProtection
    dataTypes:
      - SecurityAlert (IPC)
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - ServiceStop
relevantTechniques:
  - T1078
  - T1489
query: |
    SecurityAlert 
    | where AlertName contains "Sign-in from an infected device"
    | extend Extprop = parsejson(Entities)
    | mv-expand Extprop
    | extend Extprop = parsejson(Extprop)
    | extend CmdLine = iff(Extprop['Type']=="process", Extprop['CommandLine'], '')
    | extend File = iff(Extprop['Type']=="file", Extprop['Name'], '')
    | extend Account = Extprop['Name']
    | extend Domain = Extprop['UPNSuffix']
    | extend Account = iif(isnotempty(Domain) and Extprop['Type']=="account", tolower(strcat(Account, "@", Domain)), iif(Extprop['Type']=="account", tolower(Account), ""))
    | extend IpAddress = iff(Extprop["Type"] == "ip",Extprop['Address'], '')
    | extend Process = iff(isnotempty(CmdLine), CmdLine, File)
    | summarize count() by AlertName,AlertSeverity,CompromisedEntity,Account,IpAddress
    | join kind=inner 
    (
    AzureActivity
    | where OperationNameValue hassuffix ("/workspaces/computes/delete")
    | where ActivityStatusValue =~ "Succeeded"
    | summarize  StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ActivityTimeStamp = makelist(TimeGenerated), ActivityStatusValue = makelist(ActivityStatusValue),  OperationIds = makelist(OperationId), CorrelationIds = makelist(CorrelationId), Resources = makelist(Resource), ResourceGroups = makelist(ResourceGroup), ResourceIds = makelist(ResourceId), ActivityCountByCallerIPAddress = count()  
    by CallerIpAddress, Caller, OperationNameValue
    ) on $left. IpAddress == $right. CallerIpAddress
    | extend timestamp = StartTimeUtc, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled
