id: ee2a4583-0ddb-48d5-a30c-83144e82a4db
name: "[Entra ID]授予應用程式可指派Microsoft Entra ID 角色的管理權限"
version: 1.0.0
kind: Scheduled
description: |
  授予應用程式可指派Microsoft Entra ID 角色的管理權限。
  請與Entra ID的管理員確認，是否允許該應用程式可以指派角色權限， 若非預期建議請至Entra ID->應用程式註冊->所有應用程式->找到該應用程式選擇API permissions，將權限移除，再調查是否有其他活動。
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 2h
queryPeriod: 2h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - Impact
  - PrivilegeEscalation
relevantTechniques:
  - T1098.003
query: |
  AuditLogs
  | where Category =~ "ApplicationManagement"
      and LoggedByService =~ "Core Directory"
      and OperationName in~ ("Add delegated permission grant", "Add app role assignment to service principal")
  | mv-apply TargetResource = TargetResources on
      (
      where TargetResource.type =~ "ServicePrincipal"
          and array_length(TargetResource.modifiedProperties) > 0
          and isnotnull(TargetResource.displayName)
      | extend props = TargetResource.modifiedProperties
      )
  | mv-apply Property = props on
      (
      where Property.displayName in~ ("AppRole.Value", "DelegatedPermissionGrant.Scope")
      | extend
          DisplayName = tostring(Property.displayName),
          PermissionGrant = trim('"', tostring(Property.newValue))
      )
  | where PermissionGrant has "RoleManagement.ReadWrite.Directory"
  | mv-apply Property = props on
      (
      where Property.displayName =~ "ServicePrincipal.DisplayName"
      | extend TargetAppDisplayName = trim('"', tostring(Property.newValue))
      )
  | mv-apply Property = props on
      (
      where Property.displayName =~ "ServicePrincipal.ObjectID"
      | extend TargetAppServicePrincipalId = trim('"', tostring(Property.newValue))
      )
  | extend InitiatingAppName = tostring(InitiatedBy.app.displayName)
  | extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)
  | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
  | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)
  | extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))
  | extend TargetAppDisplayName = tostring(iff(isnotempty(TargetAppDisplayName), TargetAppDisplayName, TargetAppServicePrincipalId))
  | extend
      InitiatingAccountName = tostring(split(InitiatingUserPrincipalName, "@")[0]),
      InitiatingAccountUPNSuffix = tostring(split(InitiatingUserPrincipalName, "@")[1])
  | extend Initiator = InitiatingAccountName, Target = TargetAppDisplayName
  | extend
      Source_Network_IPLocation= geo_info_from_ip_address(InitiatingIpAddress)
  | project
          Alert_Category_zh = "Entra ID",
      Alert_SubCategory_zh = "異常身分權限修改",
      Alert_Name_zh = "授予應用程式可指派Microsoft Entra ID 角色的管理權限",
      Alert_Description_zh = strcat("於台灣時間", format_datetime(datetime_utc_to_local(TimeGenerated, "Asia/Taipei"), "yyyy-MM-dd HH:mm:ss"), ". ", "EntraID:", tostring(coalesce(AADTenantId, TenantId)), ". ", "偵測到來源使用者/服務主體", iff(isnotempty(InitiatingUserPrincipalName), InitiatingUserPrincipalName, InitiatingAppName), "授予應用程式:", TargetAppDisplayName, ".", "可指派Microsoft Entra ID 角色的管理權限:", ActivityDisplayName, ". 來源IP:", InitiatingIpAddress, ", 來源位置:", Source_Network_IPLocation),
      Alert_TriageStep_zh = strcat(
                            "1. 確認操作使用者/服務主體:",
                            iff(isnotempty(InitiatingUserPrincipalName), InitiatingUserPrincipalName, InitiatingAppName),
                            ", 來源 IP:",
                            InitiatingIpAddress,
                            "是否異常。 ",
                            "2. 檢視授權目標應用",
                            TargetAppDisplayName,
                            " 授權內容:",
                            ActivityDisplayName,
                            "是否為預期操作或維運項目。"
                        ),
      Alert_Containment_zh = strcat(
                             "1. 若判定為未授權或可疑權限升級, 立即移除目標應用程式:",
                             TargetAppDisplayName,
                             "的權限並停用 。",
                             "2. 針對操作發起者 ",
                             iff(isnotempty(InitiatingUserPrincipalName), InitiatingUserPrincipalName, InitiatingAppName),
                             " 進行風險處置(撤銷 Sessions/強制重新身分驗證, 必要時暫停其目錄管理權限)。"
                         ),
      Alert_Remediation_zh =
      "1. 強化應用與權限治理:對高風險 Graph/Directory 權限採最小權限與管理者核准流程, 並對 Service Principal 的憑證/權限變更納入定期稽核。 "
      "2. 強化偵測與自動化:建立自動化回應(SOAR)(通知/封鎖來源/要求使用者驗證)。",
              Alert_Time_TW = datetime_utc_to_local(TimeGenerated, "Asia/Taipei"),
      Alert_Time_UTC0 = TimeGenerated,
      Event_Action = ActivityDisplayName,
      Event_Status = Result,
      Event_Description = PermissionGrant,
      Source_Identity_FullName = iff(isnotempty(InitiatingUserPrincipalName), InitiatingUserPrincipalName, InitiatingAppName),
      Source_Identity_ID = iff(isnotempty(InitiatingAadUserId), InitiatingAadUserId, InitiatingAppServicePrincipalId),
      Source_Identity_Type = iff(isnotempty(InitiatingUserPrincipalName), "User", "Service"),
      Source_Network_IPAddress = InitiatingIpAddress,
      Source_Network_IPLocation = Source_Network_IPLocation,
      Target_Identity_FullName = TargetAppDisplayName,
      Target_Identity_ID = TargetAppServicePrincipalId,
      Target_Identity_Type = "Service",
      Target_Resource_ID = tostring(coalesce(AADTenantId, TenantId)),
      Target_Resource_Name = "Microsoft Entra ID",
      Target_Resource_Type = "Microsoft Entra ID"
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Source_Identity_FullName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Source_Network_IPAddress
  - entityType: CloudApplication
    fieldMappings:
      - identifier: Name
        columnName: Target_Identity_FullName
alertDetailsOverride:
  alertDynamicProperties: []
