{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Workspace": {
      "type": "string",
      "metadata": {
        "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
      }
    },
    "WorkspaceRegion": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]",
      "metadata": {
        "description": "The region of the selected workspace. The default value will use the Region selection above."
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
      "apiVersion": "2020-08-01",
      "name": "[concat(parameters('Workspace'), '/vimAuthenticationFortinetFortigate')]",
      "location": "[parameters('WorkspaceRegion')]",
      "properties": {
        "etag": "*",
        "displayName": "ASIM Authentication filtering parser for Fortinet - Fortigate",
        "category": "ASIM",
        "FunctionAlias": "vimAuthenticationFortinetFortigate",
        "query": "let EventSeverityLookup = datatable(EventOriginalSeverity: string, EventSeverity: string)\n[\n  \"information\", \"Informational\",\n  \"notice\", \"Informational\",\n  \"warning\", \"Low\",\n  \"error\", \"Low\",\n  \"alert\", \"Medium\",\n  \"critical\", \"High\",\n  \"emergency\", \"High\",\n  \"0\", \"Informational\",\n  \"1\", \"Informational\",\n  \"2\", \"Informational\",\n  \"3\", \"Informational\",\n  \"4\", \"Low\",\n  \"5\", \"Low\",\n  \"6\", \"Low\",\n  \"7\", \"Medium\",\n  \"8\", \"Medium\",\n  \"9\", \"High\",\n  \"10\", \"High\"\n];\nlet parser = (\n    starttime: datetime=datetime(null), \n    endtime: datetime=datetime(null), \n    username_has_any: dynamic = dynamic([]),\n    targetappname_has_any: dynamic = dynamic([]), // no targetappname\n    srcipaddr_has_any_prefix: dynamic = dynamic([]),\n    srchostname_has_any: dynamic = dynamic([]), // no srchostname\n    eventtype_in: dynamic = dynamic([]),\n    eventresultdetails_in: dynamic = dynamic([]),\n    eventresult: string = '*',\n    disabled: bool=false\n) {\n  let FortigateLogs = CommonSecurityLog\n  | where not(disabled)\n  | where \n    (isnull(starttime) or TimeGenerated >= starttime) \n    and (isnull(endtime) or TimeGenerated <= endtime) \n  | where DeviceVendor == \"Fortinet\"\n  | where DeviceProduct has \"Fortigate\"\n  | where DeviceEventClassID !in (\"0100022949\", \"0100022952\") // Omit \"Attempted to join FortiCloud\" and \"service activation failed\" logs\n  | where ((array_length(username_has_any) == 0) or DestinationUserName has_any(username_has_any))\n    and ((array_length(srcipaddr_has_any_prefix) == 0) or (has_any_ipv4_prefix(SourceIP, srcipaddr_has_any_prefix)))\n    and (array_length(srchostname_has_any) == 0)\n    and (array_length(targetappname_has_any) == 0);\n  let LogoutEvents = FortigateLogs\n  | where Activity == \"system event logout\"\n  | where ((array_length(eventtype_in) == 0) or \"Logoff\" in~ (eventtype_in))\n  | where (array_length(eventresultdetails_in) == 0)\n  | extend EventType = \"Logoff\";\n  let LoginEvents = FortigateLogs\n  | where Activity == \"system event login\"\n  | where ((array_length(eventtype_in) == 0) or \"Logon\" in~ (eventtype_in))\n  | extend EventType = \"Logon\"\n  | extend EventResultDetails = case(\n    Message has \"invalid password\", \"Incorrect password\",\n    Message has \"invalid\", \"No such user or password\",\n    Message has \"disabled\", \"User disabled\",\n    Message has \"no valid user certificate\", \"Incorrect key\",\n    Message has \"blocked IP\", \"Logon violates policy\",\n    Message has \"max login failures\", \"Logon violates policy\",\n    Message has \"declined disclaimer\", \"Logon violates policy\",\n    Message has \"password renewal\", \"Logon violates policy\",\n    Message has \"internal error\", \"Other\",\n    Message has \"connection timeout\", \"Other\",\n    \"\"\n  )\n  | where (array_length(eventresultdetails_in) == 0 or EventResultDetails in~ (eventresultdetails_in));\n  union\n  LogoutEvents,\n  LoginEvents\n  | extend \n    EventStartTime = TimeGenerated,\n    EventEndTime = TimeGenerated,\n    EventSchema = \"Authentication\",\n    EventSchemaVersion = \"0.1.4\",\n    EventCount = int(1),\n    Type = \"CommonSecurityLog\"\n  | project-rename\n    EventProductVersion = DeviceVersion,\n    EventProduct = DeviceProduct,\n    EventVendor = DeviceVendor,\n    TargetIpAddr = DestinationIP,\n    TargetHostname = Computer,\n    TargetFQDN = DeviceName,\n    EventOriginalType = Activity,\n    EventOriginalSubType = DeviceEventClassID,\n    TargetUsername = DestinationUserName,\n    TargetDvcId = DeviceExternalID,\n    SrcIpAddr = SourceIP,\n    ActingAppName = SourceProcessName,\n    EventMessage = Message\n  | extend\n    TargetUsernameType = \"Simple\",\n    TargetDvcIdType = \"Other\"\n  | parse-kv AdditionalExtensions as (deviceSeverity: string, status: string, [\"ad.status\"]: string) with (pair_delimiter=\";\", kv_delimiter=\"=\")\n  | extend EventResult = case(\n    [\"ad.status\"] == \"success\" or status == \"success\", \"Success\",\n    [\"ad.status\"] == \"failed\" or status == \"failed\", \"Failure\",\n    EventMessage has \"login failed\", \"Failure\",\n    EventMessage has \"Login disabled\", \"Failure\",\n    EventMessage has \"logged out\", \"Success\",\n    EventMessage has \"logged in successfully\", \"Success\",\n    \"NA\"\n  )\n  | where (eventresult == \"*\" or (EventResult == eventresult))\n  | extend\n    EventOriginalSeverity = coalesce(deviceSeverity, LogSeverity, \"\")\n  | lookup EventSeverityLookup on EventOriginalSeverity\n  | extend temp_isMatchTargetUsername = TargetUsername has_any(username_has_any)\n  | extend ASimMatchingUsername = case(\n      array_length(username_has_any) == 0,\n      \"-\",\n      temp_isMatchTargetUsername,\n      \"TargetUsername\",\n      \"No match\"\n  )\n  | extend\n    Dvc = TargetDvcId,\n    IpAddr = SrcIpAddr\n  | project\n    TimeGenerated,\n    Type,\n    EventResultDetails,\n    EventType,\n    EventStartTime,\n    EventEndTime,\n    EventSchema,\n    EventSchemaVersion,\n    EventCount,\n    EventProductVersion,\n    EventProduct,\n    EventVendor,\n    TargetIpAddr,\n    TargetHostname,\n    TargetFQDN,\n    EventOriginalType,\n    EventOriginalSeverity,\n    EventOriginalSubType,\n    TargetUsername,\n    TargetDvcId,\n    SrcIpAddr,\n    ActingAppName,\n    EventMessage,\n    TargetUsernameType,\n    TargetDvcIdType,\n    EventResult,\n    EventSeverity,\n    ASimMatchingUsername,\n    Dvc,\n    IpAddr\n};\nparser(\n  starttime=starttime,\n  endtime=endtime,\n  username_has_any=username_has_any,\n  targetappname_has_any=targetappname_has_any,\n  srcipaddr_has_any_prefix=srcipaddr_has_any_prefix,\n  srchostname_has_any=srchostname_has_any,\n  eventtype_in=eventtype_in,\n  eventresultdetails_in=eventresultdetails_in,\n  eventresult=eventresult,\n  disabled=disabled)",
        "version": 1,
        "functionParameters": "starttime:datetime=datetime(null),endtime:datetime=datetime(null),username_has_any:dynamic=dynamic([]),targetappname_has_any:dynamic=dynamic([]),srcipaddr_has_any_prefix:dynamic=dynamic([]),srchostname_has_any:dynamic=dynamic([]),eventtype_in:dynamic=dynamic([]),eventresultdetails_in:dynamic=dynamic([]),eventresult:string='*',disabled:bool=False"
      }
    }
  ]
}