id: 1f8054ee-eb3b-47f0-adbb-d4cfb8cc5960
name: Foreign access to mailbox using Graph
version: 1.0.0
kind: Scheduled
description: |-
  This rule detects when a mailbox is successfully accessed using Graph API by a user who is not the owner of this mailbox.

  Investigation
  ------------------
  1. Verify whether this isn't a shared mailbox
  2. Scrutinize the IP this happened from
  3. Scrutinize the user who did this. Could this be within their job function?
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - MicrosoftGraphActivityLogs
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
- Collection
relevantTechniques:
- T1114
query: |-
  MicrosoftGraphActivityLogs
  | where TimeGenerated > ago(1h)
  | where RequestUri contains "https://graph.microsoft.com/v1.0/users/" and RequestUri contains "/mailFolders/Inbox/messages"
  | join kind=inner (IdentityInfo
      | where TimeGenerated > ago(14d)
      | distinct AccountUPN, AccountObjectId)
      on $left.UserId == $right.AccountObjectId
  // Very hacky way to get the target mailbox's owner UPN
  | extend MailboxTargetUPN = split(RequestUri, @"/users/", 1)
  | extend MailboxTargetUPN = iif(MailboxTargetUPN contains_cs "MailFolders", split(tostring(MailboxTargetUPN[0]), @"/MailFolders/", 0)[0], MailboxTargetUPN)
  | extend MailboxTargetUPN = iif(MailboxTargetUPN contains_cs "mailFolders", split(tostring(MailboxTargetUPN[0]), @"/mailFolders/", 0)[0], MailboxTargetUPN)
  | where MailboxTargetUPN != AccountUPN
  | where not(AccountUPN contains "t.hormiz@ebaclearing.eu" and MailboxTargetUPN in~ ("humanressources@Ebaclearing.eu", "ASU@ebaclearing.eu"))
  | where ResponseStatusCode == 200
  | extend AccountUPN = tostring(AccountUPN), AlertText = strcat("User ", AccountUPN, " read out the mailbox ", MailboxTargetUPN, " using Graph API. This may be part of reconnaissance by an actor who compromised the account trying to read out mailboxes that do not belong to them.")
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: Selected
    groupByEntities:
    - Account
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
alertDetailsOverride:
  alertDisplayNameFormat: Foreign access to mailbox using Graph
  alertDescriptionFormat: '{{{AlertText}}'
  alertDynamicProperties: []
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: AccountUPN
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPAddress
suppressionDuration: 5h

