id: 1b56831b-3713-4c9c-ac75-a7e330623076
name: Potentially malicious svg file delivered to Inbox
description: |
  This query can be used as a Custom Detection Rule (CDR) to trigger when a potantially malicious .SVG file has been delivered into an Inbox.
description-detailed: |
  This query can be used as a Custom Detection Rule (CDR) to trigger when a potantially malicious .SVG file containing JavaScript has been delivered into an Inbox. https://learn.microsoft.com/en-us/defender-xdr/custom-detection-rules
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
  - EmailAttachmentInfo
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailAttachmentInfo
  | where FileName contains ".svg" and FileType == "html" // SVG files which render as only an image will be FileType as Text, unless containing Javascript which displays FileType as Html
  | join EmailEvents on NetworkMessageId
  | where LatestDeliveryLocation == "Inbox/folder"
version: 1.0.0