id: 2c6e7f75-d83c-4344-afdc-83335fe550e6
name: MDO_URLClickedinEmail
description: |
  URLs clicked in Email
description-detailed: |
  URLs clicked in Email
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - UrlClickEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  UrlClickEvents
  | where ActionType == "ClickAllowed"
  //| where ActionType <> "ClickAllowed"
  | project AccountUpn, ActionType, Url
version: 1.0.0