id: a96c1571-1f7d-48dc-8287-7df5a5f0d987
name: MDO_SummaryOfSenders
description: |
  Count of all Senders and where they were delivered
description-detailed: |
  Count of all Senders and where they were delivered
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  //Distinct Count
  EmailEvents
  | summarize QuaratineEmails = count_distinct(DeliveryLocation == "Quarantine"),
    Emails = count_distinct(DeliveryLocation == "Inbox/folder"),
    JunkEmails = count_distinct(DeliveryLocation == "Junk folder")by SenderFromAddress

  //Count of all Senders and where they were delivered
  EmailEvents
  | summarize QuaratineEmails = count(DeliveryLocation == "Quarantine"),
    Emails = count(DeliveryLocation == "Inbox/folder"),
    JunkEmails = count(DeliveryLocation == "Junk folder")by SenderFromAddress
version: 1.0.0