id: d029c39e-47fa-4e34-809f-db5d7186b701
name: Admin and User Submission Trend
description: |
  Admin and User Submission Trend
description-detailed: |
  Admin and User Submission Trend in Defender for Office 365
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let totalAdminSubmission = CloudAppEvents
  | where ActionType == "AdminSubmission"
  | make-series Count= count() default = 0 on Timestamp step 1d
  | extend Details = "Admin submissions";
  let totalUserSubmission = CloudAppEvents
  | where ActionType == "UserSubmission"
  | make-series Count= count() default = 0 on Timestamp step 1d
  | extend Details = "User submissions";
  union totalAdminSubmission,totalUserSubmission
  | project Count, Details, Timestamp
  | render linechart
version: 1.0.0





