id: 8c9bc29b-f32a-49fe-8fe8-450479f4130f
name: Top submitters of user submissions
description: |
  This query helps reviewing top submitters of user submissions
description-detailed: |
  This query helps reviewing top submitters of user submissions in Defender for Office 365
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents
  | where Timestamp > ago(30d) 
  | extend Record= (parse_json(RawEventData)).RecordType 
  | extend SubmissionState = (parse_json(RawEventData)).SubmissionState  
  | extend UserKey = (parse_json(RawEventData)).UserKey 
  | where Record == 29 
  | where ActionType == "UserSubmission" 
  | summarize count() by tostring(UserKey) 
  | sort by count_
version: 1.0.0