id: 8cde246b-7ed1-429c-933a-f7d0363dbbc0
name: Total Submissions by Submission Type
description: |
  Total Submissions by Submission Type
description-detailed: |
  Total Submissions by Submission Type in Defender for Office 365
  Query is also included as part of the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - CloudAppEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  CloudAppEvents 
  | where ActionType == "UserSubmission" or ActionType == "AdminSubmission"
  | summarize count() by ActionType
  | render piechart
version: 1.0.0