id: 1c9a0c69-efc6-4fe6-ac53-baf6fe77b833
Function:
  Title: Parser for CitrixADCEventOld
  Version: '1.0.0'
  LastUpdated: '2023-08-23'
Category: Microsoft Sentinel Parser
FunctionName: CitrixADCEventOld
FunctionAlias: CitrixADCEventOld
FunctionQuery: |
    CommonSecurityLog
    | where DeviceVendor =~ "Citrix" 
    | where DeviceProduct =~ "NetScaler"
    | extend EventCount = int(1)
            ,EventType = coalesce(
                    Activity,
                    column_ifexists("DeviceEventCategory", ""),
                    extract(@'outcome=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),
                    ""
                    )
            ,HttpRequestMethod = coalesce(
                    RequestMethod,
                    extract(@'method=(.*?)(?:;|$)',1, AdditionalExtensions, typeof(string)),
                    ""
                    )
            ,OriginalLogSeverity = DeviceCustomString4
    | project-rename  EventVendor=DeviceVendor
                    , EventProduct=DeviceProduct
                    , EventProductVersion=DeviceVersion
                    , EventSeverity=LogSeverity
                    , Module=DeviceEventClassID
                    , DvcAction=DeviceAction
                    , UrlOriginal=RequestURL
                    , SrcIpAddr=SourceIP
                    , SrcPortNumber=SourcePort
                    , EventOriginalType=DeviceCustomNumber1
                    , HttpTransactionId=DeviceCustomNumber2
                    , ProfileName=DeviceCustomString1
                    , PPEId=DeviceCustomString2
                    , SessionId=DeviceCustomString3
                    , EventYear=DeviceCustomString5
    | project-away Activity
                ,  AdditionalExtensions
                ,  ApplicationProtocol
                ,  DestinationDnsDomain
                ,  DestinationServiceName
                ,  DestinationTranslatedAddress
                ,  DestinationTranslatedPort
                ,  CommunicationDirection
                ,  DeviceDnsDomain
                ,  DeviceExternalID
                ,  DeviceFacility
                ,  DeviceInboundInterface
                ,  DeviceNtDomain
                ,  DeviceOutboundInterface
                ,  DevicePayloadId
                ,  ProcessName
                ,  DeviceTranslatedAddress
                ,  DestinationHostName
                ,  DestinationMACAddress
                ,  DestinationNTDomain
                ,  DestinationProcessId
                ,  DestinationUserPrivileges
                ,  DestinationProcessName
                ,  DestinationPort
                ,  DestinationIP
                ,  DeviceTimeZone
                ,  DestinationUserID
                ,  DestinationUserName
                ,  DeviceAddress
                ,  DeviceName
                ,  DeviceMacAddress
                ,  ProcessID
                ,  EndTime
                ,  ExternalID
                ,  FileCreateTime
                ,  FileHash
                ,  FileID
                ,  FileModificationTime
                ,  FilePath
                ,  FilePermission
                ,  FileType
                ,  FileName
                ,  FileSize
                ,  SimplifiedDeviceAction
                ,  ReceivedBytes
                ,  Message
                ,  OldFileCreateTime
                ,  OldFileHash
                ,  OldFileID
                ,  OldFileModificationTime
                ,  OldFileName
                ,  OldFilePath
                ,  OldFilePermission
                ,  OldFileSize
                ,  OldFileType
                ,  SentBytes
                ,  Protocol
                ,  RequestClientApplication
                ,  RequestContext
                ,  RequestCookies
                ,  RequestMethod
                ,  ReceiptTime
                ,  SourceHostName
                ,  SourceMACAddress
                ,  SourceNTDomain
                ,  SourceDnsDomain
                ,  SourceServiceName
                ,  SourceTranslatedAddress
                ,  SourceTranslatedPort
                ,  SourceProcessId
                ,  SourceUserPrivileges
                ,  SourceProcessName
                ,  StartTime
                ,  SourceUserID
                ,  SourceUserName
                ,  DeviceCustomIPv6Address1
                ,  DeviceCustomIPv6Address1Label
                ,  DeviceCustomIPv6Address2
                ,  DeviceCustomIPv6Address2Label
                ,  DeviceCustomIPv6Address3
                ,  DeviceCustomIPv6Address3Label
                ,  DeviceCustomIPv6Address4
                ,  DeviceCustomIPv6Address4Label
                ,  DeviceCustomFloatingPoint1
                ,  DeviceCustomFloatingPoint1Label
                ,  DeviceCustomFloatingPoint2
                ,  DeviceCustomFloatingPoint2Label
                ,  DeviceCustomFloatingPoint3
                ,  DeviceCustomFloatingPoint3Label
                ,  DeviceCustomFloatingPoint4
                ,  DeviceCustomFloatingPoint4Label
                ,  DeviceCustomNumber1Label
                ,  DeviceCustomNumber2Label
                ,  DeviceCustomNumber3
                ,  DeviceCustomNumber3Label
                ,  DeviceCustomString1Label
                ,  DeviceCustomString2Label
                ,  DeviceCustomString3Label
                ,  DeviceCustomString4
                ,  DeviceCustomString4Label
                ,  DeviceCustomString5Label
                ,  DeviceCustomString6
                ,  DeviceCustomString6Label
                ,  DeviceCustomDate1
                ,  DeviceCustomDate1Label
                ,  DeviceCustomDate2
                ,  DeviceCustomDate2Label
                ,  FlexDate1
                ,  FlexDate1Label
                ,  FlexNumber1
                ,  FlexNumber1Label
                ,  FlexNumber2
                ,  FlexNumber2Label
                ,  FlexString1
                ,  FlexString1Label
                ,  FlexString2
                ,  FlexString2Label
                ,  RemoteIP
                ,  RemotePort
                ,  MaliciousIP
                ,  ThreatSeverity
                ,  IndicatorThreatType
                ,  ThreatDescription
                ,  ThreatConfidence
                ,  ReportReferenceLink
                ,  MaliciousIPLongitude
                ,  MaliciousIPLatitude
                ,  MaliciousIPCountry