Parser:
  Title: Empty Dns Events Table
  Version: '0.0'
  LastUpdated: May 11, 2021
Product:
  Name: Microsoft
Normalization:
  Schema: DnsEvents
  Version: '1.0.1'
References:
- Title: Using functions
  Link: https://docs.microsoft.com
- Title: Tech Community
  Link: https://techcommunity.microsoft.com
Description: |
  The purpose of this function is to generate and guarentee the schema columns
ParserName: vimDnsEmpty
ParserQuery: |
  let EmptyNewDnsEvents=datatable(
    TimeGenerated:datetime
  , _ResourceId:string
  , Type:string
  // *************************************************************  Event and Dvc Fields
  //  ----------------- Mandatory: 
  , EventCount:int
  , EventStartTime:datetime
  , EventType:string
  , EventResult:string
  , EventResultDetails:string 
  , EventProduct:string
  , EventVendor:string
  , EventSchemaVersion:string
  , Dvc:string
  // ----------------- Optional 
  , EventMessage:string
  , EventSeverity:string
  , EventOriginalUid:string
  , EventReportUrl:string
  , TenantId:string
  , DvcHostname:string
  , EventProductVersion:string
  , DvcIpAddr:string
  , DvcAction:string
  , SrcIpAddr:string
  , SrcPortNumber:int
  , DstIpAddr:string
  , DstPortNumber:int
  , EventSubType:string
  , DnsQuery:string
  , DnsQueryType:int
  , DnsQueryTypeName:string
  , DnsQueryClass:int
  , DnsQueryClassName:string
  , DnsResponseCode:int
  , DnsResponseName:string
  , DnsResponseCodeName:string 
  , DnsFlags:string 
  , NetworkProtocol:string
  // * User is still old style
  , SrcUserAadId:string
  , SrcUserDomain:string
  , SrcUserName:string
  , SrcUserSid:string
  , SrcUserUpn:string
  , UrlCategory:string 
  , ThreatCategory:string

  // ****************************************************** Aliases
  , EventEndTime:datetime 
  , DomainCategory:string   
  , IpAddr:string
  , Domain:string
  , TransactionIdHex:string
  , DvcId:string
  , EventOriginalType:string
  , AdditionalFields:dynamic
  , Query:string
  , QueryType:int
  , QueryTypeName:string
  , QueryClass:int
  , QueryClassName:string
  , ResponseCode:int
  , ResponseName:string
  , ResponseCodeName:string 
  , Flags:string 
  )[];
  EmptyNewDnsEvents 
