id: b32f2a8b-50d9-48e0-b1e1-0556d50e26b5
name: APT Baby Shark (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_babyshark.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where ProcessCommandLine =~ @"reg query ""HKEY_CURRENT_USER\Software\Microsoft\Terminal Server Client\Default""" 
       or ProcessCommandLine startswith "powershell.exe mshta.exe http"
       or ProcessCommandLine =~ "cmd.exe /c taskkill /im cmd.exe"
  | top 100 by Timestamp desc
