id: 81142fc7-fcb1-41b2-8976-5237849b0bc6
name: apt sofacy zebrocy (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_sofacy_zebrocy.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents
  | where Timestamp > ago(7d)
  | where ProcessCommandLine endswith "cmd.exe /c SYSTEMINFO & TASKLIST"
  | top 100 by Timestamp desc
