id: 0c4345bf-d21f-40da-b83d-c3e6fea01d8f
name: apt unidentified nov 18 (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_unidentified_nov_18.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where ProcessCommandLine endswith "cyzfc.dat, PointFunctionCall" 
  | top 100 by Timestamp desc
