id: 0594fe6d-ce59-4d2c-bd34-8212a75deaec
name: apt unidentified nov 18 (1)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_unidentified_nov_18.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceFileEvents
query: "DeviceFileEvents  \r\n| where Timestamp  > ago(7d)\r\n| where FolderPath has \"ds7002.lnk\"\r\n| top 100 by Timestamp desc "
