id: fb0ca747-549c-4c6a-9b8c-e77f0b52d1de
name: apt ta17 293a ps (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_ta17_293a_ps.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: "DeviceProcessEvents \r\n| where Timestamp > ago(7d)\r\n| where ProcessCommandLine =~ \"ps.exe -accepteula\"\r\n| top 100 by Timestamp desc "
