id: 23a7fa02-0644-43b8-a1b1-c14b49ed728a
name: APT29 thinktanks (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_apt29_thinktanks.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: "DeviceProcessEvents \r\n| where Timestamp > ago(7d)\r\n| where ProcessCommandLine has \"-noni -ep bypass $\"\r\n| top 100 by Timestamp desc "
