id: 7d02a6d4-2b85-4931-8a1c-cb02464fbd03
name: Cloud Hopper (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_cloudhopper.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where FileName =~ @"cscript.exe" and ProcessCommandLine has ".vbs /shell "
  | top 100 by Timestamp desc
