id: cf390f01-d9de-4a29-ad3d-4cce9b698524
name: cypherpunk-exclusive-commands
description: |-
  This query was originally published in the threat analytics report, Cypherpunk ransomware leaves wake of tampered AVs.
  Cypherpunk is a human-operated ransomware campaign named after the unusual .cypherpunk extension given to encrypted files.
  The query below surfaces commands that follow the distinctive pattern Cypherpunk operators would use to remotely execute code.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
tactics:
- Execution
- Ransomware
query: |-
  // Searches for possible Cypherpunk ransomware activity
  DeviceProcessEvents
  | where InitiatingProcessParentFileName startswith "psexe"
  | where ProcessCommandLine has "Dvr /go"
