id: d320d492-d977-4087-9fee-f5cf3b66c7b8
name: Dragon Fly (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_dragonfly.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where FileName =~ "crackmapexec.exe"
  | top 100 by Timestamp desc
