id: 4f63f7da-3576-45b8-ae6f-07dc6140d901
name: Equation Group C2 Communication (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_equationgroup_c2.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where (FolderPath endswith @"\rundll32.exe" and ProcessCommandLine endswith ",dll_u") 
          or ProcessCommandLine has " -export dll_u "
  | top 100 by Timestamp desc
