id: bc5b6d9f-6763-41b3-8ca1-1f9267d73c61
name: Hurricane Panda activity (0)
description: |-
  Original Sigma Rule: https://github.com/Neo23x0/sigma/blob/master/rules/apt/apt_hurricane_panda.yml.
  Questions via Twitter: @janvonkirchheim.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)
  | where ProcessCommandLine endswith " localgroup administrators admin /add"
       or ProcessCommandLine has @"\Win64.exe"
  | top 100 by Timestamp desc
