id: 815a9abd-2602-4872-aece-5e3e15c8961a
name: MacOceanLotusDropper (0)
description: |-
  Backdoor processes associated with OceanLotus Mac malware backdoor dropper.
  References:.
  Https://blog.trendmicro.com/trendlabs-security-intelligence/new-macos-backdoor-linked-to-oceanlotus-found/.
  OS Platforms: Macintosh.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |+
  DeviceProcessEvents
  | where Timestamp > ago(14d)
  | where ProcessCommandLine contains "theme0" 
  | project Timestamp, DeviceId , DeviceName, AccountName , AccountSid , InitiatingProcessCommandLine , ProcessCommandLine  
  | top 100 by Timestamp 
