id: 91f17a87-181f-40fc-83f2-a4c06620c29c
name: MacOceanLotusBackdoor (0)
description: |-
  Backdoor processes associated with OceanLotus Mac Malware Backdoor.
  References:.
  Https://blog.trendmicro.com/trendlabs-security-intelligence/new-macos-backdoor-linked-to-oceanlotus-found/.
  OS platforms: Macintosh.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |+
  DeviceProcessEvents
  | where Timestamp > ago(14d)
  | where FileName in~ ("screenassistantd","spellagentd")
  | top 100 by Timestamp 
