id: 24d80911-c366-4954-9008-8d9f39fee15c
name: Ransomware hits healthcare - Alternate Data Streams use (0)
description: |-
  Find use of Alternate Data Streams (ADS) for anti-forensic purposes.
  Alternate Data Streams execution.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d) 
  // Command lines used 
  | where ProcessCommandLine startswith "-q -s" and ProcessCommandLine has "-p" 
  // Removing IDE processes 
  and not(FolderPath has_any("visual studio", "ide")) 
  | summarize make_set(ProcessCommandLine), make_set(FolderPath), 
  make_set(InitiatingProcessCommandLine) by DeviceId, bin(Timestamp, 1h)
