id: da6c052d-0363-4a2a-8f61-dc0744ba4c19
name: Ransomware hits healthcare - Turning off System Restore (0)
description: |-
  Find attempts to stop System Restore and.
  Prevent the system from creating restore points.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents  
  | where Timestamp > ago(7d)  
  // Pivoting for rundll32  
  and InitiatingProcessFileName =~ 'rundll32.exe'   
  // Looking for empty command line   
  and isnotempty(InitiatingProcessCommandLine)  
  // Looking for schtasks.exe as the created process  
  and FileName in~ ('schtasks.exe')  
  // Disabling system restore   
  and ProcessCommandLine has 'Change' and ProcessCommandLine has 'SystemRestore' 
  and ProcessCommandLine has 'disable'
