id: af347fd6-a6e6-407f-b8b8-604983229859
name: Ransomware hits healthcare - Robbinhood activity (0)
description: |-
  Find distinct evasion and execution activities.
  Associated with the Robbinhood ransomware campaign.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d) 
  | where InitiatingProcessFileName =~ "winlogon.exe"  
  | where FileName == "cmd.exe" and ProcessCommandLine has_any("taskkill", "net", 
  "robbin", "vssadmin", "bcdedit", "wevtutil")
