id: 9c26c028-241f-44bd-a50f-94627a7e1cc5
name: Ransomware hits healthcare - Vulnerable Gigabyte drivers (0)
description: |-
  Locate vulnerable Gigabyte drivers used by RobbinHood ransomware to turn off security tools.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceFileEvents
query: |-
  ​DeviceFileEvents 
  | where Timestamp > ago(7d) 
  | where SHA1 in('0b15b5cc64caf0c6ad9bd759eb35383b1f718edf3d7ab4cd912d0d8c1826edf8', 
  '31f4cfb4c71da44120752721103a16512444c13c2ac2d857a7e6f13cb679b427')
