id: 61ca48de-5973-4f9d-8f9c-e24776b6ba45
name: Ransomware hits healthcare - Robbinhood activity
description: |
  Find distinct evasion and execution activities.
  Associated with the Robbinhood ransomware campaign.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
query: |
  DeviceProcessEvents 
  | where Timestamp > ago(7d) 
  | where InitiatingProcessFileName =~ "winlogon.exe"  
  | where FileName == "cmd.exe" and ProcessCommandLine has_any("taskkill", "net", 
  "robbin", "vssadmin", "bcdedit", "wevtutil")
