id: 24216c89-0e83-4b53-8eb7-3349e52c3703
name: Ransomware hits healthcare - Clearing of system logs
description: |
  // Look for attempts to use fsutil.exe to delete file system logs that can be used as forensic artifacts.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
query: |
  DeviceProcessEvents
  | where Timestamp > ago(7d)
  | where FileName =~ "fsutil.exe"
  and ProcessCommandLine has "usn" and ProcessCommandLine has "deletejournal"
