id: 7c67dddf-0897-404d-9e5c-daceae6e8146
name: Ransomware hits healthcare - Backup deletion (0)
description: |-
  List alerts flagging attempts to delete backup files.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - AlertInfo
  - AlertEvidence
query: |+
  ​ AlertInfo 
  | where Timestamp > ago(7d) 
  | where Title == "File backups were deleted" 
  | join AlertEvidence on AlertId 
