id: 08ddcb66-e883-435f-bc3b-9d0f300de53f
name: Ransomware hits healthcare - Cipher.exe tool deleting data (0)
description: |-
  ​// Look for cipher.exe deleting data from multiple drives.
  This is often performed as an anti-forensic measure prior to encryption.
requiredDataConnectors:
- connectorId: Microsoft365Defender
  dataTypes:
  - DeviceProcessEvents
query: |-
  DeviceProcessEvents 
  | where Timestamp > ago(7d)  
  | where FileName =~ "cipher.exe"  
  // Looking for /w flag for deleting  
  | where ProcessCommandLine has "/w"  
  | summarize CommandCount = dcount(ProcessCommandLine), 
  make_set(ProcessCommandLine) by DeviceId, bin(Timestamp, 1m)  
  // Looking for multiple drives in a short timeframe  
  | where CommandCount > 1
