id: 2b373bca-b491-4b2f-906e-6f42eeab01a1
name: spam-detection-trend
description: |
  This query visualises total emails with Spam detections over time summarizing the data daily
description-detailed: |
  This query visualises total emails with Spam detections over time summarizing the data daily in Microsoft Defender for Office 365. Visualize with chart type "Line".
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  //This query visualises total emails with Spam detections over time summarizing the data daily.
  EmailEvents
  | where ThreatTypes has "Spam"
  | make-series Count = count() default = 0 on Timestamp step 1d
version: 1.0.0