{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
      "workspaceName": {
          "type": "string"
      },
      "location": {
        "type": "string"
      }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimProcessCreateMicrosftSecurityEvents",
            "dependsOn": [
              "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
            ],
            "properties": {
              "etag": "*",
              "displayName": "Azure Information Model Process - windows logs, event 4688",
              "category": "Security",
              "FunctionAlias": "vimProcessEventsMicrosftWindowsEvent4688",
              "query":  "let MandatoryLabelLookup = datatable (MandatoryLabel:string,MandatoryLabelRid:string, MandatoryLabelText:string, MandatoryLabelMeaning:string) [ 'S-1-16-0', '0x00000000', 'SECURITY_MANDATORY_UNTRUSTED_RID', 'Untrusted', 'S-1-16-4096', '0x00001000', 'SECURITY_MANDATORY_LOW_RID', 'Low integrity', 'S-1-16-8192', '0x00002000', 'SECURITY_MANDATORY_MEDIUM_RID', 'Medium integrity', 'S-1-16-8448', '0x00002100', 'SECURITY_MANDATORY_MEDIUM_PLUS_RID', 'Medium high integrity', 'S-1-16-12288', '0X00003000', 'SECURITY_MANDATORY_HIGH_RID', 'High integrity', 'S-1-16-16384', '0x00004000', 'SECURITY_MANDATORY_SYSTEM_RID', 'System integrity', 'S-1-16-20480', '0x00005000', 'SECURITY_MANDATORY_PROTECTED_PROCESS_RID', 'Protected process' ]; let ProcessEvents=(){ SecurityEvent | where EventID == 4688 | extend EventCount = int(1), EventVendor = 'Microsoft', EventProduct = 'Security Events', EventSchemaVersion = '0.1.0', EventStartTime = todatetime(TimeGenerated), EventEndTime = todatetime(TimeGenerated), EventType = 'ProcessCreated', EventOritingalType = EventID, EventOriginalUid = EventOriginId, DvcId = SourceComputerId, DvcHostname = Computer, DvcOs = 'Windows', ActorUserId = SubjectUserSid, ActorUserIdType = 'SID', ActorUsername = iff (SubjectDomainName == '-', SubjectUserName, SubjectAccount), ActorUsernameType = iff(SubjectDomainName == '-','Simple', 'Windows'), ActorUserSessionId = SubjectLogonId, ActorType = AccountType, ActorDomainName = SubjectDomainName, TargetUserId =TargetUserSid, TargetUserIdType = 'SID', TargetUsername = iff (TargetDomainName == '-', TargetUserName, TargetAccount), TargetUsernameType = iff (TargetDomainName == '-', 'Simple', 'Windows'), TargetUserSessionId = TargetLogonId, ActingProcessId = ProcessId, ActingProcessName = ParentProcessName, TargetProcessId = NewProcessId, TargetProcessName = NewProcessName, TargetProcessCommandLine = CommandLine, TargetProcessTokenElevation = TokenElevationType | lookup MandatoryLabelLookup on MandatoryLabel | extend User = TargetUsername, Dvc = DvcHostname, Process = TargetProcessName | project-away ParentProcessName, ProcessId, SubjectUserSid, SubjectDomainName, SubjectUserName, SubjectAccount, TargetUserSid, TargetDomainName, TargetUserName, TargetAccount }; ProcessEvents",
              "version": 1
          }
        }
      ]
    }
  ]
}