{
    "$schema": "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "PlaybookName": {
            "defaultValue": "Comment-MCASAlertURL",
            "type": "string"
        },
        "UserName": {
            "defaultValue": "<username>@<domain>",
            "type": "string"
        }
    },
    "variables": {
        "AzureSentinelConnectionName": "[concat('azuresentinel-', parameters('PlaybookName'))]",
        "MCASConnectionName": "[concat('mcas-', parameters('PlaybookName'))]",
        "AzureMonitorLogsConnectionName": "[concat('azuremonitorlogs-', parameters('PlaybookName'))]"
    },
    "resources": [
        {
            "type": "Microsoft.Web/connections",
            "apiVersion": "2016-06-01",
            "name": "[variables('AzureSentinelConnectionName')]",
            "location": "[resourceGroup().location]",
            "properties": {
                "displayName": "[parameters('UserName')]",
                "customParameterValues": {},
                "api": {
                    "id": "[concat('/subscriptions/', subscription().subscriptionId, '/providers/Microsoft.Web/locations/', resourceGroup().location, '/managedApis/azuresentinel')]"
                }
            }
        },
        {
            "type": "Microsoft.Web/connections",
            "apiVersion": "2016-06-01",
            "name": "[variables('AzureMonitorLogsConnectionName')]",
            "location": "[resourceGroup().location]",
            "properties": {
                "displayName": "[parameters('UserName')]",
                "customParameterValues": {},
                "api": {
                    "id": "[concat('/subscriptions/', subscription().subscriptionId, '/providers/Microsoft.Web/locations/', resourceGroup().location, '/managedApis/azuremonitorlogs')]"
                }
            }
        },
        {
            "type": "Microsoft.Logic/workflows",
            "apiVersion": "2019-05-01",
            "name": "[parameters('PlaybookName')]",
            "location": "[resourceGroup().location]",
            "tags": {
                "LogicAppsCategory": "security"
            },
            "identity": {
                "type": "SystemAssigned"
            },
            "properties": {
                "state": "Enabled",
                "definition": {
                        "$schema": "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#",
                        "actions": {
                            "For_each": {
                                "actions": {
                                    "For_each_3": {
                                        "actions": {
                                            "Check_MCAS_Alert_URL_path": {
                                                "actions": {
                                                    "Add_MCAS_Alert_URL_to_the_Sentinel_Incident_Comments": {
                                                        "inputs": {
                                                            "body": {
                                                                "Value": "MCAS Alert URL: @{variables('MCASAlertURL')}"
                                                            },
                                                            "host": {
                                                                "connection": {
                                                                    "name": "@parameters('$connections')['azuresentinel']['connectionId']"
                                                                }
                                                            },
                                                            "method": "put",
                                                            "path": "/Comment/@{encodeURIComponent(variables('SubscriptionId'))}/@{encodeURIComponent(variables('WorkspaceId'))}/@{encodeURIComponent(variables('RG'))}/@{encodeURIComponent('Alert')}/@{encodeURIComponent(items('For_each')?['SystemAlertId'])}"
                                                        },
                                                        "runAfter": {
                                                            "Set_the_MCAS_Alert_URL": [
                                                                "Succeeded"
                                                            ]
                                                        },
                                                        "type": "ApiConnection"
                                                    },
                                                    "Set_the_MCAS_Alert_URL": {
                                                        "inputs": {
                                                            "name": "MCASAlertURL",
                                                            "value": "@items('For_each_3')?['Href']"
                                                        },
                                                        "runAfter": {},
                                                        "type": "SetVariable"
                                                    }
                                                },
                                                "description": "Does the MCAS URL navigate the MCAS Alert Page",
                                                "expression": {
                                                    "and": [
                                                        {
                                                            "contains": [
                                                                "@items('For_each_3')?['Href']",
                                                                "alerts"
                                                            ]
                                                        }
                                                    ]
                                                },
                                                "runAfter": {},
                                                "type": "If"
                                            }
                                        },
                                        "description": "For Each URL found in the MCAS Alert in the Extended Links column, check if the URL is for the MCAS Alert page",
                                        "foreach": "@body('Parse_JSON')",
                                        "runAfter": {
                                            "Parse_JSON": [
                                                "Succeeded"
                                            ]
                                        },
                                        "type": "Foreach"
                                    },
                                    "Parse_JSON": {
                                        "description": "Reformat the Extended Links column of the MCAS Security Alerts to distinguish the MCAS URLs",
                                        "inputs": {
                                            "content": "@items('For_each')?['ExtendedLinks']",
                                            "schema": {
                                                "items": {
                                                    "properties": {
                                                        "Category": {},
                                                        "Href": {
                                                            "type": "string"
                                                        },
                                                        "Label": {
                                                            "type": "string"
                                                        },
                                                        "Type": {
                                                            "type": "string"
                                                        }
                                                    },
                                                    "required": [
                                                        "Href",
                                                        "Category",
                                                        "Label",
                                                        "Type"
                                                    ],
                                                    "type": "object"
                                                },
                                                "type": "array"
                                            }
                                        },
                                        "runAfter": {},
                                        "type": "ParseJson"
                                    }
                                },
                                "description": "Run through all the MCAS Alerts in Sentinel and review for the MCAS alert URL",
                                "foreach": "@body('Run_query_and_list_results')?['value']",
                                "runAfter": {
                                    "Run_query_and_list_results": [
                                        "Succeeded"
                                    ]
                                },
                                "type": "Foreach"
                            },
                            "Initialize_MCAS_Alert_URL_": {
                                "inputs": {
                                    "variables": [
                                        {
                                            "name": "MCASAlertURL",
                                            "type": "string"
                                        }
                                    ]
                                },
                                "runAfter": {
                                    "Insert_Resource_Group": [
                                        "Succeeded"
                                    ]
                                },
                                "type": "InitializeVariable"
                            },
                            "Insert_AlertId": {
                                "inputs": {
                                    "variables": [
                                        {
                                            "name": "AlertId",
                                            "type": "string"
                                        }
                                    ]
                                },
                                "runAfter": {
                                    "Insert_WorkspaceId": [
                                        "Succeeded"
                                    ]
                                },
                                "type": "InitializeVariable"
                            },
                            "Insert_Resource_Group": {
                                "inputs": {
                                    "variables": [
                                        {
                                            "name": "RG",
                                            "type": "string"
                                        }
                                    ]
                                },
                                "runAfter": {
                                    "Insert_AlertId": [
                                        "Succeeded"
                                    ]
                                },
                                "type": "InitializeVariable"
                            },
                            "Insert_SubscriptionId": {
                                "inputs": {
                                    "variables": [
                                        {
                                            "name": "SubscriptionId",
                                            "type": "string"
                                        }
                                    ]
                                },
                                "runAfter": {},
                                "type": "InitializeVariable"
                            },
                            "Insert_WorkspaceId": {
                                "inputs": {
                                    "variables": [
                                        {
                                            "name": "WorkspaceId",
                                            "type": "string"
                                        }
                                    ]
                                },
                                "runAfter": {
                                    "Insert_SubscriptionId": [
                                        "Succeeded"
                                    ]
                                },
                                "type": "InitializeVariable"
                            },
                            "Run_query_and_list_results": {
                                "description": "Get all Security Alerts from Sentinel that came from an MCAS alert",
                                "inputs": {
                                    "body": "SecurityAlert | where ProviderName == 'MCAS'",
                                    "host": {
                                        "connection": {
                                            "name": "@parameters('$connections')['azuremonitorlogs']['connectionId']"
                                        }
                                    },
                                    "method": "post",
                                    "path": "/queryData",
                                    "queries": {
                                        "resourcegroups": "",
                                        "resourcename": "",
                                        "resourcetype": "Log Analytics Workspace",
                                        "subscriptions": "",
                                        "timerange": ""
                                    }
                                },
                                "runAfter": {
                                    "Initialize_MCAS_Alert_URL_": [
                                        "Succeeded"
                                    ]
                                },
                                "type": "ApiConnection"
                            }
                        },
                        "contentVersion": "1.0.0.0",
                        "outputs": {},
                        "parameters": {
                            "$connections": {
                                "defaultValue": {},
                                "type": "Object"
                            }
                        },
                        "triggers": {
                            "Recurrence": {
                                "recurrence": {
                                    "frequency": "Hour",
                                    "interval": 8
                                },
                                "type": "Recurrence"
                            }
                        }
                    },
                    "parameters": {
                        "$connections": {
                            "value": {
                                "azuresentinel": {
                                    "connectionId": "[resourceId('Microsoft.Web/connections', variables('AzureSentinelConnectionName'))]",
                                    "connectionName": "[variables('AzureSentinelConnectionName')]",
                                    "id": "[concat('/subscriptions/', subscription().subscriptionId, '/providers/Microsoft.Web/locations/', resourceGroup().location, '/managedApis/azuresentinel')]"
                                },
                                "azuremonitorlogs": {
                                    "connectionId": "[resourceId('Microsoft.Web/connections', variables('AzureMonitorLogsConnectionName'))]",
                                    "connectionName": "[variables('AzureMonitorLogsConnectionName')]",
                                    "id": "[concat('/subscriptions/', subscription().subscriptionId, '/providers/Microsoft.Web/locations/', resourceGroup().location, '/managedApis/azuremonitorlogs')]"
                                }
                                }
                            }
                        }
            }   
        }
    ]
}
