id: d096643d-6789-4c74-8893-dd3fc8a94069
name: Vulerabilities
description: |
  This query searches for all the vulerabilities that RidgeBot identified
severity: High
status: Available
requiredDataConnectors: 
  - connectorId: RidgeBotDataConnector
    dataTypes:
      - CommonSecurityLog
queryFrequency: 12h
queryPeriod: 12h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
  - InitialAccess
  - PrivilegeEscalation
relevantTechniques:
  - T1189
  - T1059
  - T1053
  - T1548
query: |
  CommonSecurityLog
  | where DeviceVendor == "RidgeSecurity"
  | where DeviceEventClassID startswith "40"
  | order by LogSeverity
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: DeviceVendor
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Computer
version: 1.0.0
kind: Scheduled