id: 1eebfaf3-40e1-4bc2-9f42-049b7b8ceb60
name: Critical Risks
description: |
  This query searches for all the exploited risks that RidgeBot identified
severity: High
status: Available
requiredDataConnectors: 
  - connectorId: RidgeBotDataConnector
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
  - InitialAccess
  - PrivilegeEscalation
relevantTechniques:
  - T1189
  - T1059
  - T1053
  - T1548
query: |
  CommonSecurityLog
  | where DeviceVendor == "RidgeSecurity"
  | where DeviceEventClassID == "4001"
  | order by TimeGenerated desc 
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: DeviceVendor
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: Computer
version: 1.0.0
kind: Scheduled