{
  "$schema": "https://schema.management.azure.com/schemas/2019-08-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
      "workspaceName": {
          "type": "string"
      },
      "location": {
        "type": "string"
      }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2017-03-15-preview",
      "name": "[parameters('workspaceName')]",
      "location": "[parameters('location')]",
      "resources": [
        {
          "type": "savedSearches",
          "apiVersion": "2020-08-01",
          "name": "vimProcessEventsMicrosftWindowsEvent4688",
            "dependsOn": [
              "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'))]"
            ],
            "properties": {
              "etag": "*",
              "displayName": "Azure Information Model Process - windows logs, event 4688",
              "category": "Security",
              "FunctionAlias": "vimProcessEventsMicrosftWindowsEvent4688",
              "query": "let ProcessEvents=(){ SecurityEvent | where EventID == 4688 |project-rename //***** Mandatory Fields - name change ***** EventProduct = EventSourceName, DvcHostName = Computer, //***** Optional Fields - name change ****** EventOriginalUid = EventOriginId, ActorUserDomain = SubjectDomainName, ActorUserName = SubjectUserName, ActorUserId = SubjectUserSid, ActingProcessFileName = ParentProcessName, ActorAccount = SubjectAccount, DvcId = SourceComputerId, TargetUserDomain = TargetDomainName, TargetProcessFileName = Process, TargetProcessFilePath = NewProcessName, TargetProcessCommandLine = CommandLine, //TargetProcessGuid = ProcessGuid, TargetProcessTokenElevation = TokenElevationType | extend //***** Mandatory Fields - calculating value ****** EventCount = int(1), EventVendor = \"Microsoft\", EventSchemaVersion = \"0.0.1\", EventStartTime = todatetime(TimeGenerated), EventEndTime = todatetime(TimeGenerated), EventType = \"ProcessCreated\", DvcOs = \"Windows\", TargetUserIdType = \"SID\", ActorUserIdType = \"SID\", TargetProcessId = toint(NewProcessId), //***** Optional Fields - calculating value ****** ActingProcessId = toint(ProcessId), ActorUserSessionId = toint(SubjectLogonId), TargetUserSessionId = toint(TargetLogonId) //***** Aliases ****** | extend TargetUser = TargetUserName, TargetProcessName = TargetProcessFilePath, Dvc = DvcHostName }; ProcessEvents",
              "version": 1
          }
        }
      ]
    }
  ]
}