id: 64990414-b015-4edf-bef0-343b741e68c5
name: Multiple Teams deleted by a single user
description: |
  'This hunting query identifies where multiple Teams have been deleted by a single user in a short timeframe.'
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity (Teams)
tactics:
  - Impact
relevantTechniques:
  - T1485
  - T1489
query: |

  // Adjust this value to change how many Teams should be deleted before including
  let max_delete = 3;
  let deleting_users = (
  OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "TeamDeleted"
  | summarize count() by UserId
  | where count_ > max_delete
  | project UserId);
  OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "TeamDeleted"
  | where UserId in (deleting_users)
  | extend timestamp = TimeGenerated, AccountCustomEntity = UserId
version: 2.0.0
