id: 0a8f410d-38b5-4d75-90da-32b472b97230
name: Non-owner mailbox login activity
description: |
  'Finds non-owner mailbox access by admin/delegate permissions. Whitelist valid users and check others for unauthorized access.'
description-detailed: |
  'This will help you determine if mailbox access observed with Admin/Delegate Logontype. 
  The logon type indicates mailbox accessed from non-owner user. Exchange allows Admin 
  and delegate permissions to access other user's inbox.
  If your organization has valid admin, delegate access given to users, you can whitelist those and investigate other results.
  References: https://docs.microsoft.com/office/office-365-management-api/office-365-management-activity-api-schema#logontype'
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity (Exchange)
tactics:
  - Collection
  - Exfiltration
relevantTechniques:
  - T1114
  - T1020
tags:
  - Solorigate
  - NOBELIUM
query: |

  OfficeActivity
  | where Operation == "MailboxLogin" and Logon_Type != "Owner" 
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by Operation, OrganizationName, UserType, UserId, MailboxOwnerUPN, Logon_Type, ClientIP
  | extend timestamp = StartTime, AccountCustomEntity = UserId, IPCustomEntity = ClientIP
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
version: 2.0.0