[
  {
    "kind": "Scheduled",
    "properties": {
      "displayName": "Test Rule",
      "description": "",
      "severity": "High",
      "enabled": true,
      "tactics": [
        "Persistence",
        "LateralMovement"
      ],
      "query": "AzureActivity | where isnotempty(OperationNameValue)",
      "queryFrequency": "PT1H",
      "queryPeriod": "P2DT1H30M",
      "triggerOperator": "GreaterThan",
      "triggerThreshold": 0,
      "suppressionDuration": "PT1H",
      "suppressionEnabled": false
    },
    "playbook": "/subscriptions/{0}/resourceGroups/{1}/providers/Microsoft.Logic/workflows/<enter_your_playbook_name>"
  }
]