id: c10b22a0-6021-46f9-bdaf-05bf2350a554
name: Post Delivery Events over time
description: |
  This query visualises the daily amount of emails that had a post delivery action from zero-hour auto purge.
description-detailed: |
  This query visualises the daily amount of emails that had a post delivery action from zero-hour auto purge in Defender for Office 365
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailPostDeliveryEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  let TimeStart = startofday(ago(30d));
  let TimeEnd = startofday(now());
  EmailPostDeliveryEvents
  | where TimeGenerated >= TimeStart
  | where ActionType has "ZAP"
  | make-series ZappedEmails = count() default = 0 on Timestamp from TimeStart to TimeEnd step 1d
  | render timechart
version: 1.0.0
