// Name: Changes made to Cloudtrail logs
// Description: Attackers often try to hide their steps by deleting or stopping the collection of logs that could show their activity. The query looks for any changes to the manipulation of  Cloudtrail logs.  
//
// Id: 610d3850-c26f-4f20-8d86-f10fdf2425f5
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// DataSource: #AWSCloudTrail
//
// Techniques: #Persistence, #DefenseEvasion
//
AWSCloudTrail
| where EventName == "UpdateTrail" or EventName == "DeleteTrail" or EventName == "StopLogging”
| project TimeGenerated , EventName , EventTypeName  , UserIdentityAccountId ,  UserIdentityPrincipalid , UserAgent , UserIdentityUserName , SessionMfaAuthenticated , SourceIpAddress , AWSRegion , EventSource
