id: c7bfadd4-34a6-4fa5-82f8-3691a32261e8
name: AWS - Changes to Elastic Load Balancer security group events.
description: |
  'Monitoring Changes to Elastic Load Balancer specific security group events.
  More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255'
severity: Low
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
  - PrivilegeEscalation
query: |

  let timeframe = 1d;
  AWSCloudTrail
  | where TimeGenerated >= ago(timeframe)
  | where EventName == "ApplySecurityGroupsToLoadBalancer"
       or EventName == "SetSecurityGroups"
  | project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements