id: 8c2ef238-67a0-497d-b1dd-5c8a0f533e25
name: Changes to internet facing AWS RDS Database instances
description: |
  'Amazon Relational Database Service (RDS) is scalable relational database in the cloud. 
  If your organization have AWS RDS Database running, monitoring changes to especially internet facing AWS RDS (Relational Database Service) 
  Database instances is crucial. Once alerts triggered, validate if changes observed are authorized and adhere to change control policy. 
  More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255
  and RDS API Reference Docs: https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_Operations.html'
severity: Low
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1h
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1098
query: |

  let timeframe = 1h;
  let EventNameList = dynamic(["AuthorizeDBSecurityGroupIngress","CreateDBSecurityGroup","DeleteDBSecurityGroup","RevokeDBSecurityGroupIngress"]);
  AWSCloudTrail
  | where TimeGenerated > ago(timeframe)
  | where EventName in (EventNameList)
  | project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
  | extend timestamp = TimeGenerated, AccountCustomEntity = UserIdentityUserName, IPCustomEntity = SourceIpAddress