// Name: AWS - Changes to Security Group ingress and egress settings
// Description: Monitoring changes to AWS Security Group ingress and egress settings.
// More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255
//
// Id: 4f19d4e3-ec5f-4abc-9e61-819eb131758c
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// AlertTriggerOperator: Specific EventNames
//
// AlertTriggerThreshold: n/a
//
// DataSource: #AWSCloudTrail
//
// Techniques: #LateralMovement, #PrivilegeEscalation
//
let timeframe = 1d;
AWSCloudTrail
| where TimeGenerated >= ago(timeframe)
| where EventName == "AuthorizeSecurityGroupEgress"
     or EventName == "AuthorizeSecurityGroupIngress"
     or EventName == "RevokeSecurityGroupEgress"
     or EventName == "RevokeSecurityGroupIngress"
| project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
