id: 610d3850-c26f-4f20-8d86-f10fdf2425f5
name: Changes made to Cloudtrail logs
description: Attackers often try to hide their steps by deleting or stopping the collection of logs that could show their activity. The query looks for any changes to the manipulation of  Cloudtrail logs.
severity: Low
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - DefenseEvasion
query: |

  AWSCloudTrail
  | where EventName == "UpdateTrail" or EventName == "DeleteTrail" or EventName == "StopLogging”
  | project TimeGenerated , EventName , EventTypeName  , UserIdentityAccountId ,  UserIdentityPrincipalid , UserAgent , UserIdentityUserName , SessionMfaAuthenticated , SourceIpAddress , AWSRegion , EventSource