id: 65360bb0-8986-4ade-a89d-af3cf44d28aa
name: AWS - Changes to VPC settings
description: |
  'This alert monitors changes to VPC settings such as new ACL entries and routes in route tables.
  More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255'
severity: Low
requiredDataConnectors:
 - connectorId: AWS
   dataTypes:
    - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - LateralMovement
  - PrivilegeEscalation
query: |

  let timeframe = 1d;
  AWSCloudTrail
  | where TimeGenerated >= ago(timeframe)
  | where EventName == "CreateNetworkAclEntry"
      or EventName == "CreateRoute"
  | project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements