id: d25b1998-a592-4bc5-8a3a-92b39eedb1bc
name: Login to AWS Management Console without MFA
description: |
  'Multi-Factor Authentication (MFA) helps you to prevent credential compromise. This alert identifies logins to the AWS Management Console without MFA. 
  This is done by looking at the eventName ConsoleLogin and if the AdditionalEventData field indicates MFA was NOT used 
  and the ResponseElements field indicates NOT a Failure. Thereby indicating that a non-MFA login was successful.'
severity: Low
requiredDataConnectors:
  - connectorId: AWS
    dataTypes:
      - AWSCloudTrail
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
  - PrivilegeEscalation
  - Persistence
  - InitialAccess
relevantTechniques:
  - T1078
query: |

  let timeframe = 1d;
  AWSCloudTrail
  | where TimeGenerated >= ago(timeframe)
  | where EventName == "ConsoleLogin" 
  | extend AdditionalData = todynamic(AdditionalEventData)
  | extend MFAUsed = AdditionalData["MFAUsed"]
  | extend RElements = todynamic(ResponseElements)
  | extend CLogin = RElements["ConsoleLogin"]
  | where MFAUsed != "Yes"
  | where CLogin != "Failure"
  | project TimeGenerated, EventName, EventTypeName, CLogin, MFAUsed, UserIdentityAccountId,  UserIdentityPrincipalid, UserAgent, 
  UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, AdditionalData, RElements
  | extend timestamp = TimeGenerated, AccountCustomEntity = UserIdentityUserName, IPCustomEntity = SourceIpAddress