// Name: AWS - Changes to Elastic Load Balancer security group events.
// Description: Monitoring Changes to Elastic Load Balancer specific security group events.
// More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255
//
// Id: c7bfadd4-34a6-4fa5-82f8-3691a32261e8
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// DataSource: #AWSCloudTrail
//
// Techniques: #LateralMovement, #PrivilegeEscalation
//
let timeframe = 1d;
AWSCloudTrail
| where TimeGenerated >= ago(timeframe)
| where EventName == "ApplySecurityGroupsToLoadBalancer"
     or EventName == "SetSecurityGroups"
| project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
