// Name: AWS - Changes to VPC settings
// Description: This alert monitors changes to VPC settings such as new ACL entries and routes in route tables.
// More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255
//
// Id: 65360bb0-8986-4ade-a89d-af3cf44d28aa
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// DataSource: #AWSCloudTrail
//
// Techniques: #LateralMovement, #PrivilegeEscalation
//
let timeframe = 1d;
AWSCloudTrail
| where TimeGenerated >= ago(timeframe)
| where EventName == "CreateNetworkAclEntry"
     or EventName == "CreateRoute"
| project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
