// Name: AWS - Changes to internet facing RDS Database instances.
// Description: Monitoring Changes to internet facing RDS Database instances.
// More information: https://medium.com/@GorillaStack/the-most-important-aws-cloudtrail-security-events-to-track-a5b9873f8255
//
// Id: 8c2ef238-67a0-497d-b1dd-5c8a0f533e25
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// AlertTriggerOperator: gt
//
// AlertTriggerThreshold: 0
//
// DataSource: #AWSCloudTrail
//
// Tactics: #LateralMovement, #PrivilegeEscalation
//
let timeframe = 1d;
AWSCloudTrail
| where TimeGenerated >= ago(timeframe)
| where EventName == "AuthorizeDBSecurityGroupIngress"
     or EventName == "CreateDBSecurityGroup"
     or EventName == "DeleteDBSecurityGroup"
     or EventName == "RevokeDBSecurityGroupIngress"
| project TimeGenerated, EventName, EventTypeName, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated, SourceIpAddress, AWSRegion, EventSource, AdditionalEventData, ResponseElements
