// Name: AWS - Monitor Credential abuse / hijacking
// Description: Looking for GetCallerIdentity Events where the UserID Type is AssumedRole 
// An attacker who has assumed the role of a legitimate account can call the GetCallerIdentity function to determine what account they are using.
// A legitimate user using legitimate credentials would not need to call GetCallerIdentity since they should already know what account they are using.
// See: https://duo.com/decipher/trailblazer-hunts-compromised-credentials-in-aws
// 
// Id: 32555639-b639-4c2b-afda-c0ae0abefa55
//
// Severity: Low
//
// QueryFrequency: 1d
//
// QueryPeriod: 1d
//
// DataSource: #AWSCloudTrail
//
// Techniques: #LateralMovement, #PrivilegeEscalation
//
let timeframe = 1d;
AWSCloudTrail
| where TimeGenerated >= ago(timeframe)
| where EventName == "GetCallerIdentity"
| where UserIdentityType == "AssumedRole" 
| summarize by SourceIpAddress, TimeGenerated, EventName, EventTypeName, UserIdentityType, UserIdentityAccountId, UserIdentityPrincipalid, UserAgent, UserIdentityUserName, SessionMfaAuthenticated,AWSRegion, EventSource, AdditionalEventData, ResponseElements
| sort by TimeGenerated desc nulls last 
