id: 29683151-e15d-4c0c-845b-892be89bf080
name: Enumeration of Users & Groups for Lateral Movement
description: |
  This query hunts for attempts to list users or groups using Net commands, which are commonly used for lateral movement. 
description-detailed: |
  This query hunts for attempts to list users or groups using Net commands, which are commonly used for lateral movement.
requiredDataConnectors: 
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
query: |
  DeviceProcessEvents 
  | where TimeGenerated > ago(7d) 
  | where FileName == 'net.exe' and AccountName != "" and ProcessCommandLine !contains '\\'  and ProcessCommandLine !contains '/add' 
  | where (ProcessCommandLine contains ' user ' or ProcessCommandLine contains ' group ') and (ProcessCommandLine contains ' /do' or ProcessCommandLine contains ' /domain') 
  | extend Target = extract("(?i)[user|group] (\"*[a-zA-Z0-9-_ ]+\"*)", 1, ProcessCommandLine) | filter Target  != '' 
  | project AccountName, Target, ProcessCommandLine, DeviceName, TimeGenerated  
  | sort by AccountName, Target
version: 1.0.0