id: 61c99147-b749-4164-80b1-c4bfa4efa704
name: Match Cyware Intel Watchlist Items With Common Logs
description: |
  'Query to match common security log identifiers with IOCs held by the Cyware Intel watchlist that is created automatically by Cyware'
requiredDataConnectors:
  - connectorId: F5
    dataTypes:
      - CommonSecurityLog
  - connectorId: CiscoASA
    dataTypes:
      - CommonSecurityLog
  - connectorId: PaloAltoNetworks
    dataTypes:
      - CommonSecurityLog
  - connectorId: Fortinet
    dataTypes:
      - CommonSecurityLog
  - connectorId: CheckPoint
    dataTypes:
      - CommonSecurityLog
  - connectorId: CEF
    dataTypes:
      - CommonSecurityLog
tactics:
  - CommandAndControl
  - Execution

relevantTechniques:
  - T0853
  - T0863
query: |
  CommonSecurityLog
  | join kind=inner (_GetWatchlist('CTIX')
      | where isnotempty(SearchKey)
  ) on $left.DestinationIP == $right.SearchKey
  | project TimeGenerated, SourceIP, DestinationIP, DestinationHostName, Activity, ApplicationProtocol, SearchKey=SearchKey, LastUpdatedTimeUTC
version: 1.0.0
