id: deb99c6f-1903-455b-bb2c-0036614110bc
name: Detecting Suspicious PowerShell Command Executions
description: |
  'Spot connections to rarely accessed external domains that are present in your watchlist, which could signify data exfiltration attempts or C2 communication.'
requiredDataConnectors: [
'DeviceProcessEvents'
]
tactics:
  - CommandAndControl
relevantTechniques:
  - T1102
query: |
    DeviceNetworkEvents
    | join kind=inner (
        _GetWatchlist('CTIX')
        | where isnotempty(SearchKey)
    ) on $left.RemoteUrl == $right.SearchKey
    | project TimeGenerated, RemoteUrl, DeviceName, SearchKey=SearchKey, LastUpdatedTimeUTC
version: 1.0.0
