id: 3842e70d-45be-43b1-8206-4ebc4c305f34
name: PowerShell Downloads
description: |
  The query searches for PowerShell execution events that could involve a download.
description-detailed: |
  This query finds PowerShell execution events that could involve a download. It looks for PowerShell execution events that include commands that could be used to download files from the internet, such as Net.WebClient, DownloadFile, Invoke-WebRequest, Invoke-Shellcode, http, IEX, Start-BitsTransfer, or mpcmdrun.exe.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - Execution
query: |
  DeviceProcessEvents
  | where TimeGenerated > ago(7d)
  | where FileName in~ ("powershell.exe", "powershell_ise.exe")
  | where ProcessCommandLine has "Net.WebClient"
     or ProcessCommandLine has "DownloadFile"
     or ProcessCommandLine has "Invoke-WebRequest"
     or ProcessCommandLine has "Invoke-Shellcode"
     or ProcessCommandLine has "http"
     or ProcessCommandLine has "IEX"
     or ProcessCommandLine has "Start-BitsTransfer"
     or ProcessCommandLine has "mpcmdrun.exe"
  | project TimeGenerated, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine
  | top 100 by TimeGenerated
version: 1.0.0