id: 3fdb3c31-d528-4b94-8268-918838cdaee8
displayName: Fortinet Fortigate NetworkSession IP Summary
description: |
  'This summary rule aggregates network session logs from Fortinet Fortigate devices, providing hourly insights into session count, data sent and data received by device actions, destination port, protocol, source and destination IP addresses.'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: FortinetFortigateNetworkSessionSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor == "Fortinet"
    and DeviceProduct startswith "FortiGate" 
    and (column_ifexists("DeviceEventCategory","") has "traffic"  or AdditionalExtensions has "cat=traffic")
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count(), SentBytes = sum(SentBytes), ReceivedBytes = sum(ReceivedBytes) by SourceIP, DestinationIP, DestinationPort, DeviceAction, Protocol, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - Network" ]