id: 29e6b3fb-5942-4a1a-95da-2c0821863e90
displayName: Palo Alto PAN-OS NetworkSession IPSummary
description: |
  'This summary rule aggregates network session logs from Palo Alto PAN-OS devices, providing hourly insights into session count, data sent, data received by device actions, destination port, source and destination IP addresses.'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: PaloAltoPANOSNetworkSessionSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor == "Palo Alto Networks" and DeviceProduct == "PAN-OS" and Activity == "TRAFFIC"
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count(), SentBytes=sum(SentBytes), ReceivedBytes=sum(ReceivedBytes) by SourceIP, DestinationIP, DestinationPort, DeviceAction, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - Network" ]