id: 6457ab65-69ea-4444-981d-1ecaf414fda7
displayName: Zscaler Internet Access NetworkSession IP Summary
description: |
  'This summary rule aggregates network session logs from Zscaler Internet Access devices, providing hourly insights into session count, data sent, data received by device actions, destination port, protocol, source and destination IP addresses.'
requiredDataConnectors:
  - connectorId: CefAma
    dataTypes:
      - CommonSecurityLog
destinationTable: ZscalerNetworkSessionSummary_CL
query: |
  CommonSecurityLog
  | where DeviceVendor == "Zscaler"
  | where DeviceProduct == "NSSFWlog"
  // You can customize the summary table by adding or removing fields based on your requirement.
  | summarize Count = count(), SentBytes = sum(SentBytes), ReceivedBytes = sum(ReceivedBytes) by SourceIP, DestinationIP, DestinationPort, DeviceAction, Protocol, bin(TimeGenerated,1h)
binSize: 60
version: 1.0.0
metadata:
    source:
        kind: Community
    author:
        name: Microsoft
    support:
        tier: Community
    categories:
        domains: [ "Security - Network" ]