Parser:
  Title: Network Session ASIM parser for zScaler ZIA
  Version: '0.1'
  LastUpdated: Dec 8, 2021
Product:
  Name: zScaler ZIA
Normalization:
  Schema: NetworkSession
  Version: '0.2.1'
References:
- Title: ASIM Web Session Schema
  Link: https://aka.ms/ASimWebSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
- Title: zScaler Connector
  Link: https://docs.microsoft.com/azure/sentinel/data-connectors-reference#zscaler
- Title: zScaler Sentinel deployment guide
  Link: https://help.zscaler.com/zia/zscaler-microsoft-azure-sentinel-deployment-guide
Description: |
  This ASIM parser supports normalizing zScaler ZIA proxy logs produced by the Azure Sentinel zScaler connector to the ASIM Network Session normalized schema. The parser supports squid native log format.
ParserName: ASimNetworkSessionzScalerZIA
ParserParams:
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
  let ActionLookup = datatable (DvcOriginalAction: string, DvcAction:string) [
    // See https://help.zscaler.com/zia/firewall-insights-logs-filters
    'Allow','Allow',
    'Allow due to insufficient app data','Allow',
    'Block/Drop','Drop',
    'Block/ICMP','Drop ICMP',
    'Block/Reset', 'Reset',
    'IPS Drop', 'Drop',
    'IPS Reset', 'Reset'
  ];
  let parser=(disabled:bool=false){
  CommonSecurityLog | where not(disabled)
  | where DeviceVendor == "Zscaler"
  | where DeviceProduct == "NSSFWlog"
  // Event fields
  | extend 
    EventCount=DeviceCustomNumber1, 
    EventStartTime=TimeGenerated, 
    EventVendor = "zScaler", 
    EventProduct = "ZIA", 
    EventSchema = "NetworkSession", 
    EventSchemaVersion="0.2.1", 
    EventType = 'NetworkSession', 
    EventEndTime=TimeGenerated 
  | project-rename
    DvcOriginalAction = DeviceAction, 
    DvcHostname = Computer, 
    EventProductVersion = DeviceVersion, 
    NetworkProtocol = Protocol, 
    DstIpAddr = DestinationIP, 
    DstPortNumber = DestinationPort, 
    DstNatIpAddr = DestinationTranslatedAddress, 
    DstNatPortNumber = DestinationTranslatedPort, 
    DstBytes = ReceivedBytes, 
    DstAppName = DeviceCustomString3, 
    NetworkApplicationProtocol = DeviceCustomString2, 
    SrcIpAddr = SourceIP, 
    SrcPortNumber = SourcePort, 
    SrcUsername = SourceUserName, // ?? Open question to zScaler - sometimes seems to include the location.
    SrcNatIpAddr= SourceTranslatedAddress, 
    SrcNatPortNumber = SourceTranslatedPort, 
    SrcUserDepartment = DeviceCustomString1,  // Not in standard schema
    SrcUserLocation = SourceUserPrivileges,  // Not in standard schema
    SrcBytes = SentBytes, 
    NetworkDuration = DeviceCustomNumber1, 
    ThreatName = DeviceCustomString6, 
    ThreatCategory = DeviceCustomString5, 
    RuleName = Activity 
  // -- Calculated fields
  | lookup ActionLookup on DvcOriginalAction 
  | extend
    ThreatCategory = iff(DeviceCustomString4 == "None", "", ThreatCategory),
    SrcUsername = iff (SrcUsername == SrcUserLocation, "", SrcUsername)
  // -- Enrichment
  | extend
    EventResult = iff (DvcOriginalAction == "Allow", "Success", "Failure"),
    DstAppType = "Service", 
    SrcUsernameType = "UPN" 
  // -- Aliases
  | extend
    Dvc = DvcHostname,
    User = SrcUsername,
    IpAddr = SrcIpAddr
  | project-away 
    DeviceCustom*
  };
  parser (disabled)