Parser:
  Title: ASIM Sysmon for Linux Network Session Parser
  Version: '0.0'
  LastUpdated: Sep 9th, 2021
Product:
  Name: Sysmon for Sysmon
Normalization:
  Schema: NetworkSessions
  Version: '0.2.0'
References:
- Title: ASIM Network Session Schema
  Link: https://aka.ms/AzSentinelNetworkSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
  ASIM Sysmon for Linux Network Session Parser
ParserName: vimNetworkSessionSysmonLinux
ParserQuery: |
 let SysmonForLinuxNetwork=(){
      Syslog
      | where SyslogMessage has_all ('<Provider Name="Linux-Sysmon"', '<EventID>3</EventID>')
      | parse SyslogMessage with 
          *
          '<EventRecordID>' EventRecordId:int '</EventRecordID>'
          *
          '<Computer>' SysmonComputer:string '</Computer>'
          *
          '<Data Name="RuleName">'RuleName:string '</Data>'
          '<Data Name="UtcTime">' EventEndTime:datetime '</Data>'
          '<Data Name="ProcessGuid">{' ProcessGuid:string '}</Data>'
          '<Data Name="ProcessId">' ProcessId:string '</Data>'
          '<Data Name="Image">' Image:string '</Data>' // -- Need to determine direction
          '<Data Name="User">' User:string '</Data>' // -- Need to determine direction
          '<Data Name="Protocol">' Protocol:string '</Data>' // -- source is lowercase
          '<Data Name="SourceIsIpv6">' SourceIsIpv6:bool '</Data>'		
          '<Data Name="SourceIp">' SrcIpAddr:string '</Data>'
          '<Data Name="SourceHostname">' SrcHostname:string '</Data>'
          '<Data Name="SourcePort">' SrcPortNumber:int '</Data>'
          '<Data Name="SourcePortName">' SrcPortName:string '</Data>'
          '<Data Name="DestinationIsIpv6">' DestinationIsIpv6:bool '</Data>'
          '<Data Name="DestinationIp">' DstIpAddr:string '</Data>'
          '<Data Name="DestinationHostname">' DstHostname:string '</Data>'
          '<Data Name="DestinationPort">' DstPortNumber:int '</Data>'
          '<Data Name="DestinationPortName">' DstPortName:string '</Data>'
          *
     | extend 
         EventType = "NetworkSession",
         EventStartTime = EventEndTime,
         EventCount = int(1),
         EventVendor = "Microsoft",
         EventSchemaVersion = "0.2.0",
         EventSchema = "NetworkSession", 
         EventProduct = "Sysmon For Linux",
         EventResult = 'Success',
         DvcOs = "Linux",
         TargetUsernameType = "Simple", // src/dst
         TargetUsername = User, // src/dst
         EventOriginalType = '3' // Set with a constant value to avoid parsing
      | project-rename 
         DvcHostName = SysmonComputer, // Computer may be different than HostName, in which case HostIP may be incorrect. 
         DvcIpAddr = HostIP, 
         TargetProcessId = ProcessId, // src/dst
         TargetProcessGuid = ProcessGuid, // src/dst
         TargetProcessName = Image // src/dst
      | extend // aliases
         User = TargetUsername,
         Process = TargetProcessName,
         Dvc = DvcHostName
      | project-away
         ProcessName, ProcessID
  };
  SysmonForLinuxNetwork