Parser:
  Title: ASIM Sysmon for Linux Network Session Parser
  Version: '0.0'
  LastUpdated: Sep 9th, 2021
Product:
  Name: Sysmon for Linux
Normalization:
  Schema: NetworkSession
  Version: '0.2.0'
References:
- Title: ASIM Network Session Schema
  Link: https://aka.ms/AzSentinelNetworkSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AzSentinelNormalization
Description: |
  ASIM Sysmon for Linux Network Session Parser
ParserName: vimNetworkSessionLinuxSysmon
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstportnumber
    Type: int
    Default: int(null)
  - Name: url_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: httpuseragent_has_any
    Type: dynamic 
    Default: dynamic([])
  - Name: hostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: dvcaction
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: "'*'"
  - Name: disabled
    Type: bool
    Default: false
ParserQuery: |
    let DirectionNetworkEvents =
        Syslog | where not(disabled)
        | where SyslogMessage has_all ('<Provider Name="Linux-Sysmon"', '<EventID>3</EventID>')
        | project-away ProcessName, ProcessID
        // ***************  Prefilterring *****************************************************************
        | where  (eventresult=='*' or eventresult=='Success')
           and (array_length(httpuseragent_has_any) ==0) // if filtering by ua - return nothing
           and (array_length(dvcaction) ==0  )     /// if filtered by action return nothing
           and (array_length(url_has_any)==0)
            and (isnull(starttime) or TimeGenerated>=starttime) 
            and (isnull(endtime) or TimeGenerated<=endtime) 
            and (array_length(srcipaddr_has_any_prefix)==0 
                  or has_any_ipv4_prefix(SyslogMessage,srcipaddr_has_any_prefix)
                ) 
            and (array_length(dstipaddr_has_any_prefix)==0 
                  or has_any_ipv4_prefix(SyslogMessage,dstipaddr_has_any_prefix)
                ) 
            and (array_length(hostname_has_any)==0 
                  or SyslogMessage has_any(hostname_has_any)) 
            and (isnull(dstportnumber) or SyslogMessage has (tostring(dstportnumber))) 
        // *************** / Prefilterring ***************************************************************
        | parse SyslogMessage with * '<Data Name="SourceIp">' SrcIpAddr:string '</Data>' *
        | where (array_length(srcipaddr_has_any_prefix)==0 
                  or has_any_ipv4_prefix(SrcIpAddr,srcipaddr_has_any_prefix)
                ) 
        | extend outbound = (SrcIpAddr == HostIP or SrcIpAddr in ('127.0.0.1', '0.0.0.0'))
    ;
    let parser = (T: (SyslogMessage: string)) {
      T 
      | parse SyslogMessage with 
          *
          '<EventRecordID>' EventOriginalUid:string '</EventRecordID>'
          *
          '<Computer>' SysmonComputer:string '</Computer>'
          *
          '<Data Name="RuleName">' RuleName:string '</Data>'
          '<Data Name="UtcTime">' EventEndTime:datetime '</Data>'
          '<Data Name="ProcessGuid">{' ProcessGuid:string '}</Data>'
          '<Data Name="ProcessId">' ProcessId:string '</Data>'
          '<Data Name="Image">' Process:string '</Data>'
          '<Data Name="User">' User:string '</Data>'
          '<Data Name="Protocol">' Protocol:string '</Data>' // -- source is lowercase
          '<Data Name="Initiated">' Initiated:bool '</Data>' 
          '<Data Name="SourceIsIpv6">' SourceIsIpv6:bool '</Data>'		
          '<Data Name="SourceIp">' * '</Data>'
          '<Data Name="SourceHostname">' SrcHostname:string '</Data>'
          '<Data Name="SourcePort">' SrcPortNumber:int '</Data>'
          '<Data Name="SourcePortName">' SrcPortName:string '</Data>'
          '<Data Name="DestinationIsIpv6">' DestinationIsIpv6:bool '</Data>'
          '<Data Name="DestinationIp">' DstIpAddr:string '</Data>'
          '<Data Name="DestinationHostname">' DstHostname:string '</Data>'
          '<Data Name="DestinationPort">' DstPortNumber:int '</Data>'
          '<Data Name="DestinationPortName">' DstPortName:string '</Data>'
          *
    };
    let OutboundNetworkEvents = 
      DirectionNetworkEvents
      | where outbound
      | invoke parser ()
      // *************** Postfilterring ***************************************************************
      | where 
              (array_length(dstipaddr_has_any_prefix)==0 or has_any_ipv4_prefix(DstIpAddr, dstipaddr_has_any_prefix))
          and (array_length(srcipaddr_has_any_prefix)==0 or has_any_ipv4_prefix(SrcIpAddr, srcipaddr_has_any_prefix))
          and (array_length(hostname_has_any)==0 or DstHostname has_any (hostname_has_any) )
          and  (isnull(dstportnumber) or DstPortNumber ==dstportnumber)
      // *************** Postfilterring ***************************************************************
      | extend
        SrcUsernameType = 'Simple',
        SrcUsername = User,
        SrcProcessId = ProcessId, 
        SrcProcessGuid = ProcessGuid,
        SrcProcessName = Process,
        SrcAppName = Process,
        SrcAppType = 'Process'
      | project-away SyslogMessage
    ;
      let InboundNetworkEvents = 
          DirectionNetworkEvents
          | where not(outbound)
          | invoke parser ()
          // *************** Postfilterring ***************************************************************
          | where 
              (array_length(dstipaddr_has_any_prefix)==0 or has_any_ipv4_prefix(DstIpAddr, dstipaddr_has_any_prefix))
          and (array_length(srcipaddr_has_any_prefix)==0 or has_any_ipv4_prefix(SrcIpAddr, srcipaddr_has_any_prefix))
          and (array_length(hostname_has_any)==0 or DstHostname has_any (hostname_has_any) )
          and  (isnull(dstportnumber) or DstPortNumber ==dstportnumber)
          // *************** Postfilterring ***************************************************************
          | extend
          DstUsernameType = 'Simple',
          DstUsername = User,
          DstProcessId = ProcessId, 
          DstProcessGuid = ProcessGuid,
          DstProcessName = Process,
          DstAppName = Process,
          DstAppType = 'Process' 
          | project-away SyslogMessage
      ;
      let SysmonForLinuxNetwork=
          union OutboundNetworkEvents, InboundNetworkEvents
          | extend 
              EventType = 'NetworkSession',
              EventStartTime = EventEndTime,
              EventCount = int(1),
              EventVendor = 'Microsoft',
              EventSchemaVersion = '0.2.0',
              EventSchema = 'NetworkSession', 
              EventProduct = 'Sysmon For Linux',
              EventResult = 'Success',
              EventSeverity = 'Informational',
              DvcOs = 'Linux',
              Protocol = toupper(Protocol),
              EventOriginalType = '3' // Set with a constant value to avoid parsing
          | project-rename 
              DvcIpAddr = HostIP,
              DvcHostname = SysmonComputer
          | extend // aliases
              Dvc = DvcHostname,
              IpAddr = SrcIpAddr,
              Src = SrcIpAddr,
              Dst = DstIpAddr
      ;
      SysmonForLinuxNetwork 