{
    "id": "AwsS3",
    "title": "Amazon Web Services S3",
    "publisher": "Amazon",
    "descriptionMarkdown": "This connector allows you to ingest AWS service logs, collected in AWS S3 buckets, to Microsoft Sentinel. The currently supported data types are: \n* AWS CloudTrail\n* VPC Flow Logs\n* AWS GuardDuty",
    "logo": "Aws.svg",
    "graphQueries": [
        {
            "metricName": "Total data received",
            "legend": "AWSGuardDuty",
            "baseQuery": "AWSGuardDuty"
        },
        {
            "metricName": "Total data received",
            "legend": "AWSVPCFlow",
            "baseQuery": "AWSVPCFlow"
        },
        {
            "metricName": "Total data received",
            "legend": "AWSCloudTrail",
            "baseQuery": "AWSCloudTrail"
        }
    ],
    "sampleQueries": [
        {
            "description": "High severity findings summarized by activity type",
            "query": "AWSGuardDuty\n            | where Severity > 7\n            | summarize count() by ActivityType"
        },
        {
            "description": "Top 10 rejected actions of type IPv4",
            "query": "AWSVPCFlow\n            | where Action == \"REJECT\"\n            | where Type == \"IPv4\"\n            | take 10"
        },
        {
            "description": "User creation events summarized by region",
            "query": "AWSCloudTrail\n            | where EventName == \"CreateUser\"\n            | summarize count() by AWSRegion"
        }
    ],
    "connectivityCriterias": [
        {
            "type": "SentinelKinds",
            "value": [
                "AmazonWebServicesS3"
            ]
        }
    ],
    "dataTypes": [
        {
            "name": "AWSGuardDuty",
            "lastDataReceivedQuery": "AWSGuardDuty\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        },
        {
            "name": "AWSVPCFlow",
            "lastDataReceivedQuery": "AWSVPCFlow\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        },
        {
            "name": "AWSCloudTrail",
            "lastDataReceivedQuery": "AWSCloudTrail\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
    ],
    "availability": {
        "status": 2,
        "isPreview": true       
    },
    "permissions": {
        "resourceProvider": [
            {
                "provider": "Microsoft.OperationalInsights/workspaces",
                "permissionsDisplayText": "write permission.",
                "providerDisplayName": "Workspace",
                "scope": "Workspace",
                "requiredPermissions": {
                    "write": true,
                    "delete": true
                }
            }
        ],
        "customs": [
            {
                "name": "Environment",
                "description": "you must have the following AWS resources defined and configured: S3, Simple Queue Service (SQS), IAM roles and permissions policies, and the AWS services whose logs you want to collect."
            }
        ]
    },
    "instructionSteps": [
        {
            "title": "1. Set up your AWS environment",
            "description": "There are two options for setting up your AWS environment to send logs from an S3 bucket to your Log Analytics Workspace:",
            "instructions": [
                {
                    "parameters": {
                        "instructionSteps": [
                            {
                                "title": "Setup with PowerShell script (recommended)",
                                "description": "Download and extract the files from the following link: [AWS S3 Setup Script](https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/DataConnectors/AWS-S3/ConfigAwsS3DataConnectorScripts.zip).\n    \n> 1. Make sure that you have PowerShell on your machine: [Installation instructions for PowerShell](https://docs.microsoft.com/powershell/scripting/install/installing-powershell?view=powershell-7.2).\n\n> 2. Make sure that you have the AWS CLI on your machine: [Installation instructions for the AWS CLI](https://docs.aws.amazon.com/cli/latest/userguide/install-cliv2.html).\n\nBefore running the script, run the aws configure command from your PowerShell command line, and enter the relevant information as prompted. See [AWS Command Line Interface | Configuration basics](https://docs.aws.amazon.com/cli/latest/userguide/cli-configure-quickstart.html) for details.",
                                "instructions": [
                                    {
                                        "parameters": {
                                            "fillWith": [
                                                "Script"
                                            ],
                                            "label": "Run script to set up the environment",
                                            "value": "./ConfigAwsConnector.ps1"
                                        },
                                        "type": "CopyableLabel"
                                    },
                                    {
                                        "parameters": {
                                            "fillWith": [
                                                "WorkspaceId"
                                            ],
                                            "label": "External ID (Workspace ID)"
                                        },
                                        "type": "CopyableLabel"
                                    }
                                ]
                            },
                            {
                                "title": "Manual Setup",
                                "description": "Follow the instruction in the following link to set up the environment: [Connect AWS S3 to Microsoft Sentinel](https://aka.ms/AWSS3Connector)"
                            }
                        ]
                    },
                    "type": "InstructionStepsGroup"
                }
            ]
        },
        {
            "title": "2. Add connection",
            "instructions": [
                {
                    "parameters": {},
                    "type": "AwsS3"
                }
            ]
        }
    ]
}