id: 86c7d21b-2081-419d-bc2e-7bc909d61eef
name: Top 10 External Senders (Spam)
description: |
  Identifies the top 10 external domains sending inbound emails containing spam.
  Important: Replace YOUR_DOMAIN_HERE with your internal domain(s) in quotes (e.g., "contoso.com", "contoso.onmicrosoft.com").
  Note: Time Range is controlled by the portal's time picker.
  Based on concepts from the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where EmailDirection == "Inbound"
  | where ThreatTypes has "Spam"
  | where SenderFromDomain !endswith YOUR_DOMAIN_HERE
  | summarize Count = count(), (Timestamp, ReportId) = arg_max(Timestamp, ReportId) by SenderFromDomain
  | top 10 by Count desc
version: 1.0.0