id: db9789ab-0636-4ea6-b779-1b72b4b64aac
name: Top 10 External Senders (Phish)
description: |
  Identifies the top 10 external domains sending inbound emails containing phishing threats.
  Important: Replace REPLACEWITHYOURDOMAININQUOTES with your internal domain(s) in quotes, e.g. "contoso.com", "contoso.onmicrosoft.com".
  Note: Time Range is controlled by the portal's time picker.
  Based on concepts from the Defender for Office 365 solution in Sentinel: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/part-2-build-custom-email-security-reports-and-dashboards-with-workbooks-in-micr/4411303
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - EmailEvents
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
  EmailEvents
  | where EmailDirection == "Inbound"
  | where ThreatTypes has "Phish"
  | where SenderFromDomain !endswith REPLACEWITHYOURDOMAININQUOTES
  | summarize Count = count(), (Timestamp, ReportId) = arg_max(Timestamp, ReportId) by SenderFromDomain
  | top 10 by Count desc
version: 1.0.0