id: b00f127c-46fa-40bd-9ab6-b266974d29cc
name: Attempts to sign in to disabled accounts by account name
description: |
  'Failed attempts to sign in to disabled accounts summarized by account name'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
query: |

  SigninLogs 
  | where ResultType == "50057" 
  | where ResultDescription == "User account is disabled. The account has been disabled by an administrator." 
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by AppDisplayName, UserPrincipalName
  | extend timestamp = StartTime, AccountCustomEntity = UserPrincipalName
  | order by count_ desc

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity