// Name: attempts to sign in to disabled accounts - by IP address
//
// Id: 0cd51b2e-d3b2-4001-8e3f-5cbb604f69b2
//
// Description: (failed) attempts to sign in to disabled accounts summarized
// by the IP address from from the sign-in attempts originate.
//
// DataSource: #SigninLogs
//
// Tactics: #InitialAccess
//
SigninLogs 
| where TimeGenerated >= ago(30d)
| where ResultType == "50057" 
| where ResultDescription == "User account is disabled. The account has been disabled by an administrator." 
| summarize numberLoginAttempts=count(), numberAccountsTargeted=dcount(UserPrincipalName),numberApplicationsTargeted=dcount(AppDisplayName), accountSet=makeset(UserPrincipalName), applicationSet=makeset(AppDisplayName)  by IPAddress
| extend IPCustomEntity = IPAddress
| order by numberLoginAttempts desc
