// Name: attempts to sign in to disabled accounts - by account name
//
// Id: b00f127c-46fa-40bd-9ab6-b266974d29cc
//
// Description: (failed) attempts to sign in to disabled accounts summarized
// by account name.
//
// DataSource: #SigninLogs
//
// Techniques: #InitialAccess
//
SigninLogs 
| where TimeGenerated >= ago(30d)
| where ResultType == "50057" 
| where ResultDescription == "User account is disabled. The account has been disabled by an administrator." 
| summarize count() by AppDisplayName, UserPrincipalName
| order by count_ desc
