id: 847c2652-547d-4d5f-9b71-d2f8d81eac62
name: Inactive or new account signins
description: |
  'Query for accounts seen signing in for the first time - these could be associated
  with stale/inactive accounts that ought to have been deleted but were not - and have 
  subseuqently been compromised. 
  Results for user accounts created in the last 7 days are filtered out'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
tactics:
  - InitialAccess
relevantTechniques:
  - T1078
query: |
  
  //Inactive accounts that sign in - first-time logins for accounts created in last 7 days are filtered out
  let starttime = 14d;
  let midtime = 7d;
  let endtime = 1d;
  SigninLogs
  | where TimeGenerated >= ago(endtime)
  // successful sign-in
  | where ResultType == 0
  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), loginCountToday=count() by UserPrincipalName, Identity
  | join kind=leftanti (
     SigninLogs
     // historical successful sign-in
     | where TimeGenerated < ago(endtime)
     | where TimeGenerated >= ago(starttime)
     | where ResultType == 0
     | summarize by UserPrincipalName, Identity
  ) on UserPrincipalName 
  | join kind= leftanti (
     // filter out newly created user accounts
     AuditLogs
     | where TimeGenerated >= ago(midtime)
     | where OperationName == "Add user" 
     // Normalize to lower case in order to match against equivalent UPN in Signin logs
     | extend NewUserPrincipalName = tolower(extractjson("$.userPrincipalName", tostring(TargetResources[0]), typeof(string)))
  ) on $left.UserPrincipalName == $right.NewUserPrincipalName 
  | extend timestamp = StartTime, AccountCustomEntity = UserPrincipalName

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity  