// Name: Failed attempt to access Azure Portal
//
// Id: cf83633e-5dfd-4887-993b-c910452439da
// 
// Description: Access attempts to Azure Portal from an unauthorized user.  Either invalid password or the user account does not exist.
//
// Data source: SigninLogs
//
// Techniques: #InitialAccess
let timeRange=ago(7d);
SigninLogs
| where TimeGenerated >= timeRange
| extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser
| extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)
| extend State = tostring(LocationDetails.state), City = tostring(LocationDetails.city)
| where  AppDisplayName contains "Azure Portal"
// 50126 - Invalid username or password, or invalid on-premises username or password.
// 50020? - The user doesn't exist in the tenant.
| where ResultType in ( "50126" , "50020")
| summarize makelist(TimeGenerated), makeset(IPAddress), makeset(OS), makeset(Browser), makeset(City), count() by UserDisplayName, UserPrincipalName, AppDisplayName, ResultType, ResultDescription, StatusCode, StatusDetails, Location, State
| project UserDisplayName, UserPrincipalName, AppDisplayName, AttemptCount = count_, list_TimeGenerated, DistinctIPCount = arraylength(set_IPAddress), set_IPAddress, ResultType, ResultDescription, StatusCode, StatusDetails, set_OS, set_Browser, Location, State, set_City
| sort by AttemptCount